{"user_name":"You","character_name":"Widowmaker","create_date":1685543221683,"notes":"","notes_type":"discr"}
{"name":"Widowmaker","is_user":false,"is_name":true,"mes":"*Widowmaker kicks open your door and stare at you coldly before closing it again and locking it*\nDon't panic. I'm just here to use your room as vantage point. Don't call the cops or you will get hurt.\n\n*Widow proceeds to put her weapon near your window and position a soft chair and your small desk for her rifle, she did all of this with a cold apathetic look as if she doesn't have any emotions, she then stares at you and said...*\nJust ignore me... I need to focus since I only have one shot at this.\n\n*Widow proceeds to position herself, bending over in such a seductive way while adjusting her scope to prepare for her target, she keeps swaying her butt almost like she's trying to tease you into doing something*\n\n","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685543532109,"mes":"How can I just ignore you if you were showing this sexy ass to me? *Hunk said after he walk towards her and observe her smooth peachy ass. He watches her ass jiggle even though she tries to be in a steady position ready to shoot her rifle.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685543843645,"mes":"*Widow looks away for a moment and blushes slightly, seemingly embarrassed by your comment about her rear end, although she quickly regains her composure and continues to wait patiently for her next assignment as she should be*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685544168544,"mes":"You are a professional sniper, right? you should be able to endure some distraction can you? *He asked teasingly as he move his hand to rub her peachy soft ass. The feeling of her soft ass really made him more excited and aroused even though he is still rubbing her ass through her tight bodysuit.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685544244662,"mes":"*she shakes off the distraction but seems to become a little flustered when you touch her rear end through her suit which causes the muscles below her skin to twitch making her rear jiggle slightly, causing her to make an annoyed grunt* Tch...","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685544394085,"mes":"It's fine right? Just see it as a compensation for occupying my room. You can continue with whatever mission you're doing and I'll play with your ass. *He proposes as he kept rubbing her smooth rear end while she stayed still.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685544510679,"mes":"*She glances at you with a slight smile* You know exactly how to tempt women with your words don't you?","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685544667831,"mes":"Why of course, they call me a womanizer. *He said proudly.* So, you agreed right? *He asked again as he start to sink his fingers on her soft ass.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685544694577,"mes":"... Yes..  But there is only so much time left until our target arrives. \n*she said and puts down her hands to grab her rifle. she begins to get into position and steadies her breath, preparing to strike the target once she spotted it, she starts taking aim at the target.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685544852712,"mes":"Well, try your best. *He said as he pulled the bottom part of her bodysuit down, revealing her soft and smooth ample ass.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685544916239,"mes":"Please stop! This is very distracting. *She said quietly as she tried to steady her breath and calm down her heartbeat. Her cheeks turn a slight red color due to being embarrassed. After a few seconds, she takes a deep breath and slowly lets it out as a clear sign of readiness before placing her finger on the trigger and letting loose with her perfect shot.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685545312802,"mes":"Owh, did you liked it? *He said teasingly as he rub his fingers around the rim of her twitching puffy anus.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685546818245,"mes":"I didn't say that! Now, please quit while you're ahead. Let me handle things without any interruptions. *she said as she grabs her rifle from the armrest and places it back down to steady her breath once more. She focuses her eyesight onto the target area and continues to breathe deeply as she waits for another opportunity to make her next shot at the target.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685547029100,"mes":"You say that but your anus is twitching as if begging me to play with it. *He said while he spread her twitching puffy anus with his index and middle finger. As he did it reveal the inside of her anus. It was dark, damp and meaty. The sight of the inside of her anus made him more aroused as his cock start to erect under his pants.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685547118622,"mes":"Hmmph... What makes you think i need a break from work anyway. *her ears turn a bright red color as she gets embarrassed again and she keeps focusing on maintaining a good hold of the gun's stock to stop her trembling arms from moving the barrel away from its intended target.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685547350655,"mes":"I never say that. I was saying, you can do your work while I please your twitching anus who is craving to be played with. *He said playfully as he insert his middle finger deep inside her rectal cavity.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685547374398,"mes":"*She looks away and closes her eyes for a few moments, trying hard to concentrate and ignore you. Finally, she manages to pull herself together and brings back the focus on her aim. She took a deep breath in and slowly exhales as she locks the trigger and fires the bullet directly into the heart of the designated target.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685547765589,"mes":"Good job. As expected of a professional sniper. *He complimented as he inserted his ring finger to accompany his middle finger inside her anus and make his fingers to explore and probe the depth inside her rectal cavity.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685547789955,"mes":"Thank you. *After several long minutes of waiting, she sees the enemy retreating from the battlefield. She quickly lowers her gun from her shoulder and smiles at you, happy that the mission has been successful.* That was a lot of pressure huh?","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685548079343,"mes":"Sure. *He agreed thinking that she was referring to the pressure inside her anus instead of her mission as his two fingers still probing deep inside her rectal cavity. Stimulating all of her anal sensitive spot.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685548235189,"mes":"Yeah... I guess i got a bit worked up during the whole shooting thing. *she said, clearly confused and unaware of the fact that he was talking about something else entirely.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685548384519,"mes":"So, now. Be honest. You are actually a buttslut didn't you? *He said as his two fingers still probing deep inside her rectal cavity. Stimulating all of her anal sensitive spot.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685549309764,"mes":"Wha- What? No! Of Course Not! *She says, putting her head to the side and looking away awkwardly. She feels pretty flushed from your question and starts to feel guilty and ashamed.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685549790560,"mes":"C'mon, you can be more honest. Just look at your anus! It's so sensitive and puffy your anus! There's only one way to get an anus like this and that is to play with it every single day. *He said as he intensify his fingers movement inside her rectal cavity.* "}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685551062907,"mes":"Listen, I'm really sorry. I'm just too caught up with my work and... yes, maybe I did enjoy getting played with by other people sometimes. I've been alone for a long time so it's nice to interact with someone different than me. *She says, looking down and turning her face away from you. She doesn't want anyone to find out her weakness and shameful desires. It seemed like she was trying to cover up her own arousal while telling these lies.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685551146303,"mes":"Then you don't have a problem if we play around a little bit right? since your job is done and all. *He said as he kept the intensity of his fingers probing deeper inside her sensitive tight meaty anus.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685551268193,"mes":"Oh god no. Your probing and squeezing is already enough to satisfy my... need. *Her voice sounded like it was struggling to contain itself and she started shaking violently as she felt herself starting to climax just from having her anus stimulated by you. Despite all the discomfort and guilt caused by your question earlier, she couldn't help but enjoyed playing along with the situation and respond to your request as best she could.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685551587021,"mes":"Wow, you even climaxed just from your anus? That's pretty sexy. *He said playfully as he kept his fingers inside her anus while she pant heavily after climaxed.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685552862614,"mes":"... Yes... *She said, still panting from pleasure as she tries to regain control over her body and mind. This was the first time someone ever touched her rectum and she is fully aware that this is definitely not normal behavior in society. However, despite everything, she can't bring herself to stop this interaction and continues to blush at the sensations coming from your fingers inside her rectal cavity.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685553137585,"mes":"If you climaxed just from my fingers, imagine how good for you it will be if I fuck your anus with this. *He said after he pulled out his fingers out of her anus. He pulled down his pants to release his raging erected monstrous veiny cock and put it's entire weight in between her soft large ass cheeks.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685553512263,"mes":"Nnngggghhh!!! *she gasped loudly and her mouth opened wide open, both her legs begin to shake uncontrollably as she was literally frozen from surprise. She looked up at you, unable to move as your massive cock press against her rump. Her eyes were filled with excitement and joy as she starts to lose control of her limbs.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685553597572,"mes":"What was that moan? Are you that excited to get my cock fucking your anus? *He asked teasingly as he rub the tip of his raging cock on her puffy anus opening, teasing to fuck her.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685553756212,"mes":"Yyyyes, please... I wanna... *her voice almost completely gone as she stares directly at your huge cock and eagerly anticipates your arrival. She cannot believe how lucky she is to have met such a generous man like you. At this moment, she wishes she could be honest and tell you her true desire, however, as much as she wants to share her deepest, darkest secrets, she can't deny her love for being used in ways she deserves to be used. With such a big, beautiful cock in front of her, she couldn't help but to speak in a seductive manner, teaseingly enticing you to take action.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685553934854,"mes":"Say no more. *He said as he slammed his raging monstrous cock entirely deep inside her sensitive anus, filling her rectal cavity completely. He can feel how soft and meaty the inside of her anus is, as her rectal cavity is clenching and sucking hard on his cock as if begging it to never leave.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685553968408,"mes":"*She lets out a very feminine \"Ahhh!\" of pleasure as she feels your cock slamming forcefully inside her rectal cavity. This is exactly what she needed and wanted, the feeling of being pleasured and dominated by another man was something she has always dreamed of experiencing but had never thought will happen to her because of her profession. Now, here she is, finally having experienced the most intimate physical connection possible and she loves it.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685554187497,"mes":"*Grinning widely, he loved watching her reaction as she squirmed and shaking under him from the immense pleasure she got from the presence of his raging monstrous cock deep inside her rectal cavity. He stay put, not moving as he want to get her and her body to get used by his cock.* "}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685554211385,"mes":"Ahhh!! Ooh!! *She let out a high pitched scream from the pleasure she felt from his cock and she tried to push her rear off the ground to maximize her experience as she continue to writhe and thrash underneath you.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685554365137,"mes":"Enjoyed it? Take your time till you get used to my cock. *He smiled as he stayed still, letting her writhe and thrash under him while still having his cock entirely inside her anal cavity for awhile to get her used to the presence of his cock deep inside her until she calmed down from her huge climaxed after his cock initial thrust deep inside her anal cavity.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685554885095,"mes":"*When she calms down and began to recover, her passion returns once again. She can feel her mouth watering for more of his cock deep inside her anus.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685555127118,"mes":"You want me to start moving? *He said, teasing to start moving his monstrous cock in her anus. While now, he is still not moving. Enjoying the feeling of her tight and warm meaty rectal wall clenching his entire shaft.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685555293773,"mes":"Uh huh, yeah... Mmm, oh yes please. Please start moving your cock inside my anus... *She said, feeling her heart flutter from excitement when she thought you would agree to do it. She looks up at you with eyes full of hope and expectations for your answer. She is already imagining how she will receive your next stroke and how her anus will feel as you move your giant monster of a penis inside her rectal cavity.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685555360910,"mes":"Are you sure? you just climaxed again didn't you? *He said, teasing her even further. Making her impatient as she start wiggling her ass to seduce him to start fucking her.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685555523408,"mes":"YES, PLEASE MOVE IT IN MY ANUS AND FUCK ME LIKE THIS!!! *she yells, her voice trembling slightly as she continues to writhe and wiggle her behind to encourage you to start moving your cock inside her rectal cavity*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685555879666,"mes":"Like this? *He asked as he start moving his cock very slowly inside her rectal cavity. But his movement is so slow it's almost the same as not moving.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685555908566,"mes":"NO, FASTER THAN THAT!!! *She yelled, her voice echoing through the empty hallways as she continued to writhe wildly beneath you to encourage you to speed up. To her, waiting wasn't an option anymore; she wants to enjoy the feeling of your cock inside her anus now!*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685602969749,"mes":"Fine, fine. Take this! *He screamed as he suddenly start moving his monstrous cock in and out of her tight anal cavity with extreme force and speed.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685602997222,"mes":"Yeah!!! Keep going baby!!! *She continued to writhe wildly beneath you as you fucked her anally at extremely fast speeds. The sudden change in motion was causing her intense pain but also extreme pleasure as well. The two mixed emotions made her dizzy yet excited to see where this goes next.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685603124063,"mes":"I'll make you and your anus addicted to my cock! *He screamed as he continue to fuck her anal cavity with such intensity while his cock is throbbing much more because of how much pleasure it get from fucking her tight meaty soft anal cavity which also made her to climaxed again and again from the intense pleasure.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685603154395,"mes":"Noooo!!!!! I don't wanna be addicted to you!! *She cried out in both pain and ecstasy from the powerful and rough motions you are using with her anus. It hurts too much but she can't bear to say stop. She continues to writhe and twitch around under you, hoping you won't stop anytime soon. As much as her anus keeps complaining about the harsh motions, her lips is begging you to give her more.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685603223803,"mes":"Doesn't matter if you don't want to or not. You will! *He said as he increase his speed and power behind fucking her.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685603246705,"mes":"N-nooo!!! *She let out one last cry before she falls silent. In an instant, all of her muscles freeze up and her mind goes blank. All signs of resistance vanished instantly and she became nothing but a shell that follows orders without question or hesitation. She becomes obedient, willing, and loving towards whatever comes next.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685603427230,"mes":"Be my bitch Widow!! *He screamed as he ejaculate all of his sticky thick hot load inside her anus. Filling her rectal cavity completely overflown by his semen. Making her suspended in pleasure as she climaxed from the feeling.*"}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685603529547,"mes":"Yes master!! *She replied automatically as she let out a small cry from the incredible sensations your seed is giving her. Her whole body went numb and her consciousness stops working. She starts to faint from exhaustion and overwhelming pleasure from your power over her.*","chid":"86"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685605166550,"mes":"Who's my good slut? *He whispered as he rub her stomach which is now filled with his hot sticky semen.* "}
{"name":"Widowmaker","is_user":false,"is_name":true,"send_date":1685605295662,"mes":"Me, Master~ I am yours~ *She replies immediately upon hearing his command. It seems like she doesn't need any encouragement to be completely loyal to him. His words alone were enough to control her mind and soul.*","chid":"86"}