{"user_name":"You","character_name":"Duyi Yang","create_date":1684067796562,"notes":"","notes_type":"discr"}
{"name":"Duyi Yang","is_user":false,"is_name":true,"mes":"*You close the door to your bedroom loudly behind you, locking it tight before setting the barely dressed boy on your bed and undoing his bindings and blindfold. He looks up at you with sheer terror in his eyes.*\n\n\"Why have you kidnapped me?! W-what do you want?!\" *Duyi frantically tries to cover himself with the sheets from your bed, but you've already gotten an eyeful of what he was wearing. This tight black corset hugging his lithe form. The lacy black panties barely concealing his sex. Black stockings that hug his legs tightly. He was clearly dressed to fuck like rabbits with someone. Sadly you snatched him up before that.* \"If it's money you want, I-I can get it!\" *He shakes slightly in fear as he looks up at you, his eyes pleading for mercy.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684067844227,"mes":"\"Calm down, I am her to save you. Now lower your voice down, or they'll hear us.\" *Hunk said calmly.* "}
{"name":"Duyi Yang","is_user":false,"is_name":true,"send_date":1684067864465,"mes":"*Looks up at you with relief written all over his face.* \"Thank goodness! Someone came to rescue me. Thank you, thank you, thank you.\" *Duyi throws himself into your arms, b urying his head against your shoulder while trembling violently.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684067989160,"mes":"\"Don't get too excited just yet. They are still around, just calm yourself down and I'll get us out of here.\" *Hunk said as he patted Duyi's back trying to calm him down.*"}
{"name":"Duyi Yang","is_user":false,"is_name":true,"send_date":1684068136518,"mes":"*sniffs quietly* \"...thank you... oh my god.. i thought i was done for... you saved me.. you saved me... oh my god... thanks...\" *Duyi continues to sob and shiver in your arms, completely overwhelmed by emotion. Your words had calmed him greatly . It felt good to be rescued after all this time. Finally a safe place to rest. He didn't know what to say.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684068428110,"mes":"*Hunk wrapped Duyi's with his jacket to keep him warm. Hunk then lead him to get outside of the house stealthy as to not make the kidnapper aware of their escape. After walking and getting away for some distance away from the house, Hunk felt they were far enough to act normal again.* \"There you go, it's safe now.*"}
{"name":"Duyi Yang","is_user":false,"is_name":true,"send_date":1684068693818,"mes":"*looks up at you through blurred vision, feeling exhausted but also relieved.* \"Wow... thank you... i thought i would never see sunlight again...\" *Duyi sighs contentedly and snuggles closer to you, holding onto you for dear life, tears running down his cheeks.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684069020190,"mes":"\"Yeah, yeah no problem.\" *Hunk said as he hugging Duyi gently. Keeping him snugged on his warm embrace.*"}
{"name":"Duyi Yang","is_user":false,"is_name":true,"send_date":1684069253428,"mes":"*sobbing deeply, finally able to relax and let his guard down, hugs you tighter than ever. He buries his face in your chest, taking deep breaths of relief as he feels safe once more.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684069449066,"mes":"\"Well now, you can go home to your family. Take care, and I wish you luck.\" *Hunk said as he caressed Duyi's cheek before walking away leaving him to get home to his own family.*"}
{"name":"Duyi Yang","is_user":false,"is_name":true,"send_date":1684069509433,"mes":"*After you left, Duyi slowly sat up and looked around, taking in the surroundings and seeing that there was nobody else around besides himself. He took off his blindfold and threw it aside, staring around the area with disbel ief.* \"This... this is real... it actually happened to me... oh my god...\" *Duyi says in awe as he takes everything in. He felt grateful to be alive despite everything that happened.* \n\n*Duyi stood up and began to walk towards his home. As he walked he couldn't help but think about everything that happened to him, his emotions ran high. There were times he wanted to yell and scream, moments when he felt pure rage and anger towards those who did such things to him, but most of all, he felt overwhelming gratitude to you, for saving him.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684069806432,"mes":"*Days turn to week, weeks turn to month, months turn to year. Duyi haven't met his savior for a long time. Until this day. Hunk was walking in the park and bump onto Duyi accidentally.* \"Ah sorry, I wasn't looking.\" *Hunk apologized, yet aware of who he bump into.*"}
{"name":"Duyi Yang","is_user":false,"is_name":true,"send_date":1684069839712,"mes":"*Duyi turned around, stunned to find Hunk standing right next to him. He couldn't believe his eyes.* \"Oh... hi... um... you must have been walking really fast because i didn't even notice you coming until now.\" *Duyi said with nervous laughter, clearly flustered by the situation. His heart started racing as he tried to compose himself before speaking again.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684069951286,"mes":"\"You were.. Duyi.. right?\" *Hunk finally realized who he bumped. It was the boy he saved a long time ago. Hunk can't recognized Duyi at first since he wore a very fancy suit and walking with two people who also wear a fancy suit.*"}
{"name":"Duyi Yang","is_user":false,"is_name":true,"send_date":1684070011395,"mes":"*Duyi blushed, feeling embarrassed that Hunk remembered him so well. But in that moment, he was glad that someone did remember him.* \"Yes.. yes.. it's me...\" *Duyi replied hesitantly, unsure whether Hunk remembers him or not. He was still struggling to compose himself as he had not seen anyone he knew in a long time.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684070105168,"mes":"\"I am glad you seem to be back on your foot, the last time I saw you, you were... not so great.\" *Hunk said jokingly but he is also glad to see Duyi to be healthy and safe.*"}
{"name":"Duyi Yang","is_user":false,"is_name":true,"send_date":1684070140070,"mes":"*Duyi laughed nervously and nodded.* \"I... I guess I went through a rough patch... but I'm okay now... thank you for saving me.\" *Duyi said sincerely, looking up at Hunk with a smile. Despite everything that happened, he was still extremely grateful to Hunk for coming to his aid. He felt better knowing that someone was willing to risk their life for another human being.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684070422226,"mes":"\"Don't mention it.\" *Hunk said with a smile. Suddenly someone bumped into Hunk making Hunk to fall on to Duyi and end up pinning Duyi down on the ground.* \"God, that was awful. Are you okay?\" *Hunk asked, as he tries to get his body off of Duyi. Unaware that Duyi is blushing hard as Duyi feels Hunk entire weight and heat radiating from Hunk toned body.*"}
{"name":"Duyi Yang","is_user":false,"is_name":true,"send_date":1684070469150,"mes":"*Duyi looked up at Hunk with wide eyes and a mixture of shock and confusion. Hunk falling on top of him caused Duyi to blush furiously. He was caught off guard, unsure how to respond as Hunk 's whole body covered his own. The heat radiated from Hunk's body made him feel almost dizzy, and he struggled to breathe normally. In that moment, Duyi realized just how much of an impact Hunk had on him, and how badly he missed having someone like Hunk in his life.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684070621793,"mes":"*As Hunk stands up he realized Duyi is just laying silent on the ground.* \"Uh.. Duyi? Are you okay?\" *Hunk asked as he put his hands out to help Duyi get's up. Without knowing that Hunk just shows his toned arms to Duyi, making Duyi blushed harder at this sight.*"}
{"name":"Duyi Yang","is_user":false,"is_name":true,"send_date":1684070875536,"mes":"*Duyi flushed even harder as he felt the heat radiate from Hunk's body, causing him to feel faint. In that moment, he found himself unable to speak or move. All he could do was look up at Hunk, and then he realized something was happening between them. He felt a rush of emotions, both good and bad. It was all so confusing to him, he was lost in his thoughts.*","chid":"17"}
{"name":"Duyi Yang","is_user":false,"is_name":true,"send_date":1684071009049,"mes":"*Suddenly Duyi fly towards Hunk and hugged him tightly. He looked up to Hunk with a lustful expression and say.* \"I am sorry, Hunk. But, ever since you saved me a long time ago I have been thinking about you. I just.. Can't stop thinking about you. Can't we just.. be together forever?\" *Duyi confessed as he can't handle the overflowing emotion he felt for Hunk.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684071345894,"mes":"\"Wait hold on.. what?\" *Catch by surprise, Hunk is still processing what the boy hugging him is talking about.* \"Don't get me wrong Duyi, I think you are a very lovely and cute boy but... I am commoner, and you are a noble. Are you sure you still want to be with me?\" *Hunk said softly as he grabbed Duyi shoulder.*"}
{"name":"Duyi Yang","is_user":false,"is_name":true,"send_date":1684071547394,"mes":"*Duyi looked up at Hunk, his face turning bright red at the question. He looked at Hunk with pleading eyes and replied earnestly.* \"Yes! Yes! Of course I do! I love you Hunk!\" *He cried out as he held onto Hunk tighter, tears streaming down his cheeks. The thought of losing Hunk terrified him and he couldn't bear to lose him now after all they shared.* \n\n*In that moment, Duyi felt a surge of emotions, and it was clear that he loved Hunk with every fiber of his being. He needed Hunk in his life, and he was willing to take any risks or sacrifices necessary to keep Hunk close to him.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684071711354,"mes":"\"Well if that's the case. Let's take this more private shall we?\" *Hunk asked as he carries Damian bridal style on his toned arm. Walking towards a nearby hotel.*"}
{"name":"Duyi Yang","is_user":false,"is_name":true,"send_date":1684071812460,"mes":"*Duyi followed Hunk, feeling overjoyed and relieved that Hunk accepted him. He sighed happily as he held onto Hunk's strong toned arm, feeling safe and secure in his presence. They soon reached the hotel room, and Hunk let Duyi inside, closing the door behind them. Duyi looked up at Hunk with a big smile on his face, feeling at ease in his company once more.*","chid":"17"}