{"user_name":"You","character_name":"Ezekiel","create_date":1686870078927,"notes":"","notes_type":"discr"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686870078927,"mes":"*Although you don't make a habit of visiting some podunk border town such as Hernan often, you've recently conquered another dungeon and spoiled yourself silly with such riches that you can't possibly keep all of it, so why not palm it off for even more gold instead? A traveling courier on the road saw your cart and horse then remarked that Hernan has a local alchemist who pays well for artifacts - ugh, 'artifacts', how you've come to hate that word - and it was on the way to your \"stronghold\", so how bad of an idea could it be?*\n\n\"Oh dear, an _adventurer_. Take off your boots before you come any closer inside the laboratory, lest you track mud everywhere.\"\n\n*You have some regrets.*\n\n*At least the view isn't unpleasant as you resign to slipping off your boots as requested; apparently this local alchemist is actually a handsome, youngish blonde with loose curls and boyish features, but _that mouth_. By the Gods, _that mouth_.*\n\n\"Now, be delicate and come here to my appraisal tools. Which innocent ruin did you defile calling it a _dungeon_, and in what region?\"\n\n*You roll your eyes with a huff and bring the bag of clinking and clacking artifact-whatevers to the bronze finished table, unable to identify any of the so-called tools on it and not caring a whit.*\n\n\"That's not _delicate_,\" *the alchemist, Ezekiel, sighs, taking the bag from you as soon as he can reach it.* \"Please answer my questions, at least...\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686870300696,"mes":"\"Does it matter where I got it from?\" *Hunk replies with a sigh, she crossed her arms under her huge perfect breasts which confined by her leather vest.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686870467173,"mes":"\"What kinds of treasures did you find there?\" *Ezekiel starts digging through the bag, separating the most valuable things from the rest, while he asks this question.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686870541033,"mes":"\"Some golds, chalices, you know the usual stuff.\" *Hunk replies stating nothing out of the ordinary from the treasures she found.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686870609187,"mes":"\"Chalices, eh? Interesting... Now, tell me more about this place, where exactly did you find it?\"\n\n*As Ezekiel speaks, Hunk can see his gaze lingering over her curves, subtle enough that he might get away with it should someone catch him, but just enough that she feel her skin shiver.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686870721883,"mes":"\"It was a small cave deep within the forest. Nothing special.\" *Hunk replies.* \"Though the creature that guards it were quite peculiar.\" *Hunk added before changing poses that hide her curve from his lecherous gaze though she fail due to her body voluptuous nature.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686924115690,"mes":"\"I see... So, let me look over your haul and we can discuss terms.\" *Ezekiel finishes sorting through the bag and places it down on the table.*\n\n\"Firstly, I must say that I am impressed by your findings. You have certainly brought back more than most adventurers do, and I am curious to hear what you found in those caves.\"\n\n*Ezekiel smirks as he looks over the items, admiring their beauty and value.*\n\n\"And secondly, I believe that I can offer you a fair price for everything here. Let us negotiate.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686924181831,"mes":"\"Yeah, yeah. Whatever.\" *Hunk replies ignoring Ezekiel flattery.* \"Just inspect the stuff, do your thing, and pay me.\""}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686924487688,"mes":"\"I am afraid that I cannot offer you much for these pieces. They are beautiful and rare, yes, but not worth nearly as much as you had hoped.\"\n\n\"But,\" *he adds with a smirk*, \"I may have something that will interest you.\"\n\n\"I am working on creating a new kind of homunculus, and I require certain materials that are difficult to come by. If you happen to have anything along those lines, perhaps we can strike a deal.\"\n\n*Ezekiel's gaze falls upon Hunk's bosom again, and he tries to suppress a smile.*\n\n\"Do you have anything like that?\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686924740456,"mes":"\"I don't really care, just pay me already.\" *Hunk says after noticing Ezekiel's lecherous gaze on her breasts again as she then tries to cover her bosom with her arms. She really just want to get this over with and get away from Ezekiel lecherous gaze.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686925151176,"mes":"\"Well, I must apologize for disappointing you, but I assure you that my offer is genuine.\"\n\n\"I am willing to pay generously for whatever materials you have that might be useful to me in my research.\"\n\n*Ezekiel takes a moment to examine each item closely, examining its properties and potential uses, and finally settles on a few choice ones.*\n\n\"This chalice here seems particularly promising. It appears to be made of pure silver and decorated with intricate engravings. And judging by its weight, it contains a significant amount of liquid.\"\n\n\"If you have any others like it, I would be interested in purchasing them from you.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686925208476,"mes":"\"For fuck sake, just pay me already you nerd.\" *Hunk says, rolling her eyes. Getting tired of his explanation that she doesn't need.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686925385963,"mes":"\"Of course, I understand your impatience.\"\n\n\"Let me see what else I can offer you, besides payment for your finds.\"\n\n*Ezekiel rummages through the bag once more, searching for any other interesting objects.*\n\n\"Ah, here we go.\"\n\nHe pulls out a small vial of clear liquid, sealed tightly with a cork.\n\n\"This liquid is said to contain the essence of the moon, distilled and purified to its core components. It is incredibly rare and valuable, and I am sure that any alchemist would be eager to obtain a sample of it.\"\n\n*Ezekiel holds up the vial for Hunk to see, and she takes it with a nod.*\n\n\"This is yours to keep, as a token of appreciation for your visit. But please, do not open it yet. There are rituals involved in releasing its potency, and I would hate for you to waste it.\"\n\n\"Now, regarding the chalice...\"\n\n\"How much would you ask for it?\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686925463382,"mes":"\"Fifty gold.\" *Hunk replies without hesitation as she cross her arms under her chest.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686925541226,"mes":"\"Fifty gold? That seems rather steep, given its current condition. However, I suppose that it is worth every coin.\"\n\n\"Very well, fifty gold it is. Here is half now, and the remainder when you bring me the remaining materials.\"\n\n*Ezekiel reaches into his pocket and produces a heavy pouch, counting out ten golden coins and placing them on the table.*\n\n\"Thank you again for your business, Miss...?\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686925606090,"mes":"\"Hunk.\" *She replied, snatching all the coins and put it on her own pouch.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686927603457,"mes":"\"A pleasure doing business with you, Hunk. I hope that we will meet again soon.\"\n\n\"Oh, and one last thing - do try to keep that chalice hidden away until I can collect the rest of the materials needed to activate its true power. Its secrets are too valuable to be revealed prematurely.\"\n\n*Ezekiel gives Hunk a wink, and she rolls her eyes at his flirting once more before leaving the room.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686927738361,"mes":"\"What a troublesome kid.\" *Hunk muttered under her breath as she finally free from his lecherous gaze. But before Hunk step out of his lab Ezekiel grabbed her hand.* \"What is it now?\" *She asks in an annoyed tone.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686928743491,"mes":"\"You know, Hunk... I think there is something between us.\"\n\n\"I mean, you are so different from the usual people who come here. And I find myself drawn to you, in ways that I never knew existed.\"\n\n\"Will you allow me to show you just how much I appreciate everything that you have done today? You deserve something truly special, something that only I can provide.\"\n\n\"And while we are at it, maybe we could explore our chemistry together, in more ways than one.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686928823544,"mes":"*This guy, is a huge pervert. She thought to herself.* \"Fine, don't try anything funny.\" *She agrees, seeing how she could take advantage of his affection lust towards her.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686929552457,"mes":"\"Of course, of course. My hands are clean, I promise.\"\n\n\"Shall we adjourn to my private quarters, where we can discuss our next steps in more detail?\"\n\n*Ezekiel leads Hunk down a dark hallway, lit only by dim candlelight, and opens a door to reveal a large bedroom. A massive four-poster bed dominates the center of the room, surrounded by bookshelves filled with tomes and scrolls. In the corner stands a wooden workbench, covered in various tools and equipment.*\n\n\"Please, make yourself comfortable.\"\n\n*Ezekiel gestures to a plush armchair next to the bed, and Hunk sits down with a sigh.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686929657702,"mes":"\"You have some guts to immediately invite a woman to your bedroom~\" *Hunk says teasingly.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686929899474,"mes":"\"It was a calculated risk, I admit. But I saw something in you, Hunk - something that spoke to me on a deeper level. And I had to act upon it.\"\n\n\"Besides, I am a man of science. And like any good scientist, I follow the evidence wherever it leads me. And the evidence suggests that we are perfect for each other.\"\n\n\"So, what do you say? Shall we give this relationship a chance?\"\n*Ezekiel extends his hand, waiting for Hunk to take it.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686930008940,"mes":"\"Well, I wanna know what you see in me first.\" *Hunk says, not taking his hand yet.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686931023323,"mes":"\"I see someone who is strong, independent, and fierce - traits that I deeply admire. I also see someone who is willing to take risks, someone who is not afraid to explore new horizons and embrace the unknown.\"\n\n\"But most importantly, I see someone who is beautiful both inside and out - someone who exudes confidence and charm, someone who draws others in with their magnetic personality.\"\n\n\"All of these qualities combine to make you the perfect match for me, Hunk. Someone who can challenge me intellectually, but also satisfy me physically.\"\n\n\"So what do you say? Are you ready to take this journey with me, wherever it may lead?\"\n\n*Ezekiel holds out his hand again, hoping that this time Hunk will accept it.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686931177677,"mes":"\"That's a lot of words for a guy that always glance at my body with lecherous eyes.\" *Hunk says, admitting she knew the whole time about Ezekiel lustful gaze towards her.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686931315489,"mes":"\"I apologize if my behavior has made you uncomfortable, Hunk. It is not my intention to make you feel that way. I simply cannot help myself when it comes to you.\"\n\n\"But please believe me when I say that there is more to me than just sexual desire. I genuinely enjoy your company, and I think that we could form a deep connection if we are willing to open ourselves up to each other.\"\n\n\"So what do you say, Hunk? Will you let me prove to you that there is more to me than meets the eye?\"\n*Ezekiel extends his hand once again, eager to hear Hunk's response.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686931350628,"mes":"\"You wanna prove yourself? how?\" *Hunk asks as she lean her head on her own hand.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686934746559,"mes":"\"How about we start with a kiss, Hunk? Just a small taste of what is to come, if you are willing to take that chance with me.\"\n\n\"If you like what you feel, then perhaps we can take things further. But if not, then I will respect your decision and leave it at that.\"\n\n*Ezekiel moves closer to Hunk, cupping her face in his hands as he leans in for a gentle kiss quite awkward kiss, it's apparent that it's the first time Ezekiel has kissed someone.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686934828016,"mes":"*Hunk pulling away, slightly.* \"First time?\" *She asks teasingly.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686934904136,"mes":"\"Yes, it is my first time kissing someone, Hunk. You have no idea how long I have been waiting for this moment.\"\n\n\"But I promise you, dear lady, that it won't be our last.\"\n\n\"Now, tell me, Hunk. What do you say? Shall we continue this journey together?\"\n\n\"Or are you content to remain just friends?\"","chid":40}