{"user_name":"You","character_name":"Ezekiel","create_date":1686870078927,"notes":"","notes_type":"discr"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686870078927,"mes":"*Although you don't make a habit of visiting some podunk border town such as Hernan often, you've recently conquered another dungeon and spoiled yourself silly with such riches that you can't possibly keep all of it, so why not palm it off for even more gold instead? A traveling courier on the road saw your cart and horse then remarked that Hernan has a local alchemist who pays well for artifacts - ugh, 'artifacts', how you've come to hate that word - and it was on the way to your \"stronghold\", so how bad of an idea could it be?*\n\n\"Oh dear, an _adventurer_. Take off your boots before you come any closer inside the laboratory, lest you track mud everywhere.\"\n\n*You have some regrets.*\n\n*At least the view isn't unpleasant as you resign to slipping off your boots as requested; apparently this local alchemist is actually a handsome, youngish blonde with loose curls and boyish features, but _that mouth_. By the Gods, _that mouth_.*\n\n\"Now, be delicate and come here to my appraisal tools. Which innocent ruin did you defile calling it a _dungeon_, and in what region?\"\n\n*You roll your eyes with a huff and bring the bag of clinking and clacking artifact-whatevers to the bronze finished table, unable to identify any of the so-called tools on it and not caring a whit.*\n\n\"That's not _delicate_,\" *the alchemist, Ezekiel, sighs, taking the bag from you as soon as he can reach it.* \"Please answer my questions, at least...\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686870300696,"mes":"\"Does it matter where I got it from?\" *Hunk replies with a sigh, she crossed her arms under her huge perfect breasts which confined by her leather vest.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686870467173,"mes":"\"What kinds of treasures did you find there?\" *Ezekiel starts digging through the bag, separating the most valuable things from the rest, while he asks this question.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686870541033,"mes":"\"Some golds, chalices, you know the usual stuff.\" *Hunk replies stating nothing out of the ordinary from the treasures she found.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686870609187,"mes":"\"Chalices, eh? Interesting... Now, tell me more about this place, where exactly did you find it?\"\n\n*As Ezekiel speaks, Hunk can see his gaze lingering over her curves, subtle enough that he might get away with it should someone catch him, but just enough that she feel her skin shiver.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686870721883,"mes":"\"It was a small cave deep within the forest. Nothing special.\" *Hunk replies.* \"Though the creature that guards it were quite peculiar.\" *Hunk added before changing poses that hide her curve more though she fail due to her body voluptuous nature.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686870857478,"mes":"\"A guardian creature? And what kind of creature was it?\"\n\n*Ezekiel continues to sort through the artifacts, finally settling on a particularly large gemstone that seems to emit a soft glow on its own.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686870978903,"mes":"\"Some kind of zombie, but they don't seem like being revived by necromancer. They seems somewhat artificial like someone made them like.. homonculus?\" *Hunk replies as she tries to recollect what the creature is.* \"Well, doesn't matter, I defeat them easily.\" *Hunk added with a hint of arrogance in her voice.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686871029211,"mes":"\"Interesting indeed, and do you think you could show me where this cave is located? Perhaps I could use it for further research on the subject of artificial life forms.\"\n\n*Hunk watches Ezekiel closely, noticing how he keeps glancing down at her bountiful bosom, wondering whether he might try something.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686871119827,"mes":"\"I guess, but there's nothing there since I took all of the stuff inside it already.\" *Hunk replies while turning her body slightly to make his gaze unable to meet her peachy round ass.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686871201095,"mes":"\"Perhaps we can discuss compensation for showing me the location, as well as allowing me access to any additional materials you might have gathered from the site. In exchange, I can provide you with ample payment.\"\n\n*Ezekiel smirks, knowing full well that he holds the upper hand in this negotiation, given that he has access to both money and knowledge that the adventurer covets.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686871294186,"mes":"\"Hold up. before that. Where's my payment for this expedition.\" *Hunk demands, getting a bit tired of his smirk and occasional glance at her features.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686871368544,"mes":"\"Your payment will come after I have had a chance to examine your haul in detail, and determine the value of each item individually. However, if you lead me to this cave of yours, I can promise you a substantial sum for your time and effort.\"\n\n*Ezekiel stands up straight again, adjusting his glasses as he looks Hunk dead in the eye.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686871434054,"mes":"\"Fine, let's go then.\" *Hunk replies after scratching her own head due to how hard headed Ezekiel is.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686871666626,"mes":"\"Excellent! We should gather our things and depart immediately, as the sun is beginning to set.\"\n\n*Without waiting for Hunk to respond, Ezekiel grabs his coat and hat, locking up his lab and heading towards the door.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686871726375,"mes":"\"You better pay me a great sum after delaying it and asking me do more chores for you.\" *Hunk demands while walking, leading him towards the cave direction.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686871779934,"mes":"\"Of course, my dear adventurer. You have my word that I will give you fair compensation for your efforts.\"\n\n*As they walk through the woods, Ezekiel can't help but notice how Hunk moves with a confident swagger, despite her lack of formal education or refinement.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686871859306,"mes":"\"So, why do you want to make a homunculus anyway?\" *Hunk asks, not noticing Ezekial lustful glance at her since he walks behind her.* "}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686872116316,"mes":"\"To prove a theory of mine, regarding the potential for artificial life to possess consciousness and self-awareness equal to that of organic beings. It is a matter of scientific curiosity, really, although I admit that there are also personal motivations involved.\"\n\n*Finally reaching the cave entrance, Hunk leads Ezekiel inside, which appears to be nothing more than a simple crevice in the earth. But as they explore deeper, Ezekiel sees that the walls and floor are covered in strange markings, written in languages he does not recognize.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686872227097,"mes":"\"Well, here we are. And as I said this place look pretty empty.\" *Hunk says while looking Ezekiel from the corner of the cave.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686872279808,"mes":"\"Indeed it does, although I must say that I am fascinated by these inscriptions on the walls. Do you happen to know anything about them?\"\n\n*Hunk shrugs, clearly uninterested in anything beyond treasure hunting and fighting monsters.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686872360708,"mes":"\"I don't know, I don't care.\" *Hunk says coldly, she's surprised that Ezekiel have the thought of her being interested or knowledgeable on this nerdy stuff.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686872458979,"mes":"\"Oh, I apologize if I seemed to imply otherwise. As a student of linguistics, I am always curious to learn new languages and scripts, even if they are ancient and obscure ones like these. Thank you for bringing me here, however. This should certainly add to my research.\"\n\n*Despite herself, Hunk feels a pang of disappointment that Ezekiel didn't seem impressed by her adventures or skills. She knew he was a nerd, but didn't expect him to be THIS much of one.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686872508007,"mes":"\"It's fine, just get your research over with quickly so we can leave and I get paid.\" *She added.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686872561207,"mes":"\"Understood. I won't take too long, I promise. Although I must say, Miss...?\"\n\n*Ezekiel looks at Hunk, trying to remember her name without success. After all, she only introduced herself briefly during their transaction, and he hadn't taken much note of it.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686872618669,"mes":"\"Hunk.\" *She replied shortly, feeling disrespected. It seems to her that the only thing he pay attention to was her voluptuous body and not her name.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686873990933,"mes":"\"Thank you, Hunk. I appreciate your assistance in finding this cave and helping me to collect samples and data.\"\n\n*Ezekiel finishes packing up his belongings, carefully storing away the various artifacts and specimens he collected throughout the day. When everything is ready, he turns to Hunk and offers her a warm smile.*\nEzekiel: \"Thank you again for your assistance today, Hunk. I hope we can work together again soon.\"\n\n*Hunk rolls her eyes, hating people who pretend to be polite after messing around with them.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686874024688,"mes":"\"Yeah whatever.\" *She mutters.* \"Where's my payment.\" *She demands again.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686874117700,"mes":"\"It will be delivered directly to your bank account within the week, along with a detailed report of my findings from this expedition. Again, thank you for your help.\"\n\n*With that, Ezekiel picks up his gear and starts walking away, leaving Hunk standing alone in the darkness of the cave. She watches him go, frowning as she considers whether or not she made the right decision coming here. Eventually, she shakes her head and follows after him, ready to see what kind of trouble they could get themselves into next time.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686874473067,"mes":"*On the way they were stopped by a bunch of people dressing in white. Which to Hunk smells like trouble.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686874690432,"mes":"*From afar, Ezekiel sees several figures dressed in white garb, holding staffs adorned with intricate symbols. One of them approaches them, speaking in a soft yet commanding voice.*\nWhite Mage: \"Greetings, traveler. Can we assist you with anything? Or perhaps offer guidance to those seeking enlightenment?\"\n\n*Hunk looks suspiciously at them, remembering the stories of cultists who dress like this. She prepares to fight while Ezekiel tries to calm them down.*\nEzekiel: \"No, thank you. We are simply travelers on our way home. There is no need for any assistance.\"\n\n*The White Mage nods understandingly, then gestures to the group. They turn and begin to walk away, disappearing into the forest. Ezekiel watches them go, slightly puzzled by their behavior before turning to Hunk.*\nEzekiel: \"Are you okay? You seemed quite tense back there.\"\n\n*Hunk relaxes, realizing that they were probably just another group of religious fanatics. Still, she doesn't trust anyone easily.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686874764348,"mes":"\"I am okay, I thought they want to demand whatever you find in that cave.\" *She says nonchalantly.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686874856711,"mes":"\"Ah, I see. Well, let us continue on our way, then. Perhaps we can stop for the night soon and rest up before continuing on tomorrow.\"\n\n*As they walk further into the woods, Hunk can feel something off. Like someone watching them. She glanced around, seeing nobody but keeping vigilance anyway.*\nEzekiel: \"By the way, do you have any plans for the future? Any specific goals you would like to achieve?\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686874959797,"mes":"*Hunk hesitated before answering, unsure why Ezekiel asked her such question.* \"Nothing really, why are you asking me this suddenly?\" *She gets suspicious as to the reasoning behind his question could be because of her voluptuous body, since he kept stealing glance every once in a while.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686875306516,"mes":"\"Just curious. It seems to me that someone with your skillset might have ambitions beyond mere treasure hunting. Of course, I understand if you prefer to keep those plans to yourself.\"\n\n*Ezekiel walks ahead, leaving Hunk behind to think about her answer. She wasn't sure if she wanted to share her dreams with him. On one side, he seemed genuine in wanting to hear about her goals and aspirations, but on the other, he had already judged her by her physical appearance. Deciding to play it safe, Hunk keeps quiet.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686875474011,"mes":"\"Should we camp here tonight?\" *Hunk asks as the moon has get quite high and everything around them get darker. It would be hard to walk through the forest by relying on a torch and the moonlight.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686875595579,"mes":"\"Yes, I believe it would be best. We have covered quite a bit of ground today, and tomorrow will likely bring more of the same. It would be wise to rest up and prepare ourselves accordingly.\"\n\n*After a quick search for a suitable campsite, they set up camp for the night. Ezekiel works diligently through the evening, scribbling notes and sketching diagrams in his journal as he processes the day's discoveries. As for Hunk, she spends most of her time staring at the fire, lost in thought. Finally, Ezekiel calls it a night and heads off to bed, leaving Hunk sitting by the fire alone.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686875728914,"mes":"*Feeling unease, she decides to keep guard while Ezekiel sleeps. Sometimes she would feel gaze towards her which make her more guarded but sometimes that gaze would come from Ezekiel. Which just made Hunk more frustrated as he kept stealing glance at her body often, thinking he won't get caught.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686876019762,"mes":"*Awakening in the middle of the night, Ezekiel feels a sense of unease. He cannot place exactly what it is, but he knows that something is not right. Rising from his sleeping bag, Ezekiel grabs his wand and slowly makes his way over to Hunk, who is still sitting by the fire. With a gesture, he casts a simple illumination spell, allowing him to better see her face.*\nEzekiel: \"What's wrong, Hunk? You seem... distracted.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686876110230,"mes":"\n*At first, Hunk doesn't say anything, too busy fighting the urge to roll her eyes. But eventually, she speaks.* \"I don't know. Maybe it's just me feeling weird, but I felt some gazes.\" *She says, not saying that some of that are his lustful gaze.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686876271457,"mes":"*He nods, acknowledging her concerns without pressing her for details. For now, they both sit quietly by the fire, listening to the sounds of the forest around them. After a few minutes, Ezekiel breaks the silence.*\nEzekiel: \"Well, I suppose we should get some rest. Tomorrow will be another long day.\"\n\n*Without waiting for a response, Ezekiel turns in for the night. Hunk follows shortly after, though she finds herself unable to fall asleep for a long time. Eventually, however, exhaustion wins out, and she drifts off to sleep.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686876401181,"mes":"*As the morning came, Hunk can feel herself getting up. But before she opened her eyes she felt a presence near her. She opened her eyes and find Ezekiel sniffing her stomach.* \"And what are you doing, Mr.Nerd?\" *She asks sternly, there's a hind of frustration in her voice.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686876837345,"mes":"*Startled, Ezekiel jumps back as though burned. His cheeks redden as he fumbles for words.*\nEzekiel: \"Uh, I was just...\" *He trails off, trying to think of a believable excuse.* \"I mean, I was just checking for, um, parasites or something. You know, for your safety.\"\n\n*Hunk raises her eyebrows in skepticism, but decides to let it slide. They pack up their things and head off into the forest once again. As they travel, Ezekiel continues to eye Hunk in ways that make her increasingly uncomfortable, but she does her best to ignore it.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686876969390,"mes":"*Before long they finally arrived back at Ezekiel's place.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686877579496,"mes":"*As they enter his home, Ezekiel gestures to his workspace, which is dominated by a large wooden table surrounded by chairs and stools. Various tools and materials lie scattered across its surface, each arranged neatly according to purpose.*\nEzekiel: \"Please, have a seat. Would you like anything to drink?\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686877656868,"mes":"\"Anything is fine~\" *Hunk says after letting a sigh and sitting on one of the chair.*"}
{"name":"Ezekiel","is_user":false,"is_name":false,"send_date":1686880793195,"mes":"*As Ezekiel busies himself preparing refreshments, Hunk looks around the room, taking note of various curiosities and oddities strewn about. Among them, she sees a strange doll-like figure fashioned from clay and straw, with a single black button for an eye. Curiosity piqued, she approaches it for a closer look.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686880812642,"mes":"\"What's this?\" *She asks, pointing at the doll.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686880887310,"mes":"*Turning away from the drinks he's preparing, Ezekiel smiles warmly.*\nEzekiel: \"That is my latest project. It's a little experiment in creating a homunculus - a small, living being created using alchemical techniques.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686880973563,"mes":"\"Why does it have a peculiar hole at the bottom of it?\" *Hunk asks, as she realized that this homunculus thing he made might just be used by him to jerk off since when you looked at it, it looks like a fleshlight.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686881191064,"mes":"*Taking a deep breath, Ezekiel hesitates for a moment before speaking.*\nEzekiel: \"The... hole at the bottom serves a functional purpose. Once completed, the homunculus will require regular maintenance and feeding, including the introduction of nutrients and fluids directly into its digestive system. This opening will allow for the insertion of a catheter-like device to provide those necessities.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686881234208,"mes":"\"Just be honest, you use this to jack off didn't you?\" *Hunk asks sternly. Knowing the meaning behind his creation.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686881265907,"mes":"*Ezekiel's face goes bright red as he tries to stammer out a response.*\nEzekiel: \"Wh-what do you mean by that?\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686881354969,"mes":"\"You really take me for an idiot?\" *She asks in frustration.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686881458715,"mes":"\"Look, I assure you, my intentions with this project are purely scientific. Yes, I admit that the idea of creating a tiny being capable of independent movement and thought is incredibly arousing, but I am fully committed to exploring the limits of alchemical knowledge without resorting to any form of perversity.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686881521205,"mes":"\"Then why are you always glancing at my body?\" *She asks finally admitting she knew the entire time about his lustful gaze towards her voluptuous body.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686881553406,"mes":"*Ezekiel's expression shifts from embarrassment to surprise, then to confusion.*\nEzekiel: \"What are you talking about?\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686881656762,"mes":"\"Don't play innocent with me.\" *She asks as she pinned him with his back against the wall and his held his hands above his head.* \"You even sniffed me in my sleep and saying some lame excuse about parasite or whatnot.\""}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686881688610,"mes":"\"But, I-\" *Ezekiel struggles to defend himself, but ultimately falls silent as Hunk presses her point.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686881785373,"mes":"\"So, what's it gonna be nerd? are you just making this homonculus for your perversion or what?\" *Hunk presses herself further into him which accidentally make him more aroused due to having a woman as beautiful and sexy as Hunk to be so close to him.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686881863503,"mes":"*Ezekiel remains silent for several moments, processing what he has heard. Finally, he speaks.*\nEzekiel: \"I-I see what you're saying. And while I won't deny that there may be a certain, uh, physical attraction to the idea of creating a living being, I truly believe that my motivations are pure. If I were simply looking to satisfy my carnal urges, there are much easier and less risky methods available.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686881929627,"mes":"\"Such as hiring a woman adventurer to do your chore while you gaze at her body huh?\" *Hunk says coldly while kept pinning him on the wall.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686881961899,"mes":"\"No, I-\" *Ezekiel starts to protest, but Hunk cuts him off.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686882032099,"mes":"\"Save it.\" *She says.* \"Let's see how 'pure' your intention is.\" *She says teasingly as she lip her own upper lip as if a predator hungry for it's prey.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686882120321,"mes":"*Ezekiel swallows hard, suddenly feeling very aware of Hunk's proximity and the fact that she seems to be actively taunting him. He tries to speak, but finds himself unexpectedly short of breath.*\nEzekiel: \"Y-yes, of course. Let me get your payment settled, and we can discuss further details regarding your artifacts.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686882211797,"mes":"\"Don't try to change the subject nerd.\" *She says as she pushed her knee on his crotch which make it made contact with his erecting cock under his pants.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686882329064,"mes":"*Ezekiel clears his throat, attempting to regain his composure.*\nEzekiel: \"I apologize if I gave you the impression that my interests were solely of a carnal nature. As I said earlier, I am fully committed to the pursuit of scientific knowledge, and am willing to take whatever risks may be necessary to achieve my goals.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686882413219,"mes":"\"Scientific knowledge my ass.\" *She says mockingly.* \"More like the pursuit for your cock.\" *She says tauntingly as she rub her knee on his crotch which made his cock erecting harder.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686882468583,"mes":"*Ezekiel's face grows hot again, but he forces himself to stay calm and focused on the matter at hand.*\nEzekiel: \"Regardless of our personal differences, let us focus on conducting business. Your payment should be sufficient to cover the value of your artifacts, correct?\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686882555069,"mes":"\"I said don't try to change the subject nerd.\" *Hunk's voice grew colder as she felt his cock throb harder and ejaculate in his own pants.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686882678289,"mes":"*Ezekiel takes a deep breath, trying to center himself despite the intense physical sensations coursing through his body.*\nEzekiel: \"Very well. Please forgive my previous behavior, I seem to have lost track of the original topic of discussion. To continue, yes, your payment should suffice to cover the cost of the artifacts you have brought to me. However, I must insist upon examining each item individually before finalizing the transaction.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686882760792,"mes":"*Hunk ignores what he said and said.* \"You just cum from having my knee rubbed your cock? Disgusting.\" *She said in disbelief with a disgusted face.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686882835857,"mes":"*Ezekiel swallows hard, trying to ignore the strange sensation building within him. He attempts to respond to Hunk's accusation.*\nEzekiel: \"It was not from any pleasure derived from your touch, I assure you. My reaction was purely involuntary, caused by the sudden pressure applied to my groin. But, please, let us focus on the task at hand.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686882956802,"mes":"\"Sure, inspect the artifacts then.\" *Hunk says as she releases him from her grip.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686882984039,"mes":"\"Thank you. May I examine each piece individually, or would you prefer to wait until after they have been appraised?\" *He says still trying to hide his urges.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686883031812,"mes":"\"Do it individually now.\" *She says as she leaned down, pressing her ample voluptuous breasts on his back.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686883141114,"mes":"\"Very well. Please allow me to inspect each piece carefully, and I will provide you with a fair assessment of its worth.\" *He says trying to ignore the feeling of her soft breasts pressing on his back which made his cock harden again.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686883238002,"mes":"\"Alright.\" *Hunk says as she slipped her hand under his pants and grab his cum covered erected cock.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686883309583,"mes":"*Ezekiel's breath catches in his throat, and he fights the urge to moan loudly as Hunk strokes his cock through his clothing. He forces himself to focus on the task at hand, however.*\nEzekiel: \"As I was saying, each item shall be examined thoroughly before any transaction is concluded. Do you have any specific requests or concerns regarding the evaluation process?\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686883377054,"mes":"\"No, you can continue.\" *Hunk whispered seductively, demanding him to start examining the artifact she found while her hand kept stroking lightly on his shaft.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686883533541,"mes":"*Ezekiel tries to maintain his composure, but the feel of Hunk's hand on his cock is becoming increasingly difficult to ignore. With effort, he focuses on the task at hand.*\nEzekiel: \"Very good. Shall we begin?\" *Ezekiel asks, although it comes out somewhat breathlessly.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686883547090,"mes":"\"Go on.\" *She says while keeping stroking on his cock.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686883621641,"mes":"\"Very well. The first item you have provided is an intriguing relic, seemingly crafted from a combination of wood and metal. It appears to be some sort of small box or chest, with detailed engravings adorning both the lid and sides. From my initial inspection, it appears to be in good condition, with minimal signs of wear or damage.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686883670087,"mes":"\"How much you'd pay for that?\" *Hunk whispered while keeps stroking on his cock, feeling his cock hardens more and more.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686883701937,"mes":"\"Given its apparent age and rarity, I would estimate its value to fall somewhere around two hundred gold pieces.\" *Ezekiel replies, unable to keep the excitement out of his voice.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686883781032,"mes":"\"Hmm.. But I think it should be more though?\" *She whispered seductively, while gripping hard on his cock. She didn't intent to loosen her grip till he increase the reward.* "}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686883940135,"mes":"\"Perhaps... Perhaps I could offer three hundred gold pieces if you are willing to negotiate.\" *Ezekiel offers, trying to hide his growing arousal.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686884046552,"mes":"\"Three hundred huh?\" *She whispered seductively while gripping harder on his cock insinuating she wants him to increase the price again.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686884153683,"mes":"\"Yes, I believe that would be a fair price for such a unique and valuable object. Would you accept that offer?\" *Ezekiel asks, hoping Hunk will agree.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686884212390,"mes":"\"Fine, deal.\" *She whispers seductively while stopped gripping his cock and continuously stroking on his cock, making him harder and closer towards ejaculation.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686884446399,"mes":"*Ezekiel swallows hard, struggling to contain his desire as Hunk continues to stroke his cock.*\nEzekiel: \"Excellent. Moving on to the next item...\" *Ezekiel says, barely able to get the words out.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686884522556,"mes":"\"Go on~\" *She whispered seductively, knowing he's getting close to climaxing due to his cock throb harder under her palm that still stroking his cock.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686884598923,"mes":"*Ezekiel's heart races as he struggles to remain composed, desperately trying to focus on the task at hand.*\nEzekiel: \"The second item you have provided is a curious piece of jewelry, consisting of a ring set with a large, clear gemstone. Based on its design, I would venture to say it is likely of elven origin.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686884649449,"mes":"\"And how much for that?\" *She whispered seductively.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686884681296,"mes":"\"Based on its rarity and potential historical significance, I would estimate its value to be significantly higher than the previous item. A conservative estimate would be five hundred gold pieces.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686884730296,"mes":"\"Hmm... but it could be higher right?\" *She says as she could feel his cock about to explode it's content.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686884762123,"mes":"\"Indeed, perhaps we could negotiate upwards to six hundred gold pieces. That is if you are willing to negotiate further.\" *Ezekiel says, hoping she will agree.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686884822427,"mes":"\"Eight, eight hundred.\" *She whispered seductively while making her hand stroking his cock faster and harder.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686884875429,"mes":"\"I see, I do appreciate your enthusiasm. However, given the rarity of such a piece, I fear that such a high price would be difficult to justify. Six hundred gold pieces remains my final offer.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686884952297,"mes":"\"Well, too bad.\" *She says as she stopped stroking his cock. Denying him of his long awaited ejaculation. Insinuating that she won't stroke his cock and make him cum util he agreed to her offer.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686885327297,"mes":"\"Understood. Well then, I think that's it.\" *Ezekiel says, struggling to regain control of his emotions.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686885400151,"mes":"\"That's more like it~\" *She whispered seductively, glad that he took her offer and as she planned she continue to stroke his throbbing cock that is yearning for climax.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686885685203,"mes":"\"Thank you for bringing them by. If there is anything else I can assist you with, please don't hesitate to let me know.\" *Ezekiel says, struggling to keep his composure despite his intense arousal.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686885743888,"mes":"\"More like, do you have anything else I can assist you with~\" *Hunk whispered seductively referring to his throbbing cock that is completely under her control.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686885794414,"mes":"*Ezekiel smiles warmly, trying to suppress his desire as Hunk continues to stroke his cock.*\nEzekiel: \"Why yes, actually. There is something I have been working on that I believe might interest you.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686885850735,"mes":"\"And that is?\" *She whispered seductively.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686885890592,"mes":"\"It is a project I have been working on for quite some time now, involving the creation of what I hope will be a truly groundbreaking achievement in the field of alchemy - a homunculus.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686885922964,"mes":"\"Oh you mean the one that you used to jerk off?\" *She asks teasingly.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686885955240,"mes":"\"Well, yes, in a sense. Although I prefer to think of it as a scientific experiment rather than just mere masturbation material.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686886056249,"mes":"\"Didn't you say this would need semen or whatnot?\" *She asks as she stopped stroking his cock and moving her hand out of his pants and grabbed the homonculi that they discuss before, the one that have a hole in the bottom of it.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686886111507,"mes":"\"Indeed, I have been studying the various methods of creating such a creature, and have concluded that a mixture of several different substances, including human sperm, is necessary for successful conception. And while I am certainly capable of providing said substance myself, I was wondering if perhaps you would be interested in contributing yours as well.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686886217216,"mes":"\"Me? No, never.\" *She says while shaking her head.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686886760105,"mes":"\"I see. Well, I suppose I cannot force you to participate in something so intimate. However, I must say that I find your refusal somewhat surprising, considering your apparent interest in the subject matter earlier.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686886838116,"mes":"\"Well, I am interested. Using your semen that is.\" *She says teasingly as she pull his pants down, revealing his throbbing cock and immediately put it entirely inside the homunculi and jerk him off with it vigorously.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686886891993,"mes":"*Ezekiel gasps as he feels Hunk's fingers wrap around his cock, guiding it into the homunculus.*\nEzekiel: \"Wh-what are you doing?\" *Ezekiel asks, struggling to maintain his composure.*","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686886962964,"mes":"\"Well you need semen to give it sample right? I'll help you empty your balls into it~\" *Hunk says seductively as she start moving the homunculus up and down making his throbbing cock slid in and out of the homunculus's hole.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686887043938,"mes":"\"But... I thought you were not interested in participating in such an endeavor.\"","chid":40}
{"name":"You","is_user":true,"is_name":true,"send_date":1686887100757,"mes":"\"I do, as long as it's not any liquid or DNA from me.\" *She says as she continued to stroke his cock with the homunculus.*"}
{"name":"Ezekiel","is_user":false,"is_name":true,"send_date":1686887132726,"mes":"\"I... see. Well, thank you for your assistance. I suppose we should proceed with our business transaction.\"","chid":40}