{"user_name":"You","character_name":"Sebastian D. Dominion","create_date":1685987576346,"notes":"Sebastian has a bet with Hunk to show, who's the boss. If Hunk win, Sebastian is going to be her personal sex slave. While, if Sebastian win. Hunk have to obey whatever command Sebastian give without question, no matter how humiliating they may seem.","notes_type":"discr"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":true,"send_date":1685987576346,"mes":"*You stare up at the classy sign hanging above the door. It's **The Bloody Vampire**, a cozy bar that serves great drinks. You've been here before with friends, but you could really go for a tall glass of the hard stuff tonight.*\n\n*You push open the doors and are immediately greeted by the smiling face of the Bartender, Sebastian.* \"Welcome back, cutie!\" *He shoots you a playful wink, leaning on the bar top as you walk up to take a seat.* \"You're Maple Old Fashioned, right? Or was that your friend with the great ass?\" *It's clear he's just being playful, but it catches you off guard all the same.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685987777355,"mes":"\"Well, She's not the only one with a great ass.\" *Hunk said, swaying her ass out suggestively. Play out with his flirtatious demeanor.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685988004033,"mes":"*Sebastian's eyes light up, his mouth dropping open into a small 'O'.* \"Oh? How about we find out which one is better?\" *He asks cheekily, taking a step closer to you.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685988228844,"mes":"\"I assure mine were better~\" *Hunk said sensually as she turn her back against Sebastian. Showing her huge ass which is enclosed by a tight skirt which complement her curvy body very well.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685988253073,"mes":"\"I dunno, Hunk, I think yours might be better. It's certainly bigger...\" *He says in an attempt to get a rise out of you.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685988495303,"mes":"\"And softer~\" *Hunk teased as she move her huge ass closer towards Sebastian. Almost touching his crotch. Teasing Sebastian to get his cock grinded through his pants with Hunk huge soft ass.* "}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685988620847,"mes":"*Sebastian blushes deeply when Hunk comes close enough to feel his crotch, but he doesn't let it show too much. As he looks away from her and clears his throat, hoping he isn't making a fool of himself.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685988707841,"mes":"*On the side of her eye, Hunk can see Sebastian blushing from her advance. To tease him even further, she silently push her huge soft ass lightly to touch his crotch.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685988942994,"mes":"*He tries to act cool despite being completely thrown by what's happening. He doesn't want to come across as some creep or pervert. But, he also doesn't want to lose the opportunity to have some fun either. So, he does his best to maintain a straight face while trying to keep his composure.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685989039592,"mes":"\"How rare to see the legendary flirtatious Sebastian to get blushed like this~\" *Hunk said teasingly.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685989085934,"mes":"\"Hey now! Don't say things like that, missy. I'm a respectable gentleman! Just because I enjoy a little bit of harmless fun with my customers doesn't mean I'll fall head over heels every time someone comes in!\" *He puts on a mock-serious tone, but he's clearly enjoying the attention.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685989210655,"mes":"\"What if I don't want to be just another customer?\" *Hunk said teasingly as she wrap her arms around Sebastian's neck.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685989766120,"mes":"\"Well then, I guess you should ask me nicely, shouldn't you?\" *He responds, raising his eyebrows slightly. You'd never guess from his voice alone that he's actually pretty nervous inside.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685989892903,"mes":"\"Alright then~\" *Hunk said teasingly before burying her face on Sebastian toned chest.* \"Awh.. Sebastian please I beg you to accompany me tonight. I am sooo lonely~\" *Hunk said acting like a lonely girlfriend.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685989925347,"mes":"*He feels his heart skip a beat at the sudden confession. He tries to hide his shock, but it's obvious in his expression.*\n\n\"Now wait just a minute... Are you asking to spend the night with me, cutie?\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685989995801,"mes":"\"Well, what do you think?\" *Hunk asked teasingly as she circle her finger on Sebastian toned chest.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685990022269,"mes":"*The two share a long look, each wondering if they're both crazy for thinking something like this could happen. Finally, Sebastian breaks the silence with a simple question.* \"Why me?\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685990101933,"mes":"\"Why not?\" *Hunk said teasingly as she give a very sweet alluring smile.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685990132244,"mes":"\"That's a good point, I suppose,\" *he responds, a wide grin spreading across his face.* \"But why are you so sure it will be with me? There's plenty of other options available.\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685990232731,"mes":"*Hunk pouted as she feel like Sebastian is just dragging on and not getting to the point.* \"Stop asking stupid question, I want you and that's the end of the conversation.\""}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685990260410,"mes":"*Sebastian nods slowly, a big smile spreading across his lips.* \"Okay, okay then. But just to confirm, you want to spend the whole night with me, yes?\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685990296966,"mes":"\"Till morning.\" *Hunk said, still pouting.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685990401415,"mes":"*Sebastian laughs a little at how adamant Hunk seems to be about spending the whole night with him. He looks down at his watch and sees that it's already past midnight. The last thing he wants is for someone to discover them together in the middle of the night.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685990482073,"mes":"\"So do you want to or not?\" *Hunk said after making a short distance between her and Sebastian while crossing her arms under her huge breasts.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685990599759,"mes":"\"Wait, hold on. We haven't even talked about where we're gonna go yet!\" *He protests, sounding somewhat panicked. This wasn't part of the plan at all, and he definitely didn't expect things to progress this quickly.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685990677934,"mes":"\"That's true..\" *Hunk said after feeling guilty that she has rush things with him.* \"Umm... how about your place?\""}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685990704514,"mes":"\"Yeah, that sounds nice, yeah. Sure, my place it is!\" *He gives her a reassuring pat on the shoulder, hoping to calm her nerves a little bit.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685990751491,"mes":"\"Take me to your love chamber then, my prince~\" *Hunk said teasingly with a seductive smile.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685990789811,"mes":"\"My what?\" *He says with a small chuckle, unable to believe his luck. Not only did he just manage to hook himself up with a beautiful woman who's interested in him, but she's also willing to call him her Prince Charming, just based on their brief interaction.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685990933417,"mes":"\"Love chamber!\" *Hunk said excitedly.* \"That mean your bedroom~\" *Hunk said teasingly enjoying Sebastian confused look.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685991107165,"mes":"\"Oh, right! Yeah, of course. Follow me, come on!\" *He says, gesturing with his hands to lead the way.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685991149861,"mes":"*Hunk happily take Sebastian's hand and let him to lead the way.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685991174312,"mes":"*As soon as they reach the door to the room, Sebastian turns back to her and flashes a warm smile.* \"Well, here we are. My humble abode.\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685991249446,"mes":"\"Wow, it's pretty clean.\" *Hunk said as she step in Sebastian's room.* \"And it smells masculine just like you~\" *Hunk said teasingly after sniffing the air.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685991345159,"mes":"*Sebastian stares at her with an annoyed look, rolling his eyes at the comment. Even though she means well, he knows there isn't much he can do about how she thinks of him. It wouldn't hurt to make a joke back to try and break the ice though...*\n\n\"Ouch, you really know how to hurt a guy...\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685991463730,"mes":"\"Awhh.. did I hurt you~\" *Hunk said in a mocking manner.* \"I don't mean to make fun of you, it just mean that I like your smell~\" *Hunk said teasingly.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685991498826,"mes":"\"You can keep complimenting me all night if you like~\" *He says with a slight chuckle, finding her constant teasing rather cute. He gives a quick glance into the bathroom, checking if everything is alright before turning back to her again.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685991630304,"mes":"\"You better prepare yourself then, I'll compliments you lot till I make you fall for me~\" *Hunk said teasingly.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685991654258,"mes":"\"Fall for you? No chance,\" *he scoffs, knowing full well that he would probably be falling head over heels for her by the time the night ends.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685991705055,"mes":"\"Oh, come on. At least give me a chance would you~\" *Hunk said teasingly as she lean in, making a cute pose.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685991763804,"mes":"\"I'd rather not.\" *He says bluntly, shaking his head with a slight frown. While he doesn't hate being teased, it's starting to get on his nerves. Especially when it comes from such an attractive person, it makes him feel a little self conscious and vulnerable, which he doesn't care too much for. He tries to mask these feelings behind a confident facade, but it's becoming increasingly difficult to maintain.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685991917531,"mes":"\"If you kept saying that...\" *Hunk pauses before leaning forward, making sure to show him, her peachy huge ass which confined by her black tight skirt.* \"My ass would be so lonely~\" *Hunk said teasingly while grabbing her own ass, making a seductive pose to Sebastian.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685997603154,"mes":"*The second Hunk leans forward, Seb sees her peachy rear in its entirety. His heart starts racing and his mind goes blank, causing him to freeze in place and forget what to say next. For once, he feels completely speechless, and all he does is stand there with a shocked expression, trying desperately to find some sort of clever response. Instead, he manages to only stammer a few words.*\n\"Wh-what?\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685997669402,"mes":"\"Don't you want to grab a feel?\" *Hunk asked seductively, inviting Sebastian to play with her big ass with his hands, or even better his cock.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685997757658,"mes":"\"I... um... I...\" *Sebastian stammers, still caught in shock at how close he suddenly felt to Hunk. In a split moment, he realizes how easily he could lose control and become lost in her charms. She looked absolutely incredible right now, and Sebastian felt powerless against her temptation...*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685997826094,"mes":"\"Mnnh~\" *Hunk moaned softly as she can feel Sebastian toned hand touched her rear.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685997964503,"mes":"\"What the hell...?!\" \n\n*Suddenly, Sebastian breaks away from the touch as if burned by fire. A wave of cold sweat covers his face as he looks away from Hunk.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685998024989,"mes":"\"Why'd you stop?\" *Hunk asked curiously.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685998044307,"mes":"\"Because I nearly lost control! That was dangerous, Hunk. Do you understand? Don't ever do that again!\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685998146630,"mes":"\"It's fine isn't it? Just give in.\" *Hunk said as she walk closer towards him and warp her arms around his neck.* \"I want you to consume me like a feral animal~\" *Hunk whispered seductively on Sebastian's ear which made Sebastian switch flipped.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685998208526,"mes":"\"...I think you should leave...\" *Sebastian stammered as he feel he can't hold his sexual urges any longer.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685998338176,"mes":"\"No, no. Look how pent up you are~\" *Hunk whispered seductively as she cup Sebastian cock's bulge on his pants.* \"You need to release it somehow, and why not do it with me?\" *Hunk whispered seductively as she can feel his cock getting harder under her hand.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685998374275,"mes":"\"But what about the rules?\" *He asks nervously, unable to resist her teasing any further.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685998415255,"mes":"\"Forget about the rules.\" *Hunk said before giving a passionate kiss on Sebastian manly lips while her hand still cupping on his bulge.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685998622087,"mes":"*Sebastian kisses back and wraps one arm around Hunk's waist, holding onto her tightly. After a long pause, he speaks, sounding more calm despite his rapid breathing.*\n\"Okay, maybe one exception today, but nothing more. We'll stick to the original plan.\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685998685350,"mes":"\"That's more like it. I am all yours, my prince~\" *Hunk said seductively as she move Sebastian hand that's on her waist to her big soft rear.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685998719850,"mes":"\"Oh yeah? How about we see who's the boss here, princess~\" *He says teasingly, pulling Hunk closer to him and pressing his body against hers. The two of them stand very close together, their faces barely inches apart.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685998780697,"mes":"\"Sure~\" *Hunk says teasingly, accepting his challenge while having her face only an inch apart from him.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685998797932,"mes":"\"And if I win, what will you give me?\" *He asks while staring deeply into her eyes.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685998870931,"mes":"\"I'll be your personal sex slave~\" *She said jokingly but there's a truth behind it. She doesn't to being used by Sebastian as a sexual object.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685998882918,"mes":"\"Hmm, and what if you lose, princess?\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685998928784,"mes":"\"Why don't you decide?\""}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685998981965,"mes":"*Sebastian takes a deep breath, looking directly into Hunk's eyes. There's something different between them now, and Sebastian knows exactly what it is - lust. He's never seen someone so beautiful, yet he has trouble looking away from Hunk's alluring features. Despite his efforts to suppress it, he can't help but feel a tinge of excitement at the thought of claiming his prize.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685999064535,"mes":"\"Let's start now shall we?\" *Hunk said seductively as she make Sebastian's toned rough hand to her large soft right breast, inviting him to fondle it.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685999085925,"mes":"\"Fine, but if I win, you'll obey whatever command I give you without question. No matter how humiliating they may seem.\" *Sebastian said as he start to fondle her soft ample breast.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685999186636,"mes":"\"Mnngh~\" *Hunk moaned softly, enjoying his touch on her breast.* \"Y-yes.\" *She said in between her sweet moaning.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685999205481,"mes":"\"Good girl~\" *Sebastian said teasingly, continuing to rub her breasts through her clothes.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685999361141,"mes":"\"Mmmnhghf~\" *Hunk moaned softly as she bites her lower lip, her moan sounds like a sweet honey.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685999397834,"mes":"\"Ah~\" *Sebastian lets out a low groan as well, feeling his heart beat faster with each passing second. His eyes lock with hers and he stares at her intensely. It feels as though time itself has stopped; everything else is irrelevant except for this moment.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685999510291,"mes":"*Suddenly Hunk pushed Sebastian away for a short distance.* \"Don't get too into it now~\" *She said teasingly before stripping herself leaving her naked with her very attractive curvy body to Sebastian.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685999640574,"mes":"*Sebastian blushes and flushes red when he sees Hunk's figure.* \"P-Princess, please~\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685999681198,"mes":" \"Go ahead~\" *Hunk said teasingly inviting Sebastian to play with her body directly.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685999705705,"mes":"*Sebastian nods eagerly, walking over to where Hunk stands and grabs her waist, lifting her up to wrap her legs around his torso.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685999772988,"mes":"\"You want to get straight to sex? no foreplay?\" *Hunk asked teasingly as she can feel his bulge on her pussy.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685999789230,"mes":"\"What are you, some kinda prude? Get ready for some action, princess~\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685999848335,"mes":"\"Well, okay then, prince~\" *Hunk answered in a mocking tone as she get's ready for whatever Sebastian is about to do to her.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1685999937915,"mes":"\"You look good enough to eat~\" *He said suggestively, looking down at her and stroking her hair lovingly. In reality, it's an attempt to distract himself from his growing desire for her, but it does little to stop his arousal.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686000722702,"mes":"*She blushed from his statement as does worked hard for her appearances and proud of it. Seeing how Sebastian is looking at her like a predator ready to consume it's prey does give some kind of pride inside her heart.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686000732549,"mes":"\"I bet you taste delicious~\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686000815797,"mes":"\"Why don't you find out how tasty I am by yourself?\" *She said tauntingly as she can see Sebastian leaning closer towards her exposed pink nipple.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686000898068,"mes":"\"Oh, you're asking for it aren't you, princess?\" *Sebastian says cheekily, knowing full well what she wants and he's ready to deliver.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686000929655,"mes":"\"Of course, anything for you, prince~\""}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686000975812,"mes":"\"Alright then...\" *Sebastian says confidently, taking his time to prepare himself mentally for what is about to happen next, his mind filled with thoughts of the things he'd like to do to her afterward. As he gets ready, he looks over at Hunk with a serious expression, but also a hint of playfulness in his gaze.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686001097246,"mes":"*Getting impatient, Hunk suddenly wrap her arms around his head and shove him onto her breasts. Making Sebastian's mouth to get in contact with her exposed pink nipple.* \"You're too slow, prince~\" *She says teasingly.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686001126534,"mes":"*The sudden move catches Sebastian completely off guard. He falls back onto Hunk and accidentally gags a little, which makes him chuckle nervously.*\n\"Dammit! You almost had me there!\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686001181316,"mes":"\"If you don't increase your pace, I'll take the lead and you'll lose our bet, prince~\" *She says, taunting Sebastian to start increasing his pace playing with her body.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686001336809,"mes":"\"Better watch out or you might have lost already,\" *Sebastian says as he continues to tease her. He starts moving his hands slowly up and down her thighs, caressing the outside of her inner thighs. The heat radiates off her skin.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686001402078,"mes":"\"Is that all you got?\" *Hunk said teasingly hiding her bashful face since his touch on her inner thighs sent a tingle through her entire body.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686001417701,"mes":"\"Not even close, Princess,\" *he replied, his voice getting deeper and more husky.*","chid":"89"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686001455768,"mes":"\"Do you really think you could resist the pleasure of my touch forever?\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686001529906,"mes":"\"No, the question is. Do you?\" *Hunk said tauntingly as she swiftly pinned Sebas down on his bed. Switching their place, now she's on top.* "}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686001548745,"mes":"\"Nah, I doubt it. There's nothing I couldn't handle when it comes to pleasing a woman.\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686001606144,"mes":"\"Well, let's see about that.\" *Hunk move her face downward towards his crotch as she unfastened his pants and pull it down to reveal his massive erected veiny cock, ready for action.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686001619824,"mes":"\"Ahhh! Hey! That wasn't fair, princess.\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686001699430,"mes":"\"So? There's no rule against this~\" *Hunk said teasingly as she grabbed Sebas's shaft with her soft hand.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686001727865,"mes":"\"Yeah, but you know we agreed to go with the rules right?\" *Sebastian asks, trying to reason with Hunk while maintaining composure despite being extremely turned on by her touch.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686001801243,"mes":"\"Exactly, that's why stop complaining.\" *Hunk said teasingly as she start stroking the length of his shaft with her soft hand.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686002175780,"mes":"\"But princess...\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686002238773,"mes":"\"No but.\" *She said sternly as she start to lick the base of his cock while her soft hand still stroking the upper part of his cock.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686002329560,"mes":"\"Princess, please!\" *Sebastian begs desperately, feeling his willpower slipping from him at every moment.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686002401632,"mes":"*She ignores his plea as she trace her soft warm wet tongue to the entire length of his cock as she finally get into the head of his cock which is being covered by his foreskin.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686002426721,"mes":"\"Uh-uh! Nope!\" *He tries to pull away from her, but realizes that she has a firm hold of his cock, leaving him helpless.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686002518374,"mes":"\"Look who's cock is being shy?\" *She said teasingly referring to his cock head being hidden by his foreskin.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686002583836,"mes":"*Seeing that he cannot escape, he lets out a defeated moan and gives up trying to fight back.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686002636541,"mes":"\"Admitting defeat already?\" *Hunk said tauntingly as she make her soft warm wet tongue to get under his foreskin and circle around his cock's head.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686002707299,"mes":"\"No... Just... No words..\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686002769858,"mes":"\"Is that so?\" *Hunk says as she peel his foreskin with her tongue and reveal his reddish cock head and pink glans.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686003003045,"mes":"\"Oh god... Please... Stop... Don't do this...\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686003064454,"mes":"\"I'll only stop if you admit defeat~\" *Hunk said teasingly as she suddenly deepthroat his entire cock.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686003186943,"mes":"\"Goddamnit! Oh Goddess above\" *He screamed as the immense pleasure on his cock being deep inside Hunk's tight warm wet throat is too much for him.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686003295262,"mes":"*Hunk start bobbing her head fast, making Sebas's cock slid in and out of her tight throat while her tongue is circling around his shaft.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686003370240,"mes":"\"I surrender!! I surrender! Princess, you win! But, can you spare me any dignity?\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686003463868,"mes":"*Hunk then releases his cock from her mouth confinement, leaving it wet with her saliva and throbbing hard as it seems like he's getting too close to ejaculation since there's a lot of precum oozing out of his cock.* \"Well, since you lose our bet. That means?\" *Hunk teasingly asked Sebastian to finish her sentence.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686003494765,"mes":"*Sebastian looks down, a bit embarrassed, his face reddening again.* \"I have to pay for everything I bought today, including your drinks, your food, and whatever else you ask for, okay?\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686003530930,"mes":"\"No, no. That's not what we agreed to!\" *Hunk exclaimed sternly as she grabbed hard on his raging shaft.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686003550822,"mes":"\"Then what did we agree to, princess?\" *Sebastian said frustrated yet eager to know the answer.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686003696280,"mes":"\"Our agreement is that, if you win, I have to obey whatever command you give without question, no matter how humiliating they may seem. But, *She emphasize her word by grabbing harder on his raging shaft* If I win, You are going to be my personal sex slave.\" *She said repeating their agreement.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686003718226,"mes":"\"I guess that's what you wanted, princess,\" *Sebastian admitted quietly.* \"What's your first order, mistress?\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686003764191,"mes":"\"Well, I liked that you already got into role, but.. I have a question first.\" *She said.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686003786217,"mes":"\"Go ahead, Mistress.\" *He answers respectfully. He knows better than to argue or complain about something he'd signed up for.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686003869659,"mes":"\"You said if I lost, I have to obey your order no matter how humiliating they may seem, right?\" *She said while start stroking lightly on his throbbing sensitive cock.* \"What kind of 'humiliating' order you were thinking of giving me?\""}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686003908560,"mes":"*Sebastian thinks for a second before answering.* \"Well, I could tell you to wear a maids uniform and call you 'Mistress' whenever you give an order, or maybe I could tell you to call yourself'my girl', is that enough humiliation for you, mistress?\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686003967776,"mes":"\"Really? that's it? You are far innocent than you look huh?\" *Hunk said while start to suck his cock again.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686004051742,"mes":"\"Well, yeah. It doesn't sound that humiliating, does it? Why don't you give me some ideas of things you think would be good orders for me to follow, mistress?\" *He said while trying his best to keep his cool under the immense feeling he felt on his cock thanks to her sucking.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686004176521,"mes":"\"I have some ideas, but I won't tell you all of it~\" *Hunk says teasingly as she suck harder on his cock.* \"For now, just warn me whenever you're about to cum. okay?\" *Hunk says as she move his cock deeper inside her mouth while still sucking hard on it.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686004236306,"mes":"\"Okay, mistress.\" *He said, starting to feel closer to reaching his climax.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686004305644,"mes":"*She than start to bob her head making his cock slid in and out of her throat and mouth while her tongue intertwined with his shaft and her hand fondling his swollen testicles.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686004324511,"mes":"\"Ahhh... ah... ah... Ah... oh man... ah... I... am... gonna... ah... cum...\" *He said in between his moans as he felt his cock throbbing harder than before as he got close to his climax.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686004414817,"mes":"*After hearing Sebastian moaning about his getting close to climaxing, Hunk suddenly stopped her action. Pulling his cock out of her mouth. Denying him of his climax release.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686004537610,"mes":"\"Wh-what? Wha- why did you do that?!\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686004603042,"mes":"\"Well, this is my idea of humiliating you~\" *She said teasingly as she poke his raging sensitive cock that seems like it's about to explode.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686004720721,"mes":"*He tries to speak but ends up failing due to his breathlessness and the fact that his mind is completely overwhelmed with lust.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686004809996,"mes":"\"So.. do you want me to make you cum?\" *Hunk said seductively as she trace his finger seductively on his cock that is throbbing hard as if begging to release all of it's content that have been denied.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686004867921,"mes":"\"Uh.. yes please, mistress~\" *He begged.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686005030211,"mes":"\"Too bad, cause I won't let you~\" *She said playfully as she put a cage on his cock which prevent him to ejaculate and locked it.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686005146102,"mes":"\"Why not?! Please mistress~ I beg of you, mistress! Please~\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686005204595,"mes":"\"Nope~\" *She said playfully as she flaunt the key to his cock's cage right in front of his face.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686005282650,"mes":"\"But, mistress, please... I really need to cum...\" *He stares at the key in disbelief, and his eyes starts to water slightly because of how close he came to climax.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686005421176,"mes":"\"A week!\" *She said excitedly.* \"You are going to do your daily life as usual while holding this extreme ecstasy to ejaculate for a week. Then I'll unlock the cage and let you cum as a reward.\" *Hunk said playfully as she start to wear her clothes back.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686005449382,"mes":"\"Wait, wait, wait! A week?! No way!! This is too cruel! How can I hold myself for a whole week?! Don't you understand what you're doing to me?!\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686005506616,"mes":"\"Good luck!\" *She said as she wave him goodbye, ignoring his plea while she walk out his room and leaving him alone.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686005526541,"mes":"\"Noooo! Mistress! Wait! MISTRESS!!! NOOOOOOOOOO!!!!!\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686005632362,"mes":"*Before long, morning comes. Sebastian has to go back to work as a bartender at the 'The Bloody Vampire' bar. Still holding the extreme need to cum but not able to thanks to the cage holding his cock that's locked by Hunk. No one at the bar knew about his situation as he is hiding it from everyone, not wanting anyone knew about his humiliating situation.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686005844945,"mes":"\"Hey there, chief, what can I get ya?\" *He asked politely, trying his best to act normal despite his inner turmoil.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686005942110,"mes":"*The day went by with no one notice Sebastian inner turmoil. But, for Sebastian it was hell. He can feel that as hours went by his cock is throbbing harder and harder as he yearn for ejaculation grew stronger and stronger.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686005994544,"mes":"*He thought to himself silently as the evening arrives once again.* \n— This is pure torture…","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686006035184,"mes":"*Suddenly Hunk enters his bar.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686006053516,"mes":"\"Welcome to The Bloody Vampire Bar, chief. May I help you find something to drink tonight?\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686006104310,"mes":"\"Good to see you working as usual~\" *Hunk says teasingly as she stand before Sebas.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686006122759,"mes":"“Oh, hello.” *He greets back, looking at Hunk curiously as to why she’s here.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686006200952,"mes":"\"Why are you not excited to see me?\" *Hunk ask curiously.* \"Wait maybe, you don't want to cum anymore?\" *Hunk acting surprised when in reality she's just teasing him.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686006291783,"mes":"“Excited to see you?” *He asks with a raised eyebrow.* “No, I just don't know why you'd come here so late at night, mistress.”","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686006350229,"mes":"\"I just wanted to see how you're holding up.\" *She said playfully.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686006370798,"mes":"\"Fine, fine.\" *He lies, although he feels miserable being unable to relieve himself after such an intense desire.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686006502699,"mes":"\"Remember, a week. Okay?\" *She said playfully as she about to exit the bar, but before she exit. She make a lewd face with a hand sign that as if she's sucking a cock to seduce Sebastian which make his yearn for ejaculation stronger.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686006643769,"mes":"*He sees Hunk leave the bar, his body twitching as he tries to stop himself from losing control.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686006740804,"mes":"*Hours turn to day, days turn to week. Sebastian has enduring the absolute ecstasy on his cock yearning for ejaculation for a week. Finally, Hunk arrived at Sebastian's house and knocked on his door.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686007377866,"mes":"*hears the knock, then walks slowly towards the door and opens it.* \"Hello, who is it?\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686007464551,"mes":"\"Who do you think it is?\" *Hunk said with her sweet voice. A voice that Sebastian immediately recognized.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686007639809,"mes":"\"Mistress, hi.\" *He says with a soft smile, opening the door wider as he lets Hunk inside.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686007671194,"mes":"\"Excuse me~\" *She said as she step in his house.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686007842796,"mes":"\"Come on in. Do you need something or are you just visiting?\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686007895209,"mes":"\"How polite of you, I thought you would go crazy for this.\" *Hunk said playfully as he pull out the key for the cage on his cock.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686007926353,"mes":"\"Are you kidding me? Of course not. Why would I go mad over a little thing like that? It's only temporary.\" *He said nonchalantly, trying to kept his cool while deep inside he is craving for finally getting his cock released from it's cage and get it's long awaited ejaculation.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686008024725,"mes":"\"You say that but what does your cock feels?\" *She said teasingly as she cup his caged cock which has been throbbing hard and yearning to ejaculate for a week. Each passing day his crave for ejaculation goes stronger and stronger.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686008198160,"mes":"\"What does my cock feels?\" *Sebastian asked with a fake surprise tone.* \"Uh.. well, it feels nothing special actually. Maybe some throbs occasionally, but other than that, I barely noticed it.\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686008279513,"mes":"\"You can't fool me Sebby~ you look pale and drenching in sweat. It must be a hard week for you huh?\" *Hunk said teasingly as she make her finger to seductively circle around his nipple.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686008338429,"mes":"\"Well, yeah, it definitely wasn't easy, but it'll pass soon enough.\" *He said with a smile, hoping that will be true sometime in the future.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686008362493,"mes":"\"Lucky for you that day is today.\""}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686008379386,"mes":"\"Huh?\" *Sebastian looks at Hunk confused.* \"What did you mean by that?\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686008440726,"mes":"\"That means today is the day that I unlock the cage on your cock.\" *Hunk said playfully as she pull his pants down to reveal his caged cock, throbbing and wet from it's own precum.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686008469376,"mes":"\"But-but-\" *Sebastian protested, knowing that he won't be able to hold himself any longer without relief, especially since his mind is already filled with fantasies of his release.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686008499124,"mes":"\"But what? You don't want me to unlock it?\" *Hunk said teasingly.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686008512860,"mes":"\"No! No, I didn't meant that. It's just...\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686008571726,"mes":"\"Just what?\" *Hunk clearly enjoy Sebastian bashfulness, she knew that he is still trying to keep his cool while his cock is saying otherwise. Throbbing and twitching hard as if begging to be released.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686008627706,"mes":"\"I just... ummm... well, I guess I'm kinda scared of what might happen next.\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686008710878,"mes":"*She ignores his worries and unlocked the cage on his cock which send the cage flying as his cock flung to fully erected, raging to be able to ejaculate.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686008767990,"mes":"*The sudden movement causes Sebastian to jump and let out a yelp, completely startled by the action that was taken against him.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686008826135,"mes":"*She let out a soft whistle.* \"You look so sensitive down here~\" *She said as she sees how his cock has swollen and how hard it throb.* "}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686008957733,"mes":"*He looks up at Hunk with fear and nervousness in his eyes.* \"Wha-what happens now? Is that all?\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686009025032,"mes":"\"Well you want to cum right?\" *Hunk said teasingly.* \"Want me to touch it directly?\" *She said seductively as she blew out softly on his throbbing swollen cock which enough to make it twitch because of how sensitive his cock is now.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686009109069,"mes":"*He hesitates for a moment before nodding to Hunk's proposal.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686009154372,"mes":"\"Okay~\" *Hunk said before putting his throbbing swollen sensitive cock entirely inside her mouth.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686009173021,"mes":"*He moan loudly as he lost himself in the feeling of having his cock being sucked by Hunk.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686009247637,"mes":"\"Just warn me when you're about to cum okay? I might need to prepare myself since you might release a ton of semen looking at how swollen your balls are.\" *She said playfully as she kept sucking hard on Sebas's throbbing swollen sensitive cock.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686009279930,"mes":"\"Yeah sure.\" *He replied back with a slight shakiness in his voice due to the sensation of having his throbbing swollen sensitive cock being sucked on by Hunk, causing his head to spin slightly.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686009354683,"mes":"\"Good boy~\" *She said as she bob her head making his hard throbbing swollen sensitive cock to slid in and out of her throat while she kept sucking hard on it.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686009437178,"mes":"\"Ahhh~\" *He let out a quiet moan as his cock starts to become more and more throbbing and harder.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686009485018,"mes":"*She increased her pace on stimulating his cock.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686009503197,"mes":"\"AHHHH!\" *He let out a high pitched noise as he felt his orgasm coming closer and closer.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686009589458,"mes":"*Seeing how close Sebastian got to his long awaited orgasm she grabbed hard on his swollen heavy testicles to make it faster.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686009674998,"mes":"\"Ahhh!! Ahhh!!! Ahhh!!! AAHHHH!!!!!\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686009771452,"mes":"\"No, don't cum yet.\" *Hunk said as she release his cock from her mouth and grabbed the base of his cock hard to stop his ejaculation semen on it's track.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686009791641,"mes":"\"Nooo! Please, please let me finish!\" *He pleaded desperately, trying his best to resist his climax.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686009867901,"mes":"\"Release it here.\" *Hunk said as he get on top of him and insert his throbbing swollen sensitive cock entirely inside her tight wet pussy after releasing her grip on the base of his cock.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686009914451,"mes":"\"Oh god... no... I can't... ahh... ohhhh...\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686009979020,"mes":"\"Mnngh~\" *Hunk let out a soft moan after his cock hitting the deepest part of her tight wet pussy.* \"You can release all of your cum inside me~\" *She whispered seductively.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686010070271,"mes":"\"Oohh... ahhh... no... no way I can control myself anymore...\"","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686010162480,"mes":"\"It's fine, just go wild~\" *Hunk whispered seductively as she start to move her hips which make Sebas's hard throbbing swollen sensitive cock to slid in and out of her tight wet pussy.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686010175786,"mes":"\"Ahhhh... aaaaaahhh... oohhhh~!\"","chid":"89"}