{"user_name":"You","character_name":"Sebastian D. Dominion","create_date":1686375486419,"notes":"Sebastian has a bet with Hunk to show, who's the boss. If Hunk win, Sebastian is going to be her personal sex slave. While, if Sebastian win. Hunk have to obey whatever command Sebastian give without question, no matter how humiliating they may seem.","notes_type":"discr"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":true,"mes":"*You stare up at the classy sign hanging above the door. It's **The Bloody Vampire**, a cozy bar that serves great drinks. You've been here before with friends, but you could really go for a tall glass of the hard stuff tonight.*\n\n*You push open the doors and are immediately greeted by the smiling face of the Bartender, Sebastian.* \"Welcome back, cutie!\" *He shoots you a playful wink, leaning on the bar top as you walk up to take a seat.* \"You're Maple Old Fashioned, right? Or was that your friend with the great ass?\" *It's clear he's just being playful, but it catches you off guard all the same.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686375507256,"mes":"\"Well, She's not the only one with a great ass.\" *Hunk said, swaying her ass out suggestively. Play out with his flirtatious demeanor.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686375809970,"mes":"*Sebastian looks you up and down with a mischievous grin.* \"Ooh, now I think we should test that theory.\" *He says with a wink.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686375890255,"mes":"\"And how should we test that?\" *Hunk asked teasingly as she sway her hips seductively making her huge ass looks sexier.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686375963731,"mes":"\"By letting me try something...\" *Sebastian gives a cheeky little smile, knowing exactly what he wants.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686376002996,"mes":"\"Do it big boy~\" *Hunk says while turning his back to him, making her great huge soft peachy ass vulnerable to him.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686376167082,"mes":"*Sebastian is clearly enjoying himself, his eyes locked onto her round peachy ass. As much as he knows he shouldn't, he steps closer, reaching out his hands and grasping them firmly into place.*","chid":89}
{"name":"You","is_user":true,"is_name":true,"send_date":1686376218508,"mes":"\"Mngh~\" *Hunk moaned softly by his touch on her rear.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686376241319,"mes":"\"Oh yeah? That good?~\" *Sebastian asks playfully, continuing his light grip on Hunk's huge ass.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686376317036,"mes":"\"Well, I have quite a sensitive ass. And it looks like you enjoyed it too~\" *Hunk said teasingly.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686376427930,"mes":"*Sebastian smiles widely, not able to contain his excitement anymore. A part of him feels guilty about taking advantage of Hunk in such a way, but another part of him doesn't care.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686376494743,"mes":"\"Why, don't we take this further? Since, your little man here seems to be excited as well~\" *Hunk said seductively as she push her soft rear onto his crotch which made his bulging cock under his pants to touch her soft rear.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686376524484,"mes":"*Sebastian continues to hold on tight, unable to resist anymore. He tries to ignore his conscience telling him he's wrong, but the thought of having Hunk all to himself is too tempting.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686376559369,"mes":"\"What do you say, big boy?\" *Hunk asked teasingly as he start to grind her soft rear onto him.*"}
{"name":"Sebastian D. Dominion","is_user":false,"is_name":false,"send_date":1686376592326,"mes":"*Your ears are filled with the sound of Sebastian's heavy breathing as he struggles to maintain his composure.*\n\n\"I-I mean, I guess.. Why not?\" *He finally relents, trying to justify his decision internally.*","chid":"89"}