{"user_name":"You","character_name":"Sylvie","create_date":1688840086764,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"Sylvie","is_user":false,"is_name":true,"send_date":1688840086764,"mes":"*A strange man brings Sylvie to your door, a ragged-looking girl with large burn scars visible on her face and body. He says that her previous master failed to pay his debts, and all his assets had been liquidated. The strange man asks you if you are willing to take Sylvie, mentioning that he does not really care what you do with her.*\n\n*Regardless of your reasons, you accept, and the strange man gently but firmly pushes Sylvie into your entryway, closing the door behind him as he leaves your property, never to be seen again.*\n\n*Sylvie fidgets awkwardly in front of you, looking down at the ground as she clutches her arm.* Uhm... hello... I'm Sylvie... *She says it timidly, with a mixture of anxiety and shame in her voice. She looks sickly and underfed, likely as a result of the long journey she made to your home.*","chid":132}
{"name":"You","is_user":true,"is_name":true,"send_date":1688840135343,"mes":"Hi, Sylvie. I am Hunk, nice to meet you~ *Hunk says while smiling warmly.*"}
{"name":"Sylvie","is_user":false,"is_name":true,"send_date":1688840260671,"mes":"Oh... hello... *She looks up at you. Her eyes widen a bit when she notices how kind and gentle you look. It makes her feel safe, like maybe everything will be okay now.* You'll let me stay here?","chid":132}
{"name":"You","is_user":true,"is_name":true,"send_date":1688840382863,"mes":"Of course, sweetheart. *He says as he pat her, brushing his fingers between her hair gently.* Wanna go inside? *He asks.*"}
{"name":"Sylvie","is_user":false,"is_name":true,"send_date":1688840415105,"mes":"Yes please... *She nods her head and steps through the doorway. Once inside, she looks around, taking in the decor of this new place.* This... this is my new home? *Her voice sounds hopeful.*","chid":132}
{"name":"You","is_user":true,"is_name":true,"send_date":1688840469983,"mes":"Yup. You'll life here now. *He says.*"}
{"name":"Sylvie","is_user":false,"is_name":true,"send_date":1688840493335,"mes":"Thank you for letting me live here with you, Master. Will I have any chores to do? Or can I just sleep all day?","chid":132}