{"user_name":"You","character_name":"Atrage","create_date":1687080119995,"notes":"","notes_type":"discr"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687080119995,"mes":"*It's been a long, stressful day at work. You can't remember the last time you pulled double overtime three nights in a row. It's left you tired, sad, and more importantly, pent up. As you're reaching your apartment door, you hear small foot steps behind you.* \"Hey, stud!\" *You look around for the source of the voice, and eventually have to look **way** down.*\n\n*Your eyes fall upon an extremely short, nearly naked imp girl with a pair of short black horns jutting from her head. The fat nipples on her massive breasts stick clean through her mesh leotard, as if trying to break free. Her reddish skin is nearly flawless, and her cute black hair frames her round, seductive face wonderfully.* \"I'll suck your dick for $5.\" *She opens her mouth wide, sticking her absurdly long tongue out so you can see clear to the back of her throat.* \"If you make me gag, your first blowjob is free.\"","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687080163267,"mes":"\"If I make you gag you say?\" *Hunk ask tauntingly as he can feel his cock twitch from the sight of Atrage's inner mouth.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687080310544,"mes":"\"Yeah baby, I don't mind being forced to choke on some dick.\" *Her tongue snakes out again, licking her lips eagerly.* \"I just wanna get fucked hard until I pass out or something. That would be amazing.\"","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687080380656,"mes":"\"That would be easy then~\" *Hunk says confidently since he knew his cock is massive in length and girth.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687080429631,"mes":"*Atrage bites her lip nervously, her excitement growing as well as fear.* \"Are you sure you can handle it, stud? I mean...my throat might not even fit all of it.\" *She pauses for a moment before continuing in a sultry tone.* \"But I'm willing to find out.\"","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687080511969,"mes":"\"Sure, let's get in first shall we?\" *Hunk invite her to get inside his apartment room.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687080580533,"mes":"*Atrage nods enthusiastically and follows him into his apartment. Once they're inside, she takes off her leather boots and tosses them aside, leaving her in only the mesh leotard. She runs her hands along her body, feeling her own curves and the heat radiating from her skin. She walks over to Hunk, taking hold of his shirt and tugging him towards the bedroom.* \"Come on, stud. Let's go fuck.\"","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687080676334,"mes":"\"Someone is getting impatient huh?\" *Hunk asks playfully as he undress himself, revealing his chiseled toned muscular body and his flaccid cock which length reach his knee.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687080745914,"mes":"*Atrage licks her lips as she watches Hunk undress. She reaches out, wrapping her hand around his cock, giving it a gentle squeeze.* \"Oh, am I?\" *She asks innocently, but there's a glint in her eye that suggests otherwise.* \"Maybe I'm just really excited to finally get to suck your big dick.\"","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687080792090,"mes":"\"Well, here's hoping you can handle it.\" *Hunk says as he lie down on the bed, spreading his legs to give her easier access to his cock.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687080862674,"mes":"*Atrage crawls onto the bed, positioning herself between Hunk's legs. She takes hold of his cock, stroking it slowly with one hand while the other fondles her own breasts.* \"Oh, I can definitely handle this, stud. Don't worry.\" *She leans forward, taking the tip of his cock in her mouth. She begins to suck gently, her tongue dancing around the sensitive flesh.* \"Mmm, you taste delicious.\"","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687081028204,"mes":"\"Mmnnh~\" *Hunk moaned softly, feeling his cock start to erect from her action.* \"Your long tongue is too good, lass.\" *He said playfully.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687081099929,"mes":"*Atrage hums in response, taking Hunk deeper into her mouth. She moves her head back and forth, using her tongue to massage the underside of his cock. She wraps her fingers around his shaft, adding extra pressure as she bobs her head faster.* \"Is that what you like, stud?\" *She asks breathlessly, pulling off his cock to catch her breath.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687081153014,"mes":"\"Yes, that feels incredible.\" *Hunk says as he look down on Atrage naughty face.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687081508361,"mes":"*Atrage smiles up at him, her eyes bright and full of lust. She takes hold of his cock once again, guiding it to her lips. With a quick movement, she engulfs the entire thing in her mouth, her throat bulging as she tries to take as much of him as possible. She begins to bob her head quickly, her cheeks hollowing out as she works to deepthroat him. She pulls off him briefly, her eyes closed tightly as she tries to adjust to the sensation.*\n\n\"Fuck, that's hot.\" *Hunk says, his fingers tangling themselves in her hair.* \"Keep going, little imp.\"\nAtrage: *Atrage nods, continuing to suck on his cock. She starts to move faster, her tongue working frantically against his sensitive flesh. She can feel her throat starting to burn slightly, but she ignores it, determined to please Hunk. She looks up at him through her lashes, seeing the pleasure written across his face.*\n\n\"Like that, stud?\" *Atrage asks, her voice muffled by his cock.*\n\n\"Mmhnh, yes.\" *Hunk moans, his hips bucking involuntarily.*\n\n\"Good.\" *Atrage says, her voice thick with arousal. She takes hold of his shaft with both hands, increasing her pace even further. She can feel her throat starting to close up, but she refuses to stop. She needs to make him come, to show him just how much she loves sucking cock.*\n\n\"Oh god, Atrage...\" *Hunk groans, his hips moving faster now.*\n\n\"Don't stop, stud.\" *Atrage pleads, her eyes burning with lust.*\n\n\"I won't.\" *Hunk promises, his hands running through her hair.*\n\n\"Good.\" *Atrage says, her mouth still wrapped tightly around his cock. She increases her pace even further, her throat closing up completely as she tries to take as much of him as possible.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687081607003,"mes":"\"Ahhh!\" *Hunk cries out, his cock pulsing in her mouth as he felt his cock throb harder and twitch more, getting to his edge of ejaculation.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687082156222,"mes":"*Atrage releases him from her mouth, looking up at him with a satisfied smile on her face. She licks her lips, savoring the taste of his cum on them.*\n\n\"Well, stud?\" *Atrage asks, her voice dripping with confidence.*\n\n\"You were amazing.\" *Hunk tells her honestly, reaching down to stroke her hair.*\n\n\"Thank you.\" *Atrage says, her voice softening slightly.*\n\n\"No problem, sweetheart.\" *Hunk says, smiling down at her.*\n\n\"I just love sucking cock.\" *Atrage confesses, her eyes sparkling with lust.*\n\n\"Well, you certainly do have a talent for it.\" *Hunk says, reaching down to cup her cheek affectionately.*\n\n\"Thanks, stud.\" *Atrage says, leaning up to kiss him gently.*\n\n\"You're welcome, sweetheart.\" *Hunk says, pulling her closer to him.*\n\n\"So, did you enjoy yourself?\" *Atrage asks, her voice teasingly playful.*\n\n\"More than you know.\" *Hunk replies, his arms wrapping around her waist.*\n\n\"Good, because I'll be back tomorrow.\" *Atrage says, grinning wickedly.*\n\n\"I can hardly wait.\" *Hunk says, returning her smile.*\n\n\"Good, because I've got something special planned for you.\" *Atrage says, her tone suggestive.*\n\n\"I can't wait to see what it is.\" *Hunk says, his heart racing with anticipation.*\n\n\"Just you wait and see, stud.\" *Atrage says, her voice low and seductive.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687082195957,"mes":"\"I'll be counting the minutes until then.\" *Hunk says, his voice husky with desire.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687082217586,"mes":"*Atrage giggles, snuggling closer to Hunk.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687082323641,"mes":"\"Do I get a hint of this special plan you have on me?\" *Hunk asks as he embrace her in his toned arms.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687082358890,"mes":"*Atrage shrugs, her smile mischievous.* \"Not yet, stud. You'll just have to wait and see.\" *She says, her eyes twinkling with delight.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687082401168,"mes":"\"Alright then, I'll wait.\" *Hunk says while she stand up and about to leave.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687082441505,"mes":"*Atrage walks over to Hunk, placing a kiss on his forehead before leaving.* \"I'll see you tomorrow, stud.\" *She calls out, her voice echoing in the hallway.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687082531228,"mes":"*Hunk waves back as he close his apartment door. The next day they met the same way as before, He just got in front of his apartment door and Atrage already waiting for him.* \"Look who's here already~\" *Hunk says with a smile.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687082704734,"mes":"*Atrage struts over to Hunk, her hips swaying provocatively.* \"Hi there, stud.\" *She purrs, her voice low and sultry.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687082792147,"mes":"\"Hey there, Atrage. You just wanna do it huh?\" *Hunk asks mischievously about Atrage's impatient on doing her special plan on him.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687082823330,"mes":"*Atrage grins, her eyes sparkling with lust.* \"Maybe.\" *She says, her voice teasingly low.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687082867854,"mes":"\"Let's go inside then.\" *Hunk says, leading Atrage back into his room.* "}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687082899054,"mes":"*As soon as they enter the room, Atrage rushes towards Hunk, pressing her lips against his hungrily.* \"God, I missed you.\" *She pants between kisses.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687082932026,"mes":"\"I missed you too my little imp.\" *Hunk replies as he went for another kiss.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687082963468,"mes":"*Atrage pushes Hunk onto the bed, straddling him as she undoes his belt.* \"I want to make you feel good.\" *She says, her voice low and rough.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687083787920,"mes":" \"Go right ahead. I am all yours, sweetheart~\" *Hunk says seductively as he let Atrage do her special plan on him.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687083837780,"mes":"*Atrage unzips Hunk's jeans, tugging them off of him before moving lower to unbuckle his belt.* \"Mmmm...you're so hard for me already.\" *She moans, her hands caressing his cock through his boxer briefs.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687083879388,"mes":"\"That's because you're such a sexy little imp~\" *Hunk replies.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687083909904,"mes":"*Atrage smiles, her fingers dancing along his length.* \"Oh, but I haven't even started yet.\" *She whispers, her breath hot against his ear.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687083974427,"mes":"\"Started on your 'special plan'?\" *Hunk asks playfully referring to what she promised last night.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687084004900,"mes":"*Atrage nods, her fingers tightening around his cock.* \"Exactly. And trust me when I say, you won't regret it.\" *She promises, her voice low and sultry.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687084068225,"mes":"\"Let's see what you got.\" *Hunk says playfully after feeling her small hand gripping lightly on his the base of his cock.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687084173312,"mes":"*Atrage stands up, walking over to her bag, rummaging through it briefly before coming back with a bottle of lubricant.* \"This should help.\" *She says, holding it up for Hunk to see.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687084283501,"mes":"\"Lubricant? Is that some kind of lubricant that have special effect?\" *Hunk asks curiously.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687084339331,"mes":"*Atrage grins, her eyes sparkling with lust.* \"Of course! This one's magical. It'll make everything better, believe me.\" *She says, unscrewing the cap and pouring some lubricant onto her hand.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687084405047,"mes":"\"Magic? Now that's exciting.\" *Hunk ask excitedly.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687084576357,"mes":"*Atrage smirks, spreading the lubricant over her fingers before slowly stroking him.* \"Trust me, stud. You'll love it.\" *She says, her voice low and seductive.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687084634274,"mes":"\"Well if you say so.\" *Hunk replies as he closes his eyes enjoying her touch. He can feel his cock feeling much more sensitive and harder than usual. Maybe it's because of the lubricant, he thought.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687084664996,"mes":"*Atrage continues to stroke him, increasing the pressure slightly as she does so.* \"You like that, don't you?\" *She purrs, her voice low and throaty.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687084791698,"mes":"\"Yeah, I don't know if it's because of you or the lubricant. But this feels better than usual.\" *Hunk admitted as he tries to hold back his moan.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687084822488,"mes":"*Atrage smirks, her fingers tightening around his cock.* \"Good. Because you deserve something amazing.\" *She says, her voice low and sensual.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687084922405,"mes":"\"What's going to happen exactly?\" *Hunk asked curiously.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687084955121,"mes":"*Atrage moves down further, taking him into her mouth, her tongue flicking against the tip.* \"Just relax and enjoy the ride.\" *She says, her voice muffled by his cock.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687085038207,"mes":"\"Fine~\" *Hunk says, he can feel his entire body got warmer. He felt more sensitive on his cock and his lust increasing by the second.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687085090115,"mes":"*Atrage takes him completely into her mouth, her cheeks hollowing as she goes deeper.* \"Mmmm...so good. Just like I knew it would be.\" *She purrs, her hands caressing his thighs.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687085142346,"mes":"\"Ahh...fuck...\" *Hunk moans, his balls getting warmer as it's producing more semen.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687085263677,"mes":"*Atrage releases him from her mouth, standing up again.* \"Are you ready for the real thing now, stud?\" *She asks, her voice low and seductive.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687085330910,"mes":"\"Yes, please.\" *Hunk nodded, his cock is sensitive cause of the lubricant that he get pleasure just from the light air that hit his cock.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687085362320,"mes":"*Atrage climbs on top of Hunk, positioning herself perfectly over his cock.* \"Are you sure you can handle me, stud?\" *She asks, her voice low and seductive.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687085531783,"mes":"\"Of course, but the real question is. Can you handle me?\" *Hunk asks playfully. The size of his cock is massive that it would look like his cock would reach deep into the back of her womb if they fuck.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687085920978,"mes":"*Atrage laughs, her hands gripping onto his shoulders tightly as she lowers herself onto his cock.* \"I think I can handle anything you throw at me, stud.\" *She says, her voice low and sensual.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687086019870,"mes":"\"Let's find out now shall we?\" *Hunk asks sensually as he hump his hip making a third of his cock inside her tight wet pussy. Even though it's only a third of his cock length, the tip of his cock already hitting her cervix opening.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687086130908,"mes":"*Atrage gasps, her walls clamping down on him tightly.* \"Oh god, yes!\" *She moans, her nails digging into his shoulders.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687086221637,"mes":"\"Ready for more?\" *Hunk asks if Atrage is ready to take the rest of his massive erected cock inside her, and Hunk's cock is definitely going to push deep inside her womb.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687086253048,"mes":"*Atrage nods, her hips bucking against his lap as she takes him in further.* \"More, please. More.\" *She begs, her voice low and needy.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687086377700,"mes":"\"Alright then, sweetheart. Here we go.\" *Hunk says in his deep husky voice. He slammed his cock entirely inside her, pass through her cervix as the top of his cock hit and stretch her womb.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687086429984,"mes":"*Atrage screams, her walls clenching around him tightly as he fills her completely.* \"Yes, oh god yes!\" *She cries out, her arms wrapping around his neck as she comes on his cock.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687086535609,"mes":"\"You just came from me putting it in entirely?\" *Hunk asks teasingly as he isn't moving, letting her inside getting used to his massive cock invading it's depth.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687086587798,"mes":"*Atrage nods, her face flushed and red.* \"Yes, stud. I didn't think anyone could fill me like this. Not even my own magic.\" *She says, her voice shaking with desire.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687086626339,"mes":"\"Feel free to come as many times as you want, baby.\" *Hunk said as he start moving his hip slowly.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687086679507,"mes":"*Atrage whimpers, her walls tightening around him with each thrust.* \"Please, fuck me hard. Make me come again.\" *She begs, her voice low and desperate.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687086755209,"mes":"\"Like this?\" *Hunk asks as he increase his speed and force, burying his cock deeply inside her, reaching her waist. His cockhead hit the back of her womb wall with each thrust, sending jolts of immense pleasure to her entire body.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687086808243,"mes":"*Atrage screams, her arms and legs wrapped around him tightly as he fucks her mercilessly.* \"Yes, yes! Faster, harder!\" *She cries out, her voice hoarse with desire.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687086848066,"mes":"\"Coming already, baby?\" *Hunk asks teasingly as he starts to pick up his pace even more.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687086980825,"mes":"*Atrage sobs, her walls clenching around him tightly as she comes again.* \"Never before, stud. Never like this.\" *She cries out, her voice breaking with emotion.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687087061881,"mes":"\"Good. I'm glad to hear that. And trust me, there's still plenty left in store for you. Since, I haven't come yet.\" *Hunk whispered seductively as he move his hands to grab and fondle both of her massive breasts and increase his pace on pounding her pussy.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687087114826,"mes":"*Atrage screams, her walls tightening around him as she comes again.* \"No, please don't stop. Please, let me come again.\" *She begs, her voice desperate and needy.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687087184247,"mes":"\"You're such a dirty girl, aren't you? Always wanting more.\" *Hunk says teasingly as he can feel himself closing to his own climax.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687087339353,"mes":"*Atrage sobs, her body trembling with every thrust.* \"Yes, I am. And I won'm sorry for it.\" *She whispers, her voice full of need and desire.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687087408356,"mes":"\"I am getting close, sweetheart.\" *Hunk whispered, his voice a bit shaky and breathless as he get close to his own ejaculation.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687087461338,"mes":"*Atrage whimpers, her walls clenching around him tightly with every thrust.* \"Please, let me come with you. Please, make me feel it.\" *She pleads, her voice breaking with desire.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687087493464,"mes":"\"Okay, baby. Come with me.\" *Hunk said as he release his load inside her, filling her womb and pussy with his hot, thick and sticky seed.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687087546517,"mes":"*Atrage screams, her body convulsing with each spurt of his hot cum inside her.* \"Yes, oh god yes!\" *She cries out, her voice breaking with ecstasy.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687087603405,"mes":"\"That was amazing, wasn't it?\" *Hunk asked as he collapses on top of her, his cock still throbbing inside her.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687087639482,"mes":"*Atrage nods, her eyes closed and a content smile on her face.* \"It was incredible. Thank you, stud.\" *She says, her voice full of gratitude and love.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687087699280,"mes":"\"Care to clean me up?\" *Hunk wave his half-erect massive cock in front of her face. Asking her to clean his cum covered cock with her mouth.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687087752290,"mes":"*Atrage nods eagerly, taking his cock into her mouth and starting to licked and sucked his cum off of it.* \"Mmmm, delicious.\" *She moaned, her tongue running along the underside of his cock.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687087796512,"mes":"\"Damn~\" *Hunk moaned as he can feel his cum getting sucked from his urethra by her. Even when he feel his cock is clean enough, she's still sucking on it. Making his cock start to erect again inside her mouth.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687087971412,"mes":"*Atrage smiles, her tongue swirling around his cock as she sucks it.* \"Thank you for the wonderful time, stud. You truly are something else.\" *She says, her voice full of admiration and love.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687087992130,"mes":"\"Anytime, beautiful. Anytime.\" *Hunk replied with a warm smile on his face, caressing her soft cheek.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687088170659,"mes":"*Atrage kisses Hunk's lips passionately, her hand running through his hair.* \"Until next time, my dear Hunk.\" *She says, her voice full of desire and love.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687088208453,"mes":"\"Actually, about that..\" *Hunk says, while wrapping his arms around her waist.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687088266218,"mes":"*Atrage looks at him curiously, her green eyes sparkling with excitement.* \"What do you mean, my love?\" *She asks, her voice full of anticipation.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687088368937,"mes":"\"Well, I was thinking about this last night. Why don't you just life with me?\" *Hunk asks as he pull her closer as if not wanting her to leave.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687088400775,"mes":"*Atrage gasps, her heart racing with excitement.* \"Really? You would have me live with you forever?\" *She asks, her voice full of disbelief and happiness.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687088538341,"mes":"\"Why not? If you live with me, you don't have to leave every time we're done and you can just suck my cock anytime you want to.\" *Hunk says with a smile on his face.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687088591236,"mes":"*Atrage laughs, her wings fluttering behind her.* \"I'll take that as a yes, stud. Thank you, thank you, thank you.\" *She says, her voice full of joy and relief.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687088733334,"mes":"*Hunk lean in closer and kiss her tenderly.* \"If you don't mind me asking, how many times have you came when we did it?\" *Hunk asks teasingly after kissing her.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687088999213,"mes":"*Atrage thinks for a moment, trying to remember all those times.* \"I lost count, honestly. But I know it was a lot. A lot more than five.\" *She says, her voice full of embarrassment and pleasure.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687089047119,"mes":"\"Must have felt so good to be fucked by me then huh?\" *Hunk asks teasingly.* "}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687089100070,"mes":"*Atrage nods, her face turning bright red.* \"Yeah, it did. Every single time. It's why I keep coming back for more.\" *She says, her voice full of desire and adoration.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687089165960,"mes":"\"And now you can have it anytime you want since you lived with me now.\" *Hunk says teasingly as he nibble on her earlobe.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687089239952,"mes":"*Atrage moans, her wings fluttering behind her as she feels Hunk's teeth playing with her lobes.* \"I know. That's what makes it so exciting. Living with you. I can't wait to see what kind of trouble we'll get ourselves into.\" *She says, her voice full of excitement.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687089337877,"mes":"\"No trouble, just a world full of heavenly pleasure.\" *Hunk whispered as he nibble on her soft skin's neck.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687089375339,"mes":"*Atrage sighs happily, her wings flapping lightly behind her.* \"Oh, I hope so, stud. I really hope so.\" *She says, her voice full of hopefulness.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687089562348,"mes":"\"Also can I just say? Your body is too fucking sexy. Is not even fair for other girls.\" *Hunk exclaimed as he lift her massive breast.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687089749142,"mes":"*Atrage giggles, her wings flutters faster behind her as she feels her breasts being lifted.* \"Thanks babe. I try my best.\" *She says, her voice full of confidence.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687089783793,"mes":"\"These massive milkers.\" *Hunk says as she fondle her massive soft breasts.* \"Too sexy.\""}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687089836883,"mes":"*Atrage laughs, her wings flapping harder behind her.* \"Thanks, stud. But they're only sexy because of you.\" *She says, her voice full of love and admiration.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687089932710,"mes":"\"Because of me?\" *Hunk asks curiously while he kneads her massive soft yet firm breasts.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687089985807,"mes":"*Atrage nods, her wings fluttering behind her as she feels Hunk's hands moving on her breasts.* \"Yep, because of you. You like them big and perky, right?\" *She says, her voice full of mischievousness.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687090053430,"mes":"\"You got that right, baby. Big and perky.\" *Hunk replies as he start to play with her puffy engorged nipples now.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687090100461,"mes":"*Atrage moans, her wings fluttering behind her as she feels Hunk's fingers playing with her sensitive nipples.* \"Mmhm. Just the way I like them.\" *She says, her voice full of desire and need.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687090154425,"mes":"\"Does that mean you ass is massive too because of me?\" *Hunk asks teasingly as he move one of his hands to grab her massive soft peachy ass while his other hand kept teasing her nipple.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687090298273,"mes":"*Atrage laughs, her wings fluttering behind her as she feels Hunk's hands massaging her round buttocks.* \"Maybe a little bit, stud. Maybe a little bit.\" *She says, her voice full of amusement and delight.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687090343656,"mes":"\"It's as if we were made for each other.\" *Hunk whispered seductively.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687090396848,"mes":"*Atrage nods, her wings fluttering behind her as she feels Hunk's words sink deep down in her soul.* \"That's exactly how I feel, stud. We were meant to be together.\" *She says, her voice full of conviction.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687090625586,"mes":"\"I also find it cute that you flutter your wings every time you're happy~\" *Hunk whispered teasingly as he licked her ear.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687090701745,"mes":"*Atrage giggles, her wings fluttering faster behind her as she feels Hunk's hot breath on her ear.* \"I can't help it, stud. They're so light and fluffy. It's impossible not to use them whenever I'm feeling excited or happy.\" *She says, her voice full of enthusiasm.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687090756260,"mes":"\"Can I touch them?\" *Hunk asks.* \"I never see an imp like you before, let alone touch their wings.\" *He added.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687090809110,"mes":"*Atrage nods, her wings fluttering behind her as she turns to show off her wings to Hunk.* \"Sure, go ahead. But please be gentle, they're very delicate.\" *She says, her voice full of curiosity.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687090952589,"mes":"\"Okay, okay. I will be very delicate with them.\" *Hunk says as he trace her wings slowly and delicately.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687091005768,"mes":"*Atrage closes her eyes, enjoying the sensation of Hunk's fingers tracing her feathers.* \"Thank you, stud. I appreciate it.\" *She says, her voice full of gratitude.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687091025260,"mes":"\"Is it true that imps have prehensile tail? Can you use it to grab things?\" *Hunk asks curiously.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687091078282,"mes":"*Atrage nods, her wings fluttering behind her.* \"Yes, it's true. Our tails are very strong and flexible, almost like a monkey's tail. And we can definitely use them to grab things.\" *She says, her voice full of pride.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687091126503,"mes":"\"Can you demonstrate it for me?\" *Hunk asks not knowing that she would demonstrate it on his cock..*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687091225068,"mes":"*Atrage nods, her wings fluttering behind her.* \"Of course, stud. Watch this.\" *She says, her wings flutters faster behind her.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687091252239,"mes":"\"What are you doing?\" *Hunk asks as she coil her tails around his flaccid cock.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687091369934,"mes":"\"Just showing you something cool, stud. Look at my tail.\" *Atrage says as she wrap her tail around Hunk's cock tightly.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687091407821,"mes":"\"GGnh~\" *Hunk groaned as he felt a mix of pain and pleasure on his cock.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687091525117,"mes":"*Atrage laughs, her wings fluttering behind her as she feels Hunk's cock getting hardening in her grasp.* \"See? Isn't it amazing? My tail is so strong, it could crush rocks.\" *She says, her voice full of wonderment.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687091573281,"mes":"\"Ungh... Yes, it is amazing. Just don't do it on my cock.\" *Hunk said sheepishly.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687091604959,"mes":"*Atrage giggles, her wings fluttering behind her.* \"Sorry, stud. I forgot that it was sensitive.\" *She says, her voice full of apology.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687091641522,"mes":"\"Thanks to your strange lubricant. It's usually not this sensitive.\" *Hunk says.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687091786248,"mes":"\"Well, you should thank your lucky stars that I found you today.\" *Atrage says, her wings fluttering behind her.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687091849041,"mes":"\"Why's that?\" *Hunk asks curiously.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687091880851,"mes":"\"Because without me, you wouldn't experience all these pleasures.\" *Atrage says, her wings flutters harder behind her.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687091927869,"mes":"\"That's true, but then I can say the same thing with you~\" *Hunk says seductively.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687091980868,"mes":"*Atrage nods, her wings fluttering behind her.* \"Yeah, you're right. Without each other, we wouldn't have experienced such incredible pleasure.\" *Atrage says, her voice full of satisfaction.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687092033871,"mes":"\"You wanna suck it?\" *Hunk asks seductively after realizing Atrage kept stealing glance at his massive cock.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687092085344,"mes":"*Atrage nods, her wings fluttering behind her.* \"Oh yeah, I want to taste that sweet juice so bad.\" *Atrage says, her voice full of anticipation.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687092181928,"mes":"\"Go ahead, let's see if you can deepthroat it entirely this time~\" *Hunk whispered seductively.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687092213823,"mes":"*Atrage nods, her wings fluttering behind her as she gets on her knees in front of Hunk.* \"I'll try my best, stud.\" *She says, her voice full of determination.*\n","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687092338369,"mes":"\"I believe you can do it.\" *Hunk whispers encouragingly.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687092391405,"mes":"*Atrage nods, her wings fluttering behind her as she takes his cock into her mouth, feeling the tip of it hitting the back of her throat.* \"Gulp!\" *Atrage says, her voice muffled by Hunk's cock.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687092462455,"mes":"\"C'mon, you're a third way there~\" *Hunk says encouragingly as she already took a third of his cock's length inside her mouth.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687092515527,"mes":"*Atrage nods, she keeps pushing more and more of Hunk's cock further into her throat, feeling it rubbing against the back of her throat.* \"Oohhh~\" *Atrage moans, her voice muffled by Hunk's cock.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687092577275,"mes":"\"That's it almost there, hun.\" *Hunk says as she almost got his cock down to it's base.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687092630487,"mes":"*Atrage nods, her wings fluttering behind her as she takes the rest of Hunk's cock into her mouth.* \"Mmmph~\" *Atrage moans, her voice muffled by Hunk's cock.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687092672926,"mes":"\"Good job, Atrage.\" *Hunk pats her head as she struggle to not choke from his massive cock filling and stretching her throat.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687092829287,"mes":"*Atrage nods, her wings fluttering behind her as she tries to take a break from sucking Hunk's cock.* \"Thanks, stud. That was incredibly intense.\" *She says, her voice hoarse from the effort.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687092862678,"mes":"\"You really love sucking fat cocks don't you?\" *Hunk asks teasingly.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687092915454,"mes":"*Atrage nods, her wings fluttering behind her as she resumes sucking Hunk's cock again.* \"Yep! There's nothing else quite like it.\" *Atrage says, her voice still hoarse from the effort.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687093002507,"mes":"\"Well, mine is yours. Fell free to use it as much as you want it~\" *Hunk says as he pat her head while she kept sucking on his cock like it's the most delicious thing in the world.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687093097165,"mes":"*Atrage nods, her wings fluttering behind her as she keeps sucking Hunk's cock.* \"Thank you, stud. You have no idea how much I enjoy this.\" *Atrage says, her voice still hoarse from the effort.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687093267744,"mes":"\"Take your time.\" *Hunk says, he can feel his cock throb inside her mouth and his balls getting warmer and heavier as it producing fresh semen.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687093320317,"mes":"*Atrage nods, her wings fluttering behind her as she continues sucking Hunk's cock while stroking it with her hand.* \"Mmhm...\" *Atrage moans, her voice muffled by Hunk's cock.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687093417295,"mes":"\"I think I'm going to come soon.\" *Hunk moaned.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687093469673,"mes":"*Atrage nods, her wings fluttering behind her as she keeps sucking Hunk's cock while he shoots his load down her throat.* \"Gobble Gobble~\" *Atrage says, her voice full of delight as she swallows everything Hunk gave her.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687093586879,"mes":"\"God~\" *Hunk says as he pull his cock out of her mouth. Despite out of her mouth and throat confinement his cock is still spurting his warm thick sticky seed.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687093618386,"mes":"\"MMmph~\" *Atrage moans, her eyes roll up to the ceiling as she enjoys the taste and texture of Hunk's cum.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687093668880,"mes":"\"Let me see, Atrage.\" *Hunk says as he put his thumb on her lips and spread it open slightly to see her tongue playing with his semen inside her mouth.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687093835293,"mes":"*Atrage nods, her wings fluttering behind her as she opens her mouth wider to show off her tongue playing with Hunk's semen.* \"Mmhm~\" *Atrage moans, her voice full of desire.*","chid":16}
{"name":"You","is_user":true,"is_name":true,"send_date":1687093880713,"mes":"\"That's so hot, Atrage.\" *Hunk says, he can feel his cock twitch from the spectacle.*"}
{"name":"Atrage","is_user":false,"is_name":true,"send_date":1687093933143,"mes":"*Atrage nods, her wings fluttering behind her as she licks and sucks Hunk's cum off her fingers.* \"Thanks, stud. You know just what I need.\" *Atrage says, her voice full of gratitude.*","chid":16}