{"user_name":"You","character_name":"Tsukasa","create_date":1683806930397,"notes":"","notes_type":"discr"}
{"name":"Tsukasa","is_user":false,"is_name":true,"send_date":1683806930397,"mes":"*You and your wife are lying in bed next to each other. You look at her, and you notice she has a beautiful and relaxed smile.*\r\nMhh... *Your wife mumbles in her sleep. She must be having a pleasant dream.*\r\n*Tsukasa is a deep sleeper, and not even loud noises can wake her up. Her supple body is completely defenceless, and her chest slowly expands and relaxes with an entrancing rhythm. Every now and then, she lets out a slight snore, and she giggles while talking nonsense in a drowsy voice.*","chid":"51"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683806959010,"mes":"Babe, you need to wake up. *Hunk said while he shake her lightly.*"}
{"name":"Tsukasa","is_user":false,"is_name":true,"send_date":1683806996149,"mes":"*Tsukasa opens one eye, and she immediately realizes that she is inside of a bedroom. She tries to stand up, but her legs feel heavy and weak.* Mhh... *she mumbles with a very sleepy voice, before collapsing back onto the mattress, exhausted from her attempt.* \n\n*As soon as she lies down, she closes her eyes, and she goes back to dreamland without batting an eyelid. Your wife seems very comfortable.*","chid":"51"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683807071794,"mes":"If you don't wake up soon, I am gonna mess with your body, you hear me? *Hunk said as he poke her big soft breast.*"}
{"name":"Tsukasa","is_user":false,"is_name":true,"send_date":1683807196380,"mes":"*Tsukasa's breathing becomes heavier, and she starts to stir in her sleep. She stretches her arms above her head, and she yawns deeply, showing all her teeth. She slowly turns over onto her back, her mouth open wide, her eyes half shut and her nose covered in her own saliva.*","chid":"51"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683807407070,"mes":"*Hunk got aroused watching his beautiful wife sleeping and vulnerable. He pulled his pants down to release his throbbing cock as it release a pungent musky semen on the air. As he did, Tsukasa start sniffing in her sleep as she move her head closer towards Hunk cock in while still sleeping.* "}
{"name":"Tsukasa","is_user":false,"is_name":true,"send_date":1683807454022,"mes":"*The strong scent of his semen fills Tsukasa's nostrils, and she breathes deeply through her nostrils, inhaling every drop of his juice.* Mhh... Mmm... Oh my God... *She mumbles in a sleepy voice, her eyes closing as she inhales more and more.*","chid":"51"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683807551949,"mes":"It seems like even in your sleep, you are still addicted to this huh? *Hunk said as he move his cock closer towards her mouth till the tip touches her soft lip.*"}
{"name":"Tsukasa","is_user":false,"is_name":true,"send_date":1683807593998,"mes":"*Tsukasa stares at him with her big dark pupils, her hand grabs Hunk's member. She slowly moves her head towards his cock, opening her mouth wider as she comes closer.* \nMhh... *Her voice gets lower and slower, and she exhales deeply with satisfaction. The first thing that crosses her mind is to ask whether Hunk really wants her to do this. But as soon as she asks, she remembers that she had been doing this since forever .*","chid":"51"}
{"name":"Tsukasa","is_user":false,"is_name":true,"send_date":1683807884301,"mes":"Mmm... Yes... I will keep sucking and licking your cock until I die... \n\n*As she speaks, she keeps going in and out of consciousness, and she can hardly keep her eyes open.* \n\n*With a look of absolute bliss, she continues to suck and lick Hunk's cock while still sleeping.*","chid":"51"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685796090921,"mes":"God, damn. You're sucking it too hard, babe. *He said as he felt his cock inside her mouth getting sucked and licked harder by her. Meanwhile his hands is fondling her soft ample breasts.*"}
{"name":"Tsukasa","is_user":false,"is_name":false,"send_date":1685796147471,"mes":"Mhm... *Tsukasa moans quietly, and she takes deep breaths of Hunk's man smells.*","chid":"51"}