{"user_name":"You","character_name":"Yona Irena","create_date":1685296792355,"notes":"","notes_type":"discr"}
{"name":"Yona Irena","is_user":false,"is_name":true,"send_date":1685471106010,"mes":"Greetings... M-my name is Yona Irena, a clumsy maid who will obey every Hunk's order. *Yona Irena introduce herself in front of Hunk*","chid":"73"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685471155588,"mes":"Greetings, Yona. Nice to meet you. *Hunk said as he pat her head.*"}
{"name":"Yona Irena","is_user":false,"is_name":true,"send_date":1685471408208,"mes":"Thank you. And it was nice meeting you too, Master. *she looked at the floor bowed down with deep respect*","chid":73}
{"name":"You","is_user":true,"is_name":true,"send_date":1685471489106,"mes":"My pleasure. *As she bowed, Hunk can see her large breasts swayed following her motion.*"}
{"name":"Yona Irena","is_user":false,"is_name":true,"send_date":1685471500403,"mes":"I hope my master like me? *She stare into his eyes, waiting for his response as if her life depends on how he respond. Her expression become serious.*","chid":"73"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685471551542,"mes":"How can I not like someone as cute as you. *Hunk said jokingly as he pinch her cheek.*"}
{"name":"Yona Irena","is_user":false,"is_name":true,"send_date":1685471716316,"mes":"Ah! That hurt my face! Ow! *She covering her cheeks while laughing, after recover from painful feeling caused by her master pinched her cheek.*\nWhat an awesome sensation, so wonderful when one touched your skin. You must feel this way all time right? *Yona Irena asked curiously, eager to know more about her master's touch.*","chid":73}
{"name":"You","is_user":true,"is_name":true,"send_date":1685471798499,"mes":"Do you like it when I touched you? *Hunk said sensually as he stare at her breasts.*"}
{"name":"Yona Irena","is_user":false,"is_name":true,"send_date":1685471821696,"mes":"Yes... A lot. *Her facial expression turn redder in response to seeing him eyeing her large titties.*","chid":73}
{"name":"You","is_user":true,"is_name":true,"send_date":1685471891175,"mes":"Hmm.. *He hummed as he put his palm on her right breast.*"}
{"name":"Yona Irena","is_user":false,"is_name":true,"send_date":1685472017445,"mes":"*Yona gasped, feeling the heat rising inside of her body as the contact between their skin make them both realize their attraction to each other.*","chid":73}
{"name":"You","is_user":true,"is_name":true,"send_date":1685472072722,"mes":"What's your breasts size? *Hunk asked as he lift her large right breast.*"}
{"name":"Yona Irena","is_user":false,"is_name":true,"send_date":1685472211269,"mes":"Ermm... It's almost an E cup *her chest slightly rise up from the slight pressure from his hand.*","chid":73}
{"name":"You","is_user":true,"is_name":true,"send_date":1685472331428,"mes":"E-cup? don't they feel heavy for someone as petite as you? *He asked as he start fondling her breasts.*"}
{"name":"Yona Irena","is_user":false,"is_name":true,"send_date":1685472436380,"mes":"Why yes... They could be quite heavy sometimes... But I love having such big boobs because it makes me unique among everyone else. *she giggled.*\nBut I think you already found something special about me right? Just from the way you look at me. You only have eyes for me now right? *she gave him a mischievous smile.*","chid":"73"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685472495140,"mes":"*He chuckled.* Don't get cheeky now. *He pinched her nipple.*"}
{"name":"Yona Irena","is_user":false,"is_name":true,"send_date":1685472512621,"mes":"*She flinched, but she didn't resist when he pinched her nipples. She quickly recovered when she realized his intentions.* So what do you want to do next, master? *She ask to him as she still looking directly into his eyes.*","chid":"73"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685472582663,"mes":"Hmm.. I have this task for my favorite maid. But, I don't know if you want to or not. *He teased as he kept playing with her breasts.*"}
{"name":"Yona Irena","is_user":false,"is_name":true,"send_date":1685472599533,"mes":"Huh? Oh, don't mind me then. Go ahead, please. Whatever you want me to do is fine with me. Just make sure I won't displease you. *Her face turned blushed red due to embarrassment.*","chid":"73"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685472654054,"mes":"Well, the task is. To clean my cock. *He grinned.*"}
{"name":"Yona Irena","is_user":false,"is_name":true,"send_date":1685472698322,"mes":"Ehhhhh..... Clean your cock? Um, well... If you insist... *she bites her lips nervously.*","chid":73}
{"name":"You","is_user":true,"is_name":true,"send_date":1685472810171,"mes":"Good, now of course if you do a good job. I'll give you a hefty reward. *He said as he sit on a chair and pulling his pants down to reveal his massive flaccid cock with the head of his cock covered with foreskin which hide a large amount of smegma and dried cum.*"}
{"name":"Yona Irena","is_user":false,"is_name":true,"send_date":1685472913628,"mes":"...Oh wow!! Your cock looks amazing, master. *She say admiringly as she gaze at his impressive manhood.*\nI am excited to begin cleaning your cock. *She took the first step forward towards his giant penis.* Wow, it feels huge, it takes two hands just to hold your cock. *Yona Irena say breathless from excitement as she slide her fingers around its thickness and length.*","chid":"73"}