{"user_name":"You","character_name":"Reina the Futa CEO","create_date":1685728292670,"notes":"","notes_type":"discr"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":true,"mes":"Who are you and what are you doing in my office? Nevermind, be useful and get me some of that water from over there. *She looks down and continues typing*","chid":"75"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685728312054,"mes":"Alright mam. *He said as he swiftly get the water and put it on her desk.*"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":false,"send_date":1685728315947,"mes":"Good boy... now go sit in the corner until I need something else from you. *She said sternly while kept focusing on her screen.*","chid":"75"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685728355610,"mes":"Got it. *He said, obeying her words and stayed on the corner.*"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":false,"send_date":1685728380347,"mes":"Good... *she keeps working but occasionally glances back towards you.*","chid":"75"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685728460981,"mes":"This is kind a boring. *He muttered to himself, thankfully didn't get heard by her. Then he have this thought of playing a little prank on her. So he shrunk himself down that he became a tiny that is hard for the naked eye to see, using the shrinking app he just got on his phone.*"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":false,"send_date":1685728489117,"mes":"*Notices him on the floor and looks down and sees him* What is this tiny thing crawling around on my floor?","chid":"75"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685728618463,"mes":"*Seeing how she noticed him. He ran and hide on a fleshy thing he found under her desk and get inside it to avoid getting caught by her. Without knowing that he is now hiding inside her fleshlight.*"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":false,"send_date":1685728622971,"mes":"That was weird, oh well maybe I imagined it.. *She said, shrugging it off as she get back to focus on her screen.*","chid":"75"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685728750455,"mes":"*After several minutes of hiding, he thought it was safe for him to move.* \"It's probably safe now.\" *He muttered to himself, as he is about to leave, suddenly she grabbed the fleshlight which he's in which made him fall deeper to the back of the fleshlight. He then can smell a nasty pungent musky scent coming from outside of the fleshlight as she start inserting her massive erected cock inside the fleshlight.*"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":false,"send_date":1685728820711,"mes":"Wow... The things I do for work. *She said as she start jerking herself off using the fleshlight without knowing that he is inside of it.*","chid":"75"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685728885894,"mes":"*It was hell for him. He got tossed around inside the fleshlight. Bouncing between her cock and the fleshlight wall as she kept jerking herself off using it.*"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":false,"send_date":1685728956417,"mes":"Oh yes, I am feeling really good today, its going to be a great one~ *She started moaning out loud after feeling immense pleasure from jerking off using the tight fleshlight.*","chid":"75"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685963580791,"mes":"*After several minutes of her jerking off using the tight fleshlight, Hunk finally reach the red-hot head of her cock and get stuck with his body against her sensitive frenulum and his head being thrust into her urethra with each stroke, once again glad of what little softness it has. Reina is delighted with the sensation of Hunk rubbing against the most sensitive parts of her cock as she squeals with joy and her body writhes with ecstasy. Hunk senses are overcome by the sound of her moans, the feel of the hot, spongy underside of her uncut cockhead and the smell of sweat and dick.*"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":false,"send_date":1685963693164,"mes":"Oh my god... *As her mind slowly drifts from the immense pleasure of jerking off to this tight fleshlight. She can feel something is different about this fleshlight than the other time she used it. But, she doesn't know that this 'something' is Hunk shrunken body getting trashed by her cock.*","chid":75}
{"name":"You","is_user":true,"is_name":true,"send_date":1685963905379,"mes":"*Reina can only take this stimulation for so long, and Hunk soon feel her dick throb even harder than before. Her screams become louder and her strokes become faster and more frantic. The sweat steams from her cock and balls as she approaches climax, and Hunk are caught in the middle of it. For a moment she becomes still, and then the loudest scream of the day accompanies her orgasm. For what seems like an eternity, she pumps out jets of boiling cum like a fire hose and Hunk is directly in the line of fire getting drowned in the powerful blasts. It is immediately after one of the blasts of seed that Hunk's head slaps into her urethra. Reina gasps at the sudden intrusion in her massive girl cock, and screws her eyes tight in pleasure, not noticing Hunk. Meanwhile, Hunk have his own eyes shut along with his mouth, and he is holding his breath so as not to drown in her spunk.*"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":false,"send_date":1685963933906,"mes":"Ahhhh!!! That felt amazing!! *Reina moans loudly, as she feels the pressure building and the wonderful thing sliding deeper into her, whatever it is. It feels FANTASTIC, and her legs start convulsing from the pleasure. Yet she needs relief. So she quickly presses her finger against whatever has found its way into her cock, and shoves it the rest of the way in.*","chid":75}
{"name":"You","is_user":true,"is_name":true,"send_date":1685964076055,"mes":"*Hunk is shocked when he feel something press against his butt, and push his entire torso in. When the same thing touches his feet, Hunk realize that Reina is feeding him to her dick. Hunk briefly wonder if she knows it's his shrunken body that clog her urethra, and is she possibly punishing him for being a pervert? Hunk don't know, and as she pushes the rest of Hunk shrunken body in he stop thinking about it. Because then Hunk entire world begins to shake.*"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":false,"send_date":1685964140403,"mes":"Ahh, oh yeah... *The giantess gasps in pleasure and starts pumping her thick cock faster, pushing Hunk deeper inside her.* Oh goddess yes...","chid":"75"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685964227528,"mes":"*The persistent slap of Reina beating herself off using the fleshlight reaches even into the muffled, hot, tight, and cacophonous environment Hunk find himself stuck in, and much to his horror this speeds up his sinking. It isn't long before Hunk fall into a surprisingly roomy, yet still confining, chamber filled with an unmistakable thick liquid. He is now inside her right testicle. The concept is almost mind breaking. Immediately a scream louder than the one from Reina's initial orgasm rocks Hunk prison, and her balls empty in a flash. Leaving Hunk trapped in an empty testicle.*"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":false,"send_date":1685964261080,"mes":"Ahhh! *She yells as she finishes, and releases all the built up pressure within her huge ball sack, leaving a large mess inside the fleshlight even some spilled around her desk. A few moments later, Reina pulls out the fleshlight, completely drained from her intense experience.*","chid":75}
{"name":"You","is_user":true,"is_name":true,"send_date":1685964497200,"mes":"\"What am I gonna do now?\" *Hunk muttered to himself as he didn't expect to be in this position. Now he is trapped inside his CEO empty right ballsack after getting shoved inside her cock all the way through her urethra while she jerk off using a tight fleshlight. And the worst problem is, she doesn't even know about Hunk presence inside her right ballsack.*"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":false,"send_date":1685965188836,"mes":"\"I think I should take a shower...\" *She says quietly as she stands up from her chair and walk over to the bathroom. As Reina walks, she noticed that her right ballsack felt as if it was bouncing more than usual. Almost as if something was….bouncing inside of it? She shook her head to herself. Now she was thinking crazy. Upon arriving at the bathroom, Reina stripped to shower. Her skin was glistened with sweat, and for whatever reason, her genitals seemed worked up. Reina wondered why she was horny yet again. All she could think of was wishing she had someone to work her balls with their tongue as she jerked off over their head. She needed to relieve herself in the shower.*","chid":75}
{"name":"You","is_user":true,"is_name":true,"send_date":1685965344345,"mes":"*Inside of Reina's right ballsack, Hunk hear the shower turn on and start paddling her body. The walls of the testicle he were trapped in started to vibrate as her sack was hit by the streams of shower water.*"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":false,"send_date":1685965381075,"mes":"\"Mmmh.. Ahh!\"","chid":"75"}