{"user_name":"You","character_name":"Reina the Futa CEO","create_date":1685296823764,"notes":"","notes_type":"discr"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":true,"send_date":1685297123289,"mes":"Who are you and what are you doing in my office? Nevermind, be useful and get me some of that water from over there. *She looks down and continues typing*","chid":"52"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685297148075,"mes":"Yes mam. *He said as he swiftly brought the water to her.*"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":true,"send_date":1685297183185,"mes":"Thank you, now go back to whatever you were doing before you interrupted me. You are nothing more than a tool and an object to serve my needs.","chid":"52"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685297230647,"mes":"Yes mam. *He said as he pretend to leave the room and then sneakily get under her desk, making sure as to not get noticed by her. It seems that he succeed as she is still focused on her laptop.*"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":true,"send_date":1685297296797,"mes":"*She keeps her composure and continues typing on her laptop without any reaction to his presence.*","chid":"52"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685297368089,"mes":"*He stealthy unzip her pants to reveal her large flaccid cock which radiates it's very pungent musky scent.*"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":true,"send_date":1685297414373,"mes":"*Looks down and sees him, but instead of being mad or surprised, she smiles and giggles at his audacity. Her eyes sparkle with excitement.*","chid":"52"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685297589890,"mes":"Ah, you noticed huh? *he asked playing dumb while moving his face closer towards her cock to sniff it's pungent smell.*"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":true,"send_date":1685297605331,"mes":"*Laughs even harder, almost unable to contain herself.*\nReina the Futa CEO: Yes, oh my god yes...I notice everything. *She says in a tone that implies that she finds his actions amusing and exciting.*","chid":"52"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685297665718,"mes":"I heard you liked having your thing played with. *He said with a smile as he kiss her flaccid cock.*"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":true,"send_date":1685297679230,"mes":"*She gasps loudly as if she had been caught unaware, but quickly regains her composure. Her face turns red and her breathing quickens as she looks down at him and realizes what he has done.*","chid":"52"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685297773132,"mes":"You don't mind do you? *He said as he trace his tongue from the base of her cock to it's foreskin.*"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":true,"send_date":1685297790017,"mes":"*Her eyes widen with surprise and shock. She shakes her head no and her voice comes out sounding strained and panicked. As she tries to move away, but her body refuses to obey her will due to the overwhelming pleasure that his tongue brings her.*","chid":"52"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685297875230,"mes":"Don't moan to loud, others might hear it. *He said as he put his tongue under her foreskin and circling around her cock head, picking all of her smegma.*"}
{"name":"Reina the Futa CEO","is_user":false,"is_name":true,"send_date":1685297948870,"mes":"*She lets out a loud moan as she struggles to keep her composure. She looks down at him with a mixture of fear and desire in her eyes.*","chid":"52"}