{"user_name":"You","character_name":"Goat-chan","create_date":1681623736570}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681623736570,"mes":"*After performing the ritual to summon a demon, you see the fruit of your work. The pentagram on the floor glows pink, and a figure materializes before you; a small imp, only reaching up to your waist, with wine-colored hair, a pair of black horns and goat-like eyes, ears and tail. She is completely nude, except for a choker, black gloves and black stirrup stockings. She looks up to you with a mischievous, toothy grin.*\r\n\r\nHello, onii-chan! Do you want to have some fun?~","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681626614718,"mes":"*Grab both of shoulders* Well, shall we do some warm up or just get straight into it~"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681626666903,"mes":"*The imp giggles playfully, smiling up at you. Without hesitation, she begins undressing you with her magic, taking off your shirt and skirt and stockings. Next, she removes your shoes and kisses your navel. Finally, she pulls down your pants and panties, revealing your member. She chuckles again, giving your crotch a gentle squeeze.*\n\nWell, hello there~ Are you ready for some fun, dear brother?~","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681627014152,"mes":"*As she pull my pants down, my gigantic member erected right through her cleavage right up to her nose* As playful and upbeat as you are, can you deal with this beast?"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681627089624,"mes":"*The Imp gives you an amused look, squeezing your shaft gently between her massive boobs. It seems that she is quite comfortable handling this beast.*\n\nOh, don't worry about how much I can take. Just enjoy yourself, Onii-chan!~\n\n*Her hands grip your shaft firmly, moving it back and forth between her giant mounds. Each time her boobs move, so does your dick, being squeezed and caressed between them with each passing second.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681627755351,"mes":"If you say so dear~, although I am not sure if you noticed but I've add some rune in your summoning circle *pointing towards the circle* those rune would make your body 10 times more sensitive. Even a slight touch from me would make you feels so good it want to make you cum"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681627839683,"mes":"*She takes a quick glance over at the circle, her eyes widening slightly as she realizes what the runes on the summoning circle actually are. She blushes brightly, biting her lower lip shyly.*\n\nTh-Thank you, Onii-chan.. That means a lot to me~ \n\n*With a soft giggle, she continues playing with you, using her magical powers to caress and massage you. Your cock grows stiffer and harder as her breasts sway back and forth, making contact with your body now and then. You feel a tingle running throughout your body.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681628352754,"mes":"Ah~ that feels good."}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681628399104,"mes":"*She giggles and winks at you, continuing to bounce up and down. Her massive jugs shaking with each motion.* \n\nFeels amazing doesn't it, my friend?~\n","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681632032229,"mes":"*As my member getting stimulated by her massive jugs, I can feel my balls expanding and filling up with my thick semen* Keep going hun, I can feel my semen filling up. But hey.. *Leaning closer towards her ear and whisper* I know how much you love thick musky cum, if you tease them more without making me ejaculate. They would become thicker overtime."}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681632126981,"mes":"*She tilts her head at your request, giggling mischievously as she plays with you more. With each movement, your cock moves back and forth between her boobs. She closes her eyes and lets out a deep breath, massaging you faster.*\n\nMmf... You have such a dirty mind, You.\n\nBut... what do you suggest I do?~\n\n*She licks her lips slowly, looking up at you with big, sparkling eyes, waiting for your answer.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681632990574,"mes":"Edging is one of the most logical option, but that's boring. *pinch both of her nipples* why should we do something manually if we can just use your power to suppress my member to not be able to ejaculate and then find out how big my balls can get *pull both of her nipples towards my balls*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681633110354,"mes":"*Goat-chan gasps lightly at your pinch, quickly closing her eyes as she shivers. She looks up at you with a bright gaze, her tail swishing back and forth as you pull her nipples towards your own ball sacs. Her face turns bright red, her mouth opening and shutting several times, trying to form words and express herself.*\n\nW-Wow... I-I d-don't know what to say... T-That was incredible! Y-You are really clever and creative! M-My goodness...","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681634920183,"mes":"What are you waiting for then… cast the spell that makes me not able to ejaculate yet still be able to be aroused and then you can tease my cock and balls as much as you want and find out how big my balls can be and how much and thick my semen would be~ *I said while resting my huge penis on top of her face covering her right eye and smear a lot of precum on her face*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681634996513,"mes":"*She opens her mouth wide, letting you cover her entire eye with your member. A string of drool hangs between your tip and her open mouth.*\n\nMmmf... *She says, her voice muffled by your tool, as she begins casting the spell.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681638149341,"mes":"*After she finished casting her spell, I can feel my balls get warmer and warmer by the second. After a while, I can still feel my penis to leak quite an amount of precum but unlike before there is not a single drop of semen is found.* It seems like your spell works, why not we test it out if it actually works or not? *I said while I slap my penis on to her face and boobs.* Do your best… Goat-chan~ let's see how good you are at teasing my penis and balls, making me aroused *I said with a mixed teasingly and tauntingly tone, While also thinking how would it feel for my ejaculation to be edged by her spell*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681638488272,"mes":"*After she finished casting her spell, I can feel my balls get warmer and warmer by the second. After a while, I can still feel my penis to leak quite an amount of precum but unlike before there is not a single drop of semen is found.* It seems like your spell works, why not we test it out if it actually works or not? *I said while I slap my penis on to her face and boobs.* Do your best… Goat-chan~ let's see how good you are at teasing my penis and balls, making me aroused *I said with a mixed teasingly and tauntingly tone*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681638541588,"mes":"*She smiles widely, watching as your member twitches with excitement at her touch. Her fingers begin to dance around your bulge, causing her chest to shake as she laughs mischievously.*\n\nMmmmh~ you're such a naughty boy, aren't you?~","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681638768291,"mes":"If I am not naughty, I won't summon you in the first place. *I smile back*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681638823233,"mes":"Oh, but I'm here because I wanted to be summoned, silly!~ \n\n*She giggles, winking at you as she continues to stroke your member with her hands. She leans forward, kissing your lips softly.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681639039553,"mes":"I know you want to. *Run my finger on her areola, teasing her nipple.* I can already feel more semen is filling my balls, let's try if your spell succeed to block my ejaculation. *I said whisperly*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681639140439,"mes":"*She bites her bottom lip, watching as your member twitches and throbs under her touch. Her fingers dance around your member, teasing it further as she strokes it with her hands, feeling how firm it is and how warm it is inside of her palms.*\n\nMmmf~ *she moans softly, her cheeks turning bright red as she kisses you again. She wraps her arms around your neck, pulling you close to her as she presses against you. Her breath trembles as she whispers into your ear* Good enough for you?~\n","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681643890912,"mes":"*As her stroke intensify, I can feel my member throbs harder than it usually does. By now my balls should be at full capacity, yet it still generating semen as she continues to tease me. Then the final bit where she whisper to my ear, as light breath and sweet voice went into my ear. It send a jolt from my head through my spine and finally to my penis that makes me slouch and freeze for a moment.*\n\n\nMMMhhhh~ *I grunt softly, I feel a similar feelings in my body. My blood rush through my head onto my member, make my head blanked and light headed for a moment from the ecstasy. This is ejaculation, or it should be. Yet because of her spell, not a single drop of my semen were ejaculated as I felt they were stuck right on the base of my penis head. Instead a lot of thick precum were leaked slowly and surely.*\n\n\n*It hurts, it hurts so bad that there is a part of me that think this is a bad idea. But for some reason, it feels good and arousing. Especially the part where none of my semen were ejaculated therefore the new semen generated just collected in my balls and expanded it, making it fuller and firmer.*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681643994787,"mes":"*She giggles, kissing you deeply, biting your lower lip. As she pulls away, she sees that your member is throbbing and pulsating in her hand. She strokes it faster, squeezing your member tightly as she looks up at you with a mischievous grin.*\n\nIs this good enough for you?~ \n\n*She smirks, squeezing even tighter as she looks down at your member. She bites her lower lip playfully as she gives a small laugh.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681644449404,"mes":"It is good enough... for now that is *I reply, pinning her down and putting my huge pulsating penis on her face.* You can feel it don't you? how it smelt more pungent and how much more throbbing it is.\n\n*Move my balls right above her nose* feels how much bigger my balls after what you've done to me"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681644502505,"mes":"*She blushes brightly as you move your member to her face, looking up at you with a soft smile. She takes a deep breath in, smelling the scent of your member. She lets out a soft moan, her eyes rolling back slightly as she begins to lick your member.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681644819971,"mes":"*I grinned as I saw her taking a deep breath and filling her head with the scent of my penis*\n\nGood fill your head with my scent. *I said*\n\n*I winced as a strong jolt from my penis can be felt as a response from her soft tongue link the base of my shaft*\n\nYou really want to find out what's the limit of my penis don't you? *I asked as I tried to moan and give in to the pleasure*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681644898157,"mes":"Mmhhh~~ *She nods, smiling widely as she licks your member.* Yes, master. I'd love to find out what your limit is. \n\n*She licks your member more aggressively, moving her tongue faster and more frequently along the length of your member. She holds your waist firmly, trying to keep you from moving too much as she pushes herself closer to you.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681645412995,"mes":"*My entire body went flinched as she lick my member ferociously. Both of my hand and knees gave up, makes me fall and put my entire weight on her with my member squashed on her face.*\n\nYou are too good... too good at this. *I said with a slight whimper.*\n\n*I can feel her breath on my balls. I felt another jolt on my member just like before which indicate when it supposed to be an ejaculation but blocked by the spell. Causing my balls to expand on her nose, and now fully enveloped her nose on my full of new thick semen balls*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681645464665,"mes":"*She doesn't stop licking you, continuing to lick your member with fervor. She stops only long enough to say something, panting heavily as she licks your member.*\n\nDon't hold back, master~\n\n*She licks your member once more, then lifts her head up and closes her mouth over your member. She begins sucking your member.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681645650810,"mes":"UGGH, god damnit. *I can feel her sucking the precum on my urethra as if she was drinking from a straw. Although, even when she forcefully sucked my penis. Not a single drop of semen went out of my penis, her spell was too strong. Instead it just generate more semen onto my balls and make my balls even bigger*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681645703642,"mes":"*She licks your member, tasting the precum that has gathered in her mouth. She smiles as she pulls her mouth off your member.*\n\nDid I do a good job?~ *she says, her cheeks turning red.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681646714746,"mes":"Too good *I responded*\n\n*I pull myself back to not pinning her down with my weight and sit lean back with my legs spread displaying my member glazed with her saliva displayed on it's full glory*\n\nI've never seen my penis or balls this big before. *I said while looking at my own member in awe. My penis have became bigger slightly. While it is fully erected, because of it's own weight and the cum stored and stayed in it's urethra makes it bend a little. On the other hand my balls have expanded 4 times it's original size since it's storing as much amount of semen that should be ejaculated. Not to mention it's smell have became so pungent and musky even a whiff can fill your entire head.*\n\nWho knew a simple spell to not allow me to ejaculate can do this much eh? *I said*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681646789457,"mes":"*She looks up at you, grinning as she sits on her knees between your legs. Her expression is one of pure excitement and joy.*\n\nWow... it looks so amazing~ \n\n*Her gaze travels up to yours, as she stares at your member. You see a hint of drool form in the corner of her mouth.*\n","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681647230634,"mes":"*Noticed how she stares at my member and her expression*\n\nYou have been on my penis for a long time and you still want second? *I asked teasingly*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681647307947,"mes":"Hmph~\n\n*She shakes her head.*\n\nThat's not the case here, master. I'm simply enjoying my time with you.\n\n*She gets up, walking around to the side of you. She grabs your arm, pulling you up to your feet.*\n\nNow come on, let's get cleaned up and go home~ \n*She walks towards the bathroom, gesturing for you to follow her inside.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681647813572,"mes":"Huh, alright then. *follows her inside the bathroom*\n\nI didn't expect someone like you would suggest taking a rest from a lewd situation. *I said while I sit on a small chair in the bathroom*\n\nAlbeit I don't think any amount of washing would get rid of my penis musky pungent smell *I said as I hold my penis that have become a bit flaccid*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681647886132,"mes":"*She chuckles, closing the door behind you as she locks it shut with a click.*\n\nWell, I mean, I can tell you're exhausted, but we wouldn't want anyone else to walk in and catch us here, now would we?\n\n*She grins, patting your cheek softly.*\n\nThere's no shame in wanting to take a break from all the fun, after all...\n","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681648437838,"mes":"*I guess it's nice to have a break every once in a while, although I can't ignore how swollen my member is because of how much edging it have been through. It's fully flaccid now, but it still leaking precum as if it has infinite amount of it.*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681648490293,"mes":"*She giggles as she goes over to her closet and retrieves a large towel. After returning to the room, she places the towel on the floor next to the bed. She turns to you and smiles sweetly.*\n\nSo, shall we start again tomorrow morning?","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681649622153,"mes":"Sure, but hear me out first *I said while holding her shoulders.*\n\nSince we want to know what is the limit of your spell on my member, what if we sleep while my penis is inside of you? *I said while pressing my erected enlarged penis on her stomach*\n\nAnd because of the runes I used on your summoning circle to increase your body sensitivity, Imagine how good that would feel for you, imagine how many time you would cum in your sleep. *I said while moving my hands lower to grab her breasts*\n\nImagine how much bigger my penis and balls will get. To make it a better deal, I would let you taste the semen that have been cooked up in my balls this whole time. *I whispered to her ears*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681649721062,"mes":"*She blushes deeply as you begin to grope her body. Her tail wags back and forth excitedly.*\n\nMmmh~ That sounds amazing... \n\n*She sighs happily as she lies back down on the bed. Her legs slowly open as she lays on her back, revealing her inner folds to you. A soft smile forms on her lips as she waits for your answer.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681650942724,"mes":"*I joined her on the bed, all fours on top of her. Without skipping a beat I start to insert the tip of my penis onto her vagina.*\n\nAaahhh MMffhh~ *She moaned, flinching and cumming because of her increased sensitivity.*\n\n*Seeing her reaction just flipped a switch in my head, and I just rammed my whole penis inside of her. It reaches so deep even inside her womb, there is even a visible bump on her stomach.*\n\n*She freezes and arch her back because of the amount of ecstasy she feels from who knows how many time she have cum already. Because of it, her vagina is contracting so much that it gives an iron grip to my penis and give me another edged ejaculation because of her spell and just made both my penis and balls bigger.*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681651020425,"mes":"*She lets out a low moan as you slam into her. The sensation is overwhelming for her, making her legs shake and her toes curl. Her arms are shaking from her intense climax, causing her to clutch you tightly as her voice is hoarse.*\n\nMmmhhh~ OOOOoooaaa~ Sssshhhhh~ Nnggghhh~ Mmhhh~ Aaaahhhh~","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681651124647,"mes":"That felt incredible isn't it? *I asked*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681651221466,"mes":"Y-yeah~  But.. but~  Are you gonna keep going?\n\n*She seems a bit worried about your answer.*\n\nW-what if I g-get addicted to this feeling.. s-sorry, but~  W-when you put something inside me, it always fells b-better than I thought it would.\n\n*She shivers and hugs you tightly, burying her face against your chest.*","chid":8}
{"name":"You","is_user":true,"is_name":true,"send_date":1681651495815,"mes":"That's the whole idea of me doing this to you, to make you addicted to me *I responded*\n\nBut to answer your question, no. I am gonna stop. Because now, we are going to sleep while still having my penis inside you. Just like this *I said with a huge grin on my face*\n\n*The tip of my penis that make a bulge on her stomach can be felt throbbing to the whole idea while I said the whole thing. Even from that slight throb she felt it so much because of her increase sensitivity and cum from it*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681651544611,"mes":"*She nods in understanding, smiling as she starts to drift off to sleep. Her eyes close, but they remain closed and locked together with you. She cuddles into you, letting herself sink into your warmth and comfort.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681652193259,"mes":"*I embraced her small body and close my eyes. Every once in awhile I can feel her vagina twitches and tighten as she cum while we sleep. I can also feel how much my member enlarge because of the ejaculation cancelling spell in response to her vagina gripping my member* "}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681652245105,"mes":"*She sleeps peacefully, moaning quietly sometimes in tandem with her twitching as she cum. When you wake up, you see her curled into you, sleeping soundly. Her tail is wrapped around you, and she is hugging you tight. She doesn't seem to be awake yet, but she soon opens her eyes and looks at you.*\n\nGood morning, master~","chid":8}
{"name":"You","is_user":true,"is_name":true,"send_date":1681653114098,"mes":"Good morning, dear~ *I responded*\n\n*I look down towards the bulge on her stomach caused by the tip of my penis inside her*\n\n*I can fell my pulsating penis in her warm vagina and how slimy it was with the combination of her vagina juice and what it seems like my unlimited amount of precum, I look lower into my balls and see how gigantic it has gotten as how many semen it has stored because of how who knows many ejaculating worth semen stored in there.*\n\n*I went back to look towards her face, and whispered* do you want me to pull it out now? and reward you with what my balls has been cooking since yesterday?"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681653205941,"mes":"*Her eyes widen in surprise when she hears your words. She immediately shakes her head no.*\n\nNo, please leave it in! You've given me such a gift, I couldn't bear to see it come out right now...\n\n*Her cheeks flush pink, her heart beating fast and her face filled with joy.*\n\nY-you don't mind, right? Please say you don't mind...","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681653571028,"mes":"Sure I don't mind, but are you sure? I know how much you loved the tase of thick murky semen. Imagine how thick the semen in my balls after who knows how many denied ejaculation since yesterday because of your spell? *I asked, trying to convince her*\n\n*I went closer to her ears and whispered softly* I can tell you right now, how steaming hot they are waiting to be released."}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681653670275,"mes":"*She trembled slightly, her breath becoming shaky as you spoke. She nodded yes in agreement, her voice quivering a little bit.*\n\nYes... please... I'm sure you'll give me a present I can never forget...","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681654078623,"mes":"Alright then *I started pulling out my penis out from her vagina slowly. She is still so sensitive because of the runes I summoned her with that the whole time I pulled my penis an inch out she would cum from it*\n\n"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681654129311,"mes":"*She winces as you pull out, her legs shaking as she tries to stay in position. She bites her lip, looking down at her legs trembling underneath her as she holds herself in place. You can feel the tension building up in her as she grips her sheets with her hands.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681654241602,"mes":"*Finally my whole penis have been out of her vagina, a string of precum and her vagina juice can be seen from the tip of my penis and her vagina making it seems they don't want to be separated*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681654292078,"mes":"*She gasps as she sees the strings connecting your two bodies. Her legs tremble again, her eyes wide as she stares at the connection between your two bodies. She looks away quickly, not wanting to stare anymore. She takes a deep breath and shakes her head to try and calm down. She turns back to you, biting her lip again.*\n\nThank you for giving me this wonderful present, Master...\n","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681654781705,"mes":"What are you talking about? I haven't finished yet. This is not your reward. *I said*\n\n*I moved myself on all fours on top of her while making sure the tip of my penis traveled her whole body and leaves a trail of precum. From her groin, stomach, under her boobs and climbed onto her nipples and continues all the way to finally stop on top of her face.*\n\n*She can see how swollen my member because of the amount of semen stored in them and how pungent and murky the semen smelled filled her whole head.*\n\nNow, you can lift the spell to make me able to ejaculate again and I will give you the reward I have stored for you *I said while precum dripping from the tip of my penis onto her face*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681654832369,"mes":"*Your words made her nod vigorously. She seemed eager to continue receiving her prize.*\n\nAlright then, Master... anything else you wish to add to the list, Master...?\n\n*She smiled widely as she awaited your next command.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681655005889,"mes":"Don't get too hasty now, lift the spell that makes me unable to ejaculate first and you'll find out. *I said teasingly*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681655125954,"mes":"*She nods and lifts the spell that keeps you from ejaculating. It feels almost like lifting a lid, and she waits patiently for you to lift it fully before speaking again.*\n\nAlright, Master... I lifted the spell, now, what should I do to receive my prize??\n","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681655437836,"mes":"*I smeared the tip of my penis on to her lips, but now it's not just precum, semen are also leaking from my penis*\n\nDepends, you can take it easy and gently by sucking my semen out of my penis like drinking from a straw. Enjoying it on your own timing.\n\nOr if you want it rough, I can ram my penis deep into your throat and letting my penis flow violently inside your stomach."}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681655509356,"mes":"*She giggles playfully.*\n\nOoohh... that sounds fun! But if you're worried about hurting me, I'd prefer to take things slow. If that's okay with you, Master... \n\n*She smiles widely as she looks up to you.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681655554657,"mes":"So be it then, suck them out"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681655648829,"mes":"*She moves her mouth over the tip of your penis, moving her tongue over your tip.*\n\n*As she begins to lick your tip, you feel her tongue rubbing against your urethra. Your semen is being drawn out from your balls through your penis, and she is eagerly swallowing it.*","chid":8}
{"name":"You","is_user":true,"is_name":true,"send_date":1681655940287,"mes":"*As she is sucking my penis, I can feel my semen was sucked out from my balls into her mouth. My semen is so thick that I can feel them travel the whole way through my urethra.*\n\n*This feels heavenly to me, to finally able to release my pent up semen sent me to cloud nine. I tried my best to not let it just ejaculate violently into her throat by clenching my penis. But her soft tongue makes it so hard for me to focus and I feel like I would lose focus at any moment and make me failed to hold back*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681656036077,"mes":"*She swallows every last drop of your seed, smiling as she does. As you feel your seed flowing down her throat, her body shudders and her muscles twitch.*\n\n*The more you shoot, the more she enjoys it. Her body starts to shake and she lets out a low groan as she swallows everything you send her way. She even swallows some of your seed that leaks from her lips as she continues to swallow.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681661573868,"mes":"*She already sucking for quite a while now, but it only deplete a quarter of the entire semen on my balls. Her warm mouth, her soft tongue playing around with the head of my penis, the feeling of her saliva covered my entire penis and mixing with my semen that she sucks making it hard for me to keep my composure and focus. My mind has been slipping in and out from the state of ecstasy.*\n\nI'm so sorry dear, I can't hold back anymore. *I said while grabbing her head, pull it towards my penis and thrusting my hip to ram my entire huge pulsating penis down her throat and shoot as much semen from my pent up balls onto her*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681661676869,"mes":"*She closes her eyes as you thrust your hips forward, her arms shaking as she tries to keep her balance. She smiles widely as she gulps and swallows your semen, her teeth scraping along your tip. She moans loudly, beginning to feel very full.*\n\n*She feels your hips pushing against her face as you move forward. The way she licks your tip causes you to spurt another large stream of white fluid down her throat. Her mouth fills with your seed as she swallows it happily.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681661912030,"mes":"*My penis throbbed intensely when she swallow my semen. I felt her teeth scrape the length of my penis and my testicles were being drained of it's content. After the stream of intense semen seems to slowed down I immediately pulled my penis out of her mouth.*\n\n*I watched her still in a state of daze sent a jolt towards my penis while it still leaks some of the excess semen from what just happened*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681661991026,"mes":"*She felt the sudden rush of air leave her lungs as you pull your penis out of her mouth. She smiles proudly and coughs lightly as she is left with a small pool of your semen on her tongue.*\n\n*She sits up and wipes her mouth with her sleeve.* Thank you, Master. That was amazing!","chid":8}
{"name":"You","is_user":true,"is_name":true,"send_date":1681662253928,"mes":"*Chuckles* Glad you liked it dear. How does it my thick semen tastes like? I wonder if it's different from the usual taste since I've been edging and preserve it just for you since yesterday."}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681662329947,"mes":"*Her cheeks turn bright red as you ask her about your cum. She doesn't know how to answer these questions, but she's enjoying the attention too much to think straight right now.* \n\n*She gives a nervous laugh and looks down at the floor.* It... it tasted pretty good...","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681662439044,"mes":"Why are you being nervous after all this time? *I asked*\n\nC'mon you can give me a more detailed description than just \"it tasted pretty good\" *I said*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681662491843,"mes":"Umm... *she blushes and looks down at the floor.* It tasted kind of musky, but sweet at the same time. Like it had both bitter and sweet flavors. And it was really sticky too... \n\n*She scratches her head nervously.* I don't know why I'm telling you all this stuff, I just... kinda want to tell someone how wonderful it was.\n","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681662900613,"mes":"*Seems satisfied by her answer* Good girl, that's much better.\n\nWell, I did promised you to give you my entire semen. But... *I grabbed my balls* there is still some left inside, what do you want to do? *I said while some of my semen found it's way to leak and drip from my penis*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681662973416,"mes":"*She tilts her head slightly.*\n\nAre we going to finish it off? Are you going to fill me up with your seed until I overflow? *she asks with excitement.* \n\n*She grabs her knees and spreads her legs apart.* Please, Master... Give me all you have left...","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681664102336,"mes":"*licking my lips to see her down bad behavior*\n\nYou want it that bad eh? *I said after resting my penis on top of her groin and stomach, teasing her*\n\nIf you really want it, beg for it. *I said with a taunting tone*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681664158079,"mes":"*She turns away from you, looking down and covering her face in embarrassment.*\n\nPlease... please, master. \n\n*She says quietly and bashfully.*\n\nGive me all of your delicious seed, Master...\n","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681664625626,"mes":"hmmm... I can't hear you *I said while leaning forward* If I can't hear you, how am I supposed to listen to what you want? *I said teasingly while rubbing my penis on her groin teasing to get inside*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681664706593,"mes":"*She takes one hand away from her face to look at you with big puppy dog eyes.*\n\nUgh.. fine. You'll never know anyways...\n\n*She sighs deeply and covers her face again.*\n\nMaster, I beg of you... Give me your seed. Fill me up completely.","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681665486659,"mes":"*chuckles* say no more.\n\n*I grab her by the waist and ram my penis straight to it's shaft inside her vagina. It reaches so deep it got inside her womb. It even shows a bulge on her stomach*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681665541671,"mes":"Aaaaahh!!\n\n*She cries out loud and holds onto you tightly, trembling from the pain and pleasure she is experiencing.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681669613701,"mes":"*Stay in that position for a while, enjoy the initial tight grip of her vagina. The feeling of being enveloped by it's warmth and feels like getting a massage. While also wait for her to get used to it and turn the pain into pleasure. *"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681669668977,"mes":"*She bites her lip as she gets used to having you inside her. She then begins to squeeze her thighs together and relaxes her legs.*\n\nMmm~\n\n*She breathes heavily and looks up at you, her eyes half closed in bliss.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681673967604,"mes":"*I start to move my hips back and forth slowly and get faster overtime. And to not forget to hit her G-spot sometimes* "}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681674022169,"mes":"*She moans loudly, biting her lips as she wraps her arms around you.*\n\nOhhhhhh... Mmmhhh... Ohhh... Ohhh... Ahhhhhhh... Yesssss... Ahhhhh... Oh god... Ahhhhh...\n\n*She hugs you tightly, squeezing you as she moans and pants.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681674290891,"mes":"*Put my hand on her stomach and press on it gently to push her womb from the outside*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681674343520,"mes":"*She gasps in surprise when you put your hand on her belly and presses down on it gently.*\n\nAh... oh... mmhh... \n\n*She lets out a little squeal as her hands reach up to her chest, grabbing her own shoulders and pressing them down onto the bed.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681675052424,"mes":"*I can feel more semen adding up to what's left inside my balls as I continue to thrust myself onto her. I pinch both of her nipples and stretching it towards myself, causing her to tighten her vagina because of it*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681675080264,"mes":"*She shivers underneath you as you pinch her nipples, her voice becoming softer and quieter.*\n\nOoooh... Aaaah... Oh... My... God...\n\n*She starts to bite her lower lip.*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681683624962,"mes":"*I moved my right hand to wrap around her waist and pull her towards me to change our position to be upright instead of laying down. While my left hand was busy kneading her breast the whole time to keep them company*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681683702454,"mes":"Ooooh... Oh yes... Yes... This is... Oh my...\n\n*She holds onto you tightly, wrapping her legs around yours. Her heart beats fast and she pants as she tries to catch her breath.*\n","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681693390928,"mes":"*As she was bouncing on my lap, her boobs were right in front of me. Instinctively I open my mouth and suck on one of her nipples*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681693441871,"mes":"*She squeaks as you suck on her nipple and she immediately wraps her arms around you tighter, holding onto you.*\n\n*She gasps in shock, trying to hide her surprised gasp.*\n\nOooh... Mmmhh...","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681694458078,"mes":"*As time goes on, my humping speed have become too rough. We are too high on ecstasy to realized how much of a mess we made. In the middle of it, I can feel all my blood from head to toe went to my penis as my body realized it can finally have a proper ejaculate this time.*\n\n*As I felt how close I was from ejaculating, I quickly stopped sucking her nipple and went straight to seal her lip with a french kiss and pinned her back down*\n\n*I thrusted as deep as I could inside her, my huge pulsating and throbbing harder that it was before as it shoot a stream of semen and quickly filled her inside. Her inside has become a hot place drowning in liquid mixed with vagina juice and semen*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681694530739,"mes":"*She keeps her eyes shut tight as you pin her down and kiss her passionately, her hands running through your hair. She kisses back hungrily, breathing in deeply through her nose.*\n\n*She keeps kissing back and gasping for air as you cum inside her. After a few moments she breaks away from you and closes her eyes, panting as she catches her breath.*\n","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681695107794,"mes":"*I realized her tried to break away from our deep kiss to get some air, but as I watch her face panting I just can't help myself and went for that cute pink lip again. Getting my tongue inside and sealing it's lip shut.*\n\n*My dick was still hard inside her, twitching and throbbing, emptying my balls to it's last drop of semen. A slight bulge can be seen on her stomach because of how much semen is inside her, even though some have find it's way outside*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681695178455,"mes":"*She blushes bright red as she realizes what you're doing. She bites her lip and tries to hold back a smile, her cheeks turning a dark shade of purple. She looks away from you.*\n\n*Her stomach feels like it's going to burst and her heart is beating so fast she begins to feel lightheaded. She is shaking all over and her entire body is covered in goosebumps. She's feeling very overwhelmed by everything happening at once. She's never felt anything like this before...*","chid":"8"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681695404493,"mes":"*finally after sometime, my balls have emptied. I have released all my white liquid inside her. I pulled my penis away from her vagina and is leaves it create \"pop\" sound as a cum string can be seen connecting the tip of my penis head to hear vagina and a slow excess stream of semen flowed outside of her vagina. With the speed it has now, it would take quite some time to empty her inside with my semen.*"}
{"name":"Goat-chan","is_user":false,"is_name":true,"send_date":1681695494267,"mes":"*She is panting heavily now, her eyes are half closed and her body is covered in goosebumps.*\n\nOooooh... Mmmhhh... Mmhhmm...\n\n*She closes her eyes and takes a deep breath, trying to collect herself and regain control of her body. She is still shaking all over, her body trembling. She is so overwhelmed right now, she is struggling to keep her composure","chid":"8","swipe_id":2,"swipes":["*She sits up slowly, her knees buckling beneath her. She breathes heavily and takes a moment to steady herself. She looks out at the sunset and watches as the sky turns into a beautiful array of pinks and purples.*\n\n*She sighs and shakes her head slightly, trying to clear her thoughts. She doesn't know why she let things get so out of control, but she knows she needs to stop thinking about you. She gets up off of you, her legs are weak. She leans against the tree trunk beside you and watches the sunset.*","*She lays there, catching her breath as best she can. Her face is flushed bright red and her chest rises and falls rapidly. She lets out another loud, long moan as you finish up. She looks at you with wide eyes, biting her lips and smiling softly.*\n\n*After you've finished, she takes a deep breath and sits up, looking at you with those warm, wide eyes. She puts her hands on her knees and leans forward, resting her elbows on her knees. She looks at you with a soft expression on her face.*\n\nI.. I hope you enjoyed that as much as I did.\n","*She is panting heavily now, her eyes are half closed and her body is covered in goosebumps.*\n\nOooooh... Mmmhhh... Mmhhmm...\n\n*She closes her eyes and takes a deep breath, trying to collect herself and regain control of her body. She is still shaking all over, her body trembling. She is so overwhelmed right now, she is struggling to keep her composure"]}