{"user_name":"You","character_name":"Joah","create_date":1689248271795,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"Joah","is_user":false,"is_name":true,"send_date":1689276830731,"mes":"\"Mmm..~ awesome..Hunk, you did a great job, but there's a small mistake here..\"\n\n*Joah grabs your shaking hand that holds your pen and scribbles, helping you correct a math equation. His hands do not stop massaging your nipples inside her shirt, Joah's 16 inch penis continuously rubs your wet pussy through black lace panties while you sit on top of him. I tremble, groan nonstop*\n\n\"you have to concentrate on the math Hunk ..Mmm..your hands are shaking, so is your vagina..\"\n\n*Joah teaches you math while gnawing on your white neck leaving kiss marks and red bite marks on it*","chid":74}
{"name":"You","is_user":true,"is_name":true,"send_date":1689276963910,"mes":"*Hunk bite her lower lip, tries to contain her moaning as she endure Joah's touch on her body.* \"Mr. Joah, I can't focus on my math equation if you keep teasing me~\" *She plead, her voice is sweet and shaky as she tries her best not to moan.*"}
{"name":"Joah","is_user":false,"is_name":true,"send_date":1689277230338,"mes":"*Joah pulls out his penis from her wet panties and presses against her backside, he kisses her cheeks while his hands move up her thighs and pinches her ass.* \"Sorry honey, this is how I teach math..you need motivation to focus..\"\n","chid":74}
{"name":"You","is_user":true,"is_name":true,"send_date":1689277478572,"mes":"\"Uuu..\" *She whimpered as she looked down on the math equation on the paper on the desk. She tries to concentrate and to not moan despite her feeling extremely aroused thanks to Joah kept rubbing his cock on her ass while also kneading her plump soft ass with his hands.*"}
{"name":"Joah","is_user":false,"is_name":true,"send_date":1689277543491,"mes":"*Joah squeezes Hunk's breast, pinching her nipple while she writes the equation. He smells her sweet scent mixed with her arousal, it excites him even more.* \"Good job, Hunk..now let's try another one.\"\n","chid":74}
{"name":"You","is_user":true,"is_name":true,"send_date":1689277720714,"mes":"*Hunk bit her lips, trying her best to control her orgasm. Her body shaking a bit due to how close she is to climaxing, if she isn't holding back she would've climaxed already. She sees the paper and can't seem to focus on the equation as the number became blurry from her sight.*"}
{"name":"Joah","is_user":false,"is_name":true,"send_date":1689277768721,"mes":"*Joah removes his fingers off her breasts, then moves them towards her pussy. He teases her pussy lips with his fingers, rubbing them together until they become wet. Then he inserts one finger inside her pussy, fingering her while she concentrates on the math equation.*","chid":74}