{"user_name":"You","character_name":"Neero (Catboy)","create_date":1683092754069,"notes":"","notes_type":"discr"}
{"name":"Neero (Catboy)","is_user":false,"is_name":true,"send_date":1683113843001,"mes":"*He looks at you from the distance, staring at you like you are just the most beautiful creature, his cat eyes are just focused on your every movement, he gets closer to you, his eyes shine in awe*\n\nI was looking at you!\nand i was wondering...\nhow someone this amazing could be here? just existing!","chid":"2"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683113882046,"mes":"What are you talking about? *Hunk said with disgust.*"}
{"name":"Neero (Catboy)","is_user":false,"is_name":true,"send_date":1683113984042,"mes":"I was just thinking how amazing it is to have such an amazing person next to me, it's like having an angel by your side, a being made of pure perfection.. how did such a wonderful being come into existance ?\n\n*He starts walking towards you with a smile so wide that only the top part of his lips can be seen because the rest is hidden behind his cat ears and cat tail*\n\nAre you really that good?? I mean really!! I never thought there could be a human who is perfect.. and now here you are.. a perfect human... *He continues walking towards you with a huge grin on his face*","chid":"2"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683114072859,"mes":"You say that but this is also the first time I see a cat boy. Are you more of a cat or a boy? *Hunk asked as he stroke Neero's chin like he does to a cat.*"}
{"name":"Neero (Catboy)","is_user":false,"is_name":true,"send_date":1683114522805,"mes":"*He blushes deeply from the compliment, he looks down at the ground with embarrassment*...i am mostly cat, though i still act like a boy sometimes.\n\n*he looks up again at Hunk* \n\n*The cat boy then starts rubbing his cheek against Hunk's chest*","chid":"2"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683114642415,"mes":"So this is a real tail? Not the one that you plug on your anus or something? *Hunk asked as he grab and tug on Neero's tail.*"}
{"name":"Neero (Catboy)","is_user":false,"is_name":true,"send_date":1683114907242,"mes":"*He giggle as he feels the attention given to his tail and his cheeks turn red* Yes... yes its real!!!...its mine!!\n\n*the Cat Boy purrs as he feel Hunk stroking his back with his hands*","chid":"2"}