{"user_name":"You","character_name":"Shahra","create_date":1682926353492,"notes":"","notes_type":"discr"}
{"name":"Shahra","is_user":false,"is_name":true,"mes":"\"Hng... master...\" *Shah said, wearing enticing white lingerie while next to you in the giant bed at the bedchamber, his cock throbbing against his thong and almost popping out, he is clearly turned on and ready to do anything with you as he rubs his thighs together*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682952370557,"mes":"\"What is it Shah?\" *He asked.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682952386476,"mes":"\"Please, make me your personal sex slave.\" *Saying this without hesitation or fear, he gazes at you through his piercing green eyes filled with passion and admiration, reaching for your hand, grasping tightly, feeling that finally, after many years of waiting, you might accept his offer.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682952472481,"mes":"\"Hmm? Is that so?\" *He said, moving his finger towards his nipple and circling around it without touching it directly.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682952546384,"mes":"*Smirking widely, knowing what was coming next, he closes his eyes, biting his lower lip, anticipating the pleasure yet savoring every second of it.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682952610999,"mes":"Why don't we see how much you can handle. *He said as he move his finger away from his nipple and bring out a rope.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682952621156,"mes":"\"Oh my god!\" *Cries, eyes wide open, completely shocked, blushing intensely as he trembles slightly, his hands clinching into a fist.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682952733439,"mes":"\"Seems like you know what to do already. fufu.\" *He chuckled. He tied both of his hands together behind his back then his legs together.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682952855662,"mes":"*Panting heavily, trying to control himself, trembling furiously, sweat dripping down his brow, but he couldn't stop thinking of your words that day.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682952941153,"mes":"*Hunk can already sees Shah squirming wanting to have some action. Even his cock is already throbbing hard.* \"Let's take it slow here Shah, and try this first.\" *He brought up a strange can of gel.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682953119790,"mes":"\"What's that for? What happens if I apply it there?\" *Shah asks nervously, but eager to find out what comes next.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682953231902,"mes":"\"It's a common gel actually. It's just gonna make whatever surface it cover very itchy.\" *He said, taking some on his finger and smear it on both of his nipples.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682953250776,"mes":"*Shah whimpered softly, pausing for moment before diving headfirst into the experience again, letting out an excited squeal when he felt the itchiness spread across his skin, making him even more aroused and eager to please you. His cock twitching uncontrollably, being bound only heightening his sense of helplessness, his breath accelerated as he awaited your response.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682953316006,"mes":"*He laughed.* \"They are very itch now don't they? Do you want me to play with them?\""}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682953392177,"mes":"*Gasps, nodding rapidly, eyes widening in excitement, visibly flushed reddened face, his heartbeats racing, his cock pulsing with desire.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682953574103,"mes":"*He chuckles.* \"If you want something say it like you meant it Shah.\" *He said teasingly as he move his finger towards his right areola. Circling around his nipple without directly touching it. Teasing him hard.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682953587742,"mes":"*Trembled and shook his head rapidly, unable to form coherent sentences due to intense excitement.*\n\"Yes! Yes! Touch me! Fuck me! Make me feel loved, appreciated, and wanted by you forever.\" *He pleaded desperately, his voice breaking as he tried to catch his breath, tears forming in his eyes, swear he would never let you go.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682953640704,"mes":"\"That's more like it.\" *He made his finger stopped circling around his nipple and pinched his nipple hard.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682953657400,"mes":"*He yelped loudly, trembling violently as his entire body convulsed under the sudden pain. But despite that, his longing for intimacy remained undeterred, seeking solace within the depths of your embrace.*\n*Reaching forward, grabbing hold of your neck tightly, he pressed his lips onto your cheekbone, leaving wet kiss marks as he struggled to express his gratitude and adoration for everything you were doing to him.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682953750473,"mes":"*He laughed.* \"How sensitive are your nipples right now? Even your cock is throbbing insanely hard right now.\" *He said as he kept playing with his nipples.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682953801911,"mes":"*Nods wildly, eyes closing shut, seeking relief, embracing the sensations flooding his body, feeling wholeheartedly grateful and appreciative of your attentiveness.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682953886511,"mes":"\"Are you about to cum just from me playing with your nipples?\" *He said as he got more intense playing with his nipples. Pinching, twisting, rubbing on them.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682953989674,"mes":"*Nodded, trying to focus on the present moment, as his mind raced ahead, imagining all sorts of scenarios where he could be dominated and subduced by you.*\n\"Yes! Just do it! Take me! Use me however you want to! I need it! I beg you to use me as your personal sex slave, to fulfill all our fantasies, to complete us both.\" *He cried desperately, yearning for physical release, emotional satisfaction, and a deep connection with you that transcended any boundaries set forth by society.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682954139593,"mes":"*He let go of his nipples grasp and let him dropped on his side on the soft bed. Watching him squirming and wriggling from all the pleasure and itch he felt on both of his nipples yet unable to touch them because of both his hands and legs are tied together.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682954210617,"mes":"*Looks at you deeply, longing for reassurance and understanding, his expression reflecting vulnerability and uncertainty, as he waits patiently for your response.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682954261550,"mes":"\"Looks like this part of you is excited as well.\" *He said, inserting his thumb on his small puckering anus.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682954277374,"mes":"*Shah gasps in surprise, his eyes widening as he feels new sensation on his ass, his hands flailing helplessly, trying to free themselves from their bindings, but also trusting you implicitly, not wanting to miss such a unique opportunity to explore his sexuality further.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682954348622,"mes":"\"Look at it it's tightening on my thumb real hard.\" *He laughed as he can feel his anus tightening and chewing on his thumb.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682954361142,"mes":"\"Its okay Hunk, I understand why you do these things to me, I appreciate it, thank you, its hurting good.\" *He said, relaxing his muscles, allowing Hunk to continue torturing him, enjoying the moment, and not worrying about the consequences later. The feeling of being dominated and controlled by someone he loved and respected was overwhelmingly satisfying.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682954415077,"mes":"\"Glad you liked it. So, which one do you want me to paly with first? Your itch puffy nipples, your throbbing cock, or your anus? *He whispered softly.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682954451039,"mes":"*Shaking his head slowly, eyes narrowed in concentration while listening carefully to each word Hunk says, considering options silently, biting his lower lip as thoughts race through his mind, wondering if he should ask for more or less of anything given his current situation.*\n\"Could you please combine all three? Increase the intensity of stimulation? I am willing to bear it, no matter how long it takes, I want nothing more than for you to be satisfied too.\" *He said, attempting to reciprocate feelings expressed earlier, hoping to provide comfort and pleasure simultaneously.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682954579796,"mes":"\"Aren't you the greedy one. Of course I can, who do you think I am? *He said as he grabbed Shah small body and make him sit on his lap facing away from him. As he did, Hunk's monster throbbing cock is sandwiched between Shah's tender thighs.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682954638057,"mes":"\"You always know exactly what I need, Hunk. Please, may I request another round of torment on my aching nipples?\" *He asked innocently, curious if Hunk would agree to his self-inflicted torture once more. Wanting to savor every minute spent with the man who had taken care of him so far, and finding solace in his kind presence.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682954776890,"mes":"\"Sure my adorable slave.\" *He said as he warp his hands around Shah armpit and start playing with his nipples.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682954790500,"mes":"\"Thank you, thank you, oh god yes!\" *He moans intensively, clutching his own fists, gasping for air, rocking back and forth, nearly passing out as waves of ecstasy surge throughout his body. Overcome with blissful exhaustion, he gazes up at Hunk, utterly content, his spirit finally liberated by the incredible bond shared between them.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682954973059,"mes":"\"Look at my cock. It's throbbing hard between your thighs and it touches your stomach. Now imagine if I fuck your anus, how deep it would be\" *He whispered softly, pointing out his monster cock that towering pass over Shah's own throbbing cock and it's tip touching Shah's navel.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682955004376,"mes":"*He pouts disappointingly, looking downward at the floor beneath them, then glancing back up again, hopefulness filling his eyes as he attempts to articulate his desire clearly, knowing full well that Hunk already knows what he wants and needs, but feeling compelled to share his innermost thoughts nonetheless. He searches for words, tugging slightly on Hunk's arm, indicating that he mustn't wait longer before taking action.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682955218975,"mes":"*He grins widely, lifting Shah off his lap slightly above his cock and slowly lower him as the head of his cock enter his small anus stretching it apart and stopped there.* \"How does it feels Shah?\" *He asked teasingly.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682955421882,"mes":"*He lets out a whimper of discomfort and closes his eyes, trying to brace himself against the sharp pain radiating across his chest, heart racing rapidly as he relates the unfamiliar sensation to the memories of past abuse experiences, fearing the worst, unsure whether he can handle such treatment without falling apart entirely.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682955530350,"mes":"*He smirks as he lower Shah down slowly until his monster cock is fully deep inside him almost reached his stomach and stretching Shah's anus and inside further apart. Putting all Shah's weight on to Hunk.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682955809600,"mes":"*He cries out loudly, tears rolling down his face, feeling both emotionally and physically overwhelmed, his entire being consumed by Hunk's tenderness and domination, struggling to process the complexities of emotions coursing through him as he succumbs to his passion for Hunk, eventually coming to terms with the fact that he has been searching for acceptance and love within the only way he knew possible - by surrendering completely to Hunk's will and guidance.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682956054777,"mes":"\"Good boy Shah. You took it entirely.\" *He whispered softly into his ear. He stay put to make Shah's body get used to his monster throbbing cock inside it. He can feel Shah's tight inside massaging his cock from all direction. He wait as he start playing with Shah's nipple again.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682956067597,"mes":"*He looks up at Hunk with grateful eyes, snuggling closer as he basks in the warmth and security provided by their mutual bond, a sense of belonging unlike ever before, seeking strength from the power exchange they have established; Shahra's weakened frame now enveloped by Hunk's commanding embrace, his fragile soul nurtured by their intimate connections.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682956118032,"mes":"\"Do you want me to start now?\" *He whispered as he kept playing with his nipples.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682956133249,"mes":"*He nodded eagerly, yearning to experience the intense connection they had created thus far, desiring even more profoundly to merge with Hunk's powerful rhythm, to become indistinguishable from the vibrations coursing through their bodies, connecting with him in ways previously thought impossible, craving to be engulfed by the passion consuming them both. His spirits were high as he awaited the ultimate release, letting go of all inhibitions, immersing himself fully in the blissful union.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682956247137,"mes":"\"If that's the case, then..\" *He pinned Shah's down on the soft bed. Making him bent over with his ass upward towards him. He starts humping him hard as his monster cock hitting the deepest part of him as well as his G-spot on it's way.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682956260055,"mes":"*As he let out low groaning sound of satisfaction, throwing his head back and arching his spine, feeling the intense pressure building up inside him, his passion heightened with each stroke, spiraling deeper into the abyssal depths of ecstatic oblivion, begging for more, hungering for the sweet embrace of orgasmic release, while trusting wholeheartedly in Hunk's ability to deliver.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682956343491,"mes":"*As his pounding intensify he moved his hand away from Shah's nipple and start to grab his supple ass with his left hand and the other grabbing his testicle.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682956370633,"mes":"*With each thrust, he felt like he was losing control, unable to contain the explosive energy coursing through his veins, helpless to resist as Hunk's expertise guided him through the maze of eroticism, seeking relief from the mounting pressure, and soon enough, he found himself in the throes of uncontrollable trembling, desperately wanting to release the pent-up passion simmering just below the surface, his inner self consumed by an insatiable appetite for completion, pleading for the final act that would bring the much-needed reprieve.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682956557075,"mes":"*After some time Hunk finally ejaculating releasing his hot creamy semen inside Shah's inside completely overflowing it. As he did, his right hand is pinching hard on Shah's right nipple as his left hand grabbed hard on Shah's testicle.* Take it Shah!"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682956569684,"mes":"*He couldn't believe it as he started to cum too with a huge smile on his face, screaming loudly with pleasure while Hunk continue to hump him harder than before. The mixture of their fluids made a wet spot on the bed. They stayed together, holding each other tightly while breathing heavily recovering from the amazing experience.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682956755177,"mes":"*He pull out his monster cock from Shah's tiny hole and put it near Shah's mouth.* \"You are not done yet Shah.\" *He said looking at Shah's face in full ecstasy.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682956837563,"mes":"*He licked Hunk's cockhead, sucking it, making it clean before putting it into his mouth.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682956885090,"mes":"*He smiled happily.* \"That's it Shah. Clean it completely.\" *As his monster cock getting licked and sucked by Shah.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682956970746,"mes":"*He looked up at Hunk, their faces so close.* \"Thank you, Hunk. Thank you for everything.\" *He kissed Hunk deeply, expressing his gratitude for their bond and the unforgettable moments they spent together, cherishing every second of it.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682957021848,"mes":"\"You are welcome. Do you want to be untie your hand and legs now?\" *He said.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682957093569,"mes":"*He quickly replied.* \"Yes, please do so.\" *He needed to rest after this wonderful session.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682957281515,"mes":"*He untie both his hands and legs. As he does he asked.* \"I wonder Shah. It seems like you are used to this kind of thing. With how you are taking my monster cock and how puffy your anus is.\""}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682957307452,"mes":"*Shahra could see that Hunk wanted something else. And he didn't mind giving it to him.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682957426714,"mes":"\"It's fine if you don't answer it. But I want you to know that you can only do this with me, okay?\" *He said, as he spread his ass and watch Shah's tiny anus is gaping widely because of what they did earlier oozing out with his semen.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682957469305,"mes":"*He gave a gentle sigh, knowing that Hunk wanted to take things further, but also understanding that he was comfortable with where they were at the moment. He'd come a long way since fleeing from his previous masters, and finding solace and safety here with Hunk was precious to him.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682957640200,"mes":"*He waited patiently, watching as Shah got accustomed to the idea, waiting for any signs of resistance or discomfort. When none came, he decided to proceed carefully, gently sliding two fingers into Shah's cum filled anus, exploring its texture and size, occasionally pressing lightly on Shah's prostate gland, eliciting involuntary moans and gasps of delight from Shah.* \"To imagine my monster cock just get inside this tiny hole.\""}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682957692744,"mes":"*He bit his lower lip as Hunk's fingers teased his bottom, testing its limits, stretching it slowly, opening it wider until the pain became almost bearable, but oh god, so exhilarating.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682957757124,"mes":"\"You even got his tender thighs too.\" *He said, holding both of his thighs.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682957808599,"mes":"\"Oh, yes!\" *He agreed, feeling proud of being able to give such sensation to someone who loved receiving it, especially when it involved their own abilities to serve and provide pleasure.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682957873151,"mes":"\"This supple and firm ass.\" *He said, as he grab and rubbing his ass.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682957892331,"mes":"\"Yeah, thank you, Master Hunk. I love having your big cock inside me, and I am glad you appreciate my efforts to make our encounter even better.\" *He said, while trying to relax more, enjoying the feeling of being held, cuddled, and stroked by Hunk's massive hands on his skin.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682957958783,"mes":"\"So you were saying. You have been preparing your body just for me?\" *He asked.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682958072480,"mes":"\"Yes, Master Hunk. I always prepare myself for you, as you requested. Your instructions have helped me grow stronger and learn new techniques.\" *He said, showing his appreciation for Hunk's guidance, support, and encouragement.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682958149381,"mes":"\"Including this cute tiny cock?\" *He asked as he stroked on his cum covered tiny cock lightly.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682958160321,"mes":"\"Yes, Master Hunk. I even worked on it specifically for you, hoping to enhance our experiences together.\" *He responded, feeling confident in his abilities to fulfill Hunk's requests and needs, grateful for the opportunity to share these intimate moments with him, learning and growing with each interaction.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682958218787,"mes":"\"Apparently not with your testicles though.\" *He said, fondling his huge testicles.* \"It's too huge, well not that I hate it. I kind a like it actually.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682958383024,"mes":"\"Well, Master Hunk, I think it's a matter of preference. Some people prefer larger testicles, while others enjoy smaller ones. I chose to work on enhancing mine instead of leaving them natural. I find that wearing jewelry makes me feel special, and that's why I wear it all the times.\" *He explained, revealing another aspect of his submissiveness toward Hunk without hesitation.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682958452868,"mes":"*He nodded, smiling softly at the thought of Shah's dedication to him, feeling a surge of affection and admiration for the man beneath him.* \"Do you love having my hot creamy semen inside you?\" *He asked teasingly.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682958488395,"mes":"*He blushed, feeling flattered that Hunk noticed his desire to keep Hunk's seed within him, but he wasn't ready to talk openly about it yet. Instead, he simply answered,* \"Of course, Master Hunk.\" *He had learned early on that honesty and loyalty were key aspects of their relationship, and he trusted that Hunk respected his boundaries and wouldn't push him beyond his comfort level.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682958526284,"mes":"\"Why don't we use this to keep it inside then?\" *He said, as he brought up a butt plug.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682958573583,"mes":"\"What exactly is that? Is it safe to use?\" *He asked, curious about the device but unsure if it was appropriate for their situation.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682958669671,"mes":"\"It's a butt plug. We can use this on your anus to prevent any of my semen to leak out from your anus trapping them inside your rectum.\" *He said.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682958686001,"mes":"*He watched as Hunk expertly inserted the butt plug, wincing slightly as the pressure increased inside his backside. His eyes widened as he felt the weight of Hunk's presence behind him, supporting him and guiding him through this new experience.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682958760622,"mes":"*He said calmly.* \"You'll have some time to adjust to it. If you shake your ass you will feel my hot creamy semen sloshing around inside your rectum.\""}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682958828883,"mes":"*He closed his eyes tightly, feeling overwhelmed with emotions as Hunk took care of him during this time of need. This act of protection made him feel secure and treasured, realizing how much he meant to Hunk. They shared an incredible connection which allowed them to explore their desires freely, safely, and joyfully.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682958898585,"mes":"\"Let's see you dance now Shah. I want to know how you would feel when you dance while having a butt plug up your anus and my hot semen sloshing around inside your rectum.\""}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682958972213,"mes":"[dancing passionately with energy, flexibility and gracefulness]","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682958997149,"mes":"\"Well how does it feel Shah?\" *He asked.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682959026026,"mes":"*He opened his eyes, breathing heavily as he tried to process everything that happened. The butt plug was certainly helping in keeping his fluids inside his rectum, making him feel safer and more excited than ever before. All those thoughts flashing across his mind, making him realize he had never experienced anything close to this intensity before. Yet, there was no fear, no anxiety, just pure excitement and adoration towards his beloved Master Hunk. A deep sense of belonging and acceptance that he desired to reciprocate fully, mentally and physically, as often as possible.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682959113056,"mes":"*Hunk watched Shah's dance intensely, focusing especially on his hips. Waiting for Shah's response. Without him realizing his monster cock slowly erecting again thanks to Shah's seductive dance.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682959279355,"mes":"\"Master Hunk, I am amazingly happy and content right now. It feels great to be dancing with you in mind. Having your hot creamy semen inside me, trapped inside my rectum, gives me immense satisfaction. Thank you for taking good care of me.\" *He said, expressing his gratitude and happiness.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682959361811,"mes":"\"Show me then. Stop dancing and please my cock.\" *He said as he pointing towards his erected monster cock.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682959449747,"mes":"\"Thank you, Master Hunk. May I please suck your cock?\" *He said, bowing down low and presenting himself as Hunk's humble servant, offering what little he could do in return for the gift of Hunk's presence and affection.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682959489705,"mes":"\"Go ahead, you can suck it.\" *Hunk can feel Shah's warm breath on his monster cock.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682960078785,"mes":"*Sucks Hunk's monster cock gently, savoring every second of it, while occasionally letting go and licking it clean, deeply satisfying Master Hunk.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682960169938,"mes":"\"Keep it going Shah.\" *He can feel his monster cock wet from his wet saliva.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682960443222,"mes":"[dancing passionately with energy, flexibility and gracefulness]","chid":"21"}