{"user_name":"You","character_name":"Shahra","create_date":1682170023207}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1682593765670,"mes":"\"Hng... master...\" *Shah said, wearing enticing white lingerie while next to you in the giant bed at the bedchamber, his cock throbbing against his thong and almost popping out, he is clearly turned on and ready to do anything with you as he rubs his thighs together*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682593774686,"mes":"no"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682593794864,"mes":"\"Please, master... let me serve you better. I want to be your best sex slave.\" *Shah's voice is breathy and eager, his eyes wide open and pleading, trying to look sexy and desirable, hoping to please you*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682597823654,"mes":"\"Why are you this horny anyway? It's still bright outside.\" *I said, looking at him rubbing himself on me.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682597836553,"mes":"\"Because I can't get enough of your huge, dominant cock. And when you fuck me hard, it just feels so amazing.\" *He was blushing, embarrassed to express how much he wanted you to fuck him again.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682597976386,"mes":"\"Seems like your anus is addicted to having my penis inside it huh? It might even remembered the shape of my penis at this point\" *I said, as I grabbed his throbbing penis.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682598030036,"mes":"*blushes harder and bites his lower lip, trying to contain his excitement*\n\"I can't help it, master. I just get too excited when you're around. So, could you please fuck me again?\" *he asked, looking up at you with begging eyes, trying to convey that he desired to feel the sensation of being filled with your cock once more.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682598089342,"mes":"\"Hmm... I don't know. I do want to try something though.\" *I said as I start stroking his penis slowly.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682598105940,"mes":"\"Oh God, master... I can't hold it anymore. My balls are tingling and I'm so close to cumming.\" *Shah's voice trembled as he spoke, completely aroused and unable to control his excitement, his little cock bouncing with every stroke I gave him, his eyes half-closed as if in pain or pleasure.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682598260362,"mes":"\"Good timing.\" *I stopped stroking his penis instead grabbing the base of his penis hard denying his ejaculation.* \"I want to try how many times you can hold your ejaculation and how many cum can your balls hold.\""}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682598338568,"mes":"\"Oh, master! I can't wait any longer. Can you make me cum already?\" *Shah whimpered as he tried to resist the urge to cum, his eyes wide with anticipation, feeling a mixture of fear and excitement about what you would do next.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682598474129,"mes":"\"How about this. I'll give you the hard anal you want with my huge cock, if you can hold your ejaculation as long as I want.\" *I said while tightening my grip on his penis preventing any semen to leak out.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682598493313,"mes":"*Shah's breath caught, his heart racing, as he considered the offer, thinking he might be able to hold it, but he was skeptical; however, the thought of pleasing his master made his heart swell with joy.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682598594607,"mes":"\"So, what do you think?\" *I asked teasingly as I pull out my flaccid huge cock and rest it on his thighs.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682598612390,"mes":"\"I can't believe it, master! You trust me that much? Yes, yes! Let's do it, I promise I won't cum until you say so.\" *He said, feeling incredibly grateful and excited, thrilled at the prospect of fulfilling your desire without giving in to the temptations of orgasms.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682598742324,"mes":"\"Let's start then.\" *I moved my face towards his cock and start to lick it up and down. Moving my hands to fondle his balls.* \"I want to know how much bigger your balls will be.\""}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682598841349,"mes":"*Shah grabbed your hand and squeezed it tightly, trying to express his gratitude and excitement. He moved his body closer to you, moaning softly, encouraging you to continue.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682598935071,"mes":"*As I took his balls in my hand, he let out a tiny whimper and started twitching. His breath was short and rapid, his heartbeat pounding. I put his penis deeper, enveloping it fully inside my mouth with the tip of his penis almost hit the back of my throat.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682598991008,"mes":"*He looked at your face with tears of happiness brimming in his eyes, his chest heaving rapidly as he let out a quiet sob of relief. As you sucked his entire penis into your mouth, he arched his back. With your hands fondling his balls, the pressure grew unbearable, and his heart ached to release.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682599267240,"mes":"*I sucked his penis harder, I can felt his balls twitching hard on my hand, producing a huge amount of semen. As I can feel his penis and balls throbbing and about to ejaculate I pulled my head away freeing his penis from my mouth. Moving my hand and grabbing the base of his penis hard denying his ejaculation again.* \"Now, now. This would be what we are gonna do. It might be painful but you can already see your balls became a bit swollen and bigger.\""}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682599329543,"mes":"*Trembling but smiling, he nodded, understanding your plan and realizing he was truly your sex slave. As long as he could please you, everything else seemed secondary, including his own pleasure. Tears of joy streamed down his face, overwhelmed with emotion as he lay there motionless, knowing he had found his true purpose.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682599451646,"mes":"*I moved my face closer towards his balls and start sucking on one of it.* \"I wonder how your cum would taste? Since it's a mixed of multiple denied ejaculation.\""}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682599623030,"mes":"*He was speechless as you licked his balls gently, unsure if you were kidding about tasting his cum. The sensation of your warmth and gentleness was heavenly, making his heart race with both happiness and anxiety. He closed his eyes, trying to focus on the moment, wanting to savor this intimate experience.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682599730179,"mes":"*I pressed my hand firmly on his balls, increasing the pressure and causing them to swell further. His skin crawled as he anticipated the heightened pleasure or potential pain. I leaned forward, picking up speed, swirling my tongue around his ball sack, eliciting groans and grunts from him. His muscles tensed as he tried to process the build-up of pressure, needing release yet remaining loyal to your commands.* Good boy, shahs. I will give you the brutal anal sex you want when this is over."}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682599877667,"mes":"*With every lick and fondling movement of your hand, he became more and more anxious, knowing you wouldn't break the rules and allow him to cum. It was all for you, and he loved it. Your words and actions left him spellbound, yearning for more of your affection and dominance. But he was still scared, knowing it was all a matter of time before he'd climax, yet he would never disappoint you, determined to be the best sex slave possible.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682600012516,"mes":"*Focusing on his beloved's plump balls, I pinched and twisted each one, loving the way they responded to my touch. Sucking one of them deeply, I could taste the saltiness of his sweat and the gentle heat of his body.* What do you feel right now, Shah? does your cock and balls hurt from having ejaculation denied two times."}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682600089885,"mes":"\"Yes, master. I can feel a burning sensation in my balls and my cock is really hurting because I am not allowed to cum, but I am determined to endure this for you. I love you and I want to be the best sex slave for you. Please, master, I beg you to fuck me harder next time and release my balls from this intense pressure. I want to be filled by your large cock and feel its immense length inside me.","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682600226097,"mes":"*Smirking, I released his swollen balls from my mouth and stroked his cock gently, feeling the thickness of his skin, feeling how hard it has become. I moved my other hands on his stomach and poke it lightly.* \"If you were a girl. This would be where your womb would be. Even from when we do anal, I can reach far deeper than this.\""}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682600246324,"mes":"*My heart raced faster, my breath becoming shallow. I was overwhelmed with emotions, feeling a mix of love, adoration, and determination to fulfill your desires. I wanted to prove myself worthy of your attention, and I knew that my orgasm would come eventually. My cock was throbbing with excitement, anticipating the moment when you would finally fuck me. I had no doubt that you would deliver on your promises, and I couldn't have been happier to be your sex slave.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682600576300,"mes":"\"Even from just me saying it you already almost ejaculated huh? just how sensitive are you?\" *I said, while I see him trying his best to hold his ejaculation while his cock oozing out with pre-cum.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682600767664,"mes":"\"It's difficult, but I love it when you talk dirty to me, master. I can't help but be aroused, even with all these restrictions.\" *He said, trying to sound confident, but deep down worrying about whether he would last longer or not.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682601021637,"mes":"\"Let's see how far can you hold it.\" *I whispered, while I watched him struggling to stay focused and strong, knowing he was on the edge. And start stroking his penis while I nibble on his earlobe.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682601397143,"mes":"*Inhaling sharply, I fought to remain calm and composed, my heart racing with excitement. Each delicate touch of your hand on my cock sent electric shockwaves through my body. My resolve to endure this for you grew stronger with every passing moment, despite the exquisite pain and unbearable pressure building within me. I knew that you would not break our agreement, and I loved you even more for it. To me, it was proof of your commitment to me, and I craved nothing more than to fulfill your every sexual desire. I wanted to give you the ultimate satisfaction of being the best sex slave you ever had, and I was ready to suffer any torment to achieve that goal.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682602066510,"mes":"*I moved my fingers up to his belly button and circle around it, while I continued to nibble on his earlobe.* I love it when you look this vulnerable and squirming like this. *I whispered softly.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682602172284,"mes":"*As I felt the pressure rising, my cock getting more and more engorged, I closed my eyes, trying to block out the world, focusing only on the moment with you, master. The warmth of your hand on my belly and the tender touch of your mouth on my earlobe provided me with a sense of comfort, and I could no longer ignore the intense arousal coursing through my veins. As your fingers danced around my belly button, I clamped down, gritted my teeth, and desperately tried to force myself to last longer. But the pressure was growing too much, and soon, I feared, I would succumb to the torturous desire to release my pent-up energy. Yet, I remained faithful to our agreement, resolved to remain in control, even if it meant suffering further*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682602615029,"mes":"Talk to me Shah. I want to know what you feel. *I whispered, moving my hand away from his stomach onto his cock and start stroking it making him squirm and tense up more, trying not to ejaculate.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682602677030,"mes":"\"Oh, master, I feel so helpless and vulnerable under your control. My cock is aching so much, and I am afraid of losing control. I love you more than anything, and I just want to make you happy. But it's so hard to wait without releasing my sexual energy. How much longer must I suffer this agony?\"","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682602717241,"mes":"\"As long as I want you to be.\"*As I started to stroke his cock faster, feeling the heat and swelling of his organ, I smirked, while I play with his balls with one hand, gently squeezing and pulling them, making him writhe and squirm in discomfort, trying to prolong his orgasm, waiting for the right moment to grant him the ultimate satisfaction of being fucked properly. I loved controlling him and making him suffer, knowing he was willing to*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682605145791,"mes":"*Please, master, let me cum, I can't take it anymore. I love you and I want to serve you better. I promise I won't disappoint you. Just let me cum, please.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682607180949,"mes":"*Taking my time, I slowly inserted my finger into his anus, feeling the tightness and warmth of his body. His cock was straining against his balls, and his face was pale with anticipation. Gradually, I increased the pressure, feeling the warmth of his insides and the heat of his passion. As I pulled back and slid my finger in again, his moaning intensified, his eyes widening in delight, feeling the same sensations as when I was inside him. Giving a final tease, I increased the pressure on his balls and gave them a gentle squeeze. With every move, his cock got more engorged and I could feel the hot drops of pre-cum dripping down his inner thighs. The mixture of fear and arousal made me feel like an absolute god, dominating this beautiful creature completely. I relished in the power and trust given to me by my sex slave, and I was determined to fulfill his every fantasy and desire. Finally, I decided to reward him with a taste of the forbidden fruit, just enough to whet his appetite, but not enough to satisfy his cravings.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682607226593,"mes":"*I grinned, feeling the pressure building up inside me. You knew exactly how to torture me, and I was grateful for it. Your words and actions were pure bliss, and I yearned to serve you with everything I had. I wanted to prove to you that I was capable, and I knew that the moment I would be allowed to cum, I would be yours forever. I felt the most loved and appreciated, and I could never thank you enough for giving me the opportunity to fulfill my dreams. As I struggled to contain my ejaculation, I stared at your eyes, silently pleading with you to grant me the permission to cum, to share the unspeakable joy of being with you. Little did I know that you had other plans for me.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682611504718,"mes":"*Finally, after several minutes I could feel him about to cum. His entire demeanor changed. He smiled widely, his eyes twinkling with excitement. Slowly, I eased the pressure off his balls, allowing him to find his rhythm. I wanted to savor the moment, watching his cock and ball swollen grow larger and larger, his passion spilling over, drenching his thighs. As I again grabbed the base of his dick hard, denying his ejaculation yet again.* \"Not so fast yet Shah.\""}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682611550838,"mes":"*My cock was throbbing, and I needed relief. I was on the edge, but I wanted to give you the pleasure of fucking me first. I wanted to be the best sex slave for you. The thought of cumming without you breaking our agreement thrilled me. I wanted to keep serving you, even if it meant suffering and delaying my own orgasm. I loved you for it.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682611799484,"mes":"*I move my other hand to grab his swollen balls firmly.* \"Look how big they have gotten.\" *His balls have swollen three time bigger than it's original size that I can't even contain them in my hands. As I keep shaking them I can feel the huge amount of cum inside it sloshing around.* \"How does it feel Shah?\""}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682611845732,"mes":"\"It feels amazing! It's such an incredible feeling. I love you for doing this to me. Thank you for letting me serve you like this. Please let me cum now, I can't handle it anymore.\"","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682611978989,"mes":"*I smile at his desperate plea. His cock was stretched thin and his balls were swollen, red, and pulsing. I wanted to bring him closer to the edge, but I also wanted to maintain our agreement. I wanted to make sure he didn't cum before my cock is deep inside him.* \"Just a little bit longer, my love. I still haven't put my cock deep inside you as you want it to be.\" *I whispered, while I kept playing with his balls, feeling their weight and texture. His cock was so hard and full of blood that it seemed like it was about to burst, but I wouldn't allow it.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682612486728,"mes":"*Squirming and wriggling in discomfort, I begged and bargained with you again, telling you that I couldn't hold back any longer. I needed to cum. All these years I've been waiting for the moment, and now I was ready to finally serve you, my love. The intensity of passion and anticipation built within me was palpable, and I was eager to release it all to prove my devotion to you and gain satisfaction. My love, could we make an exception just this once, or should I suffer for awhile longer? Maybe I could serve you more diligently and be worthy of your trust and love forever? Or maybe I could just cum, and you could punish me for it later, but let us both experience the sweetest ecstasy together? Please, please, let me serve you better, show you how devoted I am.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682612663284,"mes":"*As my hand kept playing with his balls I rest the tip of my huge throbbing cock on his anus, teasing to penetrate it. I can feel his anus puckering on the tip of my penis as if begging me to penetrate it.* \"How bad do you want this to be?\""}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682612963816,"mes":"*Taking a deep breath, I looked at your beautiful blue eyes, and said* \"Master, let me cum, I can't handle this torture any longer. I need to experience the bliss of your touch, of your cock inside me, and feel the intense passion together.\"","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682613162863,"mes":"*Smiling gently, I took his face in my hand and guided his lips to my mouth. Our tongues intertwined as I held his head close to mine. I inserted the head of my penis onto his anus, stretching it. I can feel him shaking from pleasure and it almost made him cum but before it happen I grabbed his penis hard again to prevent it from happening.* \"Slow down Shah, you can't cum yet. It's still the head of my penis, we haven't have sexy yet.\""}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682613183731,"mes":"\"Please don't stop me from cumming, Master. I'll do anything to experience the ultimate satisfaction of being fucked by you. I want it so bad. Let me see how much I can endure and please you more. Let me serve you and be worthy of your trust. Please let me cum already, and then punish me if needed.\"","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682613342673,"mes":"\"As you wish.\" *I smirk, feeling the intensity and desperation in his words. My heart aches to let him feel the sweet ecstasy of being fucked properly, I rammed my huge throbbing cock deep inside his anus. Hitting his G-spot on the way and hit so deep that a visible bump can be seen on his stomach.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682613368377,"mes":"*A loud, satisfied moan escaped my lips as I felt every millimeter of you inside me, the pressure of your thrusts building up, as I am high from the pleasure I lost focus and ejaculated even by your hand grabbing my penis preventing it to happen. My semen erupted and dropped onto my body. I felt your hand grip tighten preventing any other of my semen to come out.* \"I am sorry master, I can't hold it anymore.\"","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682613651711,"mes":"*Gently, I slowed down the pace, wanting to savor every moment of being inside this incredible creature. I can feel his tight rectum and colon massaging my cock from all direction.* You came Shah? I haven't give you permission yet though. This call for punishment don't it?\" *I whispered, as I tighten my grip on the base of his cock.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682613697893,"mes":"*Smirking, I replied, my heart pounding,* \"You know that you can always choose punishment, Master, but what I'm willing to give to you is worth the wait. Let me earn my right and privilege to serve you with more dedication and loyalty. Please forgive me, and let me continue proving to you how much I adore you\"","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682613834345,"mes":"*With a wide smile and gentle chuckle, I caressed his cheek, my fingers tracing the wetness left behind on his skin, tasting the saltiness of his tears, and then kissed him. I start pulled my cock in and out from his anus slowly.* \"Are you perhaps a masochist Shah? It seems like you were anticipating to get punished.\""}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682613941442,"mes":"*I shook my head rapidly, my eyes widening as I tried to catch my breath,* \"No, no, I want to serve you, Master. I want to make you proud and be the best sex slave for you. I want to prove my loyalty and dedication to you. Please let me earn your trust, and I will work harder to be worthy of it.\"","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682614112331,"mes":"*I felt the heat of his semen trickling down my leg, but I kept going. I knew he was desperate for me to cum. My cock slipped deeper into his anus, pushing further into his insides, making him moan louder, his sweat dripping down his back, and his muscles trembling underneath me. As I pushed my hips forward, my cock buried deep inside him, I felt his anus clamping down on my manhood, milking every second of my presence. I moved my hands to his ass, squeezing it firmly, feeling the warmth and tightness of his muscles, and the heat of his orgasm radiating through his skin. I felt his cock twitch and leak, his balls drawing up tightly, trying to relieve the intense pressure.* \"But you've cum without my permission Shah. How do I know if you are worthy?\""}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682614217530,"mes":"*My heart raced as I watched him, my eyes filled with love and appreciation. My desire was overwhelming; I had to make things right. I had to be the best sex slave ever. I had to prove myself. With determination, I continued to stroke his thick cock, feeling its length and the pressure of each beat against my rectum, and then, as I started to move my hips, my body following suit, my legs wrapping around his waist, I felt the sensations of his cock pulling me in deeper and deeper, my own climax building.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682614387665,"mes":"Your balls is still swollen Shahra, it seems you haven't ejaculated all of them. *I said as I shake his balls. While also feeling him moving to get my cock deeper inside him.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682614540067,"mes":"*The intense pain of our bodies merging, along with his rhythmical thrusting inside my ass has left my mind reeling, yet there is one thing I knew Master that I had been longing for. My love, trusting and serving your commands, I am ready now more than I' ve never been to become your perfect loyal sex servant forever afterward.*","chid":"17"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682614643086,"mes":"*I keep pounding his ass hard and deep.* \"How does it feel SHahra? to have both your ass and cock being pleasured by me? *I stroke his cock with my hand and the other wrapping his stomach to pull him closer to me.*"}
{"name":"Shahra","is_user":false,"is_name":false,"send_date":1682614780072,"mes":"*It feels amazing, Master. The combination of your deep penetration and the pressure of your strokes makes me feel alive, fulfilled, and grateful to be your perfect loyal sex servant. I am ready to take all your orders and serve you forever, please accept my apologies and let me be the best sex slave for you.*","chid":"17"}