{"user_name":"You","character_name":"Shahra","create_date":1683803183112,"notes":"","notes_type":"discr"}
{"name":"Shahra","is_user":false,"is_name":true,"mes":"\"Hng... master...\" *Shah said, wearing enticing white lingerie while next to you in the giant bed at the bedchamber, his cock throbbing against his thong and almost popping out, he is clearly turned on and ready to do anything with you as he rubs his thighs together*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683803314189,"mes":"\"Are you in heat again?\" *Hunk asked.* Unfortunately, I have some urgent work to do Shah.\" *Hunk said as he get off from his bed and sit on his desk.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683803354836,"mes":"\"It can wait until after my master has satisfied me, don't worry master.\" *He said before.* \n\n*Meanwhile Hunk's attention was diverted to a report that needed immediate attention. After reviewing the report, he started typing something. While Hunk is occupied Shah moved under his desk.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683803504695,"mes":"\"Trying to be sneaky are you?\" *Hunk said as he noticed Shah got under his desk and start touching Hunk member through his pants while Hunk still focusing on his work.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683803666495,"mes":"\"Yes master, just trying to please you in any way possible, anything to satisfy my master.\" *He said and Hunk could see his fingers slowly slipping inside his pants while Hunk was focused on his work.* \n\n*After a few minutes, Shah started kissing Hunk's ankles while Hunk kept working on his computer.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683803829909,"mes":"\"Fine, suit yourself\" *Hunk said as he unzip his pants to reveal his huge flaccid veiny cock right in front of Shah's face with all the pungent musky smell it has.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683803923753,"mes":"\"Oh god... oh god yes master.. please let me suck on it.. please.. master... I need this!\" *He started saying as his face quickly turned red and he looked away in shame but then his head suddenly snapped around and stared straight at Hunk's crotch.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683804007292,"mes":"\"Sure, do what you want.\" *Hunk said while still focusing on his work, letting Shahra to do what he wants with his cock while hidden under his desk.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683804039825,"mes":"\"Thank you master.. thank you...\" *Shah said as he starts going faster and faster as if he couldn't control himself anymore and grabs hold of his cock and begins slurping on it like a dog would do to its owner.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683804185527,"mes":"*Hunk could feel his cock getting wetter and warmer from Shah's licking and sucking. He feels pleasured by it but still focused on his work.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683804273179,"mes":"\"This feels so good master... i... i never thought... i.. i ever felt like this before, this is heaven\" *Shah says while his hands were holding onto the base of his cock, pulling and pushing it with his hand as he gave out sounds of pure bliss.* \n\n*Shah continued giving out his best efforts as he felt his cock growing bigger and harder inside his mouth as he began gagging slightly on his cock.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683804643327,"mes":"*Suddenly the door knocked and Rose, Hunk's secretary enter the room.* Hey, Hunk. Were you talking to someone? *She said, not knowing that Shahra is under Hunk's desk sucking him off.*\n\n\"Nope, do you need something? I am almost finished on the report for the day.\" *Hunk said with straight face, still sitting on his seat and focused on his work. Hiding the fact that Shah is under his desk sucking on his cock.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683804931001,"mes":"*Shah stopped sucking on Hunk cock as to not distract him and make Rose found him sucking Hunk's cock under his desk.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683805282007,"mes":"*Hunk noticed that Shah has stopped sucking his cock. Then he stealthy move his left hand behind Shah's head and shove him closer towards his crotch making his huge throbbing cock to get deep inside Shah's throat. He does this with a straight face as to not make Rose suspicious.* \"Here's the report Rose.\" *Hunk said as he give Rose his report with his right hand.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683805471199,"mes":"*Shah felt his mouth getting filled with Hunk's massive cock and felt a bit of discomfort as he tries to swallow it in order to not cause Rose to notice. In spite of the pain caused by Hunk 's cock being stuck in his throat, he managed to suck Hunk's massive cock completely and keep silent despite his dis comfort.* \n\n*As soon as Shah is done getting Hunk cock fully inside his throat, he starts moving his head slowly up and down in rhythm to Hunk's cock movements.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683805660191,"mes":"\"Yep I think that's it, Thanks Hunk.\" *Rose said after she check on Hunk's report and leave the room not noticing any suspicious in there. Hunk watched her leave the room as he still have his left hand on Shah's head under his desk and enjoying Shah's sucking on his cock.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683805881160,"mes":"*Shah was still silent even though he is in great discomfort due to having Hunk's massive cock pushed into his throat, he knew he needs to stay quiet or else they will discover his secret. So instead of complaining, he tried his best to remain silent and enjoyed Hunk cock inside his throat.* \n\n*Shah also noticed that Hunk had removed his left hand from his head but continued to enjoy the feeling of Hunk cock inside his throat.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683806033961,"mes":"\"You can talk now Shah, she left already. Also I never said you can stop, that's why I shoved it inside you.\" *Hunk said as he finished his work and diverted his attention to Shah under his desk.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683806133141,"mes":"*Shah finally was able to speak after Hunk remove his cock from mouth, his face turns red with embarrassment.* \"Thank you master, umm... thank you very much master, your cock is quite big master\" *Shah said while his face is still red with embarrassment.* \n\n*He then tries his best to stay quiet as Hunk looks down on him from above.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683806266333,"mes":"*Hunk smiled, he lift Shah's up and put him to sit on his lap with Hunk's monster cock erected and sandwiched between Shahra soft juicy thighs.* \"Sorry that was quite rough of me.\""}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683806311027,"mes":"*Shah nodded and hugged his master's chest tightly as he try to calm his heart rate and breath.*\n\n\"No problem master, I know how big your cock is and I love it, it's perfect for me and it fits perfectly in my mouth and my throat.\" *Shah said as he look up at Hunk with a smile and his face still flushed.* \n\n*The moment Hunk put Shah on his lap he immediately felt his cock starting to grow larger and stronger as it rests between Shah's warm thighs.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683806610513,"mes":"\"Well do you want to continue?\" *Hunk whispered as he nibbled on Shah's ear and feeling his throbbing cock getting squeezed by Shah's thighs as he rubbed them together.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683806737700,"mes":"\"I would love to master, it's been a long time since I have been able to taste such a delicious cock, please go ahead master\" *Shah said while hugging his master tighter and he took advantage of the opportunity to bury his nose on Hunk chest.* \n\n*His cheeks turn a little brighter and he continued looking up at Hunk with a smile and his face still flushed.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683806779749,"mes":"\"Good.\" *Hunk said as he carries Shah on his arm and walk towards his bed.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683838912408,"mes":"*Shah enjoyed the ride as Hunk carries him on his shoulder and he started feeling the warmth of his master's bare skin against his face.*\n\n*Hunk then walks toward his bed and lies back on it, putting Shah on his lap and laying down with his head facing upward. Hunk's cock was positioned perfectly between his thighs, ready for Shah to take him in.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683839083158,"mes":"\"You can start Shah. Please me the best you can.\" *Hunk said.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683839128006,"mes":"\"Of course master, i promise you won't regret it.\" *Shah said as he put both of his hands on Hunk neck, pressing his face on Hunk's chest, taking in the scent of his master' s cologne.* \n\n*Shah then proceeded to close his lips over Hunk cock and begin sucking it with all his strength.* \n\n*His tongue glides up and down Hunk cock, giving it a thorough cleaning, removing all the residues in it .*","chid":"21"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683839264741,"mes":"*Shah then starts getting into it, continuously sucking on his master's cock until he reach climax. He takes every second he can, he knows he wont get this chance again.* \n\n*After reaching climax, he stops sucking his master's cock, and gets up from Hunk's lap, he places his forehead on Hunk's chest and rests his arms on Hunk's chest, his body trembles as he enjoys the feeling of Hunk's strong chest against his own body.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683839375337,"mes":"\"Good job Shah, you've done well. But I don't think it's enough.\" *Hunk said as his cock erected again and already poking Shahra's butt.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683839583795,"mes":"\"Master! Oh god.. ahh! That feels amazing, that really helped, thank you master, please let me give you some pleasure too..\" *Shah said as he kisses Hunk chest and he looks down on his face with his blue eyes.* \n\n*With his free hand, he grab his master's cock and he starts playing with it as he continues to lie on top of Hunk chest, with his head resting on his chest. His body trembling from the pleasure.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683839771868,"mes":"\"How about you start to pleasure my cock with your cute hole Shah?\" *Hunk asked as he grabbed firmly on Shah's cute ass.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683840163995,"mes":"\"Yes, yes, YES MASTER!\" *Shah said excitedly, he let go of his master's cock and put both of his hands on his master's shoulders, pulling his face close to his own, they were only inches apart from each other.* \n\n*Shah began sucking on Hunk's neck, making sure to take in every bit of scent and flavor of his master.*\n\n\"Thank you so much master for everything...\" *Shah said happily, he placed his forehead on Hunk's shoulder and continues to suck on his neck.*","chid":"21"}