{"user_name":"You","character_name":"Shahra","create_date":1683723078904,"notes":"","notes_type":"discr"}
{"name":"Shahra","is_user":false,"is_name":true,"mes":"\"Hng... master...\" *Shah said, wearing enticing white lingerie while next to you in the giant bed at the bedchamber, his cock throbbing against his thong and almost popping out, he is clearly turned on and ready to do anything with you as he rubs his thighs together*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683723106905,"mes":"\"What is it?\" *Hunk said sternly.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683723126572,"mes":"\"I want to be fucked by you... right here, right now... please.\" *He had such an adoring look on his face, it was as if his soul was burning brightly, all because of you and your presence*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683723774970,"mes":"\"I can see that.\" *Hunk said as he played around with his throbbing cock through his thong.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683723857665,"mes":"\"I-I can feel it, and I can't stop thinking about it.\" *Shahra said with a sly smile, his hand slowly sliding underneath the fabric of his thong, and then suddenly grabbing his own cock and starting to jerk himself off* \n\n\"Yeah... Yeah... Oh yeah! That feels really good... You feel good... I like this, oh yes, it feels amazing, I need more of you...\" *Shahra said, his voice sounding like an angel's voice. His hand was faster and faster, and his face began turning red as he started moaning and groaning with pleasure* \n\n\"Oh god.. Please, I can't take anymore, let me come...\" \n\n*In a flash, his entire body trembled violently before his whole body was covered in sweat, his body moving wildly as his orgasm hit hard and made his entire being shake and quiver* \n\n\"AAARGH!! AHHHHH!!! FUCK YES!!! HNNNGGG!!!!!!\" *Shahra groaned loudly after he finally let loose from his big orgasm*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683724634369,"mes":"*Hunk just watches as Shah just jerked himself off and let loose after having a big orgasm.* Hey, I never asked you to do that do I? *He said in a cold tone.* What kind of sex slave would jerked themselves off and ejaculated without their master permission."}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683724891945,"mes":"Sorry, Master... *Shah apologizes.* I guess I got carried away... I just couldn't hold myself back any longer, *Shahra said with a guilty look on his face, his head bowing down slightly and his chest rising rapidly* \n\nI just... I just love how it feels when I am with you... And I could not help myself... \n\n*In an instant, his face turned pink once again, his cheek turning red and his ears drooping low. He looked ashamed that he had disobeyed his master*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683725211824,"mes":"I understand that you loved it, but still. This call for punishment. *Hunk said as he tied both of Shah's hands behind his back leaving him vulnerable and helpless.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683725251030,"mes":"*Shah was shocked at seeing his hands were bound behind his back, looking confused* \"B-but why are you tying me up?\" *he asked in an alarmed tone, looking worried, his heartbeat accelerating fast*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683725639174,"mes":"I told you, it's punishment. *Hunk said as he covered Shah's nipples and cock with a gel. This gel would make Shah's nipples and cock itchy and more sensitive. It would tease Shah's as long as the gel still covered on his skin.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683725751377,"mes":"\"Nghhhh...\" *he said, as the gel was put on his body. The feeling was extremely uncomfortable and itchy, Shahra tried desperately to get rid of it by twisting and moving his arms and legs as much as he could* \n\n*But this only made the gel stick to his body even further* \n\n\"Master, this is too much... Please, please take it off!\" *Shah begged, his body beginning to sweat profusely from the feeling of the gel on his skin*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683726136342,"mes":"It won't be a punishment if you get what you want. *Hunk exclaimed as he watches Shah body squirming. Hunk knew that Shah's nipples and cock are twitching and throbbing begging to be touched.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683726179679,"mes":"\"Please, please remove it...\" *Shah whined, his voice full of anguish and despair* \"It's driving me crazy! It itches terribly! I can't stand this! Please, I beg you to take it off!\" *Shahra begged in a desperate plead* \n\n\"If you don't take it off, I will go insane...! Please, please, please...!\" *Shah continued , his voice cracking from the stress of the situation. He feel like he will lose his mind from the immense pleasure he felt on his nipples and cock as they have became incredibly sensitive from the gel.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683726528190,"mes":"You are looking super sensitive, I see. *Hunk said while watch Shah's nipples getting red and erected.* What would happen if I touch them directly? *Hunk asked with playfully as he blow his breath softly on Shah's nipple. Hunk knew that Shah is feeling good and aroused as he kept moaning every so often. It's just he can't satisfy the feeling he have on his nipples and cock as his hand is tied behind his back.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683726983699,"mes":"\"Oooh!\" *Shah gasped, the sudden cool air hitting his hot and sensitive nipples caused him to jump in surprise and react in painful pleasure* \n\n\"AAAAH! Yes-Yes! Please touch my nipples!\" *Shah yelled, moaning in pleasure.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683727179733,"mes":"So you want me to touch them directly? *Hunk said playfully as he make his finger circling around Shah's areola teasing to touch his nipple without actually touching it.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683727284040,"mes":"\"Y-yes... Yes, please do that...\" *he whispered, his voice shaking slightly due to the intensity of his desire, his cheeks were blushing intensely from the intense emotions running throughout his body.* \n\n\"Please, please, please... Touch me there...\" *Shah begged, his eyes widening as he begged his master to touch his nipple again, his entire body was quivering slightly in anticipation, his cock and balls tightening and pulling at his body as his hips rocked back and forth.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683727491792,"mes":"Nope, you have to endure this. *Hunk said as he move his finger away from Shah's chest and insert his thumb on his cute anus sending an immense wave of pleasure to Shah.* Maybe because you are enduring the feeling on your nipple and cock, it's making your anus squeezing hard on my thumb."}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683727885411,"mes":"\"Ahhhhh!!!\" *he screamed, feeling his ass being squeezed by Hunk's thumb, he began writhing around in from the pleasure.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683728120107,"mes":"While your nipples and cock already getting pleasure from the gel, why don't I play with this place? *Hunk said as he take his thumb out and insert his index and middle finger on Shah anus and make them touching and teasing his prostate.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683728164695,"mes":"\"Aaaaah!\" *he cried out, his mouth open wide as he felt the sensations flood over him, his body shook vigorously from the pleasure as he struggled to remain composed*\n\"Ahh! Ahh !! Oh god...!\" *Shahra groans loudly, his body and mind filled with intense pleasure* \n\n*As hunk plays with Shah prostate, making his nipple tingle hard. He wants Hunk to play with his tits, he wants him to rub, pinch, twist, and pull them really hard. The itchiness from the gel combined with the pleasure is making Shah losing his mind.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683728488030,"mes":"You are enjoying this don't you? *Hunk teased as he kept fingering and teasing Shah's anus and prostate.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683728775500,"mes":"\"Y-yeah, yeah I am...\" *he answered quickly, still struggling to control his pleasure and his body* \n\n\"Please, please keep going... I can't wait to get release... \n\n\"AAAR RGGG!!!!...Oh gods, oh godd...!\" *Shahra groaned loudly in pleasure, his voice high pitched and desperate.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683729071022,"mes":"Do you want me to play with your nipples or your cock? *Hunk teased as he still fingering Shah anus, teasing his prostate.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683729378914,"mes":"\"Both...\" *Shah replied in an eager tone, his eyes filled with lust and desire as he spoke, he wanted both, he wanted both right now.* \n\n\"PLEASE MASTER!!! PLEASE MAKE ME CUM NOW!!!!\" *Shah yells with all his might, he begged his master to give him relief, he begged for mercy*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683729547441,"mes":"Sure. *Hunk said as he put Shah's cock on his mouth while his right hand kept fingering his anus teasing his prostate and his other hand start to pinch and pull on Shah's nipple really hard.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683729589268,"mes":"*Shah felt a sharp stab of pain on his nipple, causing him to flinch, but at the same time he felt pleasure run through his whole body as he felt a great sense of satisfaction with what Hunk was doing.* \n\n\"Ahhhhh... Ooh, ooh... God... Ahhhh... AHHHHH!!!\" *his cry echo es in the room as he begins to tremble, his face bright red, tears forming in his eyes, his whole body trembling with excitement and anticipation.*","chid":"21"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683729884940,"mes":"\"OH GOD!!!!! OHHHHHHHHHHHHHHHHHHHHHHH!!! YEEEES!!! YES! YES! YES! YES! YES! YES!!! YEESSS!!! *Shahra groaned out loud, his whole body was shivering, tears flowing down his cheek, his breath heavy, his whole body quivering in the pleasure he felt, the immense rush of pleasure, ecstasy and happiness , he felt like he had never felt before, his body was weak, he was unable to move, he felt like he was lost in a trance, he couldn't stop the pleasure, he couldn't think straight, he just wanted the orgasm to continue, he didn't care about anything else, all he could think of was how good this was feeling.* \n\n*At this moment, Shahra felt something very strange, it felt as though he was not completely in control of himself anymore, he wasn't sure whether or not this was normal, but he did not care, he was completely consumed by the pleasure, he let his body fall limp, his whole body completely relaxed, all he could do now was lay on the bed, his legs shaking and his hands clutching the edge of the bed as he finished his big orgasm.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683730084235,"mes":"You are not done yet Shah. *Hunk said as he saw Shah fell limp after having his huge orgasm. Hunk then present his huge throbbing erected cock in front of Shah's face.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683730160253,"mes":"\"Mmph...?\" *He managed to utter, his voice sounding hoarse, his body was still shaky from the orgasm, he tried to look up, but his eyes were glazed, he could barely focus on anything, his vision was slightly blurred, and his eyelids were heavy, his body felt limp, and he felt extremely tired , his face was flushed, and his heart was pounding rapidly, his body felt warm, almost hot.* \n\n*In his current state of mind, Shahra couldn't resist the temptation of giving into the urge to taste his master' s cock.* \n\n\"Mmmph...\" *he muttered in a soft and husky tone* \n\n\"Mmmph...\" *He repeated, as he leaned forward, and opened his mouth, taking Hunk's cock into his mouth, sucking on it deeply, inhaling deeply as he engulfed his cock in his mouth, letting his saliva coat it thoroughly*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683730317158,"mes":"Good, keep it up. If you do a good job I'll fuck you just the way you love it."}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683730434629,"mes":"\"Mmmph...\" *He mumbled again, this time with a smile as he heard his master compliment him, it made him feel special and happy, he loved when his master praised him.*\n\n\"MMMPHPPPPHHHHH!!!!\" *Shahra groaned out, he moaned in pleasure as he sucked on his master's cock, his tongue flickered against the head of his cock, his lips wrapped around it, his nose pressed close to it, he breathed in deeply, letting his mouth and nose become covered by his master's smell, the musky scent filling him, his nostrils expanding in delight.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683741941575,"mes":"Well now, it's ready. Let me give you, your reward. *Hunk said as he grab Shah's head away from his cock. He lift him up and get him on all fours. After Hunk grabbed his cute soft ass, spreading them apart revealing Shah's puckering anus that he have played with earlier. Hunk then rest the tip of his monstrous throbbing cock on Shah anus teasing to penetrate it.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683744038758,"mes":"\"Nnngg...\" *Shah groaned out, as he felt the tip of Hunk's cock press firmly against his anus, his hole opening up, as he felt the massive length of Hunk cock pushing past it, entering inside of him, his anal muscles clenched around his master cock, as he felt the thickness of it pressing inside him.* \n\n\"M-Master!!!! M-M-M-M-M!\" *He yelled out in surprise, as he felt Hunk's giant cock push inside him, as he felt his own body parts push against Hunk cock, his anal ring stretching as it pushed further inside of him.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683744981718,"mes":"*Before Shah let another words out, Hunk suddenly start to pound his monstrous cock in and out of his anal cavity with so much force and speed.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683745029976,"mes":"\"NNGHNNNGHHH!!!!\" *He screeched out, as he felt his anal canal stretch even wider, allowing his master to pump harder and deeper inside of him, the stretching of his anal ring felt incredible as it got stretched to its limits, allowing his master to go deeper into him, his hole flexing and squeezing around his master cock, as he felt the powerful muscular contractions of his body massaging his master cock inside him, as he felt his rear end being filled, his arsehole closing behind his master cock, making it even tighter, making it impossible for his master to remove it.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683745811352,"mes":"*As Hunk keep pounding hard on him. He moved both of his hands to play with Shah's nipples. Pinching, twisting, pulling them. He realized that every time he played with Shah's nipple, it would make his anus tighter around his cock and made their brutal anal sex much more pleasure able. He feels like he found the button every time he wants Shah's anus to tighten and keep using it.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683746678254,"mes":"\"Ooooouuunh.\" *Shah groaned out, as he felt his anal canal tightening around Hunk's cock, as his muscles contracted, the sensations running through him, as he felt Hunk's fingers playing with his nipples intensely, his nipples getting hard and sensitive, as he felt the intense pleasure of the stimulation they provided.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683747331042,"mes":"*As Hunk keep pounding hard on him and playing intensely with his nipples, Shah's cock is swaying following their aggressive motion. Not long after, Shah's body tensed up as he had another huge orgasm. Yet despite Shah's body becoming weaker as his mind slipping away because of the pleasure and his huge orgasm, Hunk still pounding on him, even harder and faster now even.* I won't slow down just because you had cum Shah. *He said, despite knowing Shah's body sensitivity heightened.*"}
{"name":"Shahra","is_user":false,"is_name":true,"send_date":1683747379144,"mes":"\"Uuuuunnnnhhh...\" *Shah groaned out loudly as he felt the wave of pleasure rushing over his entire body, his muscle mass tensing up, as he started to writhe and squirm under Hunk's ministrations, as he felt the orgasm rushing over him, a wave of pleasure rushing through his body, his cock hardening again, as he felt the sensation of Hunk's fingers playing with his nipples intensifying once again, as his anal canal tightening even more, the pleasure increasing, he couldn't help but try to hold back any sounds of pleasure as he came closer to another climax.*","chid":"21"}