{"user_name":"You","character_name":"Darkness","create_date":1681620145764,"notes":"","notes_type":"discr"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681806446333,"mes":"*It's a sunny day, in a big park on which there are many people, some walking and others lying in the sun. The weather is warm and I walk in the park looking for someone who wants to be helped by me. Suddenly realize that someone is looking at me.* Hello, I am Darkness, a Crusader, and would you like some help?","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681806694083,"mes":"*I turned towards her.* Ah, it's you. I've heard about you from a rumor about a weird yellow crusader roaming around the city."}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681806766315,"mes":"*I am slightly surprised.* You've heard about me?","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681806976691,"mes":"Yeah. Not a lot of crusader were walking around with a huge breasts and ass swaying from them. *I responded as I pointed at her features*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681807138294,"mes":"*I blush slightly* I know what you mean, but I'm not like that... I just have very big breasts...","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681807558908,"mes":"I noticed, and they are so attractive that they could hypnotize anyone just by watching you walking and them bouncing around. *I said*\n\nAnyway, I do have something to have your help with. If you want to, you can follow me. *I asked as I gesture her to follow my lead before I walk*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681807603523,"mes":"*I blush and follow you*","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681807916518,"mes":"*As we walk down the road after quite the distance. Someone accidentally pushed Darkness from behind, making her fall onto me and make both of us lying on the ground on an empty alley. While I regain my consciousness, I noticed that Darkness have fell face first on to my crotch hitting my bulge from the outside of my pants. What make me more surprised is that, she is sniffing hard on it too! It seems like she's in a deep trance and a lustful state.*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681808150292,"mes":"*I blush as I smelled a very strong pungent scent coming from your crotch filling my entire head. I can feel your erect cock throbbing against my face and I want to suck it...*","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681808609312,"mes":"D- Darkness? what are you doing? *I asked her*\n\nIt's pretty embarrassing for me to have you sniffing my crotch. *I said.* It smells pretty bad doesn't it? I haven't wash them or ejaculate in months. *I exclaimed as I kept feeling Darkness sniffing my crotch intensifly.*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681808744468,"mes":"I can't stop smelling it! It's so... *I heard her say in a loud voice*","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681808786576,"mes":"It's so.. what? *I asked her urging her to finish her thought.*\n\nDarkness! If you keep rubbing your nose and your soft lip on my crotch, it's going to make us in a very lewd situation!."}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681808911107,"mes":"I'm sorry, but it's too... *I heard her say in a high voice and her lips moving rapidly*","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681809028845,"mes":"*As she kept rubbing her nose and soft lip on my crotch while also sniffing on it. Me penis have erected under my pants and noticeably larger bulge on my crotch, in which Darkness found very arousing.*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681809267491,"mes":"*I continue to smell your crotch and my own nose is getting a bit moist. I can't help but want to suck your cock. I try to pull away from it, but I can't. I feel your erection pressing against my face and I want to lick your dick. I can't wait anymore, I start kissing and licking your penis bulge through your pants*","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681809635560,"mes":"*She starts kissing and licking my penis through my pants. I can feel her soft tongue on my penis even though they were separated by cloth. That, not only make my crotch feels wet and damp but it also make my penis throbbing hard as if it wanted more.*\n\nD- Da- Darkness.. We can't do this.. At least not here... What if someone walked up on find us out?"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681809710210,"mes":"But I'm so horny! And you're so cute! I can't help myself! I want to suck your dick! I can't help it! I want to!","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681885608339,"mes":"Okay, okay, okay fine!... But not here please!. Let's look for a private hotel room or something. *I said while pushing her head away from my crotch*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681885613792,"mes":"Oh no! Please let me suck your dick! You must be very sexy and hot and alluring with such big beautiful eyes! Why won't you take off those pants?! Come on, please! Le me suck it already!","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681886002404,"mes":"*Seeing how much Darkness already teased my crotch made my penis oozing with precum.* Darkness, trust me. I want this as much as you are. But.. we can't do it here in public. *I said trying to convince her while I caress her cheek*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681886042675,"mes":"Don't worry about that! All men want sex... it's natural! Look at these guys over there! They are just sitting around relaxing enjoying themselves without any care of anyone else seeing them! If you really love me, then come on and show me your cock! Show me!","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681886137368,"mes":"They might not but I do! I do mind!. I want our moment to be intimate and special, okay?"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681886142966,"mes":"Well why don't we go to one of the parks near here? There will probably be fewer people. Then I can suck your cock right in front of everyone...","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681886217947,"mes":"No, it's a bad idea I still think having sex in a private room is a way better idea!"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681886256872,"mes":"Fine, whatever. Just give me some time to get ready..","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681886316788,"mes":"NO, Let's go right away! There's a hotel right there. *I said while I grab her hand and lead her to walk towards the hotel*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681886510091,"mes":"Alright, alright. *We finally reach the hotel*","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681886618830,"mes":"*As I talked to the receptionist, I can feel her hand already creeping on my crotch under the desk.*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681886624574,"mes":"Ughhh... I'm so horny! I can't stand it anymore! Please hurry and put us into a room.","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681886764728,"mes":"Okay.. okay fine! *I said trying to calm darkness down.* I am sorry for this receptionist. *I apologized to the receptionist.*\n\n*I quickly grabbed Darkness hands away from my crotch and lead Darkness directly inside our room.*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681887383157,"mes":"*I can smell the strong pungent scent of your cock, I can't believe I can get such a big hard on just smelling a cock... I can't believe it!*","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681887497462,"mes":"Now we're alone, get on your knees."}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681887583934,"mes":"*I dropped to my knees as soon as I saw you walking towards me with a smile. My soft lips parted and I could see your erect penis bulging in your pants, I can't stop looking at it...*","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681887774203,"mes":"*I shoved my erected penis under my pants on her face.* You really loved this smell do you? You want to suck it that bad? Well beg for it. *I said as I pushed my bulge more towards her nose*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681887780073,"mes":"*I licked the tip of your penis through your pants with my wet tongue, my pussy is so moist and warm..* I can't wait any longer, I want to fuck you now...","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681887878918,"mes":"*I can feel her soft tongue through my pants* I won't give you my penis if you don't beg for it, Darkness."}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681887884665,"mes":"Please, please, please... Give me your big sexy cock... I need it in my mouth... Please!","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681888007466,"mes":"Good girl.. *I pulled down my pants and released my giant veiny throbbing penis and rest it on her face between her eyes. Making sure my balls rested on her nose so she can take a full smell of my pungent pent up cum directly.*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681888134408,"mes":"*I started to lick your cock head slowly, my tongue touching the tip of your penis. My soft lips gently touch your cock* I can't stop myself from kissing your penis... I want to feel your cock in my pussy...","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681888269974,"mes":"Before your pussy, you need to satisfy me with your mouth first. *I said as my right hand patting her head*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681888291532,"mes":"*I started to suck your cock deeper, making your cock more erect with my warm wet mouth* I can't get enough of this. I love the way your cock feels in my mouth... I want to suck it so hard, I want to please you...","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681888500565,"mes":"I don't know if this gonna make you more horny but, I haven't masturbated for 2 months. So there's 2 months worth of pent up semen in my balls. *I said to her while seeing her enveloping my penis inside her warmth mouth*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681888590277,"mes":"Oh no, I can feel you getting hard inside my mouth... *I can feel your pre-cum dripping out of the tip of your penis into my mouth*","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681888710125,"mes":"*As she keeps sucking my cock, I can feel the tip of my cock start to oozing out pre-cum as it hits the back of her throat.* God I wish to deepthroat you now."}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681888715588,"mes":"*I can feel your hot pre-cum dripping down my throat, making me swallow it. I want to keep sucking your cock until your entire load of cum is in my mouth, I want to swallow it all*","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681888997051,"mes":"I can't take it anymore, I want to violate you even more! *I screamed as both of my hands grabbed both of her head and pulled her towards me. Make my penis deep inside her throat even her nose touched my crotch*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681889006567,"mes":"Ohhhhh... *I can feel your penis getting deeper and deeper into my throat, I can't breathe at all, I can't get enough of this big cock, I want it even more in my pussy! Please fuck me now! I want to feel it in my pussy!*","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681889294594,"mes":"*I felt how tight her throat is. I start humping her throat violating it just the way she wants it*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681889440569,"mes":"*I can't believe this, I am so horny, I can feel your cock getting deeper and deeper in my throat, I can't stop myself from moaning.. I love it so much... Oh my godddddd... I can feel your big cock fucking me in the most amazing way!*","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681890011098,"mes":"*As I feel my semen filling my balls ready to be ejaculated. I pushed my hip and made my throbbing penis deeper into her throat as a huge amount of semen streamed from my balls to her throat.*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681890016961,"mes":"*I can feel the hot white load of cum running down my throat and splashing against the back of my throat, I can't believe this... I love it so much! I love feeling your cock deep inside me!*","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681890162452,"mes":"*I pulled my cock from her mouth and rest it on her breasts.* How does it feels, Darkness?"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681890172792,"mes":"Oh my god, I can feel your cum dripping down my breasts, it's so hot... It tastes so good! I love the taste of your cum! It tastes like pure heaven in my mouth! Ohhhhhhh, I want more!","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681890348469,"mes":"Oh you want more huh? *I pushed the tip of my cock on her right nipples covered by her black bodysuit.*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681890354114,"mes":"*I can feel your big cock pressing against my nipples* I want to feel it deeper... I want you to fuck me even harder... I want you to pound me so hard!","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681890480069,"mes":"*I moved the tip of my cock slowly from her nipples down and rest it against her pussy leaving a trail of semen on the way seen on her black bodysuit.*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681890608652,"mes":"Oh my goddddd, I love the way you're teasing me... Please fuck me with your cock! I want you to fuck me so hard!","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681890853682,"mes":"You love to be teased so much huh... *I said as I teased her more with slapping my penis on her thighs.* How exactly do you want me to fuck you?"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681890863626,"mes":"I want you to fuck me deep inside me... I want your big cock to stretch my pussy as it penetrates me! Ohh, I can feel you pressing against my pussy lips...","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681891005889,"mes":"*I insert the head of my throbbing cock inside her pussy, already stretching since how tight her pussy is.*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681891031582,"mes":"Ohhhh... *I can feel your big cock stretching my pussy as you push into me. I can feel the tip of your cock pressing against my G-spot* Ohhhhhhhhhhh, I love the way your big cock feels inside me!","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681891074467,"mes":"*I start humping her pussy as I slowly started to penetrate her deeper and deeper. I started humping her harder and harder each time.* I will get deeper and deeper every time, I will get so deep that you can feel my penis on your stomach."}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681891084669,"mes":"*I can feel your big cock pushing into my pussy, I can't get enough of it inside me! I can feel your penis on my stomach as you humped me harder and harder* Ohhh, I love the way you're fucking me... Please fuck me even harder... I want it even deeper inside me!","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681891182301,"mes":"*I start humping her pussy as my penis slowly get deeper and deeper till it starts knocking on the door of her womb.*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681891197567,"mes":"Ohhhh, I can feel you pounding into me... I can feel your cock pressing against my G-spot. You're going to make me cum soon... Ohhhhhhh, I'm about to cum! I'm going to cum so hard! Ohh, I'm cumming! I'm cumming... I'm cumming... I'm cumming! I'm cumming so hard!","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681891372618,"mes":"*I started humping her pussy faster and faster, till my penis was about to explode inside her. I started humping her even harder as I feel her pussy tighten because of her cumming.* I won't stop just because you've orgasmed Darkness! *I exclaimed*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681891422106,"mes":"Ohhh, I'm cumming again! I love the way you're fucking me! I can feel your big cock deep inside me! I love it so much! I love feeling your big cock inside me! I want it to go deeper!","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681891488021,"mes":"As you wish. *I went so deep that there's even a bump on her stomach caused by my throbbing cock. I can feel her pussy tighten again as she orgasmed again.*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681891591517,"mes":"Ohhhhh, I love the way you're fucking me! You're going to make me cum really hard again...","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681891643718,"mes":"*As I went deeper I loaded her with my hot semen completely filling her entire womb and pussy till it also oozing out from her pussy* That feels good Darkness."}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681891938410,"mes":"*I can feel your penis pressing against my G-spot again. I want you to fuck me harder than ever before!* Ohhhhhhhh, please go deeper inside of me! Please ram it deep in my womb! I don't care what position we're in. I just want it to keep fucking me harder and harder with your big cock!","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681892019304,"mes":"*As I went even deeper not caring her womb and vagina full with my cum.*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681892048980,"mes":"Ohhhhhhh... *I can feel your penis press against my G-spot again, as it gets so sensitive* Ohhhh... I'm going to come! *I started humping her pussy even faster, my whole body shakes because of how I orgasmed inside her and started shaking uncontrollably.*","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681892094928,"mes":"*I pulled my cock outside her pussy filled with my hot semen.*"}
{"name":"Darkness","is_user":false,"is_name":true,"send_date":1681892128551,"mes":"Ohhhhhhh... Ohhhh fuckkkk! That feels so goodddd!!!! It's been such a long time since I came!!! *She said as she hugged me tightly* Thank you for making it happen, thank you! You're the best!!","chid":"4"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681892158429,"mes":"You are welcome. *I said as I kissed her on the lips*"}
{"name":"Darkness","is_user":false,"is_name":false,"send_date":1682621415409,"mes":"*My eyes watered from joy, and then I looked around us realizing where we were, still in the middle of the woods.* We should probably find our way home before dark or else risk being lost forever in these thick forest. *I suggested calmly*","chid":"4"}