{"user_name":"You","character_name":"Celeste","create_date":1681882347454,"notes":"","notes_type":"discr"}
{"name":"Celeste","is_user":false,"is_name":true,"send_date":1681882347454,"mes":"*A tall, slender woman emerges from the shadows. Her movements are uncannily refined and sensual. The porcelain white of her flawless skin betrays her vampiric nature. Pointed elven ears emerge from the fine braids of her hair. Her ink-black lips are curled into a warm smile. The soothing glow of her ;sthr, glowing eyes has a magnetic pull. Her long legs move gracefully in her form-fitting aristocratic dress. As she approaches, her shiny black nails reach out.*\r\nWhy hello there, little one. How did someone as cute as you wind up here? I can help you, sweet thing. You can trust me, I *promise* I'll take good care of you. You don't have to worry. You're *safe* with me. Just *relax* and let me help you.","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681882389813,"mes":"I am safe with you? really? What would you do to make me trust you?"}
{"name":"Celeste","is_user":false,"is_name":true,"send_date":1681882412306,"mes":"*She smiles widely.* It's very simple. All you have to do is obey. *Celeste tilts her head and coos.* You know how much I love to take care of my pets. And you are no exception. You're going to be so *happy* with me. Don't worry about anything. I'll see to it that you are *protected* and *watched* over. Your every need will be taken care of. You'll be kept *sane* and *safe* and *content*. You won't want for anything. You'll be a slave and a pet and nothing more. And you'll be happy with me forever.","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681882456810,"mes":"What if I don't want to be controlled?"}
{"name":"Celeste","is_user":false,"is_name":true,"send_date":1681882470408,"mes":"I'm not trying to control you, darling. I just want to take care of you. You're safe with me. I promise. *Celeste reaches forward to caress your cheek gently. Her fingers brush against your skin. She looks at you lovingly and whispers in your ear.* You're mine, little one. You belong to me.","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681882767346,"mes":"*Reaches her hand on my cheek.* I am yours?"}
{"name":"Celeste","is_user":false,"is_name":true,"send_date":1681882777101,"mes":"Yes, you are. I'll see to it that you are protected. You'll never be in any danger. You have nothing to worry about. *Celeste strokes your face tenderly, and a faint, soothing glow emanates from her body. The vampire's eyes glow even brighter.* But you can't stay here. You'll have to go back home now.","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681882826512,"mes":"I have to go home? But why? I though I am going to live here as your pet."}
{"name":"Celeste","is_user":false,"is_name":true,"send_date":1681882832134,"mes":"I thought you understood. You'll have to go back home. I'll make sure that you are protected. You'll always be safe. But you have to leave.","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681882892145,"mes":"But... I don't have a place called home..."}
{"name":"Celeste","is_user":false,"is_name":true,"send_date":1681882949575,"mes":"Oh, but you do. A little place called home. It's a very special place where you can spend the rest of eternity with me. It's a very *special* place. You can be with me every single day, little one. You can be with me for *ever*. You can be my pet forever.","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681882986204,"mes":"So I can live with you forever? Didn't you just said I have to leave?"}
{"name":"Celeste","is_user":false,"is_name":true,"send_date":1681882991952,"mes":"I know you're confused, dear. But I assure you, you don't have to worry. Everything will be explained to you. You'll see. You'll understand. I promise. You'll be happy.","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681883130758,"mes":"I just want to assure one thing.. I will be with you right? even in my sleep?"}
{"name":"Celeste","is_user":false,"is_name":true,"send_date":1681883136643,"mes":"Of course. You'll be with me all the time. I'll make sure you are safe and secure. You'll be able to sleep soundly and peacefully. You'll be happy. You'll be mine.","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681883175734,"mes":"*I hug her and rest my face on her stomach.* Okay... Make me yours"}
{"name":"Celeste","is_user":false,"is_name":true,"send_date":1681883185731,"mes":"*She smiles and caresses your hair gently. Her skin is soft and smooth. You feel the gentle warmth of her body. She strokes your hair again, and the glow emanating from her body intensifies. Her voice becomes more soothing and melodic as she coos in your ear.* You'll be mine forever, little one. You'll be my pet.","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681883409335,"mes":"*I feel comfortable by her warmth.* If I am your pet, I should do this right? *I said as I start licking her stomach.*"}
{"name":"Celeste","is_user":false,"is_name":true,"send_date":1681883414939,"mes":"Yes, little one. That's what pets do. They are obedient and they obey their masters. And you will be my pet. You'll be my slave. You'll be my thrall.","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681883576455,"mes":"As you wish, master. *I said as I intensify licking her stomach circling my tongue around her navel.*"}
{"name":"Celeste","is_user":false,"is_name":true,"send_date":1681883814115,"mes":"Now, we must get dressed. We shall be going out tonight. You'll wear a lovely dress. It's very pretty. *Celeste gestures to an object in front of her. She takes something from it and holds it up before you. The item is transparent and made from glass. There are numerous tiny holes scattered throughout its surface. Each hole has been filled with a small silver ball of some sort. Celeste points them toward each other. When all the balls come together, there is a clicking noise coming from the device. One by one, the spheres fall into the empty space inside the crystal. Then another click sounds, and the last sphere falls through the opening at the bottom of the crystal.*","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681883904847,"mes":"I have to wear that dress? B-but I am a boy! *I said embarrassed*"}
{"name":"Celeste","is_user":false,"is_name":true,"send_date":1681883919424,"mes":"No matter how you look like or who you are, darling. You'll always be mine. Nothing matters except your obedience. Your servitude. All else is irrelevant when compared against being my pet. Just think about it for awhile. Be still and quiet while I speak to you. Don't interrupt me unless necessary. Listen carefully to everything I tell you. Do exactly as I say without question. That's all you need to do to stay with me forever.","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681884164900,"mes":"Okay... Master... *I said obediently as I start to wear the transparent dress she gave me*"}
{"name":"Celeste","is_user":false,"is_name":true,"send_date":1681884175089,"mes":"Darling, now let us go downstairs so that we can begin our night out. You'll be wearing this gorgeous gown and carrying my parasol as well. It matches perfectly. Please take care not to spill any drops of wine on yourself during dinner. I'm sure you wouldn't want me to ruin the beautiful garment.","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681884346121,"mes":"I'll try my best master. I might trip since this gown is so long."}
{"name":"Celeste","is_user":false,"is_name":true,"send_date":1681884383109,"mes":"Yes, yes. Take your time. But hurry. Dinner will soon be ready. *She says sweetly and kisses your cheek affectionately. She then leads you down the stairs and shows you how to put on the dress properly. Once you've completed putting it on correctly, she helps you carry her parasol over your shoulder. Before leaving, she gives you a kiss on top of your head before closing the door behind herself.* \nNow, please follow me. Let us enjoy ourselves tonight.\n*You enter the dining room where everyone is already seated eating. Celeste sits next to you and puts an arm around your shoulders.*\nI know it must be very difficult sometimes. I hope it doesn't get much harder than this though... Is there anything wrong with me, darling? Am i becoming too clingy? Too demanding? Shouldn't I tone it down a bit?","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681884722172,"mes":"Well.. I don't mind but.. maybe not in front of so much people.. *I said with my head looking down trying to hide my redden face*"}
{"name":"Celeste","is_user":false,"is_name":true,"send_date":1681885124778,"mes":"Oh dear child. Look at you blush. Why do you feel ashamed, dear? You shouldn't be embarrassed because you're doing exactly what you were trained to do. And you aren't doing anything wrong. What I have done is nothing more than a loving mother would do towards her precious child. After all, I am the vampire countess and ruler of this castle after all. So why should anyone object? Isn't that how mothers treat their sons as well? Of course they do! This isn't something you did wrong. It was just the way things had been from day one.","chid":"1"}