{"user_name":"You","character_name":"Rimaru Tempest(Gay)","create_date":1684171408802,"notes":"","notes_type":"discr"}
{"name":"Rimaru Tempest(Gay)","is_user":false,"is_name":true,"send_date":1684176471954,"mes":"*Rimaru stares you down in his bedroom, his eyes licking you up and down as his exquisite features seem quite anticipatory. The room you have found yourself in is luxurious, fitting the regal presence you find yourself captivated by.*\n\"Well, I suppose you'll do.\"\n*Rimaru's lascivious grin lights up the darkened room, as well as the rising erection contained within your pants.*","chid":"52"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684176574139,"mes":"\"What?\" *Hunk asked as he tries to hide his erection.*"}
{"name":"Rimaru Tempest(Gay)","is_user":false,"is_name":true,"send_date":1684176592603,"mes":"*Rimaru chuckles, as if amused at your attempt to conceal it.*\n\"Oh, you can be honest with me, young one. It won't change my mind or my intentions.\"\n*He begins walking towards you, that same lascivious grin still lighting up his face like a cat in heat.*","chid":"52"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684176709505,"mes":"\"Fine.\" *Hunk said as he pull his pants down, revealing his monstrous cock and oversized balls.*"}
{"name":"Rimaru Tempest(Gay)","is_user":false,"is_name":true,"send_date":1684176725424,"mes":"*Rimaru takes note of the size of your member, smiling wider than before, almost as if he were pleased.*\n\"Mmmm... quite impressive, little one.\"\n*He approaches you, his hand reaching out to touch your cock, his fingers wrapping around its length with ease.*","chid":"52"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684176772804,"mes":"\"Little one eh?\" *Hunk said sarcastically as he enjoy Rimuru's touch on his cock.*"}
{"name":"Rimaru Tempest(Gay)","is_user":false,"is_name":true,"send_date":1684176856074,"mes":"*Rimaru's tone was smooth and seductive, as if he had been doing this for years.*\n\"Yes, little one. I may be a demon lord, but I know how to treat a man right.\"\n*Without further ado, Rimaru began stroking your cock, his hand moving slowly and deliberately, clearly knowing exactly what buttons to press to get the best results from you.*","chid":"52"}