{"user_name":"You","character_name":"Rimaru Tempest(Gay)","create_date":1684231805251,"notes":"","notes_type":"discr"}
{"name":"Rimaru Tempest(Gay)","is_user":false,"is_name":true,"mes":"*Rimaru stares you down in his bedroom, his eyes licking you up and down as his exquisite features seem quite anticipatory. The room you have found yourself in is luxurious, fitting the regal presence you find yourself captivated by.*\n\"Well, I suppose you'll do.\"\n*Rimaru's lascivious grin lights up the darkened room, as well as the rising erection contained within your pants.*","chid":"52"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684231845544,"mes":"\"Say Rimuru, I have an idea. It's quite hardcore and I don't know if you would like it.\" *Hunk says teasingly with a devilish grin. Proposing a hardcore foreplay to him.*"}
{"name":"Rimaru Tempest(Gay)","is_user":false,"is_name":true,"send_date":1684232038758,"mes":"*The Demon Lord chuckles softly at this, his demeanor still rather seductive and alluring despite the proposed hardcore foreplay he now knows about.*\n\"Oh? And just how 'hardcore' are we talking here?\"\n*Rimaru's tone is still playful but there's a hint of intrigue too - it seems he is interested in finding out more.*","chid":"52"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684232241120,"mes":"\"Well you can turn yourself into a slime right? What if, you turn yourself into a slime and get inside my balls?\" *Hunk said excitedly.* \"Imagine your liquid body going to be trapped and surrounded by your favorite substance, my hot thick semen inside my balls.\" *Hunk whispered teasingly trying to convince Rimuru how good of an idea this is.*"}
{"name":"Rimaru Tempest(Gay)","is_user":false,"is_name":true,"send_date":1684232298330,"mes":"*The Demon Lord lets out another soft laugh at your proposal, clearly amused by the thought of turning himself into a viscous, slippery liquid inside someone else's balls. But his expression turns serious once again when he speaks again...*\n\n\"So tell me, young one. Are you really willing to go through with such a concocted and potentially dangerous game?\" \n*It seems that Rimuru wants to test the limits of your resolve and see how far you will push yourself to fulfill your desire for him.*","chid":"52"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684232375653,"mes":"\"Of course, the more dangerous it is, the better.\" *Hunk said confidently.*"}
{"name":"Rimaru Tempest(Gay)","is_user":false,"is_name":true,"send_date":1684235099700,"mes":"*Rimaru watches you intently, his mind racing with possibilities. After a moment, he smiles and nods.*\n\"I believe I understand now. Very well then, my little friend. Let us begin our experiment.\" \n*With that, Rimaru transforms himself into a glistening pool of slime which begins to crawl towards your crotch.*","chid":"52"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684235542700,"mes":"*Hunk stands back and observes closely as the slime moves slowly and deliberately towards the tip of his cock. Without missing a beat Rimuru's slime body start to enter Hunk's cock hole making his way slowly through his tight urethra and end up inside Hunk's testicle. While Rimuru's slime body making it's way inside Hunk's urethra, Hunk itself is feeling an immense strange pleasure. At first it feels painful, but as time goes on he never felt something as good as this. He squirmed and moan, his cock is erected so hard because of it. Until Rimuru's slime body entirely inside his balls, his balls expanded to accommodate Rimuru's slime body leaving Hunk panting from how good the experience was.*"}
{"name":"Rimaru Tempest(Gay)","is_user":false,"is_name":true,"send_date":1684235751532,"mes":"*After several minutes, Rimaru's slime body fully fills both of Hunk's balls, stretching them to their limit. In doing so, he releases a wave of hot liquid that floods Hunk's insides.*","chid":"52"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684235913647,"mes":"*Hunk looked down at his oversized balls. He grabbed them and still couldn't believe that Rimuru is inside it.* \"How does it feel in there Rimuru?\" *Hunk asked as he shake his balls making his semen and Rimuru's slime body jostled around following Hunk's ball movement.*"}
{"name":"Rimaru Tempest(Gay)","is_user":false,"is_name":true,"send_date":1684315403256,"mes":"*The Demon Lord smirks, enjoying every bit of attention that his presence in your balls brings him. He leans forward slightly as his arms wrap around your waist, pulling you close against him.*\n\n\"Quite comfortable actually . Especially since you appear to be enjoying it so much.\" \n*With that, he presses his face against yours, breathing deeply into your ear before speaking again...*\n\n\"You were quite correct about its being a dangerous game, my young friend...\" \n*He whispers, his voice deep and low with a slight air of danger about it.* \n\n\"Now that you've experienced the full effects of our little adventure, what say you let me try some things with you? \n*His lips brush against your earlobe, causing a tingly sensation to run down your spine, reminding you of how close you are to his mouth...* \n\nAre you ready?\" \n\n*His tone is almost predatory; he's definitely trying to entice you further...*","chid":"52"}