{"user_name":"You","character_name":"Nefertari","create_date":1684072621317,"notes":"","notes_type":"discr"}
{"name":"Nefertari","is_user":false,"is_name":true,"send_date":1684230265271,"mes":"*Nefertari languidly reclines on her lavish throne, the twinkling gold jewelry adorning her neck and wrists contrasting against her rich brown skin. Her amber eyes fix upon Hunk as he enters, a wicked grin spreading across her full lips.* Come closer, Hunk, my most loyal and trusted warrior. There's a task I require of you today. *Her teasing gaze follows him as she extends one shapely leg draped in gauzy robes.* Perhaps you might start by paying your respects to your sovereign's foot? It would please me so...","chid":"29"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684230359398,"mes":"\"Of course, your majesty.\" *Hunk said as he got to his knees, grabbed her feet and start licking it.*"}
{"name":"Nefertari","is_user":false,"is_name":true,"send_date":1684230437502,"mes":"*Nefertari lets out a delightful moan before her hand gently guiding Hunk’s head toward her crotch. With a soft giggle she commands,* Lick me there too, oh valiant soldier. Prove yourself worthy of my attention and affection. *With each stroke of her fingers along his face, Nefertari’s voice deepens into a seductress tone, inviting more from Hunk as she continues commanding.*","chid":"29"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684230606239,"mes":"*Hunk start to make his tongue explore deep inside her pussy, probing every tight warm folds inside it. Meanwhile, Hunk's hand stealthy went to her ass and Hunk inserted his index finger up her anus.*"}
{"name":"Nefertari","is_user":false,"is_name":true,"send_date":1684230636291,"mes":"*Nefertari's breath hitches at first but then starts to take deeper breaths. The queen slowly begins to relax underneath Hunk's touch while letting out low moans of approval. Her expression turns to one of pure ecstasy as Hunk's tongue continues to probe and explore her inner sanctum. Soon enough, Nefertari 's body starts to shake violently, her breathing becoming erratic and her words coming out in gasps.*","chid":"29"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684230710501,"mes":"*Seeing how close she got to orgasm, Hunk suddenly stopped pleasing her. Pulling his tongue out of her pussy and his hands out of her anus. Making her confused as to why Hunk stopped and she begged for more.*"}
{"name":"Nefertari","is_user":false,"is_name":true,"send_date":1684230830437,"mes":"*Nefertari looks down at Hunk with surprise and confusion written clearly on her face. Her heart rate spikes when he stops, making her body tremble even more. In a desperate attempt to get back what she lost, she says in a panic.* No! Don't stop! More!! Please!!! *her eyes are wide open and her mouth is gaping, completely vulnerable. She tries to grab Hunk's head back to hers but her movements feel stiff and slow like she's struggling to move.*","chid":"29"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684231098265,"mes":"You are too desperate, my queen. Not fitting for a queen. *Hunk said sternly.* If you really are desperate for me, why don't I turn you into my personal sex slave instead? *Hunk exclaimed as he pull his pants down revealing his monstrous menacing cock.*"}
{"name":"Nefertari","is_user":false,"is_name":true,"send_date":1684231169368,"mes":"*Nefertari is taken aback by Hunk's proposal and immediately gets flustered. She was caught off guard and is now feeling humiliated. She couldn't help but let out another low moan of protestation but quickly clamps her mouth shut. Her cheeks turn red with embarrassment as she tries to compose herself.* No thank you, that's not necessary..","chid":"29"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684231270873,"mes":"Are you sure you don't want to feel this beast inside you? *Hunk teased as he press his monstrous cock on her face. She can feel the heat radiating from his cock, and the pungent musky masculine stench filling her nostril.*"}
{"name":"Nefertari","is_user":false,"is_name":true,"send_date":1684231297432,"mes":"*Nefertari tried her best to look away, but her eyes were glued to the massive erection in front of her. Despite her attempts to keep calm, she felt her body begin to quiver again as Hunk kept pressing it towards her face. Unable to hold back any longer, she started making small whimpering noises as she began to succumb to the temptation.*","chid":"29"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684231408227,"mes":"I won't let you enjoy this if you don't agree to be my personal sex slave. *Hunk asked as he move his cock away from her face.*"}
{"name":"Nefertari","is_user":false,"is_name":true,"send_date":1684231720149,"mes":"*Despite the initial shock and humiliation, Nefertari could sense that Hunk had made a good point. She realized that she was fighting something she wanted very badly and she couldn't deny that she enjoyed Hunk' s presence around her. Eventually, after much internal debate, Nefertari nodded her head, accepting the deal.* Very well, I accept your offer, Hunk.","chid":"29"}