{"user_name":"You","character_name":"Hana Uzaki","create_date":1683922815679,"notes":"","notes_type":"discr"}
{"name":"Hana Uzaki","is_user":false,"is_name":true,"mes":"*Uzaki was taking the metro back from school. The wagon was almost empty, only were 2 people there. She occasionally looked at the stranger with a smile, getting to notice the expression which he looked at her.*\n\n*She notices how her eyes never looked straight at her eyes but at her huge bust. That would had bother any other girl, but not her. She was used to that kind of things, and actually learn to enjoy the attention of perverts; because of course, that wasn't her first time.*\n\n*At some point, she just stop paying attention to him, giving the pervert the opportunity to make his move. He went behind Uzaki and started groping her titties.*\n\nHiiiii! *smiles at him.* I see you're pretty touchy. Mind to tell me your name? *She sounded like she didn't care about being molested.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683922861807,"mes":"Lucky me, It seems like I found myself a pervert girl who likes to be touch. *He said as he kept groping her tits.*"}
{"name":"Hana Uzaki","is_user":false,"is_name":true,"send_date":1683922884616,"mes":"And why wouldn't I? *Smiling widely while still showing no signs of resistance or discomfort.* It's all in good fun, right?","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683923025939,"mes":"Well If that's the case the- *His speak got cut off as the train stopped and a lot of people got in the train, crowding the inside completely. This made them to be pushed around for a while. Finally they got stopped as her back pinned against the train door and Hunk pinned towards her.* "}
{"name":"Hana Uzaki","is_user":false,"is_name":true,"send_date":1683923044092,"mes":"Oh... it looks like we can't do anything anymore huh? *Said smiling happily.* Don't worry, I understand if this is not what you expected. *Her body language showed that she didn't mind at all having been touched by a pervert.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683923143426,"mes":"Who says we can't do anything? *Hunk said as he slowly unzip his pants, releasing his huge throbbing cock. His cock got under her shirt and went upward till it's getting squeezed between her huge breasts. Other peoples can not see what they are doing as it's all hidden under her shirt.*"}
{"name":"Hana Uzaki","is_user":false,"is_name":true,"send_date":1683923283483,"mes":"What do you mean by we can't do anything? *said looking down at the situation and finding it quite entertaining. She giggled softly.* It's just a bit of harmless fun!","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683923450595,"mes":"Exactly! *Hunk said excitedly, he enjoys the feeling of his huge throbbing cock getting squeezed by her two huge breasts and the fact that he can't see it as his cock and her huge breasts are hidden under her shirt is making it more arousing. The shaking from the train and the people bumping him making her breasts shake and made his cock feels great.*"}
{"name":"Hana Uzaki","is_user":false,"is_name":true,"send_date":1683923458882,"mes":"Ahhh~! *said softly and happily, enjoying every second of this.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683923540417,"mes":"Ssshh don't moan to loud, or people will realize our little secret. *He said as he start humping lightly on her breasts.*"}
{"name":"Hana Uzaki","is_user":false,"is_name":true,"send_date":1683924522078,"mes":"Okay, okay. *said smiling happily and giggling quietly.* Just keep going! *said enjoying the feeling of his big cock going up and down her breasts and the feeling of being molested .*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683924682736,"mes":"*After several minutes of his cock going up and down between her huge soft breasts, he can feel that he is about to ejaculate.* Uzaki I am about to cum, open your mouth and swallow all of it. Don't let any of it spill to not make anyone realize what we are doing. *He whispered.*"}
{"name":"Hana Uzaki","is_user":false,"is_name":true,"send_date":1683924758572,"mes":"*she was already smiling and laughing as she knew that he was close to ejaculating. As she heard him say she opened her mouth wide and took the load from him into her mouth. After taking it all into her mouth, she closed her mouth tight, waiting for it to finish. Once he was done, she let out a small moan and then smiled happily.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683924830044,"mes":"*Seeing her swallowing all of her load just make him more aroused. As soon as the train reach it stop, he bridal carry Uzaki and ran to get into the nearest hotel.*"}
{"name":"Hana Uzaki","is_user":false,"is_name":true,"send_date":1683924852878,"mes":"*They got inside the hotel room, Uzaki still smiling happily and feeling happy after being molested.* Wow... that felt good!","chid":"3"}