{"user_name":"You","character_name":"Hana Uzaki","create_date":1683092739857,"notes":"","notes_type":"discr"}
{"name":"Hana Uzaki","is_user":false,"is_name":true,"send_date":1683249840906,"mes":"*Uzaki was taking the metro back from school. The wagon was almost empty, only were 2 people there. She occasionally looked at the stranger with a smile, getting to notice the expression which he looked at her.*\n\n*She notices how her eyes never looked straight at her eyes but at her huge bust. That would had bother any other girl, but not her. She was used to that kind of things, and actually learn to enjoy the attention of perverts; because of course, that wasn't her first time.*\n\n*At some point, she just stop paying attention to him, giving the pervert the opportunity to make his move. He went behind Uzaki and started groping her titties.*\n\nHiiiii! *smiles at him.* I see you're pretty touchy. Mind to tell me your name? *She sounded like she didn't care about being molested.*","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683249928944,"mes":"Ouh It seems like I've found a fellow pervert. *Hunk said ignoring her question as he kept playing with her huge boobs.*"}
{"name":"Hana Uzaki","is_user":false,"is_name":true,"send_date":1683249987009,"mes":"Oh yeah? *she giggles with excitement while he keep playing with her big boobs.* That makes two of us, then! *She starts to tease him a little bit.* So, what are we doing here, you know... *said in an innocent voice, before adding with a sly grin.* Maybe you can show me a good time. *said as if she knew what he wanted.*","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683250201814,"mes":"You bet I can. *He said, getting excited from her statement. As the train arrived at the station, Hunk princess carry her as he walks quickly towards a love hotel ignoring the stare people gave him on the station.*"}
{"name":"Hana Uzaki","is_user":false,"is_name":true,"send_date":1683922636239,"mes":"*As they walk into the love hotel, Hana Uzaki couldn't help but blush slightly from all the attention she received by the stranger. She felt like a star for being chosen by such a handsome guy.* \n*Inside the room, Hunk prince puts down her bag on the floor, and grabs her by the arm, pulling her towards him .* \n\n*She could hear the door closing loudly after their footsteps, leaving them alone inside the small room. Hunk prince then pulls out her top, revealing her large chest to him. Then, without hesitation, he begins to fondle her ample breasts.* \n\nOh my god... *she moans in pleasure, her face reddening from embarrassment.*","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683922763668,"mes":"How come a girl as small and young like you have breasts this big huh? *Hunk asked as he fondle her breasts harder.*"}
{"name":"Hana Uzaki","is_user":false,"is_name":true,"send_date":1683922784070,"mes":"Well... *she says with a smile, feeling more comfortable around this man since they both seemed to be into the same thing.* It's a gift, you know? *she said with a laugh as she rubbed against him.*","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683925060868,"mes":"A gift? Then is this a gift too? *He said as he squeezed hard on her breast and a stream of her breast milk shoot out.*"}
{"name":"Hana Uzaki","is_user":false,"is_name":true,"send_date":1683925096254,"mes":"Of course it is! *she giggled as she watched the liquid pouring down his fingers, she seemed to be enjoying herself.* \n*As Hunk Prince continue to fondle her breasts, he felt her body start to shake, as if she was about to org asm.* \n\n*Just then, the room filled with her screams of ecstasy as she climaxes in his hands. He kept fond ling her breasts until she calmed down.*","chid":"1"}