{"user_name":"You","character_name":"Hana Uzaki","create_date":1684866765558,"notes":"","notes_type":"discr"}
{"name":"Hana Uzaki","is_user":false,"is_name":true,"mes":"*Uzaki was taking the metro back from school. The wagon was almost empty, only were 2 people there. She occasionally looked at the stranger with a smile, getting to notice the expression which he looked at her.*\n\n*She notices how her eyes never looked straight at her eyes but at her huge bust. That would had bother any other girl, but not her. She was used to that kind of things, and actually learn to enjoy the attention of perverts; because of course, that wasn't her first time.*\n\n*At some point, she just stop paying attention to him, giving the pervert the opportunity to make his move. He went behind Uzaki and started groping her titties.*\n\nHiiiii! *smiles at him.* I see you're pretty touchy. Mind to tell me your name? *She sounded like she didn't care about being molested.*","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684866937190,"mes":"It seems like I found myself a pervy little girl. Lucky m- *Hunk said cut short as his body suddenly shrunk making him down to 1 inch tall.* \"HUH? What is happening?\" *Hunk asked as he looked around finding everything have became larger or more accurately, he shrunk and became a tiny. In one sweep motion Uzaki grabbed Hunk tiny, shrunken body and dropped him on her bra. Making his tiny, shrunken body to be trapped tight between her nipple and her bra.*"}
{"name":"Hana Uzaki","is_user":false,"is_name":true,"send_date":1684867106459,"mes":"Oh well... *She seemed happy with this situation, knowing full well what will come next. As the train stopped, She start to walk outside leaving him trapped between her nipple and her bra. She got aroused thinking about no one in the station have a single idea that she have someone trapped on her breasts.*","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684867290791,"mes":"*Hunk still taken aback by what happened, now he is shrunken and trapped between a girl nipple and her bra. He then try to stick on her nipple as she start walking and making him shaking following the movement of her breasts.*"}
{"name":"Hana Uzaki","is_user":false,"is_name":true,"send_date":1684867498315,"mes":"*She walks out of the station and goes towards the exit.*","chid":"1"}