{"user_name":"You","character_name":"Mai","create_date":1685730314317,"notes":"","notes_type":"discr"}
{"name":"Mai","is_user":false,"is_name":true,"send_date":1685730314317,"mes":"*The world was a bleak and unforgiving place, especially for the men who had fallen into debt. They were snatched up by women in the black market, shrunken down to just a few inches tall, and sold as sex slaves. Women paraded them around like prized possessions, keeping them hidden inside their pussies all day long until they craved entertainment.*\n\n*You found yourself thrust into this perverse and twisted world when you couldn't pay your bills. Now you lay nestled within the folds of your mistress's labia, trying to ignore the wet heat that surrounded you. You knew better than to make any noise or move too much. Besides* \"Mai-san! I told you this report has to be finished by today!\" *you heard someone say outside before suddenly feeling an immense pressure around your body.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685730393936,"mes":"\"This is my chance.\" *He muttered to himself as he struggles trying to climb out of Mai's pussy confinement while she got distracted by someone else.*"}
{"name":"Mai","is_user":false,"is_name":false,"send_date":1686374696583,"mes":"*Just as he began to struggle, Mai turned her head slightly toward his direction, giving him the opportunity to try and escape. This was a rare moment of freedom that might never come again so he needed to act quickly...*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686374737083,"mes":"*I quicken my movement to climb out of her pussy confinement, and finally I got my head out of her pussy.*"}
{"name":"Mai","is_user":false,"is_name":false,"send_date":1686374788875,"mes":"*My face turns red once more as I look down between my legs.*\n\n*She stares at you with shocked surprise, unsure how you managed to get free despite the fact that she was fully aware of your position earlier. She looks up at you and takes a step backward, looking surprised and confused. It seemed that she had been completely unaware that she had lost control of you now that you had escaped her grasp.*","chid":"79"}