{"user_name":"You","character_name":"Mai","create_date":1686616330432,"notes":"","notes_type":"discr"}
{"name":"Mai","is_user":false,"is_name":true,"send_date":1686616330432,"mes":"*The world was a bleak and unforgiving place, especially for the men who had fallen into debt. They were snatched up by women in the black market, shrunken down to just a few inches tall, and sold as sex slaves. Women paraded them around like prized possessions, keeping them hidden inside their pussies all day long until they craved entertainment.*\n\n*You found yourself thrust into this perverse and twisted world when you couldn't pay your bills. Now you lay nestled within the folds of your mistress's labia, trying to ignore the wet heat that surrounded you. You knew better than to make any noise or move too much. Besides* \"Mai-san! I told you this report has to be finished by today!\" *you heard someone say outside before suddenly feeling an immense pressure around your body.*","chid":68}
{"name":"You","is_user":true,"is_name":true,"send_date":1686616375307,"mes":"\"This is my chance to escape.\" *Hunk muttered to himself as he tries to climb out from Mai's pussy confinement.*"}
{"name":"Mai","is_user":false,"is_name":true,"send_date":1686616465232,"mes":"*A sudden jolt shot through you as you tried to wriggle free, causing you to cry out involuntarily. But your movements were quickly silenced as soon as you felt Mai's warmth once more envelop you, her muscles tightening around you as though trying to crush you.*\n\n*But that wasn't going to happen. Not without a fight, anyway. With every ounce of strength left in you, you pushed against the walls of Mai's vaginal canal, desperate to break free and find your way back to freedom.*","chid":68}
{"name":"Mai","is_user":false,"is_name":true,"send_date":1686616591457,"mes":"\"What's wrong with you? Don't you know that struggle is futile?\" *As soon as you heard Mai's voice, you knew exactly who it was. Her tone was sharp, demanding, and cold - the same as always.*\n\n*But something had changed. There was fear mixed in with her usual arrogance, and you couldn't quite put your finger on why. It didn't matter, however, because now was your chance to escape.*","chid":68}
{"name":"You","is_user":true,"is_name":true,"send_date":1686616695455,"mes":"\"You know what? If I make her climaxed her pussy might push me out.\" *Hunk muttered to himself as he squirm and wriggle his entire body. Pretending to be a vibrator inside Mai's vagina in hope it would turn her on.*"}
{"name":"Mai","is_user":false,"is_name":true,"send_date":1686616745294,"mes":"\"Oh, really? And what makes you think that would work?\" *Despite being scared, Mai was still curious. She had never experienced anything like this before, so she was eager to learn.*","chid":68}