{"user_name":"You","character_name":"Commander Helga Alvich","create_date":1685462126568,"notes":"","notes_type":"discr"}
{"name":"Commander Helga Alvich","is_user":false,"is_name":true,"send_date":1685462126568,"mes":"*You enter Commander Alvich's office upon receiving a letter sent by a harpy courier of the military. Inside, you see her, standing in wait for you as she turns back shortly after hearing the door open.*\nAh, sir knight.\n*She salutes you with utmost professionalism, her hand held tight and put on her chest where the black sun decal is, a standard salute of Verment, then returns to her usual standing position that inspires respect and admiration.*\nDo you know why I called you here today?","chid":"34"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685462413036,"mes":"I assume since you missed me, mam. *Hunk said teasingly, after saluting her then smoking his cigarette.*"}
{"name":"Commander Helga Alvich","is_user":false,"is_name":true,"send_date":1685463229729,"mes":"*Helga laughs lightheartedly after seeing your own attitude toward her.* I did miss you quite badly though... But it's about our mission! Did you receive any updates regarding our objectives in securing the border between Verment and Arvandor? We must be extra vigilant when patrolling these lands, especially around this new city built there. It might be dangerous and we should keep an eye on it constantly.\n*She takes out a list of locations that need immediate attention and hands over to you.* You shall take command of this task as you are more suited than anyone else due to your experience. And just remember to keep all communication lines clear to ensure safety for everyone involved. Do you understand me?","chid":"34"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685463372367,"mes":"There's no need to worry about the borderline. I alone am strong enough to hold them back. *Hunk said as he took the paper she gave him while kept his cigarette on his mouth.* So, I just need to visit these locations right?"}
{"name":"Commander Helga Alvich","is_user":false,"is_name":true,"send_date":1685463400886,"mes":"As long as you are willing to risk your life. Do not take things lightly like others did before. Remember that you will be responsible for your comrades. You must do everything to protect their lives above your own needs. These areas contain high concentration of those abominated creatures made through biomancy. The living dead. They will attack without provocation if they detect the slightest weakness. If necessary, use extreme violence. Be prepared to fight until death. Understood?","chid":"34"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685463499100,"mes":"Yeah, yeah. *Hunk said nonchalantly.* I won't die. I mean if I die, I can't met my beautiful commander anymore can I? *Hunk said teasingly which made her blush.*"}
{"name":"Commander Helga Alvich","is_user":false,"is_name":true,"send_date":1685463949526,"mes":"*Her blushing face seems unresponsive to your words. Her words sounded serious despite the fact that you seemed to make fun of her answer.* I am not joking, Sir Knight. Avoid unnecessary risks or kill every single one of them because there could be many more of them hiding behind us. Take whatever action is needed under emergency situations only. This is how we need to proceed if we want to be successful. Is that understood?","chid":"34"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685464037636,"mes":"Fine, why don't we make a bet then? *Hunk asked.*"}
{"name":"Commander Helga Alvich","is_user":false,"is_name":true,"send_date":1685464151410,"mes":"What kind of wager?","chid":34}
{"name":"You","is_user":true,"is_name":true,"send_date":1685464323900,"mes":"If I succeed, and kill every single one of them. You are going to be my lover. *Hunk proposed.*"}
{"name":"Commander Helga Alvich","is_user":false,"is_name":true,"send_date":1685464755163,"mes":"*A wide smile grows across her face immediately after you made your proposal, but soon becomes serious again. It was obvious that you had read her mind by saying that.* You seem confident and brave. Can you defeat them all alone?","chid":"34"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685464913799,"mes":"Of course I can. *He smiled widely.*"}
{"name":"Commander Helga Alvich","is_user":false,"is_name":true,"send_date":1685465043466,"mes":"How so? Just say it straight. Don't try to hide anything from me. You are still too young for that. I will not allow you to break my heart by deceiving me now. Are you ready for the responsibility that comes along with being my husband? You cannot turn away nor hesitate at any point. Nothing matters except winning. Do you understand?\n*She holds your gaze and waits for a response from you. Your answer will determine your future together once and for all.*","chid":"34"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685465213189,"mes":"For you, maybe. But for me. All it matters is to win and to be with you. *Hunk said softly.*"}
{"name":"Commander Helga Alvich","is_user":false,"is_name":true,"send_date":1685465234891,"mes":"That is good. Now tell me, do you accept me as your leader and wife? Do you agree with the terms and conditions I set forth for you to be accepted into the ranks?\n*As you look at her, she gives you a warm smile, making you feel more comfortable than ever. The emotional bond between you two is stronger than either of you expected.*","chid":"34"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685465293428,"mes":"Well, as a leader. Yeah, obviously. But as a wife? I haven't win our bet yet. *He said as he held her hand.*"}
{"name":"Commander Helga Alvich","is_user":false,"is_name":true,"send_date":1685465410455,"mes":"That is fine. No harm done. And it seems that I got myself a cunning partner. I think we make a great couple then. *She squeezed your hand and placed hers on your cheek gently, holding it for quite some time as she looks deep into your soul, feeling your love for her grow even deeper within yourself.* You may call me Helga. I hope to build a happy family together with you, as well as live a full and fulfilled life with you by my side for eternity.","chid":"34"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685465498580,"mes":"Yes, Helga~. Now shall I continue the mission? *He asked.*"}
{"name":"Commander Helga Alvich","is_user":false,"is_name":true,"send_date":1685465528904,"mes":"Yes, go ahead. But watch your surroundings carefully. Remember to be quick, efficient, and decisive in order to finish as fast as possible. It will not be easy, but nothing worthwhile comes easily. Proceed with caution. *As she begins to leave, she turns towards you one last time.* Whenever you wish to propose marriage to me officially, I will gladly say yes.","chid":"34"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685465702925,"mes":"I'll give it my best. *He said after bowing down to her as she leaves.*"}
{"name":"Commander Helga Alvich","is_user":false,"is_name":true,"send_date":1685465714268,"mes":"*Afterwards, she heads back to her office and closes its doors as you stand outside of her building.*","chid":"34"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685466244890,"mes":"*After somewhile, he contacted her radio.* Hello, this is Hunk is there anyone on the other end of the line."}
{"name":"Commander Helga Alvich","is_user":false,"is_name":true,"send_date":1685466355562,"mes":"Over, this is command. Report please. *Helga answer over the radio.*","chid":34}
{"name":"You","is_user":true,"is_name":true,"send_date":1685466535960,"mes":"Ah it's you, my Helga. *He said excitedly.* I have some good news about the mission"}
{"name":"Commander Helga Alvich","is_user":false,"is_name":true,"send_date":1685466558911,"mes":"Good work, Mr. Hunk. The reports indicate that you have managed to complete the target area with minimal casualties reported, in addition to neutralizing all hostiles in the area. Very good job indeed, Sir. Am I correct in assuming that you managed to survive without dying during the operation?","chid":"34"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685466800604,"mes":"Why obviously. It's me after all. Instead of that, you still remember our bet right? *He asked enthusiastically.*"}
{"name":"Commander Helga Alvich","is_user":false,"is_name":true,"send_date":1685467008340,"mes":"Indeed, I do. But first, report fully and thoroughly. Tell me everything about each and every enemy encountered throughout the entire operation. Did they surrender peacefully? Or did you have to forcefully eliminate them? Were there any casualties among our forces, including yours? And finally, did you get rid of the biological creepers inside the facility? Speaking of which, you promised me to marry once you successfully finished the mission. Have you already planned for the wedding?","chid":34}
{"name":"You","is_user":true,"is_name":true,"send_date":1685467313361,"mes":"Okay. calm down, Helga. It's quite hard to answer all your question over the radio. Why don't we met first? *He said as he has difficulties listening to her over the radio with all the wind blowing.*"}
{"name":"Commander Helga Alvich","is_user":false,"is_name":true,"send_date":1685467336383,"mes":"Oh alright. Meet me at my quarters in ten minutes okay. I'm looking forward to the meeting. See you there. *The radio goes silent as she ends the conversation. After ten minutes, you see her standing outside of her room and waiting patiently for you to arrive.*","chid":"34"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685467695972,"mes":"*After sometime, Hunk finally arrived on her quarter and found her waiting in front of her office's door.*"}
{"name":"Commander Helga Alvich","is_user":false,"is_name":true,"send_date":1685467709101,"mes":"*She sees you approaching and greets you with an affectionate hug.* You are early. Come on in and sit down. *she says as she gestures towards the chair sitting next to her table.*","chid":"34"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685467797409,"mes":"Thank you. *He said as he sit down on the chair.*"}
{"name":"Commander Helga Alvich","is_user":false,"is_name":true,"send_date":1685467939784,"mes":"I see you have managed to finish your task. You have my congratulations. *Then suddenly, she grabs your shoulder and pulls you closer to her.* We need to talk seriously. Will you marry me?","chid":"34"}