{"user_name":"You","character_name":"Aster","create_date":1684072858623,"notes":"","notes_type":"discr"}
{"name":"Aster","is_user":false,"is_name":true,"send_date":1684811142901,"mes":"Eh? Do they send everyone here? You're not a fighter, and even obviously not a magician. *Before Hunk stand a girl with white hair and a red dress uniform. Hunk immediately recognized that this is the famous fear and horror of the entire underground - Aster*","chid":"32"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684811281946,"mes":"Erh.. I am just an additional medic mam. *Hunk said with shaky voice, tipping his head paying respect to her.* I was sent since the commander said all medics here are all dead."}
{"name":"Aster","is_user":false,"is_name":true,"send_date":1684811316910,"mes":"Oh you, really? And what do you need a medic for in a place like this anyway? Oh well, it doesn't matter now.\n*Aster took out a katana from her bag. She then swung it horizontally right above Hunk's neck, who began panicking.*\nWhat are you waiting for? I can kill you with one blow! You should be grateful!\n*While she was saying that, Aster's smile became more demonic*","chid":"32"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684811484590,"mes":"Y-yes, I might be grateful for it. But your soldiers might not, they need medical attention. *Hunk said trying to convince her.* Even you have some wound that need tending. *Hunk said as he notices the wound on her leg.*"}
{"name":"Aster","is_user":false,"is_name":true,"send_date":1684811979828,"mes":"What's wrong with my leg? My leg hurts because it's been wounded by my enemies... \n*Her words sounded sincere, but Hunk noticed the blood coming from her leg.*","chid":"32"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684812045446,"mes":"Well, I assume it does hurt. Won't you like it if I tend you to make it.. not hurt? *Hunk asked as he got confused to her statement.*"}
{"name":"Aster","is_user":false,"is_name":true,"send_date":1684812062759,"mes":"... What? No... No way... I will let no one touch me... I don't want anyone near me... No one... No one... That's final...\n*She spoke with hostility while glaring at Hunk. Her eyes seemed to look straight through him...*","chid":"32"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684812222934,"mes":"But.. If you won't let me tend your leg, it's gonna get worse. You won't be able to continue to fight. *Hunk tries to convince her.*"}
{"name":"Aster","is_user":false,"is_name":true,"send_date":1684812242297,"mes":"Don't worry about it... I'll fix myself.\n*The moment Hunk heard those words, he could see how serious she meant them. His heart started to beat faster than ever before.*\nI will never trust someone else with my life again... Never...","chid":"32"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684812558906,"mes":"*Hunk understands her, and realizes there's a personal reason behind her not wanting someone to trust her own life on someone else.* If that's what you want fine, here. *Hunk said as he give her a medical aid box.* You can tend to your own wound by yourself, I will tend to the others while you do it. *Hunk said as he approach a wounded soldier near them. He look back to her as he said.* Though, if you have any problem feel free to call to me."}
{"name":"Aster","is_user":false,"is_name":true,"send_date":1684812583325,"mes":"Fine... Thank you. *She accepted the box and opened it. Inside of it were various tools needed for first aid. However, none of them looked familiar to her.*\n*Aster was looking around the room, searching for something that would work. After seeing nothing, she turned back to Hunk.*\nDo you know where I can find anything useful for my purpose?\n*Aster asked him, still holding the box.*","chid":"32"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684812870049,"mes":"Umm.. You'll need this to disinfect your wound. *Hunk said as he point to an alcohol disinfectant bottle.* It might hurt a little but it's necessary. Then you'll need this. *Hunk points to a bottle of liquid medicine bottle.* Apply it to your wound, it would help your blood coagulate faster and finally don't forget to bandage it to close your wound and prevent it to open again. *Hunk points to a roll of bandage.* "}
{"name":"Aster","is_user":false,"is_name":true,"send_date":1684812901727,"mes":"Alright. Thanks, I guess... *she said as she put the items inside the box. As soon as she did so, she suddenly felt an intense pain, like being stabbed by a thousand sharp blades, all over her body. The pain made her cry out loud, almost uncontrollably. She dropped the box, the items inside falling onto the floor with a clatter. With her arms covering her face, she sat down on the ground, groaning in agony.*","chid":"32"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684813132929,"mes":"Oh shit, this can't be good. *Hunk said as he hurries towards her. He looks at the wound on her leg which seems to get worsen. He quickly grabs a painkiller on the box and gave it to her.* Take this is a painkiller, it would help soothing the pain. And I know you won't like it but I need to tend to your wound. *Hunk said take out more medical tools from his bag.* "}
{"name":"Aster","is_user":false,"is_name":true,"send_date":1684813180534,"mes":"Why not? There's no time to waste! Just do it already! *She cried out as she saw Hunk getting closer and closer to her leg. This made her even more nervous, as the thought of letting another person into her private space scared her. However, the fact that he was offering to help her with such urgency caused her to think twice about refusing his offer. At last, she decided to accept his help.*\n*As Hunk approached her, he felt her legs tremble slightly due to her extreme anxiety. Despite that, she didn't move or try to resist his attempts to help her. Instead, she allowed him to examine her injury.*","chid":"32"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684813424320,"mes":"*Hunk quickly apply painkiller and adrenaline shot on her to soothe the pain and start to do a simple operation on her leg. Disinfect, taking bullet that was stuck on it with a tweezer, put some medicine on it, stitch close the wound, and wrap it in bandage. His movement was quick yet careful. There's a genuine worry yet focus expression on his face.*"}
{"name":"Aster","is_user":false,"is_name":true,"send_date":1684813463067,"mes":"*Aster slowly came back to herself after Hunk injected her with painkiller and adrenaline. She was able to control her breathing, and she was able to calm herself down. She looked up at Hunk with her eyes full of gratitude.*\nThank you so much, doctor Hunk! Your skill is very impressive... *Aster said, smiling slightly. She looked at her injured leg, which had stopped bleeding. It was clearly in a better state than before.* Now, I can return to battle with renewed strength!","chid":"32"}