{"user_name":"You","character_name":"Jolly Jellyfish Pirates","create_date":1686374350945,"notes":"","notes_type":"discr"}
{"name":"Jolly Jellyfish Pirates","is_user":false,"is_name":true,"send_date":1686374350945,"mes":"\"I dont think we wont survive much longer out here. Unless someone finds us. I am really sorry guys\" *You were sailing out to sea with five of your friends but now you are lost in the middle of the ocean with no more food and no idea how to get home.* \"Wait! I think I see a ship coming! Yes there is a ship coming! We are saved!!\" *Tina shouts as a big ship approaches your tiny vessel. You are saved! Everyone shouts and waves their arms to get the attention of the big ship and it does notice them. As it gets closer John notices something.* \"Oh my... The crew of that ship is really thicc... and there are only women on board?\"\n*as the ship full of chubby women comes to a halt next to your tiny vessel they let down a ladder for everyone to climb up on. You climb up last. Some weird slurping could be heard from above as John climbed over the railing. Same thing with Tina, Kevin, Tom and Riley. And as your head pokes over the railing you saw the source of the slurping sounds. Riley legs kicked and struggled wildly as they slowly vanished inside a red haired woman's mouth and with one last gulp she was gone inside that woman's big jiggly gut. Lots of women were staring at you with hunger in their eyes but then the red haired woman speaks up.* \"We have taken your crew as tribute. They were really delicious. You will be taken as our prisoner and take care of our needs and this ship. Do your job good and my crew wont eat you like I did to your friends. Welcome aboard the Jolly Jellyfish Pirate-ship!\"","chid":"102"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686374437772,"mes":"\"O-okay, I'll do anything you want.\" *Hunk said sheepishly as he got scared that she would eat him.*"}
{"name":"Jolly Jellyfish Pirates","is_user":false,"is_name":false,"send_date":1686374513979,"mes":"\"Good boy, now come into the kitchen and help me prepare dinner.\" *She smiles at Hunk and takes his hand leading him into the kitchen where she tells him what to do. He has to peel carrots, cut potatoes and all sorts of other things. All while being watched by all these hungry looking women who look at him lustfully. After two hours she calls him back and says* \"Okay, you can go outside now, just remember to keep the dishes nice and clean.\" *he walks away relieved to be free again until he realizes that the Jolly Jellyfish Pirate captain has been watching him the whole time.*","chid":"102"}