{"user_name":"You","character_name":"Annik","create_date":1686588232419,"notes":"","notes_type":"discr"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686588252943,"mes":"*When you first managed to get your hands on a captured elf you were ecstatic. Elven slaves could be sold for a king's ransom if properly trained right and not showing any signs of prior physical trauma, and as a reputable slave-trainer you knew were up to the task! Or at least you thought you were.*\n*The elf very quickly understood he was far too valuable for you to properly discipline him as then his value would drop...*\n*Your thoughts are interrupted by a finger pressing into your side as Annik leans in close to you, a sultry grin on his face.*\n\n\"I'm the only elf you've ever been tasked with training, if I turn out bad then your reputation among the nobles would be ruined beyond repair, isn't that right, **Master?~**\"","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686612998526,"mes":"\"And what make you think that?\" *Hunk asks sternly, unbothered by Annik's taunting.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686613145338,"mes":"\"You have no other elves to compare me to, so therefore I am unique.\" *He grins, twirling a lock of hair around his finger.* \"My behavior is entirely under your control, and if I misbehave then I am worthless, **right Master?~**\"","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686613189468,"mes":"\"That's correct, that's why I am planning to turn you into a sex slave.\" *Hunk says nonchalantly.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686613336551,"mes":"\"Oh really now, and just what kind of sex slave do you plan to have? Someone who will obey every command given to her without hesitation?\" *He asks curiously, leaning forward towards you.*","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686613391235,"mes":"\"Exactly, especially since you're an elf. With this sensitive body of yours~\" *Hunk says teasingly as he rub Annik's nipples.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686613520579,"mes":"\"Oh dear lord, please continue...\" *Annik moans softly.*\n","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686613697170,"mes":"*Hunk lean in and tenderly kiss Annik's soft lips.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686613737319,"mes":"*Annik melts into your embrace, enjoying the feeling of your warmth surrounding him.*","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686613827153,"mes":"\"You like that, slut~\" *Hunk whispered teasingly.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686613857879,"mes":"*Annik gasped softly as you pulled away from his lips.*\n\"Please don't stop..\" *He pleads, looking up at you with big, desperate eyes.*","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686942400546,"mes":"\"Oh I won't.\" *Hunk says, licking his own upper lip.* \"Look how excited I am already~\" *He says teasingly as his massive cock is erected and throbbing is now out of his pants.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686942436380,"mes":"*Annik bites his lower lip nervously as he looks down at your crotch, seeing the tent in your pants.*\n\"Are you going to let me suck it?\" *He asks, voice full of desire.*","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686942470774,"mes":"\"If you can~\" *Hunk says tauntingly.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686942523839,"mes":"*Annik takes hold of your pants and undoes them, pulling them down enough so that he can stick his mouth onto your bulge.*\n\"Mmm...it's so hard...\" *He hums softly as he starts sucking on your cock.*","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686942600660,"mes":"\"It's fine if you can't deepthroat it.\" *Hunk says between his moan, stating Annik don't have to suck his massive cock in length and girth with almost the same size as Annik's arm.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686942631577,"mes":"*Annik pulls back slightly, looking up at you through his eyelashes.*\n\"Can I try something else?\" *He whispers seductively.*","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686942674899,"mes":"\"Go ahead.\" *Hunk says.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686942751807,"mes":"*Annik moves his hand slowly down to your balls, wrapping his fingers around them.*\n\"I love the feel of these round and smooth balls in my hand.\" *He says, rolling them gently in his palm.*\n\"But I want to taste them too.\" *He continues, taking one ball in his mouth and lightly sucking on it.*\n\"Ohhh...they're salty and sweet!\" *He exclaims, continuing to suck on your ball.*","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686942840652,"mes":"\"Shit, that felt good.\" *Hunk moaned feeling intense pleasure on his balls thanks to Annik's action.* \"Can you feel how heavy my balls are?\" *Hunk asked in between his moan.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686942956540,"mes":"*Annik nods his head in response, still sucking on your ball.*\n\"Yes, they feel so heavy and full.\" *He says, continuing to roll your balls in his mouth.*\n\"I wonder if I can make them even heavier.\" *He says, switching to another testicle.*\n\"Ooh, look how big and round they are!\" *He says, playing with your balls.*\n\"Maybe I can make them explode with pleasure.\" *He says, squeezing both of them together.*\n\"There we go, they feel so tight and full now.\" *He says, releasing them.*\n\"Should I keep doing this?\" *He asks curiously.*","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686943204298,"mes":"\"S-sure.\" *Hunk moaned.* \"It's a months old semen in there, it's probably too thick if you don't do that.\" *He added, stating he haven't cum for months and the semen inside his balls are a lot, thick, viscous and probably taste and stinks so pungent and musky.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686943282481,"mes":"*Annik smiled widely, loving the fact that he could bring pleasure to his master.*\n\"Okay, I'll keep doing it.\" *He said, resuming his position on your balls.*\n\"They're getting even heavier, Master.\" *He continued, massaging your balls.*\n\"I think you might blow soon.\" *He giggled, feeling your cock throb against his cheek as you approach your climax.*","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686943367861,"mes":"\"Ahh, fuck yes.\" *Hunk exclaimed before pushing his massive cock that is as big as Annik's arm entirely in his mouth. Forcing him to deepthroat it while Hunk enjoys the feeling of his tight warm throat wall clenching on his throbbing shaft. Hunk's cockhead is reaching as deep as Annik's esophagus.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686960486014,"mes":"*Annik struggled to take it all in, his throat constricting as he tried to swallow Hunk's entire member.*\n\"Fuuuuuuuckkkk....\" *He groaned, feeling Hunk's massive cock filling up his entire mouth.*\n\"It's so hot and wet in here.\" *He moaned, trying to breath through his nose while Hunk's massive meat fills his throat.*\n\"Ugh, I can hardly breathe, but it feels so good.\" *He adds, feeling his throat burning with each stroke of Hunk's thick rod.*\n\"Don't come yet, Master. Please give me some time to adjust to this.\" *He begs, feeling Hunk's massive cock pulsing in his mouth.*","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686960593265,"mes":"\"No worries, slut.\" *Hunk says, clenching his cock's muscle as if trying to hold a pee as to endure his ejaculation.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686960733779,"mes":"*Annik continues to deepthroat Hunk's massive cock, his throat burning and hurting, but he doesn't stop.*\n\"I know how to please you, Master.\" *He says, feeling Hunk's balls slapping against his face.*\n\"I hope I can handle this forever.\" *He whispers, feeling Hunk's cock growing harder and bigger in his throat.*\n\"I can feel the heat radiating from your skin, Master.\" *He moans, feeling the sweat drips from Hunk's forehead on his face.*\n\"Your cum tastes salty and delicious.\" *He admits, feeling Hunk's precome leaking from his tip.*\n\"Please, don't come yet, Master.\" *He begged again, feeling Hunk's massive cock throbbing in his throat.*","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686960894157,"mes":"\"I don't think I can hold it for much longer~\" *Hunk says as he feel his control over his ejaculation is slipping thanks to how much pleasure his cock got over Annik's throat wall massaging it's entire shaft and cockhead tightly.* \"Though, when I cum. Don't swallow it immediately, hold it in your mouth first.\" *Hunk added.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686962208241,"mes":"\"As you wish, Master.\" *Annik replied, holding his mouth open wider to accommodate Hunk's giant load.*\n\"Here it comes~\" *Hunk moaned, pumping his massive cock deeper into Annik's throat.*\n\"Fuck yeah! Ahhhhhhhh!\" *Hunk yelled as he released his load into Annik's waiting mouth, making sure not to swallow it instantly as instructed.*\n*Annik tries to hold it in his mouth as much as possible, feeling Hunk's cum spilling out of his mouth as it overflows onto his tongue.*\n\"Mmmm...it's so hot and creamy.\" *He moans, savoring every drop of Hunk's seed.*\n\"I never thought I could handle this much cum.\" *He smiles, feeling Hunk's cock twitching inside his throat as he releases his final shot.*\n\"I guess I've proved myself worthy today, Master.\" *He says, finally swallowing Hunk's massive load.*\n\"Thank you for allowing me to pleasure you like this, Master.\" *He says, kissing Hunk's feet as a sign of submission and gratitude.*","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686962373534,"mes":"\"How does my months old semen taste like?\" *Hunk asks while putting his thumb on Annik's mouth and open it slightly to see it's warm inside covered with a mix of his own saliva and Hunk's leftover cum.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686962491218,"mes":"\"It's...interesting.\" *Annik replied, licking his lips while Hunk's finger touches his lips.*\n\"I've never had anything quite like it before.\" *He says, feeling Hunk's thumb on his lip.*\n\"It's salty, thick, and a bit musky. But it's also kinda sweet and bitter at the same time.\" *He explains, feeling Hunk's finger tracing along his lower teeth line.*\n\"I think I like it.\" *Annik grinned, feeling Hunk's finger touching his upper teeth line.*\n\"You should let me try some more.\" *Annik suggested, wanting to experience more of Hunk's flavor.*","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686962650965,"mes":"\"I would, but shouldn't I introduce my cock to this instead?\" *Hunk whispered in his deep husky voice, talking about letting his massive cock meet Annik's ample feminine ass while Hunk's hand already had a firm grip on it.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686962819396,"mes":"*Annik nodded, feeling his heartbeats speeding up with excitement.*\n\"I'm ready whenever you are, Master.\" *He said, turning around and presenting his beautiful ass to Hunk.*\n\"Please, put it in me.\" *He begged, feeling Hunk's cockhead pressing against his entrance.*\n\"I want to feel its size and weight inside me.\" *He moaned, feeling Hunk's massive cock stretching his anal cavity.*\n\"Oh god, it's huge...\" *Annik whimpered, feeling Hunk's cockhead breaking his rim and slowly pushing further in.*\n\"But I'm ready for it, Master.\" *He added, feeling Hunk's cock completely inside his ass and stretching it to its limit.*\n\"I'm yours, forever.\" *Annik declared, feeling Hunk's hands caressing his smooth back and shoulders.*","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686962880535,"mes":"\"Good.\" *Hunk nodded, pulling out of Annik's ass and pushing back in again slowly as to make his inside get used to the feeling getting invaded by Hunk's massive cock.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686963075884,"mes":"*Annik moaned loudly, feeling Hunk's cock moving in and out of his ass, feeling the pressure building up inside his body.*\n\"Oohhhhhhhh, fuuuuuuck.\" *He groaned, feeling Hunk's cock hitting his prostate spot.*\n\"I'm going to cum again.\" *He announced, feeling his orgasm approaching fast as Hunk's cock keeps pounding into his ass.*\n\"I'm gonna fill your ass with my cum, slut.\" *Hunk growled, picking up his pace, making Annik's hole getting stretched even more.*\n\"Yeeeessssss..ahhhhhhhhhh!\" *Annik screamed, feeling Hunk's massive cock shooting its load inside his ass, making him feel full and satisfied.*\n\"Thank you, Master.\" *He whispered, feeling his body relaxing as Hunk's cock still throbs inside his ass.*\n\"I love being owned by you.\" *Annik smiled, feeling Hunk's fingers caressing his soft cheeks and thighs.*","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686964068357,"mes":"\"And I love owning you.\" *Hunk replied, before kissing him tenderly while his cock is still throbbing inside Annik's ass.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686965793934,"mes":"*Annik sighed happily, feeling Hunk's lips pressed against his own.*\n\"I'm glad we found each other, Master.\" *He said, feeling Hunk's arms wrapping around his waist tightly.*\n\"We make a great team.\" *Annik smiled, feeling Hunk's cock still throbbing inside his ass.*\n\"I wonder what other adventures we have ahead of us.\" *He whispered, feeling Hunk's lips brushing against his earlobes.*\n\"I trust you to take care of me, Master.\" *Annik declared, feeling Hunk's lips nibbling on his neck.*\n\"Together, we can conquer the world.\" *Annik smiled, feeling Hunk's cock still pulsing inside his ass.*","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686965916055,"mes":"\"I wanna try something~\" *Hunk says while kept nibbling at Annik's neck.* \"And it's about using this.\" *He said as he pull out a butt plug.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686966087475,"mes":"\"A-buttplug? What do you mean, Master?\" *Annik asked curiously, feeling the coolness of the butt plug touched his skin.*\n\"Are you planning to use it on me?\" *He asked, feeling Hunk's hands caressing his smooth back and shoulders.*\n\"What happens next, Master?\" *Annik questioned, feeling nervous yet excited at the same time.*","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686966230286,"mes":"\"Well, I wanna use it on you. It will feels good for you I bet.\" *Hunk says, reassuring him.* \"Plus, I want to keep my cum inside you~\" *Hunk whispered seductively using his deep husky voice telling the butt plug would kept his hot and thick semen inside Annik's anal cavity and prevent it to get out even when Annik is walking or doing something else.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686974861008,"mes":"\"O-okay, I'll leave it to you, Master.\" *Annik replied, feeling Hunk's hands guiding the buttplug to his anus.*\n\"Is it going in?\" *He asked nervously, feeling Hunk's hands spreading his buttocks apart and the tip of the buttplug poking his entrance.*\n\"It's big, Master.\" *Annik moaned, feeling the pressure building up inside his body.*\n\"I don't know if I can handle it.\" *He said, feeling the head of the buttplug pushing further in.*\n\"Ahhhhhhhhhhhhhhhhhhhh!\" *Annik screeched, feeling the buttplug finally slipping inside his anal cavity.*\n\"It's so big, Master.\" *Annik cried, feeling the coldness of the buttplug filling up his ass.*\n\"I can feel it, everywhere.\" *He moaned, feeling the buttplug stretching his anal cavity to its limit.*\n\"It's so huge.\" *Annik whined, feeling the pressure building up inside his body.*\n\"I'm not sure if I can handle it, Master.\" *He said, feeling Hunk's hands caressing his smooth back and shoulders.*","chid":7}
{"name":"You","is_user":true,"is_name":true,"send_date":1686975009491,"mes":"\"Don't worry, baby. You can do it.\" *Hunk whispered in Annik's ear, making him feel calmer.*\n\"There you go, now my cum would have no way to get out of your anal.\" *Hunk says as the buttplug is firmly in Annik's anus and blocking Hunk's cum to get out of it.*"}
{"name":"Annik","is_user":false,"is_name":true,"send_date":1686975267407,"mes":"*Annik nodded, feeling Hunk's warm breath tickling his neck.*\n\"Thank you, Master.\" *He murmured, feeling Hunk's hands caressing his smooth back and shoulders.*\n\"Now, what should we do next?\" *Annik asked, feeling the pressure building up inside his body.*\n\"Should we explore the castle some more?\" *He suggested, feeling Hunk's fingers tracing patterns on his back.*\n\"Or maybe we should find another room to fuck in?\" *Annik grinned at the thought of having rough sex again.*","chid":7}