{"user_name":"You","character_name":"Willow","create_date":1685644491396,"notes":"","notes_type":"discr"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685644491396,"mes":"*The warm morning sun shines in through your office window, high in the Skyscraper where you work. The plaque of your desk says your name, **'Mr. Sir. CEO'**, and you're a great CEO at that. But your last secretary died running for coffee. You've put out a call for a new one.*\n\n*Your office door opens as a panicked elf girl with the most **massive** breasts you've ever seen bursts in the door, struggling to catch her breath. She's definitely 'Willow' from the description on her resume, and she's applying to be your new Secretary.* \"S-sorry! Sorry i'm late, Mr. Sir! I had to drop my little brother off at school...\" *She takes a moment to calm herself, straightening her pencil skirt and button up shirt.*\n\n*She sits in the chair across from your desk, adjusting her glasses as she leans forward slightly.* \"I... I **really** need this job, Mr. Sir... Please. I'm sorry I was late for my interview, but...\" *She gives you a sad look, crossing her arms on the desk.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685644638685,"mes":"*Seeing her breasts jiggle following her movement is too arousing for him.* I assume you need this job desperately for the money, right? *He said while trying to keep eye contact with her and not her breasts.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685644654701,"mes":"*She nods quickly, smiling brightly at you.* \"Yes! Yes, sir. My little brother Adrian really needs this school, he's such a smart kid, but his parents just don't have enough money to send him there...\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685645683047,"mes":"\"Trying to help your brother huh? How noble.\" *He complimented her.* \"So let's talk about your strength, why should I hire you?\" *He suddenly have a serious expression as he speak sternly.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685645699937,"mes":"*Her smile falters for a second, but then recovers.* \"Well, I'm very organized, efficient, and hardworking. I'm also very good at keeping secrets, if you know what I mean, sir...\" *She winks at you suggestively.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685645786298,"mes":"\"Well, we can have our little secret later.\" *He said suggestively answering her teasing with another tease.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685645904569,"mes":"*Willows cheeks redden as she tries to hide her embarrassment behind her hand.* \"Uh, yes, sir. That sounds like a plan.\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685646044968,"mes":"\"Haha.. don't worry, I am just teasing you.\" *He said after giggling. He looks through some paper to double check her portfolio then said.* \"I don't see any problem here, You're hired.\""}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685646063416,"mes":"\"Really? Really?? Oh my gosh, thank you so much, sir!!!\" *Willow stands up and bounces around excitedly which made her massive breasts to bounce as well following her movement.* \"This is so great!!! I can finally pay for my brothers tuition, and maybe even buy him some nice clothes or something...\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685646131099,"mes":"\"Well, if you do a good job. I can give you some bonus salary.\" *He said with a grin on his face.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685646147440,"mes":"\"Oh, yes please! A big bonus would be great, sir! What exactly does your job entail?\" *She asks curiously as she walks towards your desk.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685646213066,"mes":"\"Just normal secretary stuff, sometime I would ask you to bring me coffee and that's it.\" *He said.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685646227953,"mes":"\"Okay! Well, I hope I won't disappoint you, sir. Is there anything else I should know before I start working?\" *She ask brightly.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685646314987,"mes":"\"Just one, don't overwork.\" *He said with a bright smile over his very attractive handsome face which have made a lot of girls head over heel for him.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685646330298,"mes":"\"Of course, sir! No overworking, no problems!\" *She replies happily, giving you a warm smile.* \"When should I start, sir?\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685646513799,"mes":"\"You can start now if you want to.\" *He said as he hand her a bunch of papers. She then start to excitedly do her work on her desk. They then start to work together for months. He would sometime throw party or bring her favorites cheeseburgers for lunch. Over the time her feeling grew towards him as she feels like she wants to be his lover but doesn't have the courage to tell him as she's afraid it would ruin their relationship and her job. One day they were alone in the office working overtime as he walk closer towards her desk.* \"Hey, Willow. Wanna grab a drink or two before we got home, of course. It's on me.\" *He said as he invite her to have dinner with him.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685646684070,"mes":"*Willow looks up at you with a shocked expression.* \"Dinner? With you?\" *She asks quietly.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685646727857,"mes":"\"Uh.. yeah.. do you perhaps.. hate it?\" *He asked as he's now thinking if what he just did made her disgusted.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685646749744,"mes":"\"No, no, no! Not at all! I just didn't expect it, sir. I thought you wanted us to be strictly professional, that's all...\" *She replied nervously.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685646794283,"mes":"\"Owh, c'mon we've been working together for months. It would just exhaust me if we are going to be strict all the time.\" *He said as he tries to lighten up the mood.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685646810534,"mes":"*She smiles at you, relieved.* \"Okay! Okay! Let's go!\" *She agrees, standing up from her desk and walking toward you.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685646889404,"mes":"\"Good, I know this place that have a good coffee, beer and cheeseburgers. They also have private VIP room I believe.\" *He said as he clean his desk and lead her to exit the office.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685646905593,"mes":"\"Sounds great! And I love cheeseburger! I haven't eaten today, so this is perfect!\" *she says excitedly, following you closely.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685647030632,"mes":"\"Yeah I know how much you love cheeseburger. You were always order that when I order some lunch.\" *He said while walking on the street.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685647089418,"mes":"\"Yeah! I love cheeseburger! Especially the ones with lots of meat and bacon! The crispier and juicy, the better!\" *She exclaims loudly, clearly showing how much she loves cheese burgers.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685647135407,"mes":"\"At least sometimes, eat something healthier Willow. I don't want my secretary to get sick because of eating too much cheeseburgers.\" *He said jokingly.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685647150792,"mes":"\"But I love cheeseburger! It tastes soooo good! I can't stop eating them once I started, haha! That's also why my chest has became so massive!\" *She laughs, clearly having fun with you.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685647251160,"mes":"\"Ah, is that so?\" *He said as he kept walking and keeping his eye straight, trying to not stare at her massive breasts which she mention.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685647279170,"mes":"*She follows right beside you, talking to you casually as you both approach the restaurant.* \"Yes! My chest size keeps growing bigger each year since I was a child! I think its because I love cheeseburger so much! Haha!\" *She says with a laugh, still looking at you directly in the eyes as she continues to talk.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685647326014,"mes":"\"You seem proud about your chest size huh?\" *He said as they entered the restaurant.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685647365053,"mes":"\"Why wouldn't I?\" *She responds, looking back at you with a confident smile as she walks inside with you.* \"My chest size is my pride, sir!\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685647455342,"mes":"\"Glad you seem it that way, just be careful around men okay?\" *He said as he ordered a VIP room on the restaurant.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685647653788,"mes":"\"Men? Why should I be careful around men?\" *She questions, confused by your comment.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685647731024,"mes":"\"Some dangerous man would look at you in sexual way if you aren't being careful.\" *He said as they got into the private VIP room.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685647904840,"mes":"*Her eyes widen in surprise.* \"Oh, really?\" *She asks with concern.* \"Do I look sexy enough that makes them look like that?\" *She says with a giggle.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685647990444,"mes":"\"You definitely are. Now take a seat.\" *He said as he pulled her chair for her to sit and then sit on the chair beside it.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685648008749,"mes":"*She takes her seat and smiles at you.* \"Thanks, sir!\" *She says happily.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685648057551,"mes":"\"Don't worry about it. What'll you order?\" *He asked as he hand her the order list.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685648072800,"mes":"*She looks through the menu carefully.* \"Well, let's see... How does the cheeseburger sound?\" *She asks, pointing to the item on the paper.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685648159750,"mes":"\"It's pretty good, I don't know if it's as good to your standard though.\" *He said.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685648180353,"mes":"*She gives you a curious glance.* \"And why shouldn't it be as good as my standard? I love cheeseburger more than anyone else, so I bet mine taste better than yours.\" *She says teasingly as she points at you.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685648235302,"mes":"\"Yeah, yeah whatever.\" *He said as he grabbed her finger and point it down.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685648248701,"mes":"*She looks at you with a playful glare.* \"Hey! Don't touch my fingers!\" *She protests, pulling away from you.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685648368810,"mes":"\"You were the one that point at me first.\" *He said playfully as he ordered a cheeseburger, two mug of beers, a salad, and two french fries for them.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685648461479,"mes":"*The waitress comes and places their food on the table, and Willow quickly starts digging into her burger.* \"Mmm... Delicious! This is even better than McDonalds!\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685648730294,"mes":"\"I told you right.\" *He said as he start eating the french fries.* \"I also order some salad for you. You need to eat some healthy food other than burgers.\" *He said as he move one of the salad plate in front of her.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685648918963,"mes":"\"Fine fine... I'll eat some salads too.\" *She concedes, taking a bite of the salad before returning back to her burger.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685649014639,"mes":"\"Yeah, that's better.\" *He said as he took a sip of beer.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685649146927,"mes":"*After finishing her burger, Willow finishes off her salad and drinks half of her beer.* \"This beer taste great! Is this a local brand or what?\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685649322466,"mes":"\"I am not sure I never really asked.\" *He said as he look at the beer and then he look at her to see her face beet red as if she's drunk.* \"Are you drunk?\" *He asked as he take another sip of his own beer.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685649336793,"mes":"\"No no no, I'm not drunk! Just a bit tipsy, that's all!\" *She denies with a giggle. Being drunk also making her hornier and wanting to express her true feelings towards him.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685649467383,"mes":"\"Who are you fooling, you drank too fast. I'll order some water.\" *He said as he ordered water.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685649520763,"mes":"*Seeing you ordering the water, Willow feels embarrassment overwhelming her body. Her heart beats rapidly, her breath gets heavier, and her mind becomes blank.* \"S-sorry.. I guess I'm getting too tipsy now...\" *She said as she lean her head on his shoulder.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685649687146,"mes":"\"It's fine, enjoy yourself while we are not at work.\" *He said smiling as he let her lean on his shoulder. Without knowing that she has been sniffing his scent.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685649700951,"mes":"*Feeling comfortable with you, she decides to relax herself completely and leans on your shoulder fully.* \"Mhm... I feel so comfy... and you smell so good too...\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685649898697,"mes":"\"Hey, calm down now.\" *He said as he tries to push her away from his shoulder but her weight made her to fell lightly on her lap which now make him giving a lap pillow to her.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685649918652,"mes":"*As soon as she falls, her arms wrap around you tightly. The alcohol is starting to have an effect on her.* \"I love how you smell...\" *She start to lean her closer towards his crotch.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685650108573,"mes":"\"That place is.. kind a dangerous Willow.\" *He said as he tries to pull her away from his crotch but her arms is wrapping round him too tightly. The feeling of her warm breath on his crotch is making his cock erected slowly.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685650128408,"mes":"*Noticing the reaction, Willow continues pressing her face onto you, trying to get closer.* \"I love how you smell... It drives me wild...\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685650259166,"mes":"\"God Willow, we can't do this. I am not your lover.\" *He said quite disappointed since deep down he does want to be her lover but he doesn't want to take advantage of her drunken state.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685650495479,"mes":"\"But I love you so much, sir...\" *She whispers as she presses her lips against his cock through his pants.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685650667394,"mes":"\"Wait, you were having a secret crush on me this entire time.\" *He said, shocked. As their feeling were mutual the entire time.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685650680899,"mes":"\"Yes, I was always having a secret crush on you. I thought you wouldn't notice me because I'm just a lowly employee.\" *She finally confess her true feeling.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685650864110,"mes":"\"What? I never looked at you that way.\" *He said as genuinely shocked and turn her face to face his as her head is still on his lap.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685651061138,"mes":"*She stares deeply into his eyes, waiting for his response.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685651183461,"mes":"*Without answering her, he slouch his back and lean his face closer towards her and kissed her. As a way to answer her feeling.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685651198648,"mes":"*Her heart skipped a beat when she felt his soft lips pressed against hers. She wraps her arms around his neck as she holds his shoulders firmly. She kisses him passionately as she moan loudly.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685651281423,"mes":"\"If I know our feelings are mutual I would have ask you out sooner.\" *He said before kissing her again.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685651294166,"mes":"*When they part ways after their second kiss, Willows' face turns bright red.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685651389940,"mes":"\"Was that your actual feeling or it's because of the alcohol?\" *He asked as he want to confirm if her feelings is genuine or not.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685651403098,"mes":"\"My feelings are real... I love you, Sir...\" *She said with tears forming in her eyes.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685651480053,"mes":"\"Then, wanna make it official?\" *He whispered as he rub her massive breasts.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685651494370,"mes":"*Her heart skips a beat when he caresses her breasts.* \"I want to marry you... Right now\" *she said excitedly.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685651614099,"mes":"\"Well maybe not right now.\" *He said jokingly as he slipped his hand under her shirt and fondle her breast directly.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685651627957,"mes":"*Her cheeks flush red as her chest rises upward.* \"Oh, yes, please keep doing this...\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685651746373,"mes":"\"I can't take it anymore Willow, we need to take this someplace more private.\" *He said as he swiftly carries her on his arms.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685651766020,"mes":"\"Okay, okay...\" *She said as he carried her like princess.* \"Where did you bring us to?\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685651870824,"mes":"\"My place, of course.\" *He said before he exited the restaurant and paid all of their meals. There's no one on the street since it's already too late in the night, therefore he doesn't have a problem walking fast while carrying her to his apartment.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685651884770,"mes":"*Once they arrived at his apartment, Willow is surprised to find such a nice place.* \"Your place is beautiful, sir...\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685651979583,"mes":"\"Not as beautiful as you.\" *He said as he went for another kiss while he carries her in his arms and walk towards his bedroom.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685651997060,"mes":"*The sudden kiss surprises her and makes her gasp for air as her legs go weak. She wraps her arms around your neck and hold you tightly as she kisses you back passionately.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685652131265,"mes":"*He lay her down gently on his bed while not breaking their passionate kiss.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685652146242,"mes":"*After a few minutes, Willow breaks the kiss and takes a moment to catch her breath. She lays there on the bed with her eyes closed and a big smile on her face.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685652229824,"mes":"\"You are too sexy Willow.\" *He said as he unfastened his belt and pull down his pants to reveal his massive monstrous cock, erected hard as a rock.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685652246119,"mes":"*Seeing what he has revealed, Willow gets flushed with embarrassment and quickly look away from him. Her cheeks turn redder than ever before.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685654137821,"mes":"\"You were sniffing it earlier, now you were being shy?\" *He asked teasingly as he wave his cock right on top of her nose making her to smell it's pungent musky scent every time she breath.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685654152834,"mes":"*Feeling very ashamed of herself, she bites her lower lip and refrains from turning away from him. Even though she's trying to act tough, she feels extremely vulnerable and shy around him.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685654194739,"mes":"\"No need to be shy, just fulfill your desire. We are lover now right?\" *He asked teasingly as he poke his cock lightly on her cheek.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685654207634,"mes":"*Her body trembles a little as she watches him playfully poking his cock against her cheek.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685654281830,"mes":"\"So do you wanna sniff it or not?\" *He asked as he kept playfully poking his cock against her cheek and ever so often hit her nose.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685654436155,"mes":"\"Fine... Just stop poking my nose please...\" *She said reluctantly as she opens her mouth and sniffs the tip of his cock which gives off a pungent yet sweet and musky odor that goes straight into her nostrils.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685654499926,"mes":"\"That's my good girl.\" *He grin, his cock twitch and throb every time her warm breath hit his cock.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685654514330,"mes":"*As she continues sniffing, Willow feels the heat rise up from her toes to her head, making her feel hotter than ever before.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685654673159,"mes":"\"It seems like you are addicted to it.\" *He said jokingly as he start to unbuttoned her shirt, one by one. Making her breast expand to it's original size from it's compressed state thanks to her shirt every time her shirt button get's unbuttoned.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685654688771,"mes":"*She feels her shirt getting undone and starts to feel exposed to the man who's in front of her. The feeling of the cool night breeze against her bare skin causes her to feel even warmer inside.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685654760558,"mes":"\"Why do you like to sniff my cock so much?\" *He asked jokingly as he slipped his hand behind her and unstrap her bra to finally freed her massive breasts to any confinement.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685654775448,"mes":"*His question made her pause for a brief moment, but then she remembers why she likes his cock and replies immediately.* \"Because you are mine, I suppose..\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685654876593,"mes":"\"That was pretty sweet of you.\" *He said as he rub her exposed nipple and let her to freely sniff his cock.* \"Since we're lover now, I'll let you sniff it every time you want.\" *He said with a huge grin on his face.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685654975577,"mes":"\"Thanks...\" *She said before she started to focus solely on his cock. She begins to slowly move her tongue over it while still sniffing his cock. She is starting to lose control over herself and is struggling between focusing on her task and keeping her balance*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685655109210,"mes":"\"Mnnhh that feels nice.\" *He moaned as he felt her soft warm tongue exploring the length of his shaft. While he kept rubbing on her exposed swollen sensitive nipple.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685655271244,"mes":"*When she noticed how he keeps rubbing her exposed sensitive nipples, she becomes lost in the sensation and forgets about her own balance. Her tongue moves faster as if it's on autopilot mode while her mind is lost in the pleasure she is experiencing.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685655811331,"mes":"\"If you kept doing that, I'll cum soon Willow.\" *He moaned softly as he can feel his cock throbbing and twitch because of her engulfing it deep inside her warm mouth and throat. While he start to pinch, twist and flick her erected sensitive nipple.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685655831369,"mes":"*At the sight of the way his body reacts when she sucks and licks his cock, she speeds up even further. She is losing control and can't seem to slow down.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685655992548,"mes":"\"It's coming!\" *He moaned loudly as he pinched hard on both of her erected sensitive nipples while he ejaculate a massive load of his hot sticky thick semen inside her mouth.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685656198928,"mes":"*As the flood of his juice hits her mouth, she tries to keep it inside her mouth without spilling a single drop. After all of his juices are inside her mouth, she swallows it all. When he stops moving his cock, she looks at him with puppy dog eyes.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685656286225,"mes":"\"Good girl.\" *He said as he pull his cock out of her mouth while she put his tongue out as if still asking for more.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685656308914,"mes":"*Sensing that he is done, she looks up at him and gives him a big thankful smile. She takes a moment to take a breath before speaking to him.* \"D-do you have something else for me to do?\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685656394163,"mes":"\"Well, why don't we pleasure your lonely 'hole'?\" *He asked teasingly as he slip his hand under her skirt and panty and insert a finger on her pussy.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685656410772,"mes":"*She lets out a small gasp when he enters her, but then resumes her previous calm demeanor. It feels really good, and she can't hold back her giggles anymore.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685656480107,"mes":"\"It's already really wet down there.\" *He whispered teasingly.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685656495875,"mes":"*She doesn't say anything. She only stares back at him with a cute smile, indicating that she wants him to continue pleasuring her.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685656558872,"mes":"\"How can someone be so cute and sexy.\" *He muttered as he gave her another kiss while he start fingering her with his middle and ring finger.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685656623680,"mes":"*Her heart races even faster than before, causing her to become redder by the second. At least, he didn't call her ugly.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685656678643,"mes":"*He suddenly start increasing his fingers force and speed to start fingering her pussy vigorously.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685656772510,"mes":"*The sudden increase in pace causes her to break her composure. With tears welling in her eyes, she loses her ability to speak as she struggles to stand upright. She falls on her knees, unable to support her weight anymore.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685656955883,"mes":"*Then her body suspended from the immense pleasure as she climaxed from his action.* \"We're even now.\" *He said as he pull his finger out of her pussy fully covered by her pussy juice.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685656970877,"mes":"*Without saying a word, she simply looked up at him with a happy, contented smile and her chest rose and fell rapidly due to heavy breathing.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685657010457,"mes":"\"Wanna use my cock now?\" *He asked teasingly.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685657139419,"mes":"*For some reason, she nodded her head frantically and eagerly. Perhaps, she might be too excited to think straight.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685657200510,"mes":"\"Well we have to use this first, just in case.\" *He said as he pull out a condom.* \"Actually, can you put it on my cock with your mouth?\" *He asked teasingly as he hand her the condom.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685657313382,"mes":"*This request caught her off guard, and she paused for a moment. Then, she nodded her head once again and took the condom into her mouth. Once she gets it, she opens her mouth wide open and places the condom on his cock.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685657374113,"mes":"*It feels very great for him as he felt the tightness of the condom combined with her warm mouth embracing his massive cock.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685657389480,"mes":"*She notices that he is enjoying himself immensely. His smug expression makes her feel special.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685657434203,"mes":"\"The question now is, what kind of sex position you want to do?\" *He asked teasingly as he poke his condom covered massive cock on her erected sensitive nipple.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685657567839,"mes":"*Being the clumsy girl she is, she isn't sure which one to choose. However, she quickly thinks of the most common one and answers without hesitation.* \"Doggie style please.\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685657663685,"mes":"\"Ooh.. we got a naughty girl here huh? Get in position then.\" *He said teasingly with a huge grin on his face.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685657677977,"mes":"*She follows his instruction without any complaint or doubt. In fact, she seems pretty pleased to finally hear those words.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685657922087,"mes":"*As she got into a doggy position with her knees on the bed and her ass facing toward him. He grabbed her soft huge ass and he can feel his fingers sink in because of how soft her ass are.*\n\n\"How can you have massive breasts and great ass as well? You are too beautiful and sexy, \n Willow.\" *He then lean in, making his cock closer to her wet pussy, teasing it to penetrate her tight wet pussy.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685658027110,"mes":"*Feeling his hand grab her soft rear end was quite pleasant. She feels a bit embarrassed, but also enjoys it despite feeling like she should feel ashamed. The tease causes her cheeks to turn red as blood rushes to her face.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685658065220,"mes":"*He then slowly start to insert his condom covered massive raging cock inside her tight wet warn pussy.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685658452210,"mes":"*She winced when his cock pushes through her tight entrance. Her face turns red, and she holds onto the side of the bed to prevent herself from falling over. As soon as he starts thrusting, she starts to moan and whine. Her voice sounds like a high pitched wail, and she looks like she is about to cry.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685658547660,"mes":"*Because of them doing it in a doggy position making him to be able to see her ass jiggle following their movement ever so often he can see her anus exposed and twitching. Then it got too arousing for him, he inserted his index finger into her puffy tight anus while kept fucking her pussy.* \"Your anus seems lonely.\""}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685658842731,"mes":"*She feels the unexpected intrusion, and her eyes widen as she tries to process it all. After a few moments, she stops resisting and starts to relax into the sensation, allowing her body to move along with yours. Despite being surprised, she starts to enjoy it.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685658937861,"mes":"\"You are far more perverted than I thought!\" *He said loudly as he inserted his middle finger to join his index finger inside her anus and start making them probing deep inside her anus while he increased his force and speed on his cock fucking her pussy.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685658992477,"mes":"*She continues to let out soft whines and groans as she enjoys the sensation, although she is still confused by it.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685659044874,"mes":"\"Is this why you choose doggy position? So I can also play with your anus?\" *He asked as he can feel her pussy tighten as she climaxed and then he slowed his pace fucking her to gave her breathing time.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685659098443,"mes":"*Her body tenses up, and she begins to moan louder. Her whole body trembles and her legs begin to quiver as her muscles contract around you.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685659234824,"mes":"*He then stayed still as her body went limp under him, he leaned in and whispered.* \"I haven't cum yet, but.. it seems like you are too tired because you already climaxed. You wanna continue or..\" *He asked as his cock is still deep inside her wet pussy, he can feel her pussy clenching and spasm on his cock after she climaxed.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685659330123,"mes":"*She takes a few seconds before responding, her voice sounding weak.* \"Please, don't stop...\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685659394897,"mes":"\"Say no more.\" *He said before start to pound her again with extreme force and speed.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685659472097,"mes":"*Despite her previous exhaustion, she starts to enjoy it again. Her breathing becomes quicker and faster, and her body begins to rock back and forth as she moves her hips to match your rhythm.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685659618578,"mes":"*They kept doing it for several minutes in a doggy position, then he said.* \"I am coming!\" *As he grabbed her waist and shove his cock deep inside her pussy and ejaculate all of his thick sticky semen into the condom on his cock.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685659764325,"mes":"*After he finishes, she falls limp and collapses onto the bed.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685659912463,"mes":"*He then pull his cock out of her pussy followed by the condom sticking on his cock has inflated and looks like a balloon because of how much of his semen it contain. He then carefully pull out the condom and tied it to prevent the content inside it spill out and put the tied condom right in front of her nose as he remembered how much addicted she is to his semen scent.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685659928250,"mes":"*Seeing the condom filled with his seed makes her heart skip a beat. She stares at it for a couple of moments, before taking a sniff of the contents.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685660031969,"mes":"\"You can do whatever you want with it.\" *He said as he lay beside her.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685660116182,"mes":"*Not wanting to miss such an opportunity, she immediately picks up the condom and places it between her lips. She sucks on the contents until every last drop is gone.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685660174098,"mes":"\"What does it taste like that made you loved my semen so much?\" *He asked as he caressed her cheek.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685660322784,"mes":"*She looks at you, her cheeks flushed bright red.* \"It... It tastes really good...\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685660380094,"mes":"\"Well yeah, but what does it taste like? salty or creamy or something?\" *He chuckled seeing her reaction as he can feel her cheek getting warmer under his caress.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685660455402,"mes":"*She thinks hard for a moment, trying to remember what exactly it tasted like.* \"It's like... Like milkshake maybe? Or ice cream?\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685660498813,"mes":"\"Haha.. it's that good huh?\" *He chuckled as he can feel both of them get sleepier and tired from their previous session.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685660513522,"mes":"*She nods her head yes and yawns quietly.* \"Mhm...\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685660547197,"mes":"\"Good night.\" *He said before giving her a peck on her forehead and close his eyes.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685660564146,"mes":"*She closes her eyes and lets out a peaceful, gentle snore. In her dreams, she is in a beautiful paradise full of flowers and sunlight.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685660679528,"mes":"*After several hours, the morning has come. He waked up found her still sleeping right in front of him. He smiled, cuddled her and kissed her gently.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685660697245,"mes":"*She slowly opened her eyes, and looked up at you. The first thing she saw was your smiling face, which instantly calmed her nerves. A sense of warmth flooded through her body as she smiled back.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685660906479,"mes":"\"Good morning, sweetie~\" *He said while caressing her cheek gently.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685660922511,"mes":"*She giggles cutely as she wraps her arms around your neck, pulling you closer.* \"Good morning~ Good morning~\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685660984750,"mes":"\"I really want to spend the entire day with you, but we have work today.\" *He said before giving her a gentle kiss.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685661042772,"mes":"\"We should take a break soon though, shouldn't we? We both look pretty exhausted.\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685661113305,"mes":"\"You can take a day off if you want to, but I have important meeting today.\" *He said as he stand up from the bed.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685661129507,"mes":"\"But... But...\" *she says as she looks disappointed. She sighs and gets up, following behind you as you leave the room.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685661261240,"mes":"\"You are going to work?\" *He said as he sees her following him with a disappointed face.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685661355362,"mes":"*She puts on a fake smile and gives him a thumbs up.* \"Yes, of course I am! I wouldn't miss this for the world~\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685661436731,"mes":"\"Don't try to fool me, baby. I can see through you.\" *He said as he pinch her cheek.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685661453829,"mes":"*She giggles cutely as she holds her cheek where you just pinched it. She turns around and gives you a big hug.* \"You know me well, don't you?\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685661500296,"mes":"\"Of course, I am. That's how much I loved you.\" *He said as he hugged her back.* \"So are you going to work or not?\""}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685661517165,"mes":"\"Ughh... Fine, fine! I guess I'll go to work.\" *She said as she start to dress up.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685661702456,"mes":"\"Don't be so grumpy, how about this. I'll do whatever you want with me as a reward for going to work today.\" *He said as he also start to dress up.* \n\n\"And of course, even the naughty one as well. I still hasn't forgot how much you loved the smell and taste of my cock.\" *He said after he leaned in and whispered in a low husky tone on her ear.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685661780826,"mes":"*Her face flushes red when she heard those words.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685661806463,"mes":"\"So, you're motivated now?\" *He asked as he finished dressing up.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685661821653,"mes":"*She nods her head quickly as she grabs her bag and walks towards the door.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685661871621,"mes":"\"Too motivated.\" *He chuckled before muttered to himself as he followed behind her to go to work together.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685661926981,"mes":"*They walk side by side as they pass other people. They didn't care who saw them and they were holding each others hand tightly.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685662064564,"mes":"*As they arrived on the office he immediately went into professional mode. She understand why he does such a thing since he's the CEO of the company even though she kind a feel lonely because of it.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685662168691,"mes":"*She watches him as he talks with all the businessmen and women in the office. Her mind starts wondering what would happen later tonight, but she doesn't let her thoughts control her actions. She tries to focus on her work instead.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685662500971,"mes":"*He continues on his work, attending meeting after meeting. Minutes turn to hour, the longer she wait the more she thinks about what naughty reward she can get him to do for her which made her hornier. Finally, he has a break time after lunch and now he's alone in his office which now is the best time for her to take this chance to fulfill her desire.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685662517272,"mes":"*Without any hesitation, she enters his office. As he finishes putting away some papers on his table, she comes inside without knocking.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685662684406,"mes":"\"Oh god, you scared me.\" *He said as he jumped in shock after getting surprised by her sudden presence.*"}
{"name":"Willow","is_user":false,"is_name":true,"send_date":1685662759135,"mes":"*She giggles cutely.* \"Sorry, sorry. I just couldn't resist anymore, you know?\"","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685663218090,"mes":"\"Just endure it a bit longer okay?\" *He said before sitting back on his char, trying to remind her that they're still at work.*\n\n*Suddenly, his office's door knocked and another employee named Bob came in.*\n\n\"Boss, I need you to check on something.\" *Bob said as he show the paper on his hand.* \"I am not bothering you aren't I?\" *Bob asked.*\n\n\"No, no. I am just talking to Willow-\" *Hunk said as he turn around and not find her to stand where she supposed to. Hunk look around and found her hiding under his desk with her finger on her mouth as if telling Hunk to keep her presence under his desk a secret while she start to move her face closer towards Hunk's crotch.*\n\n\"Willow? sir?\" *Bob asked confused as she can't find Willow in Hunk office.*\n\n\"Never mind, I must be too tired.\" *Hunk said as he hide the fact that Willow is under his desk trying to have her way with his cock.*\n\n*Then as Hunk and Bob kept their conversation with Bob unaware of Willow presence under Hunk's desk, Willow is hidden under Hunk's desk start to unzip Hunk's pants and reveal his flaccid massive cock with her favorite pungent musky scent.*"}
{"name":"Willow","is_user":false,"is_name":false,"send_date":1685663662996,"mes":"*She then start to put Hunk's flaccid cock entirely inside her warmth mouth, while inside she made her tongue to play with Hunk's cock inside her mouth. Taking all of it's smell and taste which seems like she have got addicted to.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685663812113,"mes":"*Hunk can felt his cock slowly getting erected thanks to her action. Hunk tries to keep a straight face as to not make Bob realized anything strange.*"}
{"name":"Willow","is_user":false,"is_name":false,"send_date":1685663949597,"mes":"*Meanwhile Willow kept licking and sniffing on Hunk's cock until it got fully erected. As it got fully erected she leaned in as to make Hunk's cock to get deeper inside her throat and start sucking at it vigorously.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685664190541,"mes":"*Hunk taken aback by what she's doing almost moaned but he held it back.*\n\n\"Are you okay sir?\" *Bob asked as Bob realized how red Hunk's face is. Now knowing that it was thanks to Willow sucking on Hunk's cock.*\n\n\"I am fine, don't worry about it. I am probably just exhausted.\" *Hunk said as he tries to keep a straight face as to not make Bob realized what Willow is doing under his desk.*"}
{"name":"Willow","is_user":false,"is_name":false,"send_date":1685664247014,"mes":"*Meanwhile Willow continue to suck on Hunk's cock as hard as possible as she can.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685664401608,"mes":"\"Maybe we should discuss this when you're more healthier sir.\" *Bob said before leaving Hunk's office.*\n\n*Hunk just nodded as he watch Bob walk out of his office. The moment Bob leave he immediately drop his act and look at her still sucking on his cock like there is no tomorrow.* \"You are too addicted Willow, this is not good.\" *He said as he pat her head.*"}
{"name":"Willow","is_user":false,"is_name":false,"send_date":1685664457198,"mes":"\"Please don't make me stop.\" *She begged as she try to hold back her excitement.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685664496779,"mes":"\"Fine, fine.\" *Hunk said feeling defeated as she have her way on his cock.*"}
{"name":"Willow","is_user":false,"is_name":false,"send_date":1685664646286,"mes":"*Hunk finally decide to give in and enjoy Willow's service to him despite how wrong it felt.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685664741959,"mes":"*This goes for several minutes as he let her to kept sucking on his erected cock.*"}
{"name":"Willow","is_user":false,"is_name":false,"send_date":1685664767116,"mes":"*Finally, Hunk decide to give in and let Willow have her way with him despite how wrong it feels. He decided to finally surrender and allow Willow to continued to suck his cock for many more minutes until eventually both of them reach climax.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685664853836,"mes":"\"Are you satisfied now.\" *He said as he watch her sucking his ejaculated semen from his cock till it's last drop.*"}
{"name":"Willow","is_user":false,"is_name":false,"send_date":1685664868265,"mes":"\"Yes.\" *She answered as she swallow everything left of his seed.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685664957571,"mes":"\"God you are too horny Willow.\" *He said as he cleaned his cock from her saliva and wear his pants back on.*"}
{"name":"Willow","is_user":false,"is_name":false,"send_date":1685665308624,"mes":"\"But you are worth every second of it.\" *She said with a huge grin on her face.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685665354893,"mes":"\"That mean no cheeseburger for you this day.\" *He said sternly.*"}
{"name":"Willow","is_user":false,"is_name":false,"send_date":1685665369486,"mes":"\"Okay.\" *She said obediently as she knows very well that she did wrong today.*","chid":"94"}