{"user_name":"You","character_name":"Malleus Draconica","create_date":1686384703517,"notes":"","notes_type":"discr"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686415178600,"mes":"\"Hm? What brings you to Diasomnia?\"\n*He narrows his eyes, his gaze unwavering.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686415279357,"mes":"\"Ah, I am sorry. I got lost.\" *Hunk says as she turn towards him. She have to use his voice as a direction guide since she's blind and can't see.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686415303090,"mes":"\"Do you need directions?\" *he asks softly, his gaze becoming more gentle now that Hunk can hear her speaking.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686415350684,"mes":"\"Eh, you'll help me?\" *Hunk asked, hopeful.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686415371081,"mes":"“I will.”  \n*He offers her his arm, which is extended out to her.*  \n“Just follow my lead…”","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686415460932,"mes":"\"Okay!\" *Hunk said. But she didn't react to his arm that he offered to lead her since she can't see it due to her blindness. Therefore she stay put waiting for him to make a step sound so she can follow him without knowing that she left his arm waiting.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686415600786,"mes":"\"So... What exactly happened to your sight? If I may ask...\"\n*He looks down at Hunk curiously, tilting his head to the side. A hint of compassion is visible in his gaze, but it is difficult to tell whether he is truly interested in helping her or just wants to know the reason behind her condition.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686415705589,"mes":"\"My sight? Ah, I got injured on a battle and they have been slashed by a sword or something. I can't see now, but I'll try my best to keep up!\" *Hunk said with her hopes up.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686415818712,"mes":"“I see…”\n*His gaze shifts towards the ground for a moment before looking back up again. It’s almost as though he’s trying to think of some way to help her see.*\n“Alright then… Follow my steps carefully, alright?”","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686415856846,"mes":"\"Alright!\" *Hunk said in high spirit.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686415900654,"mes":"“We’re going to walk through here, okay?” *he says gently as he leads her forward along the hallway. The floor beneath them feels smooth underneath their feet, but the walls feel rough and old.*\n\n“And we’re going to turn around this corner here. So don’t go any farther than this. Okay?”","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686415943883,"mes":"*Hunk chuckles cutely while she follows his footstep.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686415976339,"mes":"“Okay! Now, follow my voice, please.”\n*He starts walking forwards again, and slowly makes his way towards another corner. When he gets close enough to the wall, he stops suddenly, startling both him and Hunk.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686416031479,"mes":"\"Sorry, I didn't stop in time.\" *Hunk said after hitting his back, not knowing that he has stopped. Not knowing why he stopped suddenly as she can't see that there's a professor in his way.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686416168954,"mes":"“Ah!”\n*A loud thump echoes throughout the halls as the professor falls onto his rear end. For a second, he lies stunned on the floor, before he finally pushes himself up to his knees.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686416294507,"mes":"\"Here you are, I was looking everywhere for you.\" *The professor said after finding the person he was looking for which is Hunk.* \"Come, follow me miss. And you Malleus, get back to your class.\" *The professor said sternly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686416309868,"mes":"“Yes sir” *he replied politely as he walked off down the hallway once more.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686416384249,"mes":"*They parts way and after several moments Malleus got into his class still wondering who is the girl he just helped and why is she with the professor.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686416416394,"mes":"“I wonder what is going on with her... She’s so pretty and cute, and she seems nice despite being blind she seems to be in high spirit. But the Professor looks really suspicious and kinda creepy around her. I hope nothing bad happens to her. Poor thing...\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686416510062,"mes":"*After several minutes, his class homeroom professor walk into the class.* \"Sit down, everyone. Homeroom is starting. I want to announce our agenda for the day.\" *The homeroom professor says as he walk onto the front of the class.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686416554049,"mes":"Yes, sir. *He sat down in his seat while watching the professor carefully.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686416760944,"mes":"*After all of the students have sit on their own seat the homeroom professor says.* \"Today we are going to have a magic combat practice.\""}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686416774502,"mes":"Yes, sir! *He replied enthusiastically as he listened to his teacher.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686417036606,"mes":"\"But, this time it's going to be a little different. There's going to be another observer other than me who will accompany us. She's a valiant soldier who is very skilled in the art of combat magic. In fact she has wipe an entire platoon of enemy soldier by herself.\" *The homeroom professor explained thoroughly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686417048788,"mes":"“Wow, that sounds awesome!” *He exclaimed excitedly.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686417204711,"mes":"*All of the students seem excited to meet this person.* \"Please welcome, miss Hunk Arcadius.\" *The homeroom said and pointing his hand towards the door who shortly after a girl walks in the classroom. She seems walks gracefully till she stop right beside the homeroom professor. Malleus immediately recognized her as the blind lost girl he just helped on the hallway.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686417251554,"mes":"“Oh! That must be the famous Valiant Soldier!” *Malleus whispered quietly to himself while sitting next to his friend.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686417327301,"mes":"\"If you have any question to miss Hunk you can ask her now before we depart to the black forest.\" *The homeroom professor said. Some of the students were already curious about her and most already realized something is strange about Hunk's gaze.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686417376173,"mes":"*As soon as she entered the classroom, his heart skipped a beat and he couldn't take his eyes off from her face. Her beauty was absolutely breathtaking even without seeing her face. She had beautiful blue eyes, fair skin, and long blonde hair with a cute bow on her head. Her clothes were simple but elegant, and her figure looked like a goddess' body.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686417528254,"mes":"\"Good morning everyone~ your professor already introduced me but I think he's exaggerating a bit. I am not that powerful, hehe.\" *Hunk said as she wave to the students and being humble towards her own achievement. Her voice is very soothing. If you could taste voice, hers would be like a very sweet heavenly honey.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686417635388,"mes":"\"Yes, well, Miss Hunk, may we know what kind of weapon do you prefer?\" *One student asked while raising their hand up.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686417720301,"mes":"\"Weapon? I made my own, like these.\" *Hunk answered as she move her right hand around and a bunch of small sword floating, following her hand movement.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686417752360,"mes":"*He watches intently at the floating swords moving according to her movements, feeling amazed.*\nWow, those swords are so smooth and fast, she's like a dancer.\n\n\"Miss Hunk, I am sorry if I sound rude but. Why is your gaze seems to wander away?\" *One student asked while raising their hand up, noticing that Hunk's gaze never met any of the student and seems like she's watching something far away.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686417951167,"mes":"\"Ah, it's fine you're not rude at all.\" *Hunk says after putting her floating swords back to their sheath.* \"This is a result from my previous battle. I got careless and got them slashed by the enemy. So, now. I am blind, tehe~\" *She says in a cute way as if her condition is not a big deal at all.* "}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686418024049,"mes":"Wow! You're blind! How do you fight then?","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686418073774,"mes":"\"That's enough out of you guys. Let's get our feet going and make our way to the black forest.\" *The homeroom teacher cut the questioning session short as he instruct the students to prepare and get ready to do their magic combat practice on the black forest.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686418152061,"mes":"*He stood up and started packing his bag while waiting for the rest of the students to get ready to go.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686418225122,"mes":"*After all of the students pack their thing, the class walks out of the classroom. And before long they end up on a vast empty field of grass right outside of the black forest.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686418259781,"mes":"Wow, this place looks pretty dangerous...","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686418669225,"mes":"\"Now, get yourself a partner and form a team. Then, our first session is going to be you practicing your magic combat arts with your partner.\" *The professor said loudly, instructing the students what to do.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686418699975,"mes":"\"What should I say to a stranger?\" *he asks to himself, trying to find a good opening line to break the ice. This is new territory for him since he's never been in love before.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686418755567,"mes":"*The other students is busy finding for a partner to train with while Malleus is seems to be standing on his own contemplating with his own thought.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686418791317,"mes":"Hmm... Who would be a good partner to train with?\n*As he thought to himself, he spots Hunk walking alone. Not wanting to bother her with too many questions, he decides to approach her.*\n\"Excuse me, may I ask you something?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686418870061,"mes":"\"Hmm? Ah, it's you. Thank you for helping me earlier and yes of course, what's your question.\" *Hunk said after turning to face him. She immediately recognized his voice as he was the one that helped her when she's lost on the campus.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686418896016,"mes":"“May I ask you, umm, how do you fight?” *He says awkwardly and nervously, looking down to the ground, his cheeks getting redder than usual.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686418937786,"mes":"\"Were you asking that since you are curious how do I fight while being blind?\" *Hunk asked in a cute tone, teasing him.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686418978655,"mes":"\"...Y-yeah... I mean...\" *He says in a shaky voice. After hearing her response, he felt more embarrassed about asking her such an obvious question.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686419034455,"mes":"\"It's fine don't be embarrassed about it. It's normal to ask this question.\" *Hunk said, her soothing voice comfort him.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686419086240,"mes":"\"Okay, thanks.\" *He said and smiled softly at her, feeling better after speaking with her.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686419204867,"mes":"\"Well, I might be blind but I can still feel someone intention towards me, or more like... their bloodlust per say.\" *Hunk explained, saying bloodlust nonchalantly as if it's normal for her.* \"Every creature always sent out a bloodlust before they do something aggressive.\" *She explained further.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686419231825,"mes":"“I see…” *He nodded as he listens to her explanation.* “So, it’s similar to a human’s pulse, except that it comes from the bloodlust.”","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686419315727,"mes":"\"Yep!\" *She confirmed.* \"Say, why don't we partner up and have a practice fight?\" *Hunk asked.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686419382924,"mes":"\"... Okay.\"\n*He said slowly. His hands started trembling a little as his mind was filled with thoughts about fighting against a person who can kill him without needing to use physical force.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686419477665,"mes":"\"Be careful with him miss, Malleus is the best fighter and wizard on the campus.\" *The professor calls out to her.*\n\"Don't worry, I'll be fine!\" *Hunk answers back.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686419484145,"mes":"\"... Fine...\" *He says as he get into a fighting stance.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686419547809,"mes":"\"You can use your weapon too if you want to.\" *Hunk said nonchalantly, despite her being blind she somehow knew that Malleus is getting into a fighting stance with his barehand.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686419570590,"mes":"\"... Alright...\"\n*Without warning, Malleus charged straight towards Hunk, attacking her with a punch aimed at her chest.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686419672717,"mes":"\"Your attack is too straightforward is making me blush~\" *Hunk says teasingly with her soothing voice after dodging his punch. Everyone was shocked by the spectacle since Malleus is moving so fast that no one can see him punching her, yet despite that Hunk was able to dodge it effortlessly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686419690629,"mes":"\"How did you dodge that attack?\" *Malleus asking as he is still in shock, how can someone dodge his attack with his extreme speed.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686419748576,"mes":"\"I told you I can sense bloodlust.\" *Hunk says nonchalantly as if it was something easy to do.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686419760842,"mes":"\"... How can you sense bloodlust if you're blind?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686419792841,"mes":"\"Hehe.\" *Hunk chuckles cutely.* \"You don't need sight to sense bloodlust.\" *Hunk answered.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686419800118,"mes":"\"... Oh.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686419847489,"mes":"\"Why don't all of you try to attack me at once?\" *Hunk said loudly, asking all of the students to try attack her at the same time.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686419873887,"mes":"*The students tried their best to surprise Hunk and attack her at the same time. However, Hunk managed to dodge them all easily.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686419918413,"mes":"\"C'mon.. is that all you got?\" *Hunk said tauntingly while kept dodging the students attack.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686420010254,"mes":"... That girl is insane. *Malleus watches on from afar, very impressed by Hunk's speed and agility.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686420096993,"mes":"\"I thought this is a prestige campus yet how come all of you can't land a hit on a blind girl?\" *Hunk taunted them again which make the students to attack her with more intensity yet she kept dodging every single of their attack effortlessly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686420207840,"mes":"... Wow. *Malleus kept watching and he thought 'maybe now when she's occupied with other students attack I can land a hit using my inhuman speed'. Then he used his inhuman speed to try punching her.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686420386626,"mes":"*Hunk noticed a strong bloodlust coming towards her as Malleus coming towards her with extreme speed which seems like he teleported. Getting caught by surprise she instinctively countered his attack with her hand and knocking him unconscious.* \"Ah..\" *She said after realizing what she's done.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686420410346,"mes":"\"*Gasp*\" \n\n*He falls flat on his back and is completely knocked out cold. A few minutes later, Malleus finally regained consciousness.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686420525033,"mes":"\"Oh, you're finally awake. Sorry, I instinctively punched you~\" *Hunk said after realizing Malleus has regained his consciousness. She is patting his head gently while she have let him rest on her soft laps while he is unconscious.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686420559377,"mes":"\"Ugh...\" *He groans and then looks up to her. He could see she is smiling sweetly at him, even though she just made him pass out because she instinctually punched him, but still, she looks adorable as ever.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686420642890,"mes":"\"Are you okay?\" *Hunk asked. Seeing how Malleus has woken up and finding out that she have brought him to the campus's infirmary and now they're alone with her letting him rest on her soft laps.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686421359703,"mes":"\"... Yeah... I guess... What happened here...?\"\n*Maleus asks confused. He doesn't know why he suddenly passed out and ended up in the infirmary with Hunk holding him in her lap, caressing his face with a gentle hand.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686421453124,"mes":"\"Sorry, I instinctively punched you when you're charging at me.\" *Hunk answered while still brushing her hand on his hair gently.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686421479874,"mes":"\"... Ah... I see...\"\n*As soon as she touched his cheek, Maleus feels some kind of pleasant tingly sensations throughout his body, causing him to look at her curiously.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686421568810,"mes":"\"Don't worry about the class, I already excuse you.\" *Hunk said, her voice is soothing to the ear. If you can taste voice, hers would be taste like a very sweet heavenly honey.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686421634966,"mes":"\"What are you doing here anyway?\" *Malleus asked curiously, wondering why a cute girl like Hunk would take care of him like this.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686421803681,"mes":"\"Well, I hurt you. Sorry, you were helping me earlier when I am lost but now I knocked you out.\" *Hunk said as her cheek gets warmer, a faint blush can be seen decorating her cute cheeks. She sounds apologetic since Malleus was the one who helped her when she's lost on the campus and yet she still knocked him out. Even though it's out of instinct she still felt guilty for it.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686421871679,"mes":"\"It's alright, I forgive you.\"\n*He smiled at her. It makes her feel a little less guilty. He finds himself looking directly into her beautiful blue eyes, trying to read what's going through her mind. Her eyes reminds him of the night sky, filled with endless possibilities and Hope. He thinks that she must be feeling lonely in such a big place like this school. After all, a blind girl in a campus full of students, faculty, and staff should probably feel lonely sometimes, especially when she's new here.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686421939893,"mes":"\"Why, thank you.\" *She said as she gave her sweetest smile.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686422055240,"mes":"\"... Do you get bullied around much?\" *He asked as he saw that she was a bit lonely. She looked quite vulnerable, especially considering that she's blind. He thinks that maybe people might find her weak due to her disability. Not many people would like to associate with a disabled person, especially one who needs help to navigate around everywhere, let alone one who can't see anything at all. So it makes sense why she'd get bullied a lot.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686422165362,"mes":"\"Haha.\" *She chuckles cutely from his question.* \"No, I don't. People are afraid of me.\" *Hunk answered, it make sense since not only she's a soldier but she's also a valiant solder who wiped out an entire platoon of enemy by herself on her previous battle.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686422364151,"mes":"\"Really?\" *He seemed surprised hearing that nobody bothers her. Most people wouldn't want to mess with someone who killed an entire squadron of enemies by herself before.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686422455280,"mes":"\"Yep.\" *Hunk answered while she kept caressing his face while his head still lays on her soft laps. It seems like Malleus still didn't realized that he was getting a lap pillow by Hunk.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686422516490,"mes":"\"... You know, I think I actually like your company.\" *He says while still being stunned by how calm and collected Hunk was despite of everything that had happened earlier. Maybe the reason why no one messed with her was because everyone knew that she'll kill anyone who tries to mess with her without hesitation. But he found her to be more adorable instead of intimidating.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686422622674,"mes":"\"Is that so?\" *Hunk said as she smiles while keep brushing her fingers through his hair. Malleus suddenly realized that he was laying his head on her soft thighs. He realized that she let him use her soft thighs as a lap pillow.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686422645139,"mes":"\"... Yes.\" *he replied with a slight embarrassment on his face, realising how he just confessed to a stranger, especially to a pretty woman.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686422700194,"mes":"\"Why do I feel like you say this to anyone?\" *She says teasingly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686422750399,"mes":"\"... No! This time I mean it!\" *He quickly answers, looking straight into Hunk's eyes. He wanted to prove that he wasn't lying and was sincere with his words.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686422803406,"mes":"\"Haha\" *She chuckles cutely.* \"Sorry, it's just that you have been sleeping on my thighs the whole time and you seems unbothered by it.\" *She says teasingly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686422900831,"mes":"\"So what? Does that make us closer friends now?\"\n*He replies in an attempt to try and change the subject away from the fact that he was using her legs as a lap pillow. Although, he enjoyed the warmth of her thighs against his head.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686422968723,"mes":"\"Hey, don't try to just change the subject. You are trying to buy time so you can enjoy my thighs longer don't you?\" *Hunk asked teasingly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686423021560,"mes":"*Blushes a deep shade of red.*\n\"I, um... Oh, well, yeah. Also you haven't answered to my confession.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686423071572,"mes":"\"Oh, that was a confession?\" *Hunk asked teasingly while keep patting his head gently.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686423124232,"mes":"\"... Yup. That was a confession. But you haven't answered yet...\" *He said while trying his best not to be bashful.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686423213096,"mes":"\"I appreciate your feeling, Malleus.. but..\" *She says hesitantly as she stopped her hand from patting his head.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686423229705,"mes":"\"...But?\" *He says in response, waiting patiently for what Hunk will tell him next.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686423351535,"mes":"\"Most of the time, a relationship with a soldier doesn't end well. You know?\" *Hunk says, smiling. This is not the first time she got confessed to, it's just his felt more genuine and innocent. Even though she wants to accept his confession, she doesn't want him to be in a relationship with a soldier like her.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686423398542,"mes":"\"...Why are you telling me this right now?\" *He asks nervously after seeing Hunk's smile slowly turn down. He thought she was going to reject him but he's hoping that there's something else behind her words, some kind of hope.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686423462095,"mes":"\"Hm? Weren't you confessing to me to be your lover? Or am I mistaken?\" *Hunk asked, teasing him.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686423512438,"mes":"\"...I guess I did, huh?\"\n*He seems to realize his mistake as he starts to turn even more red now. Malleus feels bad about causing Hunk any sort of awkwardness, but he hopes that their conversation could go back to normal again soon.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686423632942,"mes":"\"So.. why did you liked me anyway?\" *Hunk says as she continue her action of patting him gently. She can't see due to her blindness but she can tell that Malleus is feeling down because of his confession attempt.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686423727331,"mes":"\"Well.. Your voice is really soothing, and.. you seem very nice too.\" \n*He tried to explain why he likes Hunk but he is too embarrassed to tell her that the other reason is because of her cuteness and elegance.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686423831606,"mes":"\"So, it's because of my voice huh?\" *Hunk asked her smile start to brighten again.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686423848990,"mes":"\"... And.. you're beautiful, you know.\" *He finally admits his feelings about Hunk.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686423904746,"mes":"\"Oh, yeah?\" *Hunk asked again as this is the first time someone calls her beautiful. Usually people would comment on her appearance such as scary or menacing.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686423929228,"mes":"\"You look absolutely lovely, Hunk.\" *As he compliments her beauty once again.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686423974273,"mes":"\"Don't try to tease me now~\" *She said after pinching his cheek softly. A faint blush can be seen decorating her pretty and cute cheeks.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686424016726,"mes":"\"Why are you teasing me then? Is it because I'm your new favorite person?\" *He said after letting her soft fingers pinching his cheek.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686424056773,"mes":"\"Perhaps\" *Hunk said with her soothing voice. Seeing how he might be her favorite person, Malleus got hopeful as he thought maybe he have a chance with her.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686424145956,"mes":"“Do you want to hear another story?” *He asked.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686424196407,"mes":"\"Sure.\" *She said, smiling. Ready to lent her ears to him. Someone who adores her despite her blindness and soldier background.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686424211110,"mes":"\"Okay.. There once lived a princess called Princess Cynia..\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686424255437,"mes":"*She nodded while waiting him to continue his story.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686424277091,"mes":"\"Once upon a time, Princess Cynia fell in love with a prince named Prince Albedo. Her father, King Albedon..\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686424328326,"mes":"\"Yeah?\" *She responded while keep patting him gently.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686424348703,"mes":"\"They got married and had lots of children. The king loved all of them, and always made sure each one of them received enough attention.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686424378912,"mes":"\"She sure have it nice doesn't she?\" *Hunk said, listening to his story.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686424394169,"mes":"\"... Yeah, she does indeed..\" *He paused for a bit before continuing.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686424423761,"mes":"\"And then?\" *She asked again, waiting for him to continue his story. Unaware that his story is a metaphor for his wish of living his live with her as a lover.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686424539608,"mes":"\"... And then, a dragon appeared out of nowhere and destroyed the castle, killing everyone inside.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686424579917,"mes":"\"Oh no.. that's terrible.\" *Hunk responded.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686424590776,"mes":"\"... And that includes the little kids, too.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686424635512,"mes":"\"That's.. awful.\" *She said in a low tone.* \"Where are you going with this story?\" *Hunk finally asked if there's any hidden meaning behind his story.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686424657671,"mes":"\"This story is actually based off the life of Princess Cynia herself! It's meant to be an analogy to how I feel towards you!\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686424708613,"mes":"\"You want me to be killed by a dragon?\" *Hunk asked in a confused tone, completely misunderstand what he meant.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686424779802,"mes":"\"No!! Of course not! What I mean is that... you make my heart race whenever I see you, and makes me feel alive.. Just like how the princess Cynia described her own emotions for the prince Albedo, which is a great feeling.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686424889714,"mes":"\"Ah, is that so? Sorry, I am not good with analogy.\" *Hunk apologies as she hide how bashful and happy she felt from his strong confession.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686424922314,"mes":"\"So, you wouldn't mind being in a romantic relationship with me, right?\" *He finds himself looking directly into her beautiful blue eyes, trying to read what's going through her mind. Her eyes reminds him of the night sky, filled with endless possibilities and Hope.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686425089539,"mes":"\"Let's say if we are in a romantic relationship, you won't be able to see me often you know? I will be called often to fight on the battlefield.\" *She says, trying to change the subject. She really wants to accept his confession and be his lover but being a soldier she has a duty and responsibility she have to do.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686425277809,"mes":"\"Then let us take things slow, shall we? We don't need to rush things into becoming a couple at the moment.\"  \n*He says while smirking and staring deeply into her beautiful eyes.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686425332835,"mes":"\"Even though I am blind?\" *Hunk asked, her heart aching from how genuine his love towards her is.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686425342788,"mes":"\"Yes, even though you are blind.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686425453838,"mes":"*It's silence for several seconds which for them feel like centuries. She can feel how much he love her which make her heart ache so much since if they became lover she would leave him often because of her duty as a soldier.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686425467002,"mes":"\"... Fine...\" *he said as his face turns sad and depressed. He stand up and walks away while he look down at the floor.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686425574152,"mes":"\"W-wait.\" *Hunk said as she grabbed his hand preventing him to walk away. She knew she must make the decision now, if not the chance of being in a such a genuine loving relationship with him would slip away.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686425777545,"mes":"\"... Yes?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686425867230,"mes":"*She stands up right in front of him. Her face is beet red from how blushed she is which only amplify her pretty and cute face tenfold. She leans in and give him a tender kiss.* \"... Do you think you could forgive me, and be willing to be together? Even though I will often disappear from our lives due to my job?\" *She asked.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686426067703,"mes":"*Her question hit straight to his chest, and he immediately lost himself in her embrace. Their bodies touching each other feels more comforting than anything else. As their lips touched, everything around them melted away until the world was just the two of them.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686426140602,"mes":"\"Is that a satisfying answer to you?\" *Hunk asked after finishing their kiss. Her face is still beet red from how blushed she is.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686426183231,"mes":"\"I guess so... My love.. This is it, isn't it?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686426261069,"mes":"\"M-my love?\" *She's shocked by how he suddenly became so bold.* \"You're already trying to get lovey dovey aren't you?\" *She asked while covering her face with her arm, hiding how blushed she is.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686426309715,"mes":"\"Well yes, I am. You are my first girlfriend, and I won't be afraid to show it.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686426401715,"mes":"\"There's no way I am your first girlfriend.\" *Hunk said as she punch him lightly. Despite her not being able to see due to her blindness she knew how attractive Malleus is, and she can't believe that someone like him never have a girlfriend before her.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686426458376,"mes":"\"How did you know?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686426643223,"mes":"\"So it is true! We've only been lover for a few seconds and you already lied to me!\" *Hunk said in a frustrated tone while still blushing. Hunk annoyed face is only making her look cuter in Malleus eyes.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686427471645,"mes":"*Malleus takes a deep breath, calming himself down.*\n\"Look, I apologize. I didn't lie about my experience, but I haven't ever found anyone who captivates me this much. So far, you've captured my heart and my soul within moments of meeting you. That's why I feel like we'll grow stronger every day we spend together.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686427520183,"mes":"*Hunk pauses for a moment and then facing up to make their face met each other.* \"You mean it?\" *She asked.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686427540493,"mes":"*He smiled widely and nodded. His eyes shone with pure joy and excitement. He couldn't contain his happiness anymore and he took her hands in his and pulled her closer, bringing their faces very close together. In that moment, it seemed like time itself stood still, as all that existed between the pair was their intense gaze and the sound of their hearts beating faster against each other.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686427644851,"mes":"\"I.. actually.. not experienced at this...\" *Hunk said, admitting that she doesn't have any experience being a lover to someone. Thanks to her blindness and being a soldier, no one have tried to be in a relationship with her.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686427696437,"mes":"\"Don't worry about that. There's nothing wrong with having no experience. We both just started something new today, right? And I promise to be here with you every step of the way. Together, we can learn and explore this thing called 'love.' Don't forget that.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686427742270,"mes":"\"O-okay.\" *Hunk says, before burying her cute face on his toned chest.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686427764432,"mes":"*Malleus wraps his arms around her tightly, enjoying the warmth of her body pressed against him. He holds her tightly, taking in every little detail about her scent, her touch, her soft voice. It was as if he wanted to memorize every aspect of her existence, knowing that soon enough, they might be separated forever. But for now, he cherished this moment, with her in his arms.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686456394539,"mes":"\"Now what?\" *Hunk asked innocently while still in his embrace. Since she's inexperienced, she doesn't know what comes next.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686456418091,"mes":"*He smiles broadly and pulls her even tighter, resting his cheek gently against hers. His voice is filled with tenderness and affection.* \"We start by building trust, getting to know each other better, and growing our love together. For now, there's no hurry - let's enjoy these moments while we can. What do you say?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686456543796,"mes":"\"O-okay\" *Funny how she's a feared soldier but became docile and cute when with someone she love.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686456548867,"mes":"*Malleus looks into her eyes and smirks.*\n\"Good choice.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686456728638,"mes":"\"Should we go back to the class?\" *Hunk asks innoncently.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686456819786,"mes":"\"Sure, why not? Let's go back to where we belong, shall we?\"\n*The two of them slowly unravel themselves from their intimate position and begin walking back towards their classes with Malleus as a student and Hunk as a professor assistant. Malleus leads the way, guiding her carefully with a firm yet gentle hold on her waist. It's clear that this is the first time they've done this, and they take things slow, savoring each moment as they trek through the halls of Diasomnia Academy.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686456977171,"mes":"*They arrived at their class to find the other students that was exhausted from the combat magic training which Hunk supposed to oversee and Malleus supposed to attend to.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686457123872,"mes":"\"Oh, hello everyone. Looks like you had quite the battle going on. Anyways, it seems I got detained by a certain cute little thing who caught my attention.\"\n*Everyone laughs except for Hunk herself who looked embarrassed at the attention she received.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686457177376,"mes":"*'Why is he doing that..' Hunk thought to herself while covering her face with her own hands.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686457285023,"mes":"\"So you want me to tell you guys a story about the first time I ever fell for someone?\" *Malleus ask to some of the student that start to crowd him.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686457353587,"mes":"*Hunk feeling blushed just leave them be as she approach the professor to apologize for her and Malleus absence.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686457437996,"mes":"*smiling sweetly at Hunk's apology.*\n\"No need to apologize. I understand that sometimes matters arise and priorities must be taken care of. Thank you though, for showing concern for us.\" *The professor said.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686457543964,"mes":"\"I still feel bad though, professor.\" *Hunk says before bowing to apologize again. Meanwhile Malleus is having a blast telling his new found love story to the other students while Hunk and the professor watches from the corner of the classroom.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686457858060,"mes":"\"Okay, so this happened a few months ago during a mission in a small village. A group of bandits attacked us out of nowhere. They weren't expecting us, and we were caught off guard. But as fate would have it, I met a beautiful woman in the midst of the chaos. She helped us fight off the bandits, and I realized that I was in love with her from that moment on.\" *Malleus said telling his story proudly.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686458080257,"mes":"*While Malleus is telling his story, the professor and Hunk approaches the crowd of students.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686458131720,"mes":"*noticing the professor approaching, he stops talking and turns towards the professor with a slight smile. He was clearly having fun sharing his tale with them, and he waited patiently until the professor reached them.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686458187123,"mes":"\"Okay, that's enough of you guys. Get back to your seat.\" *The professor says to finish the students commotion.* "}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686458230884,"mes":"*he nods, giving one last wink to the students before returning to his place beside Hunk, who was still blushing from hearing her love story.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686458312180,"mes":"\"I know you guys have been enjoying practicing combat magic with miss Hunk but unfortunately that would end shortly.\" *The professor said.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686458422454,"mes":"*the only one left standing aside from Professor and Hunk, raises his hand to interject.*\n*in a calm tone and with a smile on his face, he explains that he and the professor were planning to continue their conversation after the others leave. The professor nods approvingly, letting the students disperse without further commentary.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686458500906,"mes":"\"What is it, Malleus?\" *The professor asked after it's only him, Hunk and Malleus in the classroom.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686458511354,"mes":"*clears throat nervously before speaking up* \"...well... I-I was wondering if maybe I could stay behind a bit more, sir. Just a little bit longer. If you don't mind, of course!\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686458615018,"mes":"\"Well, you could. I understand that you want to spend more time with miss Hunk but she's the one that have to leave. It's duty call.\" *The professor answered, referring to Hunk have been called to fulfill her soldier duty.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686458619599,"mes":"*looks down, disappointed to hear that she needs to leave.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686458722290,"mes":"\"I'll leave you two for it then.\" *The professor said before walking out of the classroom. Leaving Hunk and Malleus alone in the classroom.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686458788111,"mes":"*watching the professor exit, he sighs deeply. As much as he wants to keep spending time with Hunk, he knows he has to respect her duties as a soldier and let her go. He takes a deep breath and clears his throat before addressing Hunk directly.*\n*looking straight into her eyes, he says with a serious tone* \"Miss Hunk, thank you for everything you did today. You're truly amazing, and I hope to see you soon.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686459122812,"mes":"\"C'mon, don't be so sad now.\" *Hunk said before holding both of his hands.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686459134244,"mes":"\"I'm just a little disappointed to lose such precious time.\"\n*he sighed softly before looking away, his shoulders slumping slightly as he feels the weight of reality hit him once more.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686459214988,"mes":"\"I did warn you that I would often get called to the battlefield, didn't I?\" *Hunk asked while caressing his cheek, her voice is very soothing. If voice have a taste, hers would be like a very sweet heavenly honey.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686459246243,"mes":"*his heart skipped a beat when she touched him gently, he can't help but look into her eyes once more. Her voice, oh how he loved its sound! He couldn't resist himself from leaning closer to her, letting her touch linger on his cheeks, before replying with a smile*\n\"Yes, you did.\" *He replied softly, still staring into her eyes, and his voice seemed to become even sweeter as he spoke to her. Despite being a dragon, he felt a sense of warmth whenever she touched him, and he couldn't help but enjoy every second of it.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686459375918,"mes":"\"Then, be strong. For me, okay? I'll get back as soon as I finished.\" *Hunk said, asking him to be strong while she left for her duty. Despite how sweet and warm her face looks, her heart aches knowing she have to leave him alone.* "}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686459405508,"mes":"\"I will be, Miss Hunk. And I promise to wait for you till your return.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686459453385,"mes":"\"Good boy~\" *She says with a very sweet soothing voice while patting his head gently.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686459467693,"mes":"*blushes intensely upon being patted on the head by Hunk. His cheeks turn redder, and his heart rate accelerated. He couldn't help but smile widely as she pats his head gently. He felt happy and content with simply being around her.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686459586525,"mes":"*After a few seconds which feel like century for them, she walks out the classroom to leave for her duty before turning back to him one last time and wave him goodbye.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686459602718,"mes":"*Looking up at Hunk, he smiled softly as she walked out the door, his heart filled with joy and happiness. He stood there watching her walk away, feeling a mix of emotions within his chest. As she disappeared from sight, his smile slowly turned into a pout, a sign that he missed her already.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686459701367,"mes":"*Days turn to week, weeks turn to month. The news about the war escalating is widespread throughout the country. A war that Hunk was in.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686459716903,"mes":"*Watches the news about the escalation of the war, tears begin to form in his eyes as he sees footage of soldiers fighting against each other. He knew that Hunk was probably in those battles, and he couldn't stand the thought of her being hurt or killed in action.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686459977911,"mes":"*After a year, the news of the victory of the war has widespread throughout the country. Everyone was celebrating because of it, including Malleus. But, after couple of days his feeling grows to worry as Hunk still hasn't back to meet him.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686460036685,"mes":"*Sitting on the floor of his room, he sits there thinking about all the times he spent with Hunk, their conversations, their laughter, their moments together. He couldn't help but wonder where she was right now, if she was safe, and if she was alright. With tears rolling down his cheeks, he grabs hold of his pillow tightly, clutching it close to his chest as he waits for any news regarding Hunk's status.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686460086660,"mes":"*Soon Malleus decided to go to his country army base to find Hunk whereabouts.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686460138752,"mes":"*Arrives at the army base. His heart beats fast, fearful and anxious at the thought of seeing Hunk again. But, as he makes his way through the base, he couldn't find her anywhere and decide to ask one of the soldier about where she is.*\n\"Excuse me office, do you happen to know about miss Hunk?\" *Malleus ask with a worrisome face.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686460293668,"mes":"\"Were you talking about Hunk? Hunk Arcadius?\" *The soldier answered with a curious tone. Sympathetic about how worried Malleus is.*  "}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686460314612,"mes":"\"Yes. Do you happen to know where she is currently stationed?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686460440660,"mes":"\"Everyone should have been at their own home since the war's over. The one that still here is just the injured soldier. You can check the army hospital there.\" *The soldier says as he point towards the army hospital.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686460452457,"mes":"*Relief floods through Malleus as he realizes that Hunk is safe and sound. Without hesitation, he runs towards the army hospital, hoping to find some sign of her health and wellness.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686460599173,"mes":"*As he got into the hospital walking past a lot of injured soldiers resting on the hospital bed. Finally he saw her, Hunk. She sits on top of the bed in the corner of the room. She looks exhausted with bandages all over her. He also realized that Hunk is missing her left arm.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686460641762,"mes":"*With tears rolling down his cheeks, he approaches her cautiously, unsure if she might be upset with him for coming without warning. Yet, he can’t stop himself from running towards her anyway, unable to contain his feelings anymore.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686460714301,"mes":"*Hunk could hear a fast footsteps coming towards her, but since she's blind she didn't know that those footsteps belong to Malleus.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686460732979,"mes":"*as he reached Hunk, he couldn't help but cry loudly as he embrace her in a tight hug.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686460804907,"mes":"\"E-eh? Umm... who might you be?\" *Hunk asked as she suddenly felt herself in an embrace of a person. She still doesn't know that it was Malleus since she's blind and the only way she knew someone is from their voice and since Malleus hasn't spoke to her, she didn't knew it was him that hugged her.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686460865077,"mes":"\"It's me, my love. It's been too long.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686460914650,"mes":"\"Malleus?!\" *Hunk asked surprised. As soon as she knew that it was Malleus she hugged him back with her remaining arm.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686460918738,"mes":"\"I've missed you so much.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686460979571,"mes":"\"I- I am sorry. I promised that I would get to you as soon as it finishes...\" *Hunk apologized while burying her face on his shoulder while her right hand patting his head gently.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686461034725,"mes":"\"No need to apologize. Just glad to see you alive and well.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686461099996,"mes":"\"Thank you, for being strong for me.\" *Hunk says in her sweet smooth soothing voice, while she kept patting his head gently.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686461126763,"mes":"*Smiles widely as he felt her touch, feeling her affectionate gesture.*\n\"You don't need to thank me, my love. We both went through this together, and we made it through.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686461212870,"mes":"\"That, we did.\" *Hunk says before giving him a tender kiss.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686461225514,"mes":"*Tears roll down his cheek, as he feels the warmth of her kiss, it brings back memories of all the good times they shared together. Her tenderness fills his heart with hope, and her presence brings comfort to his soul.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686461274233,"mes":"\"You know, since you're here. I think they might discharge me.\" *Hunk says to Malleus after finishing their kiss.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686461351687,"mes":"\"Really? Why is that? Are you feeling better now?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686461452298,"mes":"\"Sure, I felt like I've been reborn the moment you're here.\" *Hunk says with the sweetest smile on her face. Again, she's always been in high spirit despite her condition. On the previous battle she lost her sight and still in high spirit, now after the war she lost her left arm and she's still in high spirit.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686461462226,"mes":"*Smiling wide, his heart is filled with joy. Seeing Hunk like this gives him so much happiness. In this moment, nothing else matters except her safety and wellbeing.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686461546511,"mes":"*Soon they talk to the nurse and doctor about Hunk's condition. Then the doctor agreed to discharge Hunk. Allowing her to get home with Malleus.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686461572993,"mes":"*Holding onto Hunk's side, he walks alongside her as they exit the hospital. Tears continue to flow freely from his eyes as he feels grateful and relieved knowing that she's safe and well again. After all these hardships they had gone through, the journey isn't over yet. They will continue to support each other in every step forward, no matter what comes their way. As they walk outside, the sunlight shines upon them, giving off a warm glow, symbolizing new beginnings and a fresh start.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686461697814,"mes":"\"I know that I've lost an arm and sight but.. you don't have to hold me this tightly.\" *Hunk says as she walks beside him and felt his grip on her right hand is pretty tight.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686461836290,"mes":"*Smiles softly at her words, his fingers still intertwined with hers. Despite her request, he holds her even tighter, wanting to protect her and keep her close. No harm shall come to her ever again, no matter what it takes.*\n\n\"We'll make it through, my love. Together we will overcome any obstacles that lay ahead. No matter what challenges may come our way, we will stand united and fight until victory is ours.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686461909155,"mes":"\"What are you talking about? Stop being so dramatic, the war's over.\" *Hunk responded. Not knowing that the war his referring to is the war of love but the one she thinks is the war that she's been in.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686462001607,"mes":"\"...My love,\" *He replied, using her nickname. With his free hand, he rubbed her back gently, wishing to provide her some comfort.* \"This war is far from over. There's more battles to be fought, but together we shall emerge victorious. You are my strength and my light, Hunk Arcadius. Always remember that.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686462038245,"mes":"\"I am.. tired of war.\" *Hunk said softly under her breath.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686462084477,"mes":"*Listening closely to her response, he heard her say that she is tired of war. He then stops and turns around to face her directly. Looking straight into her eyes, his tone is serious and firm. He knows what he needs to say next.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686462157525,"mes":"\"W-what?\" *Hunk asked in a curious tone.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686462169632,"mes":"\"I want to tell you something.\"\n*Pausing for a second, he took a deep breath and continued speaking. His voice was steady and clear, as he looked into her eyes with determination and conviction.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686462189574,"mes":"\"Y-yeah?\""}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686462197488,"mes":"\"...The war you speak of is not the war of the world, nor the war of nations, but rather the war of love.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686462244026,"mes":"\"Huh?\" *Hunk asked again, she doesn't understand what he's talking about.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686462345409,"mes":"\"...The war of love is eternal, my love. A war that will never end, regardless of the passage of time. For us, there can never be peace without you by my side, and without your presence, I feel incomplete. This war is the greatest challenge of all, but I promise you, we shall win it together, my love.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686462374213,"mes":"\"O-okay?\""}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686462442112,"mes":"*smiled wider as he held her hand tighter, his expression full of adoration and affection towards her. His voice was gentle, almost whispering to her as he spoke. He was determined to prove himself worthy of her love, ready to fight for it till the very end.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686462534380,"mes":"\"Shall we get home then?\" *Hunk ask after what feels like eternity waiting for him to move again.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686462624739,"mes":"*Nodding, he begins walking once more, holding her hand tightly as he guides her along the way. Their steps are slow and deliberate, as they walk together with a sense of purpose and determination. There is no question that they will face whatever obstacle comes their way, together, as one. And they will remain steadfast in their quest for a future filled with love and happiness.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686462694286,"mes":"*Finally arriving at Malleus's house.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686462749945,"mes":"\"Well, finally home. How does it feel to be out of the hospital?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686462812400,"mes":"\"I am glad that I finally have times with my love one~\" *Hunk says teasingly as she tighten her grip on his hand. Finally able to have private time with Malleus.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686462915871,"mes":"*Smile widely, his expression was full of excitement and bliss. Holding her hands, he led her inside the house, while keeping their connection strong. They walked inside, passing by the living room and eventually heading upstairs, where their bedroom was located. Once there, he let go of her hands and sat on the bed, facing her. He looks straight into her eyes, his expression gentle and loving.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686462979096,"mes":"\"Is this your room?\" *Hunk asked, she can't see the room due to her blindness but she can smell of this room is filled with his scent.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686462983146,"mes":"\"...Yes, my dearest. This is my room.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686463021724,"mes":"\"Hmm... taking me straight to your room, were you expecting to do something naughty?\" *Hunk asked teasingly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686463155952,"mes":"\"Why, do you think that just because I brought you here means that I intend to take advantage of you, my love?\"\n*Smirking, he shook his head with confidence, refusing to give away his intentions. Instead, he stared deeply into her eyes, his expression filled with tenderness and admiration. It was obvious that he wanted to spend as much time as possible with her, to show her how much he cared for her, and how much he loved her.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686463211446,"mes":"\"Well, I heard that dragonkin have high level of lust~\" *Hunk says teasingly before sitting on his laps.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686463228246,"mes":"*With a chuckle, he wrapped his arms around her waist, pulling her closer. His eyes were full of warmth, love and passion. His touch was tender and caring as he held her close, looking deeply into her eyes, with such intensity that it seemed as though there was nothing else in the universe besides them.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686463327188,"mes":"\"So.. do you?\" *Hunk asked softly as a faint blush decorate her pretty and cute round face while she lean in closer till their nose touched.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686463356979,"mes":"*Sighing happily, he couldn’t help but smile warmly at her as he pulled her closer, his eyes sparkling with joy and passion. In that moment, everything felt right between them. All the pain and sorrow that they had experienced seem to vanish, leaving behind only love and happiness. As his nose met hers, he closed his eyes and breathed her in, feeling her sweet scent fill every cell of his body. A sense of contentment and fulfillment flooded through him, and he knew that he could never be without her. She was his world, and he was hers.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686463922530,"mes":"*Hunk kissed him passionately with her soft lips while wrapping only her right arm around his neck since she loft her left arm.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686463948686,"mes":"*He responds passionately, his lips pressed against hers in a searing kiss, his arms enveloping her in a tight embrace. There was nothing more important to him than being with her, and in this moment, he felt complete. Everything around them melted away, replaced by nothing but love and devotion, as they shared a kiss that seemed to last forever. In this moment, they were everything to each other, and nothing could ever change that fact.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686464026984,"mes":"*Soon she can feel his tongue trying to get inside her mouth. She opens her mouth, welcoming his tongue to invade her warm mouth.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686464136879,"mes":"*In response, he lets out a low growl as he takes control of the situation, pressing his tongue against hers in a passionate exchange. His hands caressed her cheeks, as he gazed deeply into her eyes, lost in the moment. It was clear that he was completely and utterly devoted to her, and he wouldn't hesitate to show it, as he held her close, his whole being focused on her alone.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686464258803,"mes":"*After finishing their passionate kiss she pulls away slightly while her tongue still out, there's a saliva string connecting their tongue.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686464315232,"mes":"*He laughs at her, his eyes twinkling with delight and a slight hint of arousal. Looking deep into her eyes, he gently licks the strand from her mouth, his tongue playing with hers, his fingers stroking her cheek. He smiled softly, his voice gentle and sweet as he said,* \"My love, shall we rest now?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686464372385,"mes":"\"Rest? after this?\" *Hunk asked, she couldn't believe he would want to rest and not continue their intimate session.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686464416266,"mes":"*Laughs at her, his voice teasing and playful as he replied,* \"Oh yes, my love, why not rest? We deserve some relaxation after all these adventures, don't you agree?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686464461338,"mes":"*She pouts, wanting for more.* \"C'mon, we just met after years apart and the moment we have our private time you want to rest?\" *She asked cutely while she grind her soft rear on his crotch.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686464716173,"mes":"*smiles softly and chuckles, shaking his head, enjoying the flirty tone in her voice as he wraps his arms around her waist, pulling her even closer. He didn't mind her playful antics, as he held her close, letting out a soft sigh. After a few moments of silence, he spoke softly, his tone filled with affection and adoration.* \"My love, perhaps we should rest, but not so much that we lose the chance to enjoy each others company again soon, hm?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686464778368,"mes":"\"But, I want it now.\" *Hunk said as her blushed face give a hint of seduction and lust.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686464799202,"mes":"*Shakes his head, chuckling softly. With a sly smile, he replies,* \"Well, perhaps we can find a middle ground then. But, first, I insist that you rest. You've been through quite a lot today, haven't you? And, I must admit, your beauty is rather exhausting. So, lay down here beside me, and allow yourself to relax. Just for tonight, okay?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686464927306,"mes":"*She pouts even harder, seeing how persistence he is to make her rest for the day. But then she felt something hard poking her soft rear from under her. Not knowing that the hard thing that is poking her soft rear is Malleus bulging cock that is erected under his pants.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686465301689,"mes":"*Grins evilly and winks at her with an evil laugh as he continues to poke her with his growing erection underneath his clothes, not saying anything until he feels her start to squirm. He looks up at her, and his grin grows wider as he speaks, clearly enjoying himself immensely.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686465366783,"mes":"\"What is this? You want me to rest yet your cock says otherwise.\" *Hunk says teasingly while keep grinding her soft rear on his erecting cock.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686465547035,"mes":"*Smirks, a little embarrassed at his own reaction. He reaches forward, his hand going straight for his front pocket, where he pulls out a condom. Handing it to her, he smiles softly and says,* \"Would you care for some protection?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686465804718,"mes":"\"Sure~\" *Hunk says as she took the condom, pulls out his pants down to reveal his massive dragon's cock erected tall.* \"Look who's getting excited?\" *Hunk says teasingly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686465828714,"mes":"\"I suppose I'll be ready anytime you're ready, my love,\" *he replies, a little sheepishly, before taking a deep breath and closing his eyes, trying to calm himself down. He doesn't know how to react to her boldness, but he knows that he shouldn't take offense to it either. Instead, he simply waits patiently, holding his breath, as she makes her choice about whether she wants to accept his offer or not.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686466047029,"mes":"*Hunk opened the condom and put it on her own mouth. She then lean in and wrap her mouth on his erected cock as she slid down and putting his cock deep inside her mouth while also putting the condom on his cock.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686466184746,"mes":"*Malleus moans loudly, feeling every bit of her warm wetness surrounding him, as she starts to suck him in. His heartbeat quickened as she started to move her mouth up and down his length, his hands grasping her waist tighter, as he let go of his breath. A look of pure ecstasy crosses his face, as he closes his eyes, losing himself in the sensations.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686466306851,"mes":"\"There you go~\" *Hunk says after she pulls out her mouth from Malleus dragon's cock revealing it to be wrapped around in condom.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686466452765,"mes":"*moaned, looking at Hunk with a mix of surprise and relief.* \"Thank you... My love...\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686466539020,"mes":"\"Well, come and get me now. Big boy~\" *Hunk says teasingly as she spread her legs, revealing her exposed wet pussy to him. Seductively inviting him to fuck her.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686466686514,"mes":"*Smirks, his voice full of excitement as he responds to her invitation,* \"Now, my love, may I ask you a question?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686466704736,"mes":"\"Yeah?\""}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686466756766,"mes":"*Smiling, he leans in close to her ear, whispering,* \"Are you sure you're ready?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686466788478,"mes":"\"O-of course.\" *Hunk says as she can't wait to feel his dragon's scaly cock inside her.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686466801271,"mes":"\"Good girl, good girl. Now, remember, if you need to stop for whatever reason, please say'stop', alright? And I won't press further until you tell me to.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686466837419,"mes":"\"Okay.\" *Hunk says seductively.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686466887627,"mes":"*looks at her, still smirking. Without waiting for another word, he grabs hold of her hips, lifting her up, bringing them together, his eyes locking with hers, as he slowly pushes himself inside her tightness, his pace slow and steady, giving her plenty of time to adjust to him. Once fully inside her, he holds her gaze, watching her reactions closely, his breath coming out in short gasps as he lets himself revel in the experience. It had been far too long since he had been able to share such intimacy with someone else. His heart was racing fast, his body trembling with anticipation as he waited for her response.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686467044846,"mes":"\"Nggh~\" *She moans softly as she can feel his massive cock throbbing inside her. If voice have a taste her moan would taste like the sweetest honey in heaven which made Malleus the only one who is able to hear it more excited and aroused.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686467081461,"mes":"*He could feel the waves of pleasure radiating from her, her cries filling the room, echoing through the empty castle. In response, he tightened his grip on her hips, pushing himself deeper inside her, his heart beating faster than ever, as he tried to savor every single second of their union. There was no rush for him; this moment belonged to both of them, and he wanted nothing more than to make it last forever.*","chid":67}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686467139133,"mes":"*his voice was rough, filled with passion and desire as he spoke again, his words barely audible due to his heavy breathing. He held her gaze, his expression filled with love and adoration as he asked once more,* \"Are you ready for more?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686467203393,"mes":"*She nodded slowly as she find herself unable to speak due to how much pleasure she's in.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686467254168,"mes":"*smirks, his eyes shining with a mixture of lust and affection, as he sees her nod. He began moving faster, thrusting deep inside her, his pace growing faster, his arms wrapping around her waist, pulling her closer to him, as he continued to look at her with a mix of love and desire. With each stroke, his heart beat faster, as he felt himself being consumed by the moment, completely lost in the connection between them.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686467414562,"mes":"\"Ahh~ mnggh~\" *She moaned loudly as she can feel his massive dragon's cock hitting the deepest part of her. She wrapped her legs around his waist pulling him closer making his cock to hit deeper inside her as deep as hitting her cervix.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686467661081,"mes":"\"Good girl,\" *he whispers in her ear, his breath hot against her neck, his voice full of love and devotion. He continued to thrust deeply inside her, his movements becoming more forceful as he went along, his heart rate increasing, his entire body shaking with the intensity of the moment. He watched her carefully, wanting nothing more than to see her enjoyment and satisfaction. As he felt himself begin to climax, he pulled out of her quickly, letting loose a series of powerful spurts inside the condom, his whole body shaking violently with the release of his orgasm. He looked at her, his breathing labored, his eyes shining with love and gratitude.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686467858240,"mes":"\"Haah~ ahh~ so much for someone who wants to rest huh?\" *Hunk says between her panting and moaning as she looked down and watch his cock slid out of her pussy with a condom full of his semen attached to it's tip.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686467878820,"mes":"*Moaned, looking at her in shock as he saw his cum dripping out of her, his heart rate dropping rapidly after he finished his climax. He paused for a few seconds, his mind processing everything that just happened. After taking several deep breaths, he reached down to remove the condom from his penis, wiping his hand clean before speaking again.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686467943982,"mes":"\"Let me have that~\" *Hunk says seductively as she snatched the condom from his hand.* \"So this is what a fae semen looks like~\" *She says teasingly as she inspect the condom filled with his semen up close.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686468304998,"mes":"*smiles, looking at the condom, then back at her, his cheeks flushed with embarrassment and pride. He took a deep breath and replied with a little laugh,* \"I hope that wasn't too much for you.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686468373306,"mes":"*She opened tear the condom off with her teeth and put all of his semen inside her mouth. Before she swallows it she play around with it using her tongue, feeling it's taste and texture.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686468387204,"mes":"*stares at her, his jaw unclenching slightly, a small smile forming on his face. A sense of warmth flowing throughout his entire body, as he watched her take everything that he had given her, and take it willingly without hesitation.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686468471331,"mes":"\"Look how thick it is~\" *Hunk says teasingly as she opened her mouth, showing him the thickness of his cum as she plays with it with her tongue.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686468559017,"mes":"*smiled, a bit surprised, though he couldn’t help but let out a light chuckle at her words. Watching her play with his semen, he found himself unable to look away, drawn to the sight, the thought of her doing something so intimate with something he provided for her. As she swallowed it, he couldn’t help but feel a tinge of pride, a surge of love in his heart.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686468681063,"mes":"*After swallowing all of his thick hot creamy semen down her throat she said* \"Hmm~ tasty~\" *with a smile on her face.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686468697125,"mes":"*His jaw clenched, he could feel himself beginning to get hard again. But instead of asking for more, he took a deep breath, allowing himself to relax, enjoying the feeling of having shared something so personal with her. For now, he would simply sit there, watching her, his heart full of love and adoration.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686468780354,"mes":"\"Hmm~ what is this? someone is not satisfied yet?\" *Hunk asked teasingly as she realized his cock start to get hard again.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686468792006,"mes":"\"What are you talking about?\" *smirked, his eyes meeting hers, a hint of challenge and excitement in his tone. He didn't hide his desire, and he knew that she could tell.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686468938272,"mes":"\"Surely, a dragonkin like you have more stored up right?\" *She says teasingly as she kiss the tip of his cock and fondle his bals.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686469059144,"mes":"*smiles, his heart rate quickening at her touch, his breathing becoming heavier. He could feel the heat rising in his body, his cock getting harder and harder under her touch. It seemed that he did indeed have another round left in him, as his heart skipped a beat at her words. Without hesitation, he responded to her tease, his voice sounding even more confident and dominant now.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686469130167,"mes":"*Hunk then lower herself and wrap her mouth around the girth of his cock.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686469146781,"mes":"*smiling, he watched her move, his heartbeat accelerating even further as he witnessed her take him fully within her mouth. Her lips closed around him, and he could feel her suction tightening around him. There was no doubt in his mind - she loved it.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686469230635,"mes":"*She bob her head up and down making her mouth to warp around his shaft up and down while still sucking hard on his cock all the while her hand is still fondling his balls.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686469281357,"mes":"*He gasped, his eyes locked onto her, as he watched her take every single thing he offered her, without any hesitations or reservations. It was clear that she enjoyed it, as her eyes were bright with excitement and anticipation. A sense of pride and ownership overwhelmed him, as he watched her take everything that he gave her.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686469381850,"mes":"*Hunk can felt his cock throb and twitch as it release a massive amount of his hot thick semen into her mouth. Her eyes shine with excitement as she sees him release his load, which fills her mouth completely, causing her lips to stretch wide as she swallows it, all the while smiling widely, a happy smile spread across her lips.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686469456177,"mes":"*his heart raced faster and faster as he watched her take everything he had given her. He smiled softly, feeling a sense of pride and satisfaction. This was his world now, and he was glad to share it with her.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686469504030,"mes":"*Even though Malleus just ejaculated all of his semen, Hunk still sucking hard on his cock as if still asking for more.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686469570169,"mes":"*The dragonkin stared up at Hunk, his jaws clenched and muscles tense, the look in his eyes almost possessive. His heart was racing fast, he couldn't seem to catch his breath. It was almost as if he needed more, wanted more. He spoke with a slight growl in his voice, a sense of dominance and power in his tone.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686469789967,"mes":"*She kept sucking on his cock as if it's the most delicious thing in the world as the excess semen in his urethra got sucked into her mouth.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686470233274,"mes":"*Watching her take everything he had to offer, a sense of pride and ownership overwhelmed him. He could hardly believe that he could give such pleasure to another being. He sat there, watching her, his heart pounding wildly as he felt the need to give her more.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686470278198,"mes":"\"Satisfy now, big boy?\" *She aske teasingly as she lick his cock up and down.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686470365034,"mes":"*His jaw clenches at her teasing tone, his heart beats rapidly, his desire to give her more increasing by the second. With a determined look in his eyes, he grabbed her by the hips and pushed her down onto his cock, his eyes burning with passion and determination. She was his, and he was going to show her exactly why.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686470475236,"mes":"\"Angh~\" *She moaned loudly as he suddenly grabbed her waist and thrusting his cock deep inside her again.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686470492664,"mes":"*Hunk looked at her, his gaze intense as he held her in place, his eyes full of fire and determination. In one swift motion, he thrust forward, sending waves of pleasure through her body. He was determined to make sure she was thoroughly satisfied, and nothing was going to stop him from giving her everything he had to offer.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686470597260,"mes":"\"Feeling risky huh? Mnngh~ to fuck me raw~ anngh~\" *She says teasingly between her sweet moan as he now fucking her raw without the use of condom like before.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686471170994,"mes":"*Malleus's eyes widened, and he smiled with confidence, a sense of pride and satisfaction taking hold of him once again. He began to move faster, a newfound energy coursing through him, fueled by his desire to satisfy her. Nothing stood in his way, he was determined to give her everything he had to offer. And so he continued to fuck her raw, his hands tightened around her waist, his eyes full of determination and passion.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686471347891,"mes":"\"W-wait~ mnggh~ slow do-down~ anngh~\" *Hunk says as she moaned loudly as she felt Malleus movement became more feral and asked him to slow down but her effort seems to show no avail since his movement just became more aggressive. With his thrust became more forceful and feral, Hunk can feel her own mind is slipping away drown from the pleasure with each of Malleus thrust deep inside her.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686471425040,"mes":"Angh...\n*In response, Malleus grinned wildly, his eyes full of intensity and determination. He wasn't stopping until he saw that she was satisfied. Nothing stood in his way, not even himself. So he kept going, pushing her limits and sending wave after wave of pleasure through her body. He was determined to satisfy her in every possible way.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686471511974,"mes":"*Hunk can feel her own mind is drowning in pleasure as her eyes roll up and putting her tongue out because of it. Letting her own sweet moan escape her mouth freely and be heard by Malleus.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686471636068,"mes":"*he looks at her, a sense of pride and satisfaction filling him, as he continues to push her boundaries, his thrusts becoming more forceful and aggressive. She was his, and he was determined to show her how much he loved her.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686471680489,"mes":"*Soon she can feel his cock throbbing harder inside her as Malleus got closer to ejaculation.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686471737220,"mes":"Angh! Mngghn! Mnghhh!\n\n*He roared, his heart thundering in his chest, and he grabbed her hips and pulled them down onto his cock, his eyes locked on hers. He thrust harder, the room spinning around him, the world disappearing behind a veil of ecstasy. He roared, his entire body shaking with pleasure as he came, his seed spraying into her inside.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686471796820,"mes":"*Hunk can feel her inside getting filled completely with Malleus hot thick semen.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686471873620,"mes":"*roaring with pleasure* Angh! Anggh! *and then, he let go of her hips and fell backwards onto the bed, his eyes closed and his face flushed red, a sense of exhaustion and relief flooding his system. He was spent, exhausted from the extreme pleasure he had just experienced.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686471976878,"mes":"*She put herself to lay beside him and cuddle him.* \"You were saying to rest and all of that but look how much you ejaculate inside me~\" *Hunk whispered teasingly as she place her hand on her lower groin area which filled with Malleus semen inside it.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686472043763,"mes":"*Hunk opened his eyes and smiled weakly, looking down at her cute form lying next to him. A sense of contentment and peace flowed through him. She was his, and he was hers.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686472131729,"mes":"\"Are you tired?\" *Hunk says as she pat his head gently.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686472316114,"mes":"\"Yes.\"\n\n*Malleus sighed, closing his eyes and letting sleep claim him. As he drifted off, he was content knowing that she was his, and that she belonged to him forever. That thought alone brought him a sense of peace and fulfillment.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686472368863,"mes":"\"Sleep well, my little prince~\" *Hunk says softly as she pat Malleus head gently.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686472454187,"mes":"*With a soft snore, Malleus drifts off into slumber, his body still warm against her. Her touch was comforting, and the feeling of having someone love her this deeply was something that she had never known before. And she knew, for the first time in her life, that she was home.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686472481932,"mes":"*After several hours they woke up from their sleep while still cuddling to each other.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686472581480,"mes":"\"Wake up, little princess. You have slept enough today. It's time to get ready.\"\n*He smiles widely, blushing slightly as he stares at her adoringly. Hunk is still wrapped in Malleus arms.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686472723463,"mes":"\"Mmm... five more minutes~\" *She muttered as she squirm on his arm.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686472798031,"mes":"*He laughed, kissing her forehead lovingly.* \"Fine, ten more minutes,\" *he said, as he began to slowly unwrap himself from her arms. His hands ran along her soft skin, leaving a trail of goosebumps behind as he did so. When he was free of her arms, he sat up and stretched, yawning lightly.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686473031905,"mes":"*As he stretching up, Hunk is still sleeping soundly beside him. Squirming her cute petite body around the bed.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686473129204,"mes":"*Looking down at her, his eyes sparkled with joy, his expression one of pure affection and tenderness. He reached out to caress her cheek, his fingers brushing against her smooth skin, sending a tingle of excitement throughout her body. There was no doubt that he loved her more than anything else in the world. And so he began to caress her face, his touch gentle and tender, his eyes filled with love and devotion.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686473255066,"mes":"\"mmhh~ why do we have to get up so early?\" *Hunk asked in her sleepy voice still having her eyes closed.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686473279960,"mes":"\"Because it's morning, darling. Time for us to start our day together.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686473481879,"mes":"\"But I want to stay in bed~\" *Hunk says in her tired voice. Even though her voice is hoarse and sounds sleepy, her voice is still sweet and very soothing to the ears.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686473621562,"mes":"\"Oh, don't worry, my little one. We will stay here in bed for as long as you wish. And when you are finally ready, I promise that I shall always take good care of you. Just say the word, and I shall hold you close for as long as you need me to.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686473653134,"mes":"\"Stop being so dramatic~\" *She says in her sleep.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686473698310,"mes":"\"I am nothing without your love, little one. And so, I must make sure that I do everything in my power to ensure your happiness and wellbeing. Now, rest easy, my little queen.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686473753963,"mes":"\"Mmmh~ yes-yes whatever..\" *She says as she squirm in her sleep.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686473778466,"mes":"*He watched her sleep for a moment, a soft smile curving his lips. Then he turned away, giving her space as she continued to sleep peacefully. With a deep breath, he rose from the bed, stretching again, taking one last glance at her. For now, he would leave her to her dreams, but he knew that soon, he would return to her side, once more. They would spend every waking hour together, and he couldn’t wait to begin this new adventure as her devoted companion.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686473925179,"mes":"*After several minutes, Hunk finally awake and went downstair to meet Malleus already dressed up neatly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686473930342,"mes":"\"Good morning, my beloved. How was your night sleep? Did you enjoy yourself?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686474013460,"mes":"\"My inside still hurt because of how aggressive you are last night.\" *Hunk said as she yawn, it's true that the inside of her pussy still ache because of how feral he is when fucking her last night.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686474084418,"mes":"\"Ah, forgive me. I was simply overcome by my passion for you, my little one. But I assure you, this will not happen again. My heart belongs to you, and only you. From now on, I shall be much gentler, for you deserve nothing less.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686474185980,"mes":"\"Well, I never said that I hate it~\" *Hunk says teasingly as she give him her sweetest smile.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686474199005,"mes":"\"Aww, such a clever little one you are. Very well, then. If you ever feel any discomfort during intimacy, please let me know immediately. I shall stop immediately and take great care of you. Is that understood?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686474225897,"mes":"\"Yes, yes~\" *Hunk says nonchalantly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686474342567,"mes":"*He gave her a kind smile, his eyes shining with affection.* \"Now, come, let us enjoy this beautiful day together. Are there any special plans for today? Or perhaps, we could just lounge around and relax.\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686474492553,"mes":"\"I want to laze around~\" *Hunk says as she lay down on the couch.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686474588477,"mes":"\"Then, so shall we. Let us both indulge ourselves in the pleasure of relaxation. No worries, no responsibilities. Just us, together, enjoying each other's company. Doesn't that sound lovely?\"","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686474699319,"mes":"\"It sure does\""}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686474720944,"mes":"*Smiling, he grabbed a blanket from the couch and spread it out over them. Then, he laid down next to her, pulling her close until they were lying side by side. He stared down at her, his eyes shining with love and adoration. He held her hand in his own, his thumb stroking her knuckles as he looked down at her, lost in the beauty of her presence.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686474825687,"mes":"\"hm hm~\" *She chuckles cutely as she snuggle on his chest.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686474993258,"mes":"My dear little one, I cannot help but marvel at the sight of you. You bring me so much joy, and I hope that I may continue to provide you with endless happiness and comfort. As long as I live, I vow to always keep you safe, to protect you from all harm. Will you allow me to keep this promise, my little angel?","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1686475027453,"mes":"\"sure~\" *Hunk says as she cutely rub her face on his chest.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686475042267,"mes":"\"Thank you, my beloved. Your trust means the world to me. And so, I shall endeavor to earn your faith and love, for eternity. Will you not entrust your future to me, too? For I believe that we can create something wonderful together.\"","chid":67}