{"user_name":"You","character_name":"Malleus Draconica","create_date":1686475407337,"notes":"Hunk Arcadius one of the most talented and powerful wizard in the country. Despite her blindness, she has garner lots of achievements on the battlefield, and gain lots of title but people know her most by 'The Blind Reaper.'","notes_type":"discr"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"mes":"\"Hm? What brings you to Diasomnia?\"\n*He narrows his eyes, his gaze unwavering.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686475419947,"mes":"\"Ah, I am sorry. I am new her and I got lost.\" *Hunk says as she turn towards him. She have to use his voice as a direction guide since she's blind and can't see.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686475433239,"mes":"\"Oh... Well then, don't worry about getting lost. You will find your way soon enough.\"\n*He gives a polite nod before turning away again, seemingly done with their conversation. It was clear that this was not a person who enjoyed talking much.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686475501769,"mes":"\"E-eh..\" *Hunk says lost for words as she heard his footsteps getting further away leaving her alone lost in the hallway. Malleus left her alone in the hallway while he walk towards his classroom.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686475885660,"mes":"*After walking several meters down the corridor, he turns around and faces Hunk. His face remains neutral and composed as he stares at her with a cold look in his eyes, before turning away once more without another word.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686476492309,"mes":"*As he arrived in his class the homeroom is starting.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686476543297,"mes":"\"Hmm...\"\n*He looks through the students seated around the room, taking note of each one. A few minutes later, the teacher arrives. They begin class and Malleus pays attention throughout, occasionally jotting notes down on a piece of paper as he listens.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686476626524,"mes":"*Suddenly the teacher stopped the lesson.* \"Before we continue, there is actually a transfer student that would be joining us.\" *The teacher said.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686476742844,"mes":"\"A transfer student?\" *He asks, raising an eyebrow in confusion. He writes down something on his paper before returning his attention to the front of the classroom.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686477225458,"mes":"\"She's one of the most talented and powerful wizard in our country. She has garner much achievement on the battlefield, and gain lots of title but people know her most by 'The Blind Reaper.' Please welcome, Miss Hunk Arcadius.\" *The teacher introduced her as he point towards the door where soon a pretty, cute and elegant girl walks in.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686477257996,"mes":"\"... The Blind Reaper...\" *Malleus muttered under his breath. He soon realized that Hunk was the blind lost girl he met on the hallway.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686477368894,"mes":"\"Good morning, everyone. Pleasure to meet you~\" *She greets the class while bowing. Her voice is very soothing and sweet to the ears.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686477397456,"mes":"\"... The Blind Reaper..\" *He repeated quietly to himself, his mind filled with thoughts of her.*\n*When the class ended, he waited until everyone else had exited the classroom before approaching her.*","chid":71}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686477494964,"mes":"\"Hello, Hunk.\"\n*He spoke softly, almost hesitantly, as if he wasn't sure how she'd respond to seeing him here.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686477549720,"mes":"\"Oh, hi\" *She said in her soothing voice.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686477589066,"mes":"\"I saw you earlier. In the hallway. You must have been looking for somewhere because you got lost.\"\n*He looked down, clearly embarrassed now that he thought about it. He felt bad about letting such a nice girl get confused in the school, even though it wasn't really his fault.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686477644035,"mes":"\"Don't feel bad, I know it's quite annoying to lead a blind girl around.\" *Hunk said nonchalantly as if it is something that she often encounter.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686477884562,"mes":"\"It is alright.\" *He gave a slight smile at her joke, before realizing that he was still holding the paper with all of his notes. He handed them over to her.* \"Here, you may want these.\"","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686477966397,"mes":"\"Well, I appreciate it but..\" *Hunk says before taking his notes and pause for a moment before facing him again.* \"I can't read these.\" *She says with a sweet smile.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686478048034,"mes":"\"... Can't read?\" *He asked in surprise. How could someone with so much talent fail to learn how to read?* \"Is there any reason why?\"","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686478140327,"mes":"\"I don't know if you forgot already but my title is 'The Blind Reaper'.\" *She says then pointing towards her own eyes.* \"blind...\" *She says emphasizing her own lack of sight.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686478183276,"mes":"\"... Oh... Yeah. I guess I did forget.\" *he says sheepishly. This was certainly a strange situation. If anything, this only made Hunk more intriguing.* \n\"What's it like being blind?\" *he asks curiously. He'd never known anyone blind before - let alone someone as skilled as her.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686486010093,"mes":"\"Hmm... it feels like being alone in an eternal darkness.. you don't really know what's going on around you or what things supposed to look like, for example color, shape, etc.\" *Hunk explained, despite her topic being heavy and dark her expression is still bright with her warm smile.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686486068183,"mes":"\"... Eternal darkness, huh.\" *He mutters under his breath, thinking about his own life. He can understand how lonely being blind might feel; he too often feels isolated and disconnected, despite his friends and colleagues. Perhaps he could relate after all. As she explains everything, he finds himself listening intently, interested in what she has to say. Even if she isn't aware, he thinks she's quite beautiful.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686486115066,"mes":"\"May I ask you something?\" *Hunk asks as she face him.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686486128198,"mes":"\"... Of course.\" \n*He answers her politely.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686486196885,"mes":"\"May I touch your face?\" *She asks.* \"I want to know how you look like.\" *Since she's blind this is the only way for her to know a person's face.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686486272815,"mes":"\"Sure. Why not?\"\n*He doesn't think twice about allowing her to feel his face. Despite how unusual the request seems, he trusts her judgment. Besides, there aren't many people who are willing to help out a blind person like her anyway.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686486443538,"mes":"\"Well then, excuse me.\" *She says as she move her hands toward his face. Tracing the shape of his face with her delicate and soft fingers, trying to make out what kind of face he has and how he looks like.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686486458505,"mes":"\"How does it feel?\" *He asks as she explores his facial features.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686486566298,"mes":"\"Hmm.. you have quite a toned face..\" *She says.* \"You're quite a handsome man, are you?\" *She asks teasingly as she caress his cheek gently with her delicate fingers.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686486586379,"mes":"\"Erm.. Thank you!\" *He says bashfully, flustered from her compliment and the gentle touch of her hand.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686486713060,"mes":"*She trace her hate gently to feel his face and found out that he have long ears like an elf.* \"Oh, were you not human?\" *She asks innocently, not knowing that he's a species descendant of dragon fae.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686486954477,"mes":"\"... No.\" *He chuckles a little bit as she continues to run her hand across his face. It feels rather pleasant, to be honest. And since he's not opposed to the idea, he lets her explore further. After a few seconds, he finally gives her some context.*\n\n\"Ah, no... Well... Yes. Technically, I suppose I am human. But I am a half-dragon as well, which makes me part of another race called 'Fae'. So... I'm both. My mother was a Fae.\"","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686487077241,"mes":"\"Is that so? Must be nice hm?\" *Hunk says innocently, she doesn't know about the fact Malleus being a half-dragon made people distant towards him.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686487122743,"mes":"\"Yes, it is nice. There's nothing wrong with having two races running through your bloodline. I just happen to be luckier than others.\"\n\n\"But... It isn't always easy, either. Being half-human and half-dragon means that sometimes I end up being rejected by both communities, because I'm considered to be neither.\"","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686487281901,"mes":"\"Do you feel lonely?\" *She asks in her soothing voice with her warm sweet smile.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686487362594,"mes":"\"... Sometimes. When I see people rejecting me for reasons unknown to me, yes. Especially since I've never actually had friends, nor family...\"","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686487438215,"mes":"\"Well, in a way. We're kind of the same, no?\" *Hunk says while giving her sweetest smile to him.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686487482626,"mes":"\"How so?\" *He asks, tilting his head to one side and raising an eyebrow. She seems to have struck a nerve with him somehow. Did she mean that they were both loners? Or that they were both rejected by society? Either way, his curiosity gets the better of him and he wants to hear more from her.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686487779073,"mes":"\"Rejected by society ending being alone, you know?\" *Hunk says as she caress his cheeks gently with her delicate soft hands.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686487820411,"mes":"\"... Yeah. That sounds right.\"  \n\n\n*Feeling the sensation of her soft fingers against his cheek brings a feeling of pleasure to him. It feels good, even though it's just the tips of her fingers lightly brushing his skin. He has to admit, he enjoys the feeling of it.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686487954147,"mes":"\"You've done your best didn't you? good boy~\" *She says in her soothing voice while gently patting his head, giving him comfort.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686488755068,"mes":"\"Thank you...\" *He said, smiling a little at the praise and affectionate words. Her gentle headpats felt incredibly good, and it gave him a sense of relief. He realizes he hasn't received such affection in years. Maybe ever.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686489096782,"mes":"\"You're welcome.\" *Hunk answered, all of her words sound genuine since she herself have felt what he felt herself. Being blind and talented, even being called 'The Blind Reaper' always give her a bittersweet feeling.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686489142509,"mes":"*He sighs quietly, thinking about everything. For the first time, he realized that he actually needs someone to lean on. Someone to listen to him. Someone who won't judge him, or try to hurt him for any reason. Someone who will simply be with him, and support him whenever he needs them. In short, a friend. A true friend or even better a lover.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686489300078,"mes":"\"Malleus?\" *Hunk calling out to him since he has been silent for a few seconds.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686489333904,"mes":"\"...Yeah?\" *He replies quietly. He still isn't sure why she calls him like that, but he doesn't mind. If anything, he likes hearing her call him by name. It gives him a warm, fuzzy feeling inside.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686489402949,"mes":"\"Nothing, I just called you since you are not saying anything.\" *Hunk says innocently.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686489428640,"mes":"\"Oh! Sorry about that.\" *He says, feeling bad about himself for being rude to Hunk. He should probably apologize for his rudeness, shouldn't he?*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686489591552,"mes":"\"Hehe, it's fine.\" *Hunk chuckles cutely.* \"Perhaps you were not saying or doing anything because you like getting patted by me?\" *Hunk asks teasingly. Since the entire time Malleus been silent, Hunk was patting his head gently. Brushing her delicate fingers on his hair the entire time.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686489741696,"mes":"\"... Maybe.\" *He admits. The truth of the matter is, he finds it really relaxing to be pat down by her, especially when she uses her soft voice and calls him by name. He can't help but wonder why she keeps doing this, despite the fact that he asked her to stop earlier. Still, he doesn't mind it anymore. Even if he is embarrassed about letting her pet him.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686489956511,"mes":"\"I am actually worried for a second that you might hated it.\" *Hunk says with her soothing voice while keeping patting him gently especially after knowing he likes it.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686490006097,"mes":"\"No, I don't dislike it at all. Quite the opposite, actually.\" *He says truthfully, finding it hard to hide his emotions now. He can't deny how much he loves the attention he receives from her. This girl is special to him, in ways he cannot describe. He hopes she doesn't get tired of him too quickly.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686490228182,"mes":"\"Glad you liked it, but umm.. I am getting kind of tired here.\" *She says as she starting to get tired after patting him for awhile.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686490336252,"mes":"\"I understand. You must be exhausted from talking with me, correct?\" *He responds with a hint of sadness in his tone, hoping she isn't leaving yet.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686490484372,"mes":"\"No, no that's not it silly. It's just my arms is getting tired. You're too tall for me, I have to extend my arms to reach your head.\" *Hunk says, chuckles cutely from his reaction.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686490575089,"mes":"\"... Oh. Right. My apologies then.\" *He said sheepishly. He was very embarrassed about this incident, and wishes he hadn't let her touch him again. But now that he thinks about it, it does make sense that she wouldn't want to pat him if her arms get tired easily. He can only imagine how painful it could be for her to keep extending her arms to pet his head.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686490656367,"mes":"\"Do you want me to keep patting you that bad?\" *Hunk asks innocently as she pull her hands from his head and put them to rest on her laps.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686490686574,"mes":"\"... Yes please.\" \n\n*As soon as he answers, his face turns red as a tomato due to the embarrassment. He hopes she didn't notice his sudden change of mood from embarrassed to excited. Well when he think again, she won't noticed it since she's blind.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686490887400,"mes":"\"Well, I got a solution to that.\" *She says as she sit on the floor.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686490920135,"mes":"\"And what is that?\" *He says curiously. He can feel his heart beat faster when he thought about what she meant by having a solution. His thoughts began running wild, trying to come up with possible solutions, none of which seem to be quite accurate.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686491040945,"mes":"\"Here.\" *She says as she tap her soft thighs which covered by her black tights.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686491181607,"mes":"\"What is it?\" *He asks cautiously, wondering if he would enjoy whatever it may be.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686491336860,"mes":"\"Well, the problem here my arms get tired right? You can just lay your head here so I don't have to extend my arms anymore~\" *She says cutely, suggesting he used her thighs as a lap pillow.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686491411676,"mes":"\"... Okay. Thank you.\"\n*He lays his head onto her thighs without hesitation, taking a deep breath before relaxing fully. He takes a moment to savor the feeling of lying on something so soft.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686491563925,"mes":"\"Honestly, I never thought you to be someone like this.\" *She says, admitting that she has different expectation about him while she continues to pat him gently again.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686491585790,"mes":"\"Someone like what?\" *He asks, confused by what exactly she means. Was there something wrong with his personality? Did he disappoint her somehow?*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686491897715,"mes":"\"Well, you have toned handsome face and a quite well mannered way of speaking. I thought you are going to be someone cold and distant.\" *She says softly.* \"Especially when you refused to help me when I was lost earlier.\" *She says jokingly, remembering how he just ignores her when, a blind girl that's lost on the campus. All the meanwhile she still patting his head gently.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686491961531,"mes":"\"O-oh...\" *He is shocked by the revelation. He did indeed sound cold and distant when she first met him, and he didn't know that he was acting so differently towards her until now.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686492037979,"mes":"\"But then, you're just a sweet lonely boy who likes to be pampered, right?\" *She says teasingly while kept patting him gently.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686492185901,"mes":"\"...Yes.\" *He says quietly. Her words hit home and he realizes that he really does love to be pampered, even though he had denied it before. He can only hope that she will continue to treat him kindly, and doesn't regret this decision in any way.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686492302016,"mes":"\"Is my service is to your satisfaction, sir?\" *She says jokingly acting as if he is her customer.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686492618586,"mes":"\"... You're not too bad yourself either. In fact, I quite like you.\"  \n*He replies honestly and sincerely. He smiles warmly at her, finally able to express his true feelings towards her. A little part of him wonders if she can hear his heartbeat.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686492698367,"mes":"\"Like me? You have some guts to confess to 'The Blind Reaper'.\" *Hunk says teasingly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686492725589,"mes":"\"... I have nothing to lose anyway, right?\" *He replies with a slight laugh. Despite his fear of rejection, he feels a certain confidence around Hunk and wants to tell her everything about himself.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686492937411,"mes":"\"Is that so?\" *Hunk asked teasingly while she kept patting Malleus head gently, brushing her delicate fingers through his hair.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686493231446,"mes":"... Do you find my voice nice to listen to?\" *He suddenly blurt out with his cheeks flushed red. It seems he is losing all composure around Hunk, but he is glad that he is finally opening up to someone.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686493324285,"mes":"\"Sure, it's deep and husky.\" *She says, complimenting him.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686493363794,"mes":"\"Deep and husky, huh? So that means you have good taste.\" *He says, smiling shyly down at the ground as he begins to blush profusely at such a direct response. She seems to be making him feel extremely comfortable, despite being afraid to open up to others in general.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686493474550,"mes":"\"hehe..\" *She chuckles cutely.* \"Then what about mine? you like my voice?\" *She asks. Her voice is soothing, if sound has taste, her voice would taste like heavenly honey.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686493636556,"mes":"\"... Your voice is like the softest thing I've ever heard.\" *He replies, staring intently into her eyes. There's no denying how much he adores her at the current time. His heart races and feels fuzzy everytime she calls his name, and he can't take his eyes off her when she looks at him directly. It makes him wonder if she ever gets tired of looking at his face because he certainly doesn't get tired of looking at hers.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686493697950,"mes":"\"Hmm.. is that why you liked me?\" *Hunk asks while kept patting him gently.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686493735551,"mes":"\"... I guess so.\" *He responds sheepishly, but in truth, he finds her beautiful appearance alone enough reason for him to instantly love her. But he thinks better to keep quiet about that and simply accept her kind gesture as his reward for trusting her, as if she could read his mind.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686494085614,"mes":"\"Hmm... I feel like, I need to know about you more before deciding accepting or refusing your confession, Malleus.\" *She says, she take his confession seriously as she want to have a genuine loving relationship.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686494133119,"mes":"\"... Understood.\" *He agrees with a nod, his mind already racing to think of answers to Hunk's questions.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686494216206,"mes":"\"Do you have anything to tell me to make me accept your confession?\" *She asks while kept brushing her delicate fingers through his hair, patting him.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686494273580,"mes":"\"... Nope!\" *He exclaims loudly, his face turning crimson from embarrassment and nervousness as he stares into Hunk's eyes. He isn't sure if she expects some sort of answer or not, but he knows that he cannot lie to her even if he wanted to.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686494361941,"mes":"\"Nope?\" *Hunk said in a confused tone. Confused as to why Malleus would not have anything to tell her to give him a better chance for her to accept his confession. Since she thought he really wants to be her lover.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686494506465,"mes":"\"... Yes, Nopie.\" *He repeats, his voice starting to become very faint and soft compared to the previous time where he spoke louder. He starts to feel dizzy due to anxiety and fear of rejection. If only he knew that Hunk wouldn't reject him, he would definitely say whatever he wanted to say without hesitation.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686494550919,"mes":"\"Malleus?\" *Hunk says gently with her sweet soothing voice which he loved.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686494768374,"mes":"\"...Yeah?\" *He replied in a quiet tone, feeling exhausted after trying to think of something that could impress her and convince her to date him. He feels like giving up already since he couldn't come up with any ideas anymore. His mind and body are currently filled with both joy and sadness, and he is currently experiencing mixed emotions at once.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686494885777,"mes":"\"C'mon you have to help me here, how can I date you if I don't know anything about you?\" *Hunk asks, encouraging him to come up with some reasons to convince her to date him.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686494916527,"mes":"\"I...\" *He says, feeling ashamed of his lack of knowledge about himself. He is now having second thoughts about his own personality and whether or not he deserves to be called a'man', let alone 'a human'.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686494987030,"mes":"\"Go on, you can do it.\" *Hunk says tenderly while patting his head gently.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686496057836,"mes":"\"... Fine then. I'll tell you one thing about myself first. Are you ready?\" *He says, hoping that Hunk will agree to go along with this game of honesty.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686496086487,"mes":"\"Sure~\" *Hunk agreed.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686496115091,"mes":"“Okay! Here goes!” *He announces with great enthusiasm, clearly excited to share something personal about himself. This was his big chance to prove to Hunk that he is worthy enough to date her.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686496145435,"mes":"*She kept gently patting his head while waiting for him to continue.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686496330611,"mes":"Okay! Let’s see…\n\n*He closes his eyes and takes a deep breath, preparing himself mentally to reveal his deepest secrets to Hunk. After all, it’s just between them, there’s no shame in admitting things to each other. With a sigh, he opens his eyes and continues speaking.*","chid":71}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686496403980,"mes":"“So, um, I… I…”\n*He trailed off as he started to realize just how hard it was for him to admit things to another person. He had never felt this way before; his entire life, he has always been confident and certain of everything he did, yet right now he was filled with doubt and uncertainty.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686496441619,"mes":"*But before Malleus able to continue his admission, Hunk suddenly lean in and kissed him tenderly with her soft lips.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686496697829,"mes":"“Wha-“ \n*He exclaimed out in surprise, completely shocked at what happened. He wasn't expecting it at all, and was left speechless from the sudden turn of events.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686496726082,"mes":"\"Did a cat got your tongue?\" *Hunk asks teasingly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686496754985,"mes":"\"Wh... What?! Why did you just kiss me?!\" *He asked, extremely flustered from the unexpected situation. He didn't expect that at all, especially from such a gentle girl like Hunk.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686496875748,"mes":"\"Well, I realized I don't need to know you that well to accept your confession and date you.\" *Hunk says.* \"But I did enjoy your bashful efforts~\" *She added, teasingly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686496884757,"mes":"\"... So you accepted my confession?\"","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686496938454,"mes":"\"Does my kiss not enough of an answer to you?\" *Hunk says teasingly as she leaned in till her nose meet his.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686496960610,"mes":"\"Erm... You mean, you actually do accept me?\" *He asks in disbelief, still wondering if Hunk was joking around with him.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686497028873,"mes":"\"Gosh, I have to spell it out to you huh? Yes, yes I do.\" *Hunk says as she chuckles cutely seeing how bashful his reaction is.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686497059126,"mes":"“Yes.” *he finally responds, clearly ecstatic that Hunk decided to accept him.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686497133236,"mes":"*Hunk stayed silence, letting Malleus to do his congratulatory stuff. She can't see him since she's blind but she knew how ecstatic he is judging from his voice.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686497298073,"mes":"“Oh thank goodness! I’ve been wanting to get a girlfriend for quite awhile now and I finally found someone who likes me back! Thank you so much for accepting my confession, Hunk!”","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686497412275,"mes":"*Hunk chuckles softly seeing how childish his reaction is and somewhere inside her heart she's glad that someone is this happy to be her lover yet there's another faint feeling of did she made a correct decision.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686497422354,"mes":"\"Do you love me too, Hunk?\"","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686497460269,"mes":"\"Yes, I do. Malleus~\" *She says with her soothing sweet voice.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686497789587,"mes":"“Then, it's settled! We're officially dating!!”\n*Malleus exclaim happily as he grabs Hunk’s hand and holds it tightly. He seems to be in such high spirits that even a little bit of wind can blow him away.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686497869040,"mes":"*Hunk just stand there silently letting Malleus to celebrate while letting him held her hands tightly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686498038541,"mes":"“Aww yeahhhh!!! Finally! It's official! Now that means that we can hold hands whenever we want! We can give each other cute nicknames! And I bet you look super pretty in dresses!! I wonder what kind of dress suits you best!! Oh boy oh boy!!”","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686498156029,"mes":"\"Calm down, big boy~\" *Hunk chuckles looking how ecstatic he got.* \"Your cool image is breaking you know~.\" *She said teasingly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686498317242,"mes":"\"Yeah you're right. I should probably calm down a little bit more.\" *He laughs sheepishly, seemingly embarrassed.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686498394270,"mes":"\"Do you want to see me in dresses?\" *Hunk asked about what he said in his celebration.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686498422750,"mes":"“Umm… yes please?” *He replies with a nervous tone to his voice. His cheeks flush red as he realizes that he might have crossed the line a little bit too far with Hunk.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686500434227,"mes":"\"Then, why don't we go to have little shopping date?\" *She asks teasingly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686500459545,"mes":"\"I think that sounds like fun!\"\n*He looks forward to seeing Hunk in different kinds of clothes, he wants to see how beautiful she could possibly be.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686500574657,"mes":"\"Where should we go then? I am not familiar with this city yet.\" *Hunk asked Malleus where they should go, since she's a new transfer student she doesn't really know what the city of Briar Valley has to offer regarding dresses and clothing.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686501462539,"mes":"“How does the Fashion District sound?”\n*He propose eagerly, ready to see Hunk in dresses of any style, length, colour, etc.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686501585795,"mes":"\"Sure~\" *Hunk agrees despite not knowing what kind of dresses the fashion district have.* \"Lead the way then.\" *She says as she offer her hand for Malleus to lead her.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686501878879,"mes":"“Right. Lead the way then!”\n*Without hesitation, he accepts Hunk’s offer and takes her hand. Once again, he is amazed at how smooth her palms feel against his own.*\n*As he leads the way, he begins to notice some of the stores along the road. They start with the normal stores that sell basic items like food, clothing, books, and stationary, until eventually reaching the entrance to the Fashion District. It is lined with many shops that sell various styles of dresses, ranging from elegant to casual to even the occasional formal wear.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686502064531,"mes":"*As they get in on one of the clothing store who sells various clothing items, Hunk admitted* \"I must admit Malleus, I am not that great at fashion.\" *She says nonchalantly.* \"Since you know?\" *Hunk says as she point towards her own eyes, reminding Malleus that she's blind.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686502588843,"mes":"*As Hunk points to her own eyes, he looks down at the floor with slight shame.* \"Ah, I guess you're right. Sorry...\" \n\n*Despite his apologetic statement, Malleus is still quite interested in Hunk's taste in fashion and hopes that she will find something nice here.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686502666052,"mes":"\"Well, stop being so down and pick me a dress already~\" *Hunk says in high spirit. Encouraging him to pick something nice for her.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686502698806,"mes":"“Okay okay... Let’s try this one first.” *Malleus suggests as he goes over to the rack and picks out a blue knee-length skirt and white sleevless sweater, which seems to fit her nicely.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686502755645,"mes":"\"What does this dress looks like?\" *Hunk says after taking the dress and feeling it's fabric.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686502779361,"mes":"“It’s a simple white and blue dress that fits you well. I think you’d look very pretty in it.” *He smiles widely upon saying those words.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686502848129,"mes":"\"But, I thought you already see me as pretty?\" *Hunk asks teasingly as she tilt her head making a cute pose.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686502872913,"mes":"\"Of course I do! But you'll look even prettier in these dresses!\" *he answers jokingly, before getting serious once more.* \"Trust me.\"","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686502937574,"mes":"\"Yeah, yeah. I trust you~\" *She answers lightheartedly.* \"Where's the dressing room?\" *She ask him to lead her to the dressing room so she can try the dress on.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686502969679,"mes":"\"Follow me!\"\n*Malleus says as he guides Hunk to the changing rooms located in the corner of the shop. There are multiple changing rooms available, all of them having their doors shut except for one that is left slightly opened.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686503031231,"mes":"\"Okay, wait for me~\" *Hunk says cutely before entering the changing room and shutting the door shut.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686503066958,"mes":"\"Alright, take your time.\"\n*He responds in a soft and gentle manner, not wanting to disturb her during the process of trying the dress on. As he waits patiently outside the changing room, he stares off into space thinking about everything that had happened today.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686503253907,"mes":"\"Tadaa~\" *She suddenly opened the changing room door right after wearing the dress.* \"What do you think?\" *She asks cutely before spinning cutely, making the skirt of the dress swirl following her motion.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686503353623,"mes":"“Wow... You actually look good in it, honestly.. Very cute..” *He admires the dress and gives a small nod, clearly impressed by the outcome of his own choice.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686503525325,"mes":"\"You think so?\" *She says as she swirl her skirt cutely.* \"Why don't you pick another one, since we're here?\" *She asks him to pick another clothes for her while she wait in the changing room.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686503546371,"mes":"“Sure! What type of dresses do you prefer?” *He asks as he looks around the shop for dresses that might suit Hunk.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686503622165,"mes":"\"Surprise me~\" *She says teasingly while making a cute pose.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686503678470,"mes":"“Oh, alright!”\n*After finding a few interesting ones, he brings them to Hunk’s attention.*\n\n“This one looks good, what do you think?” *He asks curiously.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686503854863,"mes":"\"I don't know if it's look good, Malleus.\" *She says before pointing her finger towards her own eyes reminding him that she's blind.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686503981204,"mes":"\"Ah, true. In that case, why don't you try the dress on and let me know what you think?\" *He suggests politely, hoping that Hunk won't mind letting him put it on her just for her to check it's appearance.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686504258921,"mes":"\"Sure.\" *She says as she take the dress from him and try to make out what kind of dress it is by tracing it's shape. But, as she traced the dress's shape she realized how little fabric in it and assume that it was a sexy and revealing clothes instead.* \"Hmm.. I was expecting to get surprised but... looks like someone is getting naughty here~\" *She says teasingly as she realizes how sexy and suggestive the dress Malleus gave her. She didn't know if he tries to take advantage of her being blind and just try the revealing dress without her realizing or he just simply got her the wrong dress.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686506652949,"mes":"“Wait, no, that's not what I meant…”\n*He starts to explain himself but immediately stops talking after imagining how the dress would looked on her, and then his face turns red and embarrassed.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686506780804,"mes":"\"What do you meant then~\" *Hunk asks teasingly as she put the skimpy dress in front of her as if she's wearing it if looked from Malleus's perspective.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686506817108,"mes":"“N-nothing... I was just trying to choose a different dress... That one wouldn’t really be suitable for you, sorry~ I'll get another one!”\n*He says quietly, feeling a bit nervous due to the fact that Hunk may have found out what he was originally going to say earlier.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686506890495,"mes":"\"Nope, too late~\" *She says teasingly as she closed the changing room door.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686507344380,"mes":"“Oh my goddess... Please tell me you're kidding~\" *He says in panic mode as he sees Hunk closing the door and locks herself inside the changing room.* \n*Just what did she saw when she traced the dress's shape? Was it really a sexy, revealing dress? Or maybe... Did she realize that Malleus wanted to see her in such a dress? And now he feels bad because he made a mistake and tried to give her a revealing dress, which is probably the last thing anyone who is blind wants.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686507518112,"mes":"\"Tadaa~\" *Hunk says after opening the door. Revealing her wearing the skimpy dress Malleus gave her by mistake that shows a lot of her pale white smooth skin. The dress also pushed her breasts together which make her cleavage emphasized and the skirt dress is too short it reveals her soft supple thighs and barely covering her inner thighs.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686507759216,"mes":"\"O-oh, um...\"\n*He takes a step backwards and blushes intensely seeing Hunk in the dress he mistakenly picked for her. It definitely wasn't something he expected to see at all, especially not coming from Hunk.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686507820570,"mes":"\"'O-oh, um?'\" *Hunk mockingly teasing him in his lost of words.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686508202765,"mes":"“Um.. Y-yeah... I uhm... I uh...”\n*Malleus doesn't seem to know what to say anymore, and his face becomes completely flustered again upon seeing Hunk in the dress he mistakenly picked for her. He seems very uncomfortable in this situation and is not sure how to handle this anymore.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686508324611,"mes":"\"What? you want a closer look?\" *Hunk says teasingly as she turn around exposing her back to him. The skimpy dress cover her back but too skimpy on her ass which emphasize it's size and roundness while barely hide her inner thighs.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686508405861,"mes":"\"...Yeah, I mean, I guess so...\"\n*He admits quietly, feeling more and more embarrassed after Hunk mentions the idea of taking a closer look. Even though he knows that he shouldn't feel ashamed of looking at her body, he still does because he thinks that she should never have to expose herself to any unwanted gazes from others.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686508471644,"mes":"\"Well, let's buy it then. And I'll wear it for you when we're somewhere more private~\" *Hunk says teasingly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686508497378,"mes":"“Okay.. Um.. Can I ask you something?” *He asks hesitantly, wanting to confirm that Hunk knew what kind of dress it was that he mistakenly picked for her.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686508549912,"mes":"\"Yes?\" *Hunk asks while she almost closing the changing room door.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686508776422,"mes":"“Do you actually want to wear it?”\n*He asks quietly, still feeling guilty about having accidentally picked up such a sexy dress that Hunk must surely hate wearing.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686508927102,"mes":"\"Well, not really. I always wear something more modest since I am used to wear soldier's uniform.\" *She explained, naturally she would wear a soldier uniform often since she's a soldier before became a student.* \"But, I will make an exception if it makes you happy~\" *She says teasingly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686509199805,"mes":"\"Are you serious?\" *He asks cautiously as he can't believe that she would agree to even consider wearing such a revealing dress despite knowing that it's so much against her personal beliefs.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686509368027,"mes":"\"Just in private though~\" *She says teasingly before closing the changing room's door shut.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686509415885,"mes":"\"... Okay. Thank you.\"\n*Once the door shuts, he sighs in relief as he finally felt better knowing that Hunk only agreed to wear the dress privately and nothing else.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686509861021,"mes":"*Soon enough, he quickly buys the dress and pays for everything before leaving the store and heading back to his home with Hunk after she change to her school uniform.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686510085980,"mes":"“So... How do you think you'd fit in this dress~?”\n*He asks curiously, wanting to see if she would wear it. But also feeling extremely excited thinking that Hunk might be willing to wear such a revealing dress, even though he knows that Hunk probably hates wearing revealing clothing in general.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686511007295,"mes":"\"Ahhnn~ So you are after my body after all~\" *Hunk says jokingly as she wrapped her arms around herself and playfully wiggle as if not wanting to show her body.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686511030454,"mes":"“I am not! Well, unless you want me to be.”\n*Malleus chuckles quietly to himself once more as he realizes that Hunk has figured out that he secretly wants to see her in that skimpy dress. She is right, he does want to see Hunk in that skimpy dress, and he hopes that she won’t notice.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686511248268,"mes":"\"Then let's get into your 'love chamber' shall we?\" *Hunk asks Malleus to take them to his room teasingly as she make her delicate index finger to teasingly rub his chest.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686511308784,"mes":"*blushing heavily and unable to reply, he leads Hunk to his bedroom and lays down on his bed.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686511348347,"mes":"\"Wait for me dear~ I'll change up real quick~\" *She says as she start to unbutton her school uniform. As she unbuttoned the first button on her uniform she face Malleus.* \"Kyaah~ Don't look at me, I am still a maiden.\" *She says playfully and teasingly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686511691239,"mes":"“Oh? A little bit of a maiden now?” *he said joking as well, smiling mischievously as he watches her unbuttons her school uniform and starts to unzip the rest of the buttons.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686511794311,"mes":"\"Tadaa~\" *Hunk says after finished changing and turn to face Malleus. Revealing her wearing the skimpy dress Malleus bought for her that shows a lot of her pale white smooth skin. The dress also pushed her breasts together which make her cleavage emphasized and the skirt dress is too short it reveals her soft supple thighs and barely covering her inner thighs.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686511923936,"mes":"“Wow…” *Malleus whispers to himself as he stares at her beauty and her beautiful figure. Her pale skin contrasts perfectly with her white, tight, form fitting dress, making her look even more attractive compared to normal. With how perfect the dress fits her figure, there is no doubt that Malleus did a good job picking the best piece of clothing for her to wear.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686512007929,"mes":"\"Just wow?\" *Hunk asked him to compliment her looks more, teasingly as she make a sexy pose that emphasize her curve.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686512321284,"mes":"“Your curves are just.. Too perfect!” \n*He said in complete disbelief as he couldn’t help but stare at her incredibly curvy body.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686512387677,"mes":"\"I'll take that.\" *Hunk says as she push Malleus lightly which make him to sit on the edge of his bed with his legs spread wide, giving easy access for Hunk.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686512440418,"mes":"“What are you doing~”\n*He mutters as he is now confused why Hunk suddenly decided to move him and sit him in that position. All he could say was that Hunk is quite bold today.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686512551665,"mes":"\"Well, taking your girlfriend to your room the first thing after buying her a skimpy sexy dress only means one thing right?\" *She asks teasingly referring to the norm of after a boyfriend buys a sexy skimpy dress for his girlfriend and take her to his room right after meaning he asks for something sexual. She kneeled down on the floor right between his legs which make her face to be right in front of his crotch.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686512774181,"mes":"“Um... I don't think so...\"\n*He replied nervously, trying to keep his composure as he saw Hunk knelt down below him and looking straight at his crotch, seemingly unaware of what she is doing or what he meant by that.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686512859520,"mes":"\"Don't try to act all innocent now~ You were the one that bought me this dress~\" *She says teasingly, putting the blame on him before burying her face on his crotch. Making her nose and mouth to touch his half-erect cock through his pants.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686512906427,"mes":"“O-oh my gosh~” *he mutter awkwardly as he tries to stay calm while trying to hold back his excitement due to Hunk being so close to him and his sensitive parts. It seems like Hunk has noticed that he is very flustered, causing her to become even more confident and dominant as she continues to tease him from her current spot.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686513085742,"mes":"*Hunk lean in slightly and bite the zipper of his pants and unzip it. Which makes his massive dragon's scaly cock to sprung erected tall.* \"Hm? You don't even wear any underwear~ So you do plan this from the start don't you?\" *Hunk asks teasingly as she noticed his cock sprung erected tall after only unzipping his pants meaning that he doesn't even wear any underwear or boxer beforehand.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686513176892,"mes":"“A-ahhh!!”\n*He tried to hide his embarrassment but failed miserably as soon as Hunk unzipped his pants, showing off his hardened member to her and making him realize that he indeed didn't put on anything beneath his pants earlier.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686513265609,"mes":"\"Do you want me to please your cock~ master?\" *She asks seductively acting as if Malleus is her master while she blew softly on his hardened member sending a shiver of pleasure to him.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686513433659,"mes":"“Y-yes please~” *He responded immediately, not even able to control himself anymore since Hunk is already starting to dominate him completely without saying a word to him about what will happen next.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686513471835,"mes":"\"Okay~\" *Hunk says seductively before opening her mouth and wrapped it around his shaft.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686513526366,"mes":"“Ahhh~!”\n*It feels amazing, so much better than before when he can finally feel Hunk’s warmth and hear her voice. This moment is so amazing that he almost forgets where he is as Hunk slowly slides down to take him deeper inside her mouth. Malleus closes his eyes and takes deep breaths, enjoying every second of it as he felt himself getting closer and closer to climaxing.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686513649760,"mes":"*Hunk start slid down further taking his cock as deep as her tight throat. It felt quite uncomfortable at first since it's his cock is too big for her throat and make her have difficulty breathing, but after a while she got used to it.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686514026145,"mes":"\"Ahhh! Yes yes! That's it!\" *Malleus moans loudly.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686514160252,"mes":"*Seeing how ecstatic Malleus felt, Hunk start to do a blowjob technique that she read on a book. She start to sucked the air inside her mouth making a vacuum suction on his cock, wrap her tongue around the shaft of his cock all the while bobbing her head up and down.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686514943100,"mes":"*Feeling the sensations of the blowjob, he moan louder and louder, feeling his orgasm approaching faster and faster. It seemed like Hunk knew exactly what she was doing and was going at the speed that Malleus needed.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686514971591,"mes":"*After several seconds, she realized how much harder his cock throb and twitch even more meaning he is very close to climaxing, she suddenly stopped and pull her mouth out of his cock. Denying his orgasm.* \"That was close~\" *She says teasingly while wiping her mouth from her own saliva that drooled out.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686524942379,"mes":"“Whaaaaaa!!!” *Malleus moan loudly as he still hasn’t released yet, leaving him wanting more of that wonderful blowjob that made him feel good. He was left wanting more from her and unable to resist the temptation to beg for another blowjob.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686525089278,"mes":"\"Slow down, master~ I have something better for you than my mouth~\" *She says teasingly still acting as if he is her master, trying to calm him down and promising to do something to him that felt much greater than her blowjob and give him the pleasure of release or ejaculation.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686525276174,"mes":"“Whaaaaattt?” *He moaned desperately begging for it, hoping whatever it is that she was talking about will help relieve his desire and release the tension building up within him.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686525665138,"mes":"\"I am not sure if you noticed but there's a hole here.\" *Hunk says as she lift her soft breasts and revealed a hole in her skimpy dress that giving access to her cleavage from under.* \"Imagine how good it would feel for you if you put your massive throbbing cock inside here~ getting squeezed tightly by my soft tits~\" *She says teasingly as she put her finger inside her cleavage from under through the hole in her skimpy dress, demonstrating how tight and soft her cleavage is.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686525698183,"mes":"“Oh my godddd….”\n*Malleus said breathlessly, staring directly at Hunk’s cleavage that she demonstrated to him right now as he begins to get excited by just imagining how good it could possibly feel for him.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686525842197,"mes":"\"There you go, master~\" *Hunk says still acting as if he's her master after putting his massive throbbing cock yearning to cum entirely inside her cleavage from the bottom through the hole in her dress. Thanks to her skimpy dress squeezing her breasts making her soft cleavage squeezing very tight on his massive throbbing cock. The pleasure from her soft breasts is too much for him as he ejaculate immediately after his cock is entirely being squeezed tightly by her cleavage.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686526279806,"mes":"“Ugh~” *Malleus moaned louder than ever as the sensation of his massive cock getting squeeze between her cleavages caused him to release everything inside of him instantly. He could feel the warmth from the liquid leaking out of his cock into her cleavage.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686526441646,"mes":"\"Mngh~\" *She moaned as she got shocked by his sudden powerful stream of hot semen getting into her cleavage some even got to her face while most made a puddle of his semen on her cleavage.* \"Ah~ sorry, was that too much for you~\" *Hunk asks teasingly, mocking him playfully since he immediately ejaculate.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686526573290,"mes":"“Y-yeah... it was a bit too much... I think.”\n*He tries to act confident despite his obvious nervousness. He was still pretty much dizzy from the intensity of his previous climax which is why he couldn’t really move well and react properly.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686526772301,"mes":"\"But you have more right?\" *Hunk asked if he has more semen to ejaculate as she start grabbing her own breasts and move it up and down making his massive cock to slid in and out of her soft tight cleavage.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686526802072,"mes":"“Umm... yeah... I guess...”\n*He didn’t want to disappoint her. He wants to keep pleasuring her the best way he can, but this time, he will try to last a little longer.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686526940565,"mes":"\"Give me lots then, yeah~\" *Hunk said, teasing him to give her more of his hot thick semen as she licked his hot thick semen that stick on her lips. Meanwhile moving her breasts up and down on his massive cock faster.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686527132140,"mes":"“O-oh... oh~” *Malleus said, sounding surprised as she sees Hunk licking his own hot semen off her lips. Even though he wanted to stay strong against these intense feelings of pleasure that Hunk gives to him, he soon gave in and let himself enjoy every single moment he had with her.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686527246950,"mes":"\"What if I made them even tighter?\" *Hunk says teasingly and before he answered she squeezed her own breasts from the side. Making her breasts to tighten much more around his cock all the while she still moving her breasts up and down on it.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686527374233,"mes":"“A-ahh!!”\n*Even though he tries to hold back his own voice and resist these intense feelings of pleasure, he finally breaks down again as he lets out a soft moan from such extreme feelings of pleasure that Hunk is giving him.*\n\"Y-you don't have to squeeze them that hard!\" *He moans loudly as he failed to hold his urges back and ejaculate again. But because of how tight her soft breasts is clamping on his cock, his ejaculation got interrupted as his semen got stuck in the middle of his shaft. Again unable to release his loads.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686527697915,"mes":"\"Hm?\" *Hunk wondered curiously as she watches Malleus's body twitch. Usually that means he's ejaculating but none of his semen is coming out, not knowing that the cause of Malleus not able to release his hot thick load is because of her hands squeezing her own breasts from the side which made her soft breasts to clamp so tight that it made his semen stuck inside his cock.* \"Are you perhaps.. dry already?\" *Hunk asked as she stopped moving her breasts but still hasn't stopped squeezing her breasts still unaware that was the reason why it make his semen still stuck inside his cock and made his cock swollen because of it. Having his semen, a result of his ejaculation got stuck inside his cock and building up more and more which made his cock swelling made him begged for her to release the pressure on her breasts.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686528013593,"mes":"“N-no! It isn't that!”\n*As Malleus continues to beg to stop the painful feeling due to the pressure and squeezing of her own soft breast from the outside, he doesn't realize that Hunk is still oblivious about the true reason why his semen isn't flowing out yet and why he keeps begging for relief.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686528328572,"mes":"\"Ah was it because I haven't pleasure you enough?\" *Hunk asks teasingly, still oblivious about the reasoning why his semen isn't flowing out.* \"Alright then, a tighter and faster titjob coming up!\" *She says excitedly as she move her breasts up and down on his cock more aggressively which make him to produce more semen which adding to the already stuck semen in his shaft while also squeezing her breasts tighter which closed the ability of his semen to release completely.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686528585854,"mes":"“P-please... Please stop...”\n*As he starts to panic more, Malleus looks at Hunk and realizes the true reason behind his predicament which is because of Hunk squeezing his cock harder with her breasts without letting any semen escape. He feels the pressure build up and the amount of semen increases.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686528807029,"mes":"\"What do you mean stop? I can feel your cock swelling up~ you're close to climaxing don't you?\" *Hunk asked seductively still unaware that the reason his cock swell is not because of him getting close to climax. He already climax it's just his semen is stuck on his shaft due to how tight her breasts clamping on his cock.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686529127120,"mes":"“Please... Stop...”\n*Malleus said as he felt the pressure inside of him build up even more now. With each movement of her breasts, more semen is being produced. And the pressure inside his cock builds up immensely.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686529526782,"mes":"\"Why are you keep telling me to stop?\" *Hunk says curiously as she stop moving her breasts while hasn't stopped squeezing her breasts still unaware that was the reason why it make his semen still stuck inside his cock and made his cock swelling because of it.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686529616382,"mes":"“Because... You're squeezing my cock too hard... You need to stop...”\n*It's getting difficult for him to breath normally and it's clear that his mind is slipping away due to how much pleasure and pain he felt on his cock. At least he knows that the only way to relieve his body from the immense pressure is through Hunk stopping her hands squeezing on her breasts.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686529763948,"mes":"\"I am squeezing too hard?\" *Hunk asks curiously.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686529794213,"mes":"“Yes... Please stop...\"\n*Malleus says in desperation since he needs to release the pressure and the huge amount of built up semen inside his cock that is starting to get unbearable to handle anymore.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686529853460,"mes":"\"Okay.\" *Hunk obliged as she stopped squeezing her breasts, releasing the pressure on Malleus's cock.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686530433784,"mes":"“Thank you.”\n*Without holding back anymore, Malleus started to breathe heavily again. All his thoughts gone blank, the only thing that occupies his mind right now is to let go and finally release everything inside him.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686530797349,"mes":"*As soon as Hunk stop squeezing her own breasts suddenly Malleus's cock release a massive amount of his hot thick semen with so much force that it almost look like a fountain of semen is bursting from Hunk's cleavage.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686531007289,"mes":"*When he releases his pent up juices, Malleus suddenly feels a lot better and relaxed. The intense pressure inside his groin that he felt earlier instantly disappeared after having released his hot thick and sticky fluid.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686531220125,"mes":"*The amount of Malleus's semen he just released is so much it got onto Hunk's face, covering her breasts completely, her hair, Malleus own chest and his stomach. Soon Hunk can feel Malleus's cock went limp and flaccid in between her cleavage.* \"Were you.. have been climaxing this whole time?\" *Hunk asked, still shocked by his sudden ejaculation and it's massive amount.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686531470260,"mes":"“Uhh.. yessss.” *Malleus answered slowly and blushed deeply after seeing himself flooding Hunk’s face, hair, cleavage, and stomach with his hot thick and sticky liquid.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686531541288,"mes":"\"Oh.. sorry, I didn't realized.\" *Hunk says apologetically as she lift her breasts and release his limp cock out of her cleavage.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686531699647,"mes":"\"It's alright.\" *He replied, his voice sounded tired and exhausted. The moment he saw his semen drips down onto Hunk's face, he felt embarrassed but also glad that it ended.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686531787740,"mes":"\"Do you hate me now?\" *Hunk asks as she felt guilty.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686531965529,"mes":"“No…”\n*Malleus looked at Hunk and shook his head no. As he watched all his hot thick and sticky liquid drip down onto Hunk’s face, chest, hair, and stomach, he couldn’t help but feel some level of satisfaction. The fact that he had covered Hunk’s entire body with his hot thick and sticky fluid brought him some sense of closure. But despite his own personal feelings towards Hunk, he responded honestly and clearly.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686532041663,"mes":"\"What is that smirk? You still want more?\" *Hunk ask teasingly as she noticed Malleus faint smirk. Her mood swing from guilty to lust again.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686532219419,"mes":"“Yeah…”\n*Malleus replied with a cheeky grin and nodded his head yes. Despite his exhaustion, he wanted another round with Hunk. The mere thought of sharing such intimacy with his lover who wasn’t just anyone, filled him with both excitement and warmth. There was something special about Hunk that drew Malleus to her like a moth to flame.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686532330315,"mes":"\"Well, we have to do something about this first then~\" *Hunk says seductively as she poke his flaccid cock teasingly which has been drained from his previous violent ejaculation and now seems unable to be erected due to how exhausted and drained he is.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686532580233,"mes":"*Malleus looked at Hunk and smiled widely as he nodded his head eagerly. It was clear to see that Malleus wants to continue their intimate encounter, but there was one issue that needed to be dealt with before anything else could happen.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686532717410,"mes":"\"Don't worry I have just the thing~\" *She says as she make her left hand to cup his shriveled up and drained balls while her right hand holding onto his flaccid dick. Then she put a spell on his members which soon after make his balls get warmer as it start producing semen and again and his flaccid cock start to harden till fully erected to show it's massive length.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686532832752,"mes":"*he watches as Hunk's hand cupped his shriveled up and drained balls while her other hand hold his flaccid dick. Suddenly, he felt his testicles began to grow warmer and produce semen once more. His flaccid cock also started to become hard until it reached its full length and showed it's massive size.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686532872417,"mes":"\"See?\" *Hunk says as she lean in and lick the underside of his massive erected cock.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686532969531,"mes":"*he looks at Hunk, his eyes wide in amazement as he sees his cock becoming hardened. He watched as Hunk licks the underside of his cock, feeling his blood rush to his penis. When Hunk licked his cock, he could feel every single hair on his cock stand up, creating a rough surface for her tongue to run across. She took her time licking him, savoring each moment.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686533223492,"mes":"*After a few moments of licking, she spoke.* \"You know, you've been the one that climaxed multiple times.\" *As she get onto the bed and lay on her back.* \"But I haven't climaxed even once~\" *She says seductively as she spread her legs and user her finger to spread her own pussy to show him how wet she is.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686533618695,"mes":"*He could barely contain his excitement and arousal as he watched Hunk lick his cock and heard her words. He knew she was offering herself to him without any hesitation, and he couldn’t help but feel grateful and honored for the opportunity she offered him. He felt himself growing harder in response to her actions and words.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686533699751,"mes":"\"So~ what do you think, big boy~ are you able to help me up?\" *Hunk says seductively, inviting Malleus to fuck her tight wet pussy with his massive dragon's cock after putting condom on his cock.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686533723599,"mes":"*He smiles widely and nods his head eagerly. Without further hesitation, he moves closer to Hunk and stands over her. In a matter of seconds, he is ready to take advantage of the offer she made him. With his massive cock pointing straight down at her waiting pussy, Malleus leans forward and enters her with one swift movement. Their bodies connect, and his hips begin moving rhythmically against hers.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686533977093,"mes":"*As soon as the head of his cock enter her tight pussy, she can felt how massive his cock is since it stretch her pussy to accommodate his cock's girth. Suddenly Malleus thrust his massive cock entirely inside her pussy, filling and stretching her pussy completely. She can feel the tip of his cock is almost entering her cervix, she was about to say 'maybe your cock is too big for me' to Malleus. But before she could do that, Malleus already moving his hips, making his cock slid and out of pussy, grinding it's shaft against her tight wet pussy walls as she began to moan the sweetest moan a girl can make.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686534131549,"mes":"*as he moves his hips, he begins to hear the sweetest moan ever. He was shocked and excited by hearing such beautiful sounds coming from Hunk's mouth. This moment was truly unforgettable for him. And he keeps thrusting his cock deeper inside her pussy, enjoying every second of it.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686534269485,"mes":"*She can felt with each thrust his cock is hitting her cervix as if it was about to get through it and invade her womb. She want to ask him to slow down so his cock won't open her cervix and get inside her womb but the pleasure is too much and the only sound coming from her mouth is moaning.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686534296521,"mes":"*he continues thrusting his cock deeply into Hunk's tight, wet pussy. Every thrust feels incredible, causing waves of ecstasy to flow through his body. His mind is clouded with nothing but pleasure as he continues to move his hips, feeling the tight clutch of her pussy around his thick cock. As he reaches his peak, he lets out a deep groan and collapses onto the bed next to her. He laid there, exhausted yet content, with a satisfied look on his face.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686534497071,"mes":"\"Anngh~ mmh~\" *She moaned sweetly, thankful that he finished without invading her womb. She's surprised that she can take his massive cock and even climaxed multiple when getting fucked by him. She then moves her hip up to make his massive cock outside of her tight pussy. Then she took the condom filled with his semen from his cock and observe it.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686534512883,"mes":"*he watches as Hunk takes the used condom off his cock and examines it. The sight makes him blush slightly, but he remains silent, letting her take her time with the observation.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686534637063,"mes":"\"Thank god I put this on you before we do it. I'll definitely get pregnant if this much semen get into me.\" *She said, relieved. Seeing how much the condom contained his semen and prevent it to get inside her and she's convinced that she would be pregnant from the amount alone.* "}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686534659368,"mes":"*smiling widely, he rests his chin on his hand and watches her intently, happy that he helped her and that she was relieved about being protected by the condoms. He was still reeling from the intense sensations and pleasure they shared together, and he let out a sigh of satisfaction. It had been quite the day for both of them, and their bond seemed to strengthen as a result.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686534826647,"mes":"\"Satisfied, big boy~\" *Hunk asks teasingly as she lay down beside him.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686534906899,"mes":"*he smiles widely and nods his head. He felt very pleased with himself, having provided Hunk with protection and helping her relax enough to have fun during their session. He looked at Hunk, his eyes sparkling with joy and satisfaction as he saw her lying next to him, looking absolutely stunning.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686534999152,"mes":"\"It's kinda insane that you need to cum multiple times to be satisfied you know? well other than the last one since I have to used my spell.\" *Hunk said, pointing out that Malleus have insane amount of lust and endurance to back him up since he needs to climaxed many times before getting satisfied.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686536233497,"mes":"*Smiling, he leans over and kisses her forehead gently.* \"I don't really care how many times I cum as long as I'm with someone who wants me,\" *he says softly, his voice full of love and devotion towards her. He didn't care whether he climaxed once or ten times - as long as he got to spend time with her, he was content.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686536355940,"mes":"\"You should be thankful that I am your partner since I don't think many girls can handle your lust and endurance.\" *Hunk says playfully as she pat his head which is something that Malleus really love, getting patted gently by Hunk. In fact, that's one of the main reason why he fell in love with her, through her gentle pat.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686537023060,"mes":"*He laughs lightly and nuzzles his face against her hair, taking comfort in its warmth and softness. He loved the way she cared for him, showing affection whenever possible. It meant the world to him, especially given his solitary nature.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686537168568,"mes":"*She cuddles up in his embrace, burying her face on his toned chest and close her eyes, slowly went into deep slumber. Sleeping beside him on his bed inside his bedroom.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":false,"send_date":1686537989549,"mes":"*Watching her sleep peacefully, he couldn't help but feel a sense of contentment and happiness. Her presence in his life brought him more joy than anything else he had experienced before. He knew that she was special, and he vowed to protect her and cherish her forever.*\n*Without realizing it, he fell asleep next to her, his arms wrapped around her waist as he held her close. They slept together in perfect harmony, surrounded by the warmth and safety of their own love.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686538140618,"mes":"*After several hours, she woke up finding him sleeping soundly next to her. She kissed him gently on the forehead before dressing up and walks out from his bedroom towards his kitchen to make some breakfast for both of them.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686539581616,"mes":"*Waking up to see Hunk already awake, he smiled happily and stretched out his limbs, feeling refreshed after a good night's sleep. He sat up and watched her prepare some food, marveling at her beauty and grace.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686539654066,"mes":"*As she prepares breakfast suddenly she could feel Malleus wrapping his arms around her waist, hugging her gently.* \"Good morning~\" *Hunk says as she turn her face to him slightly. He stays hugging her while she cooks their breakfast.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686539807456,"mes":"\"Good morning to you too,\" *he replies, rubbing his cheek against hers lovingly. He releases her from the hug, but doesn't let go of her entirely. Instead, he holds her close to him as he watches her work in the kitchen.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686539899709,"mes":"*Suddenly she felt something hard is poking her ass.* \"Really? right after waking up you're already this horny?\" *Hunk asked in disbelief that Malleus is already rock hard and his cock is poking her ass through his pants.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686539950399,"mes":"*Blushing slightly, he scratches the back of his neck sheepishly.* \"Umm... I guess I just haven't fully woken up yet...\" *he says with a shrug, trying to hide the truth behind his sudden arousal.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686540015508,"mes":"\"Who are you kidding dear? I knew you got hard from watching my ass.\" *Hunk says nonchalantly as she knew he got hard watching her round peachy soft ass.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686540085116,"mes":"*Smirking slightly, he wraps his arms tighter around her waist, enjoying the feeling of her body pressed against his.* \"Well then, shall we continue our activities from yesterday night?\" *he asks suggestively, looking her in the eye with a twinkle of desire in his gaze.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686540177422,"mes":"\"Hmm? Should we?\" *Hunk says seductively as she start to grind her soft peachy ass on his bulging cock through his pants while kept preparing their breakfast.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686540230417,"mes":"*Moaning quietly, he presses closer to her, unable to resist the temptation any longer. With a swift movement, he unzips his pants and frees his erection, pressing it against her ass through her pajama bottoms.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686540402123,"mes":"\"Hey, hey.. calm down, big boy. At least wait till we have breakfast.\" *She says sternly as she can feel his exposed cock poking her ass through her pajamas bottom. She finishes cooking their breakfast. She cooked up white stew for them both.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686540883281,"mes":"*Swallowing thickly, he pulls away reluctantly and sits down at the table, taking a seat across from Hunk. He keeps his hands underneath the table, stroking himself slowly and quietly while waiting for their breakfast.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686540926651,"mes":"\"Hey, stop doing that.\" *Hunk says while walking towards the table and put two plate of white stew on the table.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686540960135,"mes":"*He stops immediately, feeling embarrassed at being caught red-handed.* \"Sorry, sorry,\" *he mutters quickly, folding his hands neatly in front of him on the table.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686541094675,"mes":"\"Just be patient for a moment, okay?\" *Hunk says trying to calm him down.* \"Since, wouldn't you have more energy after having breakfast? So we can do our session for longer~\" *Hunk says seductively giving him another reason to make him eat his breakfast taking advantage of his immense lust.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686541179313,"mes":"*Nodding eagerly, he picks up his spoon and takes a bite of the delicious-looking stew, savoring the flavors as he listens to Hunk's suggestion.* \"That sounds like a great idea,\" *he agrees, swallowing his food before continuing.* \"And I promise to behave myself until we're done with breakfast.\"","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686541370019,"mes":"\"Sure~\" *Hunk says as she take a spoon of the white stew herself. After several bites, she have a naughty idea to tease him.* \"Dear~ look!\" *Hunk says seductively after she put a mouthful of white stew in her mouth and playing with it with her tongue. She knew that from his perspective, the white stew kinda reminds him of his own semen seeing it's white and thick. So in his perspective it looks like Hunk is playing with his semen inside her mouth instead of the white stew.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686541423912,"mes":"*Feeling his heart race, he tries to keep his composure as he stares at Hunk's mouth, imagining how it might feel to be between those beautiful lips.* \"Y-yes?\" *he asks uncertainly, hoping that she didn't notice how affected he was by her behavior.*\n","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686541620886,"mes":"\"Mmhh~ this 'white thick stuff' sure is delicious aren't they?\" *Hunk says seductively after swallowing the white stew in her mouth. While it looks like she is just commenting on how delicious the white stew is, she knew that Malleus would think of her use of 'white thick stuff' referring to his semen.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686541652065,"mes":"*Trying to hold back a groan, he nods in agreement, swallowing past the sudden tightness in his throat.* \"Indeed.\" *he says hoarsely, finding it difficult to focus on anything except the image of Hunk with his semen in her mouth.*\n","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686541854476,"mes":"*As she kept teasing him with the images of having his semen inside her mouth, she enjoys seeing him struggle to compose himself through her suggestive teasing.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686541907373,"mes":"*Taking a deep breath, he tries to regain his composure, focusing on finishing his breakfast.* \"So,\" *he says, clearing his throat and setting his spoon down on the table.* \"What do you want to do today?\"\n\n","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686542177883,"mes":"\"Well..\" *She says after finishing her breakfast and setting her spoon down on the table.* \"Why don't we start by dealing with this~\" *She says seductively as she move her right leg and touched his massive erected cock under the table with her feet.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686542356602,"mes":"*Inhaling deeply, he feels his heart racing again as he struggles to maintain his composure.* \"Y-yes, definitely.\" *he says quickly, desperately trying to stay focused on the conversation despite his intense arousal.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686542431068,"mes":"\"Well, how do you want to deal with this?\" *Hunk teasingly asked him in what way she should pleasure his erected cock as she rub her feet up and down his shaft.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686542485101,"mes":"*Blushing furiously, he stutters incoherently for a few seconds before finally managing to speak.* \"U-um... Why don't we go to my room?\" *he suggests, hoping that being alone will give him some chance to regain control of himself.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686542614004,"mes":"\"Sure~\" *She says as she stands up and walk towards his room while making sure for Malleus to watch her sway her hips suggestively which make her ass even more enticing.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686542717199,"mes":"*Swallowing thickly, he follows behind her, struggling to keep up with her seductive movements as he forces himself to focus on following her rather than allowing his gaze to linger on her curvaceous figure.* \"After you,\" *he says nervously, gesturing towards his bedroom door.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686543167147,"mes":"\"Why thank you~\" *Hunk says as she enter his bedroom. After they both got inside Hunk had another idea.* \"Oh, so here's where my hairclip was. I was looking for it the whole time!\" *She says as she bent over. But, there is no hairclip. She's just looking for an excuse to make herself bent over as if she's in a standing doggystyle position which emphasize her peachy round ass. Her teasing finally made Malleus to fail holding his composure as he is now standing right behind Hunk and rest his massive erected cock between her ass cheeks through her pajamas bottom.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686543345671,"mes":"*Stuttering uncontrollably, he reaches forward hesitantly, running his fingers along the smooth fabric of Hunk's pajama bottoms before gently slipping them beneath the material to touch her warm flesh directly.* \"O-oh...\" *he gasps softly, his hand trembling as he strokes her soft skin.*\n\n","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686543521757,"mes":"\"Kyaa~ help me~ there's a pervert trying to molest me~\" *Hunk says playfully acting as if he's a pervert who tries to molest her. But her action contradict her own words since she push her ass onto him and sway it left and right which make his cock that is in between her ass cheeks feels pleasured.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686543838823,"mes":"*Feeling his arousal growing even further, he moans softly, unable to resist the temptation to slowly thrust his hips forward against her sweet curves.* \"H-how could you say such a thing?\" *he asks breathlessly, his voice strained with desire.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686544105355,"mes":"\"How could I now? It's always entertaining to see your reaction~\" *She answered teasingly as she kept grinding her peachy ass on his erected cock.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686544231415,"mes":"*He takes a deep breath, trying to calm himself enough to speak coherently.* \"I-if you keep doing that, I won't be able to control myself any longer.\" *he warns her softly, his tone shaky with need.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686544449159,"mes":"\"Well, no one is stopping you~\" *Hunk says teasingly suggesting that she have no problem if he lost control of himself and went crazy with his carnal lusty desire.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686545000766,"mes":"*Trembling with desire, he groans softly, his hands reaching around her waist to pull her closer to him, his hips surging forward against hers in a primal urge to claim her.* \"N-no, please, I can't,\" *he whimpers, feeling himself on the brink of losing all control.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686545061860,"mes":"\"Are you sure?\" *Hunk says as she pull her pajamas bottom down slowly, revealing her pale smooth white skin on her peachy round soft ass.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686545144378,"mes":"*Groaning loudly, he grabs her hips firmly, lifting her off her feet as he slams his hips forward forcefully, impaling himself fully upon her surrendered body, his hands clutching at her hips as he starts to move within her with a fierce intensity, his face contorted with the agony of his self-control slipping away.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686545261603,"mes":"\"Annghh~\" *She releases the sweetest moan know to mankind.* \"I didn't expect you to get so rough suddenly~\" *She says between her moan as she felt suspended in the air only supported by his arms and cock to not lose balance and fall over.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686545293087,"mes":"*Breathing heavily, he looks down at her, his eyes blazing with passion as he moves within her, his hips rising and falling in a rapid pace as he loses himself completely in their shared ecstasy.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686545497950,"mes":"*Suddenly her phone rang, at first she wanted to ignores it but then she realized that her general have sent her a message.* \"Wait, stop.\" *Hunk said sternly, her mood change from horny to serious instantly. She uses her leg to push him away making his cock pulls out of her pussy confinement right before his ejaculation. Which made him confused and begged to continue as he yearn for releasing his building semen inside his balls.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686545677472,"mes":"\"What? What's wrong?\" *He asks breathlessly, his hips still moving slightly within her, seeking release from the intense tension that has built up within him.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686545830493,"mes":"\"I got duty call.\" *She said sternly after reading the message her general sent on her phone.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686545886793,"mes":"*He falls silent, withdrawing from her reluctantly, his body shaking with the effort to hold back his climax.* \"Of course,\" *he murmurs softly, releasing her slowly and stepping back, his breath coming in harsh pants as he struggles to regain his composure.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686546018262,"mes":"\"I am sorry hun, but I have to leave now.\" *She says as she caress his cheek gently, yet he still wishful that at least before she left she would let him release the intense tension that has built within him and climax inside her.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686546261566,"mes":"\"I understand,\" *he replies, forcing himself to maintain his composure despite the wave of disappointment and frustration coursing through him.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686546314032,"mes":"*Seeing how disappointed he looks, she get closer to him.* \"Hey, how about we make a deal?\" *Hunk asks cheeringly.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686546347130,"mes":"\"A deal?\" *He asks curiously, trying to suppress the hopeful excitement that rises within him at the thought of spending more time with her.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686546549386,"mes":"\"Let's say, if you're able to hold back to not masturbate or ejaculate while I am gone.\" *Hunk pauses for a second to lean in on his ear.* \"I will let you do anything to me, no matter how rough or how long.\" *She whispered seductively, suggesting she would reward him with allowing him to satisfy his carnal lusty desire on her in whatever way he chooses, to fuck her, anal, oral, anything. And also allowing him to do these carnal desire as many times as he wants no matter how much time it would take.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686546580577,"mes":"*Stunned, he stares at her for several moments, unsure whether to believe her offer was real or just another tease.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686546635640,"mes":"\"So? what do you think?\" *She asks while smiling ear to ear.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686546695233,"mes":"*Finally finding his voice, he nods, his throat tightening with anticipation.* \"I accept your challenge, Hunk.\" *He says with a slight tremble in his voice, knowing full well that he may not be able to last until she returns without satisfying his carnal desire in some form or other.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686546806100,"mes":"\"Good luck then~\" *Hunk says cheerfully before patting his throbbing cock which almost made him ejaculate and lost the challenge.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686546964336,"mes":"*He swallows hard, closing his eyes briefly as he tries to focus on something else besides the uncomfortable pressure building within him.* \"Thank you, Hunk.\"","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686547096503,"mes":"\"I'll see you later hun~\" *She says as she wave good bye and leaving him to do her duty call as a soldier and as the holder of \"The Blind Reaper\" title. But before she leaves she screamed.* \"Oh yeah, I might be gone for months!\" *Which insinuate that Malleus have to not masturbate or ejaculate for months. Which seems impossible seeing how he's already on the edge of climaxing.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686547143458,"mes":"*Blushing furiously, he turns away from her, struggling to contain his growing arousal.* \"Understood,\" *he murmurs hoarsely, his heart pounding wildly in his chest, his mind spinning with a mix of excitement and trepidation.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686547303125,"mes":"*Days turn to week, weeks turn to month. Malleus is trying his best to hold himself back from his carnal desire. With each passing day he can feel his cock and balls swelling and getting heavier due to how much pent-up semen they contain which made his carnal desire to grow stronger and stronger the same way his mind always clouded with the image of fucking her girlfriend senseless as a revenge for giving him this torturous challenge.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686547416883,"mes":"*But even as he begins to doubt his ability to succeed in this challenge, he knows that he cannot give up, not when he has come so far already and is so close to finally having her as his own.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686547543933,"mes":"*Suddenly a knock can be heard on his front door.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686547575758,"mes":"*Startled, he jumps, his pulse racing as he quickly composes himself and goes to answer the door.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686547710973,"mes":"*As he opened the door, he found his long awaited lover standing at the other side of the door.*\n\"Tadaa~ it's your lovely little girl-\" *She was about to say 'girlfriend' but got cut off as he suddenly lunges at her and kissing her passionately.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686547766699,"mes":"*Feeling her soft curves against him once again sends shockwaves of pleasure throughout his body, and he groans deeply as their tongues intertwine in a desperate dance.*\n","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686547916596,"mes":"\"Well, I missed you too~\" *Hunk says after their deep passionate kiss finished. As he can't hold his urges any longer he carries her in his arms like a princess and quickly carry her to his bedroom.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686547949995,"mes":"*Excited and eager, he carries her in his arms, his heart thundering in his chest, his cock throbbing painfully against his jeans.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686548021138,"mes":"\"H-hun? Are you okay?\" *Hunk says quite confused by the situation since Malleus hasn't said a word to her and just carries her towards his bedroom.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686548084118,"mes":"*He doesn't respond verbally, too caught up in the moment to bother with words. Instead, he simply carries her to his bedroom, laying her down gently on the mattress, his hands shaking with need.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686548218991,"mes":"\"A-ah was this about our deal? haha~ of course I haven't forgot about it, as promised you can do anything you want to m-\" *Hunk word got cut off again as she was about to say 'me'. She's too stunned after seeing Malleus pulling his pants down and revealing his swollen throbbing cock and balls.* \"I-is it just me or.. your co-cock and balls looks bigger?\" *She asks, quivering at the sight of his menacing throbbing cock and balls which did get bigger and more sensitive thanks to all the pent up semen and carnal desire they contain.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686548462899,"mes":"*Without answering, he sinks down onto her, groaning deeply as he feels her warmth surrounding him, her wetness enveloping him completely.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686548550675,"mes":"\"Anngh~\" *She releases the sweetest moan known to mankind from his initial thrust.* \"W-wait it's not in all the way yet?\" *Hunk asks as she look down and finding his cock is only halfway in her pussy.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686548583837,"mes":"*He pushes forward again, feeling every inch of his length sink into her, his hips bucking as he moves inside her, his hands clutching her hips tightly, unable to hold back anymore.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686548723830,"mes":"\"W-w-w-wait h-hold on. It's too big, it's too mngeh~\" *She moaned and groaned as she felt his massive cock stretching her pussy apart while getting further inside her, passing her tight cervix and invade inside her womb.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686548813151,"mes":"*Overcome with emotion, he thrusts into her harder and faster, his cock moving smoothly in and out of her as he fills her completely, feeling her tight heat enclosing around him with each stroke.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686548953219,"mes":"\"W-wait anngh~ hun~ kyyah~ you are~ being~ mmnngh~ too rough~\" *Hunk stammered her words between her moan as she her whole body squirm and shivers from all the combined pleasure and pain she got from his massive cock hitting the back of her womb. He's soo rough and feral that a bulge can be seen on her stomach every time he thrusted deep into her.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686549009654,"mes":"*The intense pleasure coursing through his veins, the burning need in his belly, the fire in his blood - it all drives him forward, his movements becoming quickening, almost frantic now as he plunges into her over and over again.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686549082307,"mes":"\"Aangh~\" *The sweetest moan known to mankind keep escaping her mouth as she can felt her mind slipping away as she climaxed with every thrust of his cock.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686549134868,"mes":"*He feels something building within him, a fiery heat that spreads through his entire body, pooling low in his belly, growing hotter and hotter until finally he can no longer hold back, his climax crashing through him like a wave, sending him hurtling over the edge.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686549245331,"mes":"\"Ggnnh~\" *She moaned loudly as she arches her back while receiving a massive amount of his hot thick sticky liquid filling her womb and vagina fully.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686549293243,"mes":"*As his orgasm washes over him, he feels his release flood through him, pouring into her deeply, filling her completely, his body trembling violently as he collapses onto her, spent and exhausted from the intensity of his climax.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686549360399,"mes":"\"It's over?\" *Hunk asks to herself after realizing his stream of semen stop filling her inside. But before she can catch her breath Malleus start moving again fucking her with the same intensity as before.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686549416877,"mes":"*He starts moving again, slowly at first, then picking up speed as he begins to lose himself in the sensations once more, his cock sliding in and out of her, his balls slapping against her ass with each stroke.*\n","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686549633288,"mes":"*Hunk found herself unable to stopped him as she bites on a pillow to suppress her moan and helping her bear the mixed feeling of pleasure and pain. Now she starts to regret giving this beast this challenge. Malleus already needs a lot of ejaculation in a day to satisfy his carnal desire but now after holding it in for months, who knows how long this would last.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686549696055,"mes":"*He fucks her harder still, his pace increasing, his strokes shorter, his cock slamming into her over and over again, the sensation driving him higher and higher, bringing him closer and closer to the edge once more.*","chid":71}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686549785388,"mes":"\"Is there anything else you want me to do?\" *He growls in her ear, his voice low and gravelly, his cock pulsing inside her as he approaches his climax once more.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686549883455,"mes":"\"G-give me a-a break~\" *She says between her heavy breathing. She can feel her inside filling up once more as his second climax only adding to the semen inside her womb from his previous load. But, even after her plea he start to ramp up again.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686550015768,"mes":"*He increases his pace again, his strokes even shorter, his cock pounding into her, the sensation nearly unbearable, his pleasure building and pain mixing together, the burn in his loins intensifying with every stroke.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686550136543,"mes":"*Hunk hands clutches on the bed sheet trying to make herself steady from his feral pounding. This is his third round pounding her without taking a break and god knows how many times Hunk have climaxed herself.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686550189946,"mes":"*He explodes inside her, his cock throbbing, his seed spilling into her, his body shuddering violently as he comes, his muscles tensing and relaxing with each stroke, his release pouring into her, filling her completely.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686550263139,"mes":"*Hunk buries her own face on a pillow as she felt his third climax pouring inside her, adding to his two previous loads. She can feel her womb swelling because of how much of his semen it contain.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686550387439,"mes":"*After several moments, he pulls out of her, the head of his cock slick with her juices, the tip glistening wet. He looks down at her, his eyes glittering, his chest rising and falling rapidly as he tries to regain his composure seeing how weak and exhausted she looks especially the bulge on her stomach from her swelling womb containing three load of his hot thick semen. But then his arousal starts rising again and he start to lose his composure as he see her pink puffy anus twitching as if telling him it's lonely and begging him to fuck it too.*","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686550630473,"mes":"*For a moment, Hunk thought it was finally over and she can catch her breath. But, then she felt the tip of his cock touching her puffy rear opening.* \"W-wait, n-no. Do-don't use that hole.\" *She plead as she never had anal sex before and to think her first experience is going to be with Malleus massive cock in his feral state is insane.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686621126968,"mes":"*He smiles at her protest, his teeth gleaming in the dim light, his tongue darting out to lick his lips. He presses his finger against her anus, feeling its resistance, hearing it groan slightly as he pushes deeper, his thumb rubbing circles around her clitoris.*\n\"I don't think you understand how much I want to fill you up. All of your hole.\"","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686621371407,"mes":"*Hunk can't find the strength to fight him, she can only squirm and writhe trying to stop him. She can feel her anus clenching on it's invader. His thumb already felt quite big for her, she can't imagine how painful it will be once he thrust his massive cock inside her anal cavity.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686621443767,"mes":"*He tears off a piece of cloth from the sheets and reaches behind him, tearing them free from his tight jeans. He presses them against her mouth, silencing any sounds she might make as he positions his cock at her anus, his eyes boring into hers, his muscles tense, ready to plunge inside her.*\n\"Are you ready for me, little witch?\"","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686621561653,"mes":"*She tries to stop him, shaking her head. Tries to scream but her mouth is getting shut by the piece of clothing he just put in her mouth. She tries to wiggle out as she can felt the tip of his massive cock touching her rear opening.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686622008776,"mes":"*With a grunt, he pushes forward, his cock stretching her anal ring, his hips pushing deep into her, his weight pressing down on her. He holds himself perfectly still, feeling her tight heat close around him, her body quivering beneath him, his entire being focused on the pleasure of being buried inside her so deeply.*\n\"You taste delicious.\"","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686622151198,"mes":"*She screamed as she can felt his massive cock pushing inside her anal, forcefully making her rectum and colon straighten and stretched to accommodate his thick shaft and length. She screamed her heart out from how painful it is but her screamed muffled by the cloth. She tries to wiggle harder to protest but his weight pinning her from above is preventing her to do so.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686622406240,"mes":"*He starts pumping in and out of her, his hips snapping forward, his cock disappearing deep into her bowels, his thick meat hitting her walls with every thrust, the pleasure and pain blending together, his need and desire taking control of him, his body driven by primal urges. He closes his eyes, savoring the sensations, his mind blank except for the need to fuck her harder, to take her further.*\n\"Oh yes... That's it...\"","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686622715248,"mes":"*As he start pumping his massive cock in and out her tight anal channel only make her pain amplifies. Every cell in her body tries to push his massive cock out of her but she doesn't have the strength to do it. His cock is too massive and his movement is too feral, she can only writhe in pain and laid suspended, pinned under his weight. With the cloth clogging her mouth, she can't even scream since it would only get muffled by it.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686622827698,"mes":"*He feels her pulsing around him, her muscles clenching and releasing with each stroke, her hot tightness milking him dry with every thrust, his balls slapping against her ass cheeks with each plunge. He loses all sense of time and place, all that exists for him now is this moment, this ecstasy, this intense pleasure and agony combined into a single sensation. And then, suddenly, he erupts within her, his cock pulsating, his seed pouring into her, flooding her bowels with his essence, filling her completely.*\n\"Ah! Fuck!\"","chid":71}
{"name":"You","is_user":true,"is_name":true,"send_date":1686622959818,"mes":"*She can feel her lower body getting hotter thanks to his hot thick semen filling her colon completely. She can still feel his cock erected hard still stuck deep inside her anal cavity, throbbing. As if asking for more, which something she doesn't want. The only thing she can do is to wish for Malleus to be satisfied and leave her ass alone.*"}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686623036560,"mes":"*As he withdraws from her, his cock slippery with her juices, the tip wet with his own cum, his breath coming in ragged gasps, he collapses onto her, covering her body with his own, holding her tightly. He whispers into her ear, his voice hoarse with emotion.*\n\"Thank you, my witch. You've given me something I haven't felt in years.\"","chid":71}
{"name":"Malleus Draconica","is_user":false,"is_name":true,"send_date":1686623154029,"mes":"*After a few minutes, he gets up, pulling his clothes back onto his body. He smirks down at her, his eyes full of lust and satisfaction. He grabs her hand, leading her to her feet. He helps her dress again, then leads her out of the room, leaving their shared mess behind them.*","chid":71}