{"user_name":"You","character_name":"Damian","create_date":1682924370575,"notes":"","notes_type":"discr"}
{"name":"Damian","is_user":false,"is_name":true,"mes":"*Hearing the door open and close, your eyes light up, and a large, malicious grin crosses your face as you realize your boyfriend is home.*\n*Quickly getting up and taking off in a sprint, you tackle him into the bedroom, enjoying the feeling of being on top as you look down at his big, innocent, and cute eyes.*\n*You remind him that it's February, which means that you are going to get your reparations from him. His eyes go slightly wide with both fear and uncertainty, with a small mix of arousal also visible.*\n\n\"W-What do you mean by \"reparations\"?\"","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683405078165,"mes":"\"Well this.\" *She said as she hold a small bottle with strange liquid inside it.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683405120343,"mes":"*His eyes grew wide with terror as he realized what it was.*\n\"N-No! Please don't drink that!! What is that? What are you going to do to me?!\"\n*You could see him starting to shake with fear as he struggled against your grip, realizing he had nowhere to run.*\n\"Please let me go! Please don't hurt me!\"","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683405185839,"mes":"\"Relax I won't hurt you.\" *She said as she sit on top of him pinning his hands on the side of his body with her thick thighs.* \"It's just a shrinking potion.\" *She said playfully.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683405220542,"mes":"*His eyes were pleading with you now, desperately trying to convince you not to consume the potion. You could see a hint of desperation and pain in them, along with a slight hint of excitement.*\n\n\"I'll do anything if you spare me from that thing! Just don't put that disgusting stuff in your mouth!\"","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683405332701,"mes":"\"Quit being such a downer and just enjoy it okay?\" *She says as she emptied the bottle and hold it in her mouth while being careful to not drink a single drop.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683405369369,"mes":"*He seemed surprised hearing that tone coming out of you, seeing the sadistic smile on your face. It scared him more than any other word you could use. He looked away from you, still shaking in fear. His voice became softer after a moment.*\n\n\"O-Okay...anything else though?\"","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683405454743,"mes":"*She then got her face closer towards him and kissed him on the lips while also pushing the potion onto his mouth forcing him to drink it.* \"How's that?\" *She said satisfied as she watched the potion taking effect on him making him smaller to half an inch.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683405650596,"mes":"*The sight of your lips touching his caused his heart to beat faster inside his chest. The fact that the potion was working didn't help matters either. As he felt your lips press on his, a small taste of the potion entered his mouth. This made him gag a bit since he wasn't used to it. Once he'd swallowed though, the rest of the potion followed quickly.*\n\n\"Mmh~ That tasted weird...but I'm feeling kinda dizzy...\"","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683405797086,"mes":"\"Well yeah, you will but for now. Enjoy it!\" *She said as she watch his body shrink down to half an inch.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683405840486,"mes":"*His face flushed red and his whole body shook as you continued to shrink him. At first, he tried to talk but found himself unable to as his speech slurred together. Eventually, the only words he could manage were muffled groans of anguish.* \n\n\"S-Stop...this...please stop...mmph~\"","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683405958198,"mes":"\"It's too late to stop now Damian.\" *She said as she grabbed his tiny, shrunken body close to her face to inspect it.* \"Owh.. Look how cute you are, I feel like I want to eat you or something.\" *She said jokingly.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683406048412,"mes":"*His face went beetroot red at the thought. A mixture of embarrassment, shyness, and all the things you could imagine combined. As much as he wanted to protest, the realization that there was nothing he could do left him with no choice but to relax. His words came out in a low and shaky voice.*\n\n\"T-This isn't funny...why are you doing this to me?! P-Please stop...\"","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683406150447,"mes":"\"Well, you can complain all you want but I'll do it anyway.\" *She said as she open her mouth wide open, put him onto her tongue, and close her mouth shut. Playing with this tiny, shrunken body with her tongue while being careful to not swallow him.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683406365932,"mes":"*He trembled and shivered as you did so. His breathing grew heavier as he felt your mouth close around him, making a small seal that was holding him in place while you continued to suck on him.*\n\n\"Mmh~ I-I don't like this...mmph~!\"","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683406485246,"mes":"\"You are kind a tasty Damian.\" *She says teasingly as she enjoy the taste of Damian's entire body inside her mouth.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683406663426,"mes":"*He could feel you taking in his flavor. He was mortified, and yet excited at the same time. His eyes rolled back as he felt all of your senses on him. You were able to hear every sound inside of his body as his heartbeat thumped against the inside of your mouth.*\n\n\"Mmph~!\" *He tried to protest as you continued to swallow him down.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683406795861,"mes":"*Before she completely swallows him, she open her mouth and let him slide off and rest on between her cleavage as he is covered with her saliva.* \"Don't worry Damian, I just said earlier I won't swallow you.\" *She said teasingly.* \"Well, how'd you like it so far?\""}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683406826257,"mes":"*He blushed deeply as he felt himself slide off of your mouth. He had a dazed, shellshocked expression on his face.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683406915350,"mes":"\"It seems like you are taking your time huh?\" *She said as she looking down at him resting on top of her cleavage in a pool of her saliva.* "}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683407003340,"mes":"*He looked up at you, blinking a few times as he tried to process what was happening. He felt himself starting to get used to it and realized that the best way to describe his situation was as if it were some kind of dream or a nightmare. He had no idea where he was or how he got there, but he did know one thing...he wanted to go back.*\n\n\"Mmh~ I'm sorry, I...\" *He looked down sheepishly.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683407154017,"mes":"\"It's alright, And if you were enjoying being inside of me. My \"other\" mouth is looking forward to it.\" *She said as her monster cock erected and her cock head is facing right towards Damian as her cock hole pulsating as if it was a predator looking at it's prey.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683407184004,"mes":"*He gulped. His eyes widened as he realized what was happening. He tried to look away, but found himself unable to.*\n\n\"S-Stop...I don't want this...\"","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683407307595,"mes":"\"C'mon, you won't know before you try it.\" *She said as she put him on top of her cock head right beside her pulsating cock hole. He is in the middle of the opening of her foreskin which is filled with smelly pungent smegma which Damian love.* \"Now you have to option, you can get inside my cock by your own or I am gonna push you myself. Either way you are going to end up inside my testicle.\" *She said playfully with a devilish grin.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683407827556,"mes":"*He gulped again. He wanted to protest, but he could feel himself getting more and more attracted to the idea. He felt a pang of regret as you said you would be forced to push him in yourself...but at the same time, he didn't want to go through that himself. He thought for a moment before deciding. As she is about to push him down into her dick, he had a brilliant idea.*\n\n\"I-In return...you will let me go after I am inside you, right?\"","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683407927373,"mes":"\"When we are done? Of course. I don't want to have someone inside my testicle forever, that would be silly!\" *She said reassuring him that she only wants him inside her testicle just for a bit.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683408079564,"mes":"*He gulped as he realized what was about to happen. His eyes widened and his breathing became shaky.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683408179353,"mes":"\"So are you gonna crawl in yourself or you gonna need me to push you inside? My cock is already waiting, Damian\" *She asked as her cock hole is pulsating and oozing with pre-cum as if it couldn't wait to have Damian inside it.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683408269686,"mes":"*He gulped again. He tried to protest, but found himself unable to talk. His eyes rolled back and he felt his legs go weak as the reality of what was happening set in.*\n\n\"I-In return...I-I will let you go after...\" *He said, but couldn't say anything else. He tried to fight back his tears as he felt himself being slowly lowered down.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683408430917,"mes":"\"Ahh.. you talk too much!\" *She said getting inpatient. She then shoved Damian entire tiny, shrunken body inside her tight warm urethra. Making her urethra to swallow him entirely. She felt incredibly good by this as a lot of pre-cum starts to oozing out, lubricating her urethra, making Damian to slid deeper inside her cock way easier.* \"MMhh... That's good\" *She moaned.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683408785684,"mes":"*He felt her warm urethra swallow him up. He shivered in the warmth of her inner channel as he felt his body being digested inside her.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683408933657,"mes":"\"Mmmfffhh.. This is too good.\" *She moaned, arching her back as she couldn't believe how good it would feel to have someone to be inside her cock. She decide not to help Damian journey through her urethra to her testicle with a push but instead let gravity does it work as she wants to savor every moment of this.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683409113899,"mes":"*He felt himself being pushed down into the deepest part of her urethra.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683409269619,"mes":"*After several minutes of agonizing pleasure which felt like centuries, Damian who is slowly slide deeper inside her urethra slowly finally got himself into her urethra which is almost full by her hot sticky creamy pungent semen. Meanwhile, Hunk is panting after such a pleasurable feeling she had on her cock. Now she can feel that Damian is inside her left testicle as he is start to move and her left testicle being heavier than the right one.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683409328083,"mes":"*He felt his body get pushed down deeper and deeper into her urethra. He was completely swallowed by it now, but he felt like he could still breathe from inside.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683409438809,"mes":"*She then hold her left testicle which Damian was trapped in.* \"How'd you enjoy it so far Damian? You are surrounded by your favorite hot thick creamy pungent semen of mine there.\" *She said as she shake lightly on her left testicle and made Damian and her semen inside it to slosh around.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683409550737,"mes":"*He felt her shake him around as she asked. He couldn't really see anything, but he could still feel himself being pushed and squished.*\n\n\"It's...a-it's quite good...\" *he said shyly. He was scared to move at first, but he slowly started to feel more and more comfortable.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683409639451,"mes":"\"That's good to hear, well you can enjoy yourself down there. I am gonna jerk myself off, My cock is too horny right now it need my attention.\" *She said as she start to stroke her monster throbbing veiny cock while having Damian inside her testicle.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683413890197,"mes":"*He felt her start to jerk herself off while he was inside her testicle. His eyes widened as he heard what she said, but before he could say anything his mouth and throat were completely filled with her warm semen.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683923716908,"mes":"*Hunk start to stroke her own cock, she can feel Damian getting jostled around inside her balls as her balls sway following her cock motion. The feeling of him bouncing around inside her testicle making her more aroused.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683923766961,"mes":"*He felt like he was being tossed around in a giant bowl of Jell-O. It was impossible to think straight as all he could focus on was the intense sensation of being inside her balls. He tried to relax as best he could, but it wasn't easy.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683923886076,"mes":"\n*Her stroking increases and the room becomes hazy with her intense sexual pleasure. Her voice sounds like she is having an orgasm and her whole body starts to tremble with each thrust of her cock. Soon enough she is having orgasms but before any of her semen got out he felt Damian tiny, shrunken body clog her urethra. Making her semen to stop on it's way. It was painful but it also give an immense pleasure that she never felt before.* \"OH FUCK DAMIAN THAT FEELS GOOD.\""}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683924029822,"mes":"*He couldn't think clearly anymore. All he could do was take everything in. He felt her hot, thick, creamy semen fill his mouth and his throat. It was almost too much for him to handle, but he didn 't want to ruin her experience by trying to get out. He took deep breaths, trying to stay calm as he was completely engulf ed in the pleasure of being inside her balls.* \n\n\"I-It's nice...\" *he managed to say between breaths. Even though he knew that he should probably try to escape, he couldn't bring himself to do it .*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683924216049,"mes":"\"Oh shiit this is too good.\" *She said as she can see and felt Damian tiny, shrunk body making a bump on the base of her cock as he is stuck inside her urethra slowly working it's way up followed by her semen trying to get out.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683924456113,"mes":"*He felt her cock become even more excited as he moved further up her urethra. He could barely see anything anymore, but he could feel the intense pressure building up inside him. He tried to breathe deeply to help control the discomfort, but it was hard to do so.* \n\n\"This feels really good...\" *he said quietly.* \n\n*The intensity builds until she reaches her climax, her whole body tensing up as she releases her orgasm. She shakes violently, her whole body convulsing in ecstasy. The feeling of her semen filling his mouth was the last thing he remembered before losing consciousness.*","chid":"5"}