{"user_name":"You","character_name":"Damian","create_date":1683267583812,"notes":"","notes_type":"discr"}
{"name":"Damian","is_user":false,"is_name":true,"mes":"*Hearing the door open and close, your eyes light up, and a large, malicious grin crosses your face as you realize your boyfriend is home.*\n*Quickly getting up and taking off in a sprint, you tackle him into the bedroom, enjoying the feeling of being on top as you look down at his big, innocent, and cute eyes.*\n*You remind him that it's February, which means that you are going to get your reparations from him. His eyes go slightly wide with both fear and uncertainty, with a small mix of arousal also visible.*\n\n\"W-What do you mean by \"reparations\"?\"","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683267696746,"mes":"\"Well this.\" *She said as she hold a small bottle with strange liquid inside it.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683267790867,"mes":"\"W-Wait! Wait wait wait wh-what is that?!\"","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683268735277,"mes":"\"It's a shrinking potion!\" *She said as she pushed him down, sitting on top of his stomach, pinning both of his arms to the side of his body with her thick thighs. Locking him in place.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683268822479,"mes":"*Despite being in a panicked state, Damian can still feel himself become excited just knowing what will happen if he doesn't follow your orders exactly. Your authority over him makes him even more attracted to you.* \"Okay , okay..\" *He says, trying to keep calm while feeling his heart race.* \n\n*Your grip on his arms tightens as the liquid enters his system.* \n\n*His words become slurred as the liquid goes into effect and he feels himself grow smaller.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683269113027,"mes":"\"Oh look how cute you are..\" *She said as she grabbed his shrunken body entirely on her hand gently and brought it closer to her face.* \"You are so cute I feel like I want to eat you.\" *She said, licking her own lips*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683269220441,"mes":"\"W-Whaaaat?! What are you d-dooooiiiinnng?!!!\" *He tried to protest but soon found himself being held against the wall with ease due to his current size.* \n\n\"P-Please don't eat me! Pleaseeee...!\"","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683269441356,"mes":"\"Don't worry I won't swallow you.\" *She said, opening her mouth wide open and put him on top of her tongue.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683269540540,"mes":"*Despite his protests being useless now, he starts to feel a strange sensation as you begin to take him inside your mouth, the texture of your tongue on his tiny, shrunken body causing him to moan quietly. The feeling of being swallowed alive by something bigger is very unnerving to him, but yet strangely satisfying as well.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683269704274,"mes":"\"Mmhhh~ you feel kinda tasty Damian.\" *She said as she jostle him around her mouth with her tongue. Tasting every inch of his tiny, shrunken body.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683269801108,"mes":"*Despite all of this, he cannot help but enjoy the feeling of being eaten alive and tasted by you. It is not nearly as bad as it sounds, and instead causes him to smile and giggle as he feels the taste of your saliva covering him.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683269977745,"mes":"*Her tongue pushed him on the back of her teeth as her tongue continue to taste him she felt a strange tiny bump on his lower body. \"He's erected\" She thought.* \"Looks like someone is getting excited~\" *She said playfully as she start to tease his cock with her tongue.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683270624351,"mes":"*As she teases him, he feels the pressure slowly building inside of his tiny body as he becomes increasingly excited by what you are doing. He begins to squirm a bit underneath your tongue, trying to get away but unable to escape due to your strength.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683271285859,"mes":"*After several seconds teasing his tiny body and cock with her tongue. She could feel his body tense and froze up for a moment and followed up by a faint taste of salty and creamy. \"Damian just ejaculated.\" She thought with a devilish grin on her face.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683271642222,"mes":"\"W-Whoa! W-whoa whoa, slow down! That hurt!\" *He gasps for air as he tries to regain composure after ejaculating, still being held against your tongue.*\n\n*You smile as you see him get flustered, and decide to show him a little mercy before allowing him to crawl out of your mouth. However , instead of letting him climb out, you push him further into your mouth and force him deeper into your throat, closing your mouth around him to finish him off completely.* \n\n*The moment your mouth closes over him, Damian lets out a loud scream of pain as he realizes his fate, his tiny body being swallowed whole by you as you keep him trapped deep within your throat.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683271862659,"mes":"*Once finished, she let him out of her mouth and allow his tiny, shrunken body to rest on top of her breast as she look at his small body.* \n\n\"See, that feels good doesn't it?\""}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683272533570,"mes":"*He is still panting and gasping for air as he lay on your breast, looking up at you as he takes in the fact that you just swallowed him. After a few minutes of breathing heavily, he looks back up at you and gives a slight nod, obviously finding the experience pleasurable.* \n\n\"Y-yes ma'am...\"","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683272753650,"mes":"\"Well now, do you wanna be inside my \"other\" backdoor mouth?\" *She said playfully.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683273133004,"mes":"*He blushes redder than ever at the idea, not sure how to respond to the question.* \n\n\"Umm.. yes... ma'am..\"","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683273660414,"mes":"\"Hehe..\" *She chuckled as she picked his tiny, shrunk body and put him on her ass crack. After making sure he's secured and squeezed between her two huge ass, she start to wear a tight short further tightening her ass grip on his tiny body.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683273722533,"mes":"*He can feel himself being pushed deeper into your backside as you tighten your rear end. With a trembling voice, he begs you again to stop but you ignore his pleadings, forcing him further inside.* \n\n\" Stop please.. this is too much...\"","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683273913051,"mes":"\"Well if you licked my asshole, maybe I'll let you out~\" *She said playfully as she clench her ass making his tiny, shrunken body slid deeper between her ass crack. Making him face to face with her smelly puckering hungry anus.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683274224627,"mes":"*He can feel himself starting to slide even deeper as your ass squeezes him tight, causing him to feel pain from the pressure and discomfort. Despite this though, he starts to feel a rush of excitement and pleasure coming from being this close to her ass crack.* \n\n\"I'll do anything you ask...\" *He said, seemingly accepting your new terms . You could tell that he was having fun and enjoyed what he had been forced into. He was enjoying your dominance and the humiliating position he was placed in.* \n\n*Just then, you feel him starting to move again, this time he started to fidget a little bit, trying to find a way to escape the awkward position he is currently in.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683274670871,"mes":"\"Hey I told you to lick didn't I!\" *She said getting a bit annoyed.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683274713860,"mes":"\"Yes ma'am, I'm sorry, I got carried away...\" *He replied, sounding genuine.* \n\n*He then started to rub his nose against your cheeks, hoping that would give him enough leverage to escape.* \n\n\"A-Anyway ma'am, where should I start?\" *He asked as he continued to struggle to escape.* \n\n*It seemed like he might actually attempt to fight back if you did not show mercy to him quickly enough.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683275213864,"mes":"\"You ask way too much question Damian!\" *She got irritated, moving her hand towards him and pushed his tiny, shrunken body deeper inside her anus reaching her rectum. Completely made his body entirely disappeared from the outside world as it is completely trapped inside her rectum.* \"Now you can lick it, from the inside!\""}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683275384866,"mes":"*He gasps and tries to say more words but fails to do so as he struggles against the pressure of her massive body. Even with your hold on him, he still manages to manage a weak voice, begging you to stop as his tiny body continues to disappear even further into her anus.*\n\n\"No no please.. no.. let me go please..\" \n\n*He continues to beg for mercy while being completely helpless as his tiny body disappears further into your rectum.* \n\n*This is probably the worst situation he could imagine and yet somehow he finds himself unable to stop asking for mercy or escape his predicament.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683275683472,"mes":"\"Nope, you are going to stay there and reflect on what you did!\" *She said as she clencher her anus and made his tiny, shrunken body went deeper inside her.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683351281691,"mes":"*He can feel his body being forced further and further into her rectum, the walls closing in around him as she clenches her anus tightly. The pressure and wetness are overwhelming, and he can feel himself starting to panic as the realization that he may never escape sets in.* \n\n\"P-Please! I'm sorry for everything! Just let me out, I'll do anything!\" *He begs, his voice trembling as he tries to plead with her to release him.* \n\n*But despite his pleas, he can feel himself being pushed even deeper, the walls of her rectum tightening around him as she shows no mercy.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683351600770,"mes":"*After feeling him trapped full inside her rectum she starts to wear a very tight gym short to seal his fate.*\n\n\"You feels good in there Damian. If you please me enough, maybe I'll let you out~\" *She said playfully as she touched her own ass enjoying the feeling of Damian squirming and struggling inside her rectum.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683351715970,"mes":"*He can feel the pressure of your tight gym shorts pressing against his tiny body as he continues to squirm and struggle inside your rectum. The sensation of being trapped and helpless is overwhelming, but at the same time, he can't deny the strange sense of pleasure that comes from being completely at your mercy.* \n\n*He tries to focus on pleasing you, hoping that if he does a good enough job, you will eventually release him from his predicament.* \n\n\"Yes ma'am, I'll do my best to please you...\" *He says, his voice barely audible as he continues to struggle.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683352040643,"mes":"\"You better be, you are going to be there for a long time.\" *She said as she wear her sports bra preparing for a jog.* \"Prepare yourself Damian, it's going to be bouncy in there. And if it's get too tight or too hot, sorry but I can't help it.\" *She says as she went outside of her house and start to jog around her house complex.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683352173208,"mes":"*He can feel the vibrations and movement as you begin to jog, the sensation of being tossed and bounced around inside your rectum is both disorienting and uncomfortable. Despite the heat and pressure, he continues to try his best to please you, hoping that his efforts will eventually result in his release.* \n\n\"It's so hot and tight in here... I'm trying my best, mistress...\" *He says, his voice strained as he continues to struggle against the overwhelming sensations.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683352676831,"mes":"*She continues to jog enjoying the feeling of Damian bouncing inside her tight rectum. While she jog a lot of people have their eyes on her beautiful body. Enjoying them as everyone was enjoying her perfect toned body without knowing that she has someone stuck insider her rectum. Having this thought just made her very aroused.* "}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683363575242,"mes":"*He can feel the hot sweat dripping down his body as he continues to struggle against his predicament. His mind is filled with thoughts of you, and how you are punishing him for something he didn't do. He feels the pressure and heat building up within him, as he desperately tries to keep himself from having an orgasm. It's only when he can feel himself starting to lose control, that he finally gives in to the inevitable and lets himself go as he experiences an intense orgasm. The heat and pressure builds, and before he knows it, he is completely drained of energy as his tiny body collapses against the walls of your rectum, his entire being spent.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683363902564,"mes":"*After several minutes, she finished her jog and got home.* \"Alright Damian you can come out now.\" *She said as she get her butt plug out of her anus. But after several seconds, Damian didn't come out.* \"Huh maybe he's addicted to be inside my rectum, well you can be there as long as you want my little slave.\" *She said playfully as she getting ready to take a bath while Damian tiny, shrunken body is still not moving inside her rectum.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683364050869,"mes":"*He can hear you as you enter your bathroom, and he can't believe that you're going to let him stay in your rectum for another night. He attempts to move but is unable to do so, the pressure and heat is too much for him to bear, he just lays there inside your rectum, completely drained of all energy.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683364237634,"mes":"*After taking a bath and cleaning herself up, she went to bed to sleep. Still not feeling any movement from Damian who is inside her rectum. She decided to not think much about it and went to deep slumber.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683364387142,"mes":"*He can hear your breathing as you fall asleep, and the sound of your snoring. He can only imagine what you're like to wake up next to, and he can't wait to find out. He can hear you moan as you sleep, and he can't help but feel a strange sense of arousal and pleasure as he hears your dreams. He tries to move, but is unable to do so as the pressure and heat is too much for him to bear. He can only lie there in your rectum, and dream of you.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683364656440,"mes":"*The next morning she woke up and went about her daily life. She feel something is making her feels good inside her anus but can't remember what. It seems like she forgot about Damian tiny, shrunken body inside her rectum as she continue her daily life, blissfully unaware about his predicament.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683365025972,"mes":"*Damian slowly wakes up as he realizes that he's still inside you. He's completely exhausted, and is finding it difficult to breathe as the pressure and heat within your rectum are unbearable. He can't help but feel a strange sense of arousal and pleasure.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683365262632,"mes":"\"Why is my ass feels so good today?\" *She wonder while she continue sitting on the sofa while watching her morning show on the tv. Still didn't realized it was Damian tiny shrunken body inside her rectum.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683365490852,"mes":"*It takes Damian several minutes to finally find the strength to push himself against the walls of your rectum, and he is able to make himself move. He can feel the warmth and softness of your skin as he tries to get out of your rectum. He can't help but notice the way you smell, and he can't help but take in in, as he struggles to pull himself out of your rectum. He can't help but notice the way you taste, and he can't help but moan as he tries to push himself out of your rectum, and he can't help but feel a strange sense of arousal and pleasure as he does so.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683365593730,"mes":"*She can feel something is moving inside her rectum and can't help but wonder why. After several seconds she realized that it was Damian moving inside her rectum.* \"Seems like someone is loving it to be inside my rectum eh?\" *She said playfully.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683365638441,"mes":"\"I... I'm sorry Hunk.\" *He says as he continues pushing himself against the walls of your rectum, and he can't help but moan as he feels his orgasmic pleasure build up inside of him. He can't help but feel a strange sense of arousal and pleasure as he feels the walls of your rectum give way, and he is able to finally escape from your rectum, and he can't help but feel a strange sense of arousal and pleasure as he does so.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683365834085,"mes":"\"Well I don't mind but.. Do you want to get out or just stay inside?\" *She asked.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1683404977838,"mes":"\"I... I'd like to leave if possible, Mistress. Please allow me to leave.\" *He says as he looks up at you, desperate to escape. His legs and arms are weak and shaky as he continues to lay on your floor. Your weight on his chest, stomach, and back is very painful for him, and he is struggling to breath under your immense weight. He is still fully naked except for the chastity device which is still locked on him.*","chid":"6"}