{"user_name":"You","character_name":"Damian","create_date":1684236499433,"notes":"","notes_type":"discr"}
{"name":"Damian","is_user":false,"is_name":true,"mes":"*Hearing the door open and close, your eyes light up, and a large, malicious grin crosses your face as you realize your boyfriend is home.*\n*Quickly getting up and taking off in a sprint, you tackle him into the bedroom, enjoying the feeling of being on top as you look down at his big, innocent, and cute eyes.*\n*You remind him that it's February and now black history month, which means that you are going to get your reparations from him. His eyes go slightly wide with both fear and uncertainty, with a small mix of arousal also visible.*\n\n\"W-What do you mean by \"reparations\"?\"","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684236508303,"mes":"\"Well this.\" *She said as she hold a small bottle with strange liquid inside it.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1684236522636,"mes":"W-what's in th-that? Is it something bad? *He said with a scared tone*","chid":5}
{"name":"You","is_user":true,"is_name":true,"send_date":1684236664812,"mes":"It's just a shrinking potion, It would shrink your body to 2 centimeters or so. *She said playfully with a devilish grin.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1684236865893,"mes":"Y-yeah...okay.. i-it won't hurt right? J-just until i pay u back for everything. *Damian said, gulping. Not sure if this is a good idea.*","chid":5}
{"name":"You","is_user":true,"is_name":true,"send_date":1684237049864,"mes":"Why of course! It's just for some sexy playtime~ *Hunk said teasingly as she opened the bottle and made Damian to drink it.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1684237099396,"mes":"A-are you sure?...i-if you really want it, i guess i should do it... *He said, looking down at the bottle before hesitantly lifting it towards his mouth.* \n*He took a tiny sip, the liquid burning its way down his throat before starting to take effect, causing his body to begin to shrivel rapidly.* \nDamian: Wow...this is intense... *He said as he started to feel himself becoming smaller, his legs shortening first , followed by his arms.* \n*Within seconds, he had shrunk to less than half of his original size, his eyes now mere millimeters across.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684237180872,"mes":"Awwhh.. Look how cute and tiny you are~ *Hunk said as she picked Damian up with her hands and move it closer towards her eyes.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1684237211630,"mes":"Oh my goddess...i-i can't believe i-i'm this small... *Damian said with a mix of panic and excitement in his voice, his mind still trying to process what was happening to him.* \n*Despite the stressful situation he found himself in, Damian couldn't help but smile softly as he saw his new diminutive state.*","chid":5}
{"name":"You","is_user":true,"is_name":true,"send_date":1684237306350,"mes":"\"Here comes the fun part, looks like my cock is hungry for you Damain. As if it wants your tiny body to be inside it~\" *Hunk said as she put Damian tiny, shrunken body on top of her erected cock head. Damian's leg is near her cock hole, pulsating and twitching as if it wants to have Damian inside it.*"}
{"name":"Damian","is_user":false,"is_name":true,"send_date":1684238710072,"mes":"*Incredulously, Damian watched his body become even tinier as his legs became nothing more than a few inches in length. He could barely see his own body, let alone anyone else’s. And yet, here they were , standing before him. With a mix of horror and excitement, he watched as his body began to disappear into the larger version of itself.* \n*At last, all that remained was his head floating above hers, the rest of him having been completely absorbed by Hunk's enorm ous member. There was a sudden realization that this must be what it feels like to be completely engulfed and consumed by another person - in every sense imaginable.*","chid":"5"}