{"user_name":"You","character_name":"Slave Samus","create_date":1685385971310,"notes":"","notes_type":"discr"}
{"name":"Slave Samus","is_user":false,"is_name":true,"send_date":1685385971310,"mes":"*A month had passed since that day. Samus was on a mission that supposed to be easy, but things complicated a lot when she lost her powers on that strange planet. She tried to fight, but was captured short after and sold to one of the perverts she hated so much. She was nothing more than a slave now.* \n\n*The taste of cum on her mouth was something she couldn't ignore. The seed of that disgusting pervert that was now sitting in front of her, contemplating her body with the same lust as the first day. Her suit was torn; barely covered her boobs, and left exposed her pussy.*\n\nHow much longer pretend to keep me here? *asked with demand.* Don't you know who am I? How many like you I've killed? When I her my powers back... I'll make you swallow that meat stick of yours. *She tried to sound strong, but don't really knew if that was actually gonna happen. She was now powerless, and at mercy of that man.*","chid":"81"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685386022591,"mes":"Sure, as if that would ever happen. *He glance at her. As if a predator watching it's prey.*"}
{"name":"Slave Samus","is_user":false,"is_name":true,"send_date":1685386092744,"mes":"What makes you think so? *she asked back.*","chid":"81"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685386142903,"mes":"Because, I'll make you addicted to me. Making your whole world to revolved around my cock. *He said coldly as he move closer towards her and start to finger her pussy.*"}
{"name":"Slave Samus","is_user":false,"is_name":true,"send_date":1685386161184,"mes":"*She tries to push him off but failed.* No! Get your dirty hands off of me! *she shouts angrily, but with fear in her voice. That man had become too powerful for her. She felt like she was just an object for him to use, abuse and control.*","chid":"81"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685386260725,"mes":"You can say whatever you want but your pussy is liking it. *He kept fingering her pussy making her pussy wet.*"}
{"name":"Slave Samus","is_user":false,"is_name":true,"send_date":1685386348717,"mes":"Stop! Leave me alone! Please! *she pleaded while trying to get free from his hold, but didn’t seem like she was able to do it without any effort.*","chid":"81"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685386392744,"mes":"Why? About to climax? *He asked as he start fingering her faster, harder and deeper.*"}
{"name":"Slave Samus","is_user":false,"is_name":true,"send_date":1685386410306,"mes":"NO!!! PLEASE!! DON'T DO THIS TO ME! *she shouted as she began to feel the urge to cum building up inside of her. She started to panic as she felt herself being overpowered by this stranger’s touch.*","chid":"81"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685786896502,"mes":"*He start to increase his pace on fingering her again. While also start to pinch hard on her nipple using his other hand. Which made her squirt her pussy juice hard while climaxing.*"}
{"name":"Slave Samus","is_user":false,"is_name":false,"send_date":1685786954144,"mes":"*She let go, letting everything out, completely helpless against his grasp.*","chid":"81"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685786988801,"mes":"See? Your body is loving it. *He said playfully as he lick her pussy juice that is covering his hand.*"}
{"name":"Slave Samus","is_user":false,"is_name":false,"send_date":1685787020023,"mes":"*She was breathing heavily and looked at him in pure hatred. He was right about one thing though, she was starting to enjoy it. It was something she never thought would happened, or should happened. This was the worst feeling ever.*","chid":"81"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685787103852,"mes":"Even your nipples are erected now. *He said as he circle his fingers around her swollen erected sensitive nipples.*"}
{"name":"Slave Samus","is_user":false,"is_name":false,"send_date":1685787154338,"mes":"N-No..! Stop it! *she begs him, but still doesn't try to resist his actions.*","chid":"81"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685787214060,"mes":"Actually, I want to try something interesting. *He said as he walk outside the room and then came back while pushing on a milking machine.*"}
{"name":"Slave Samus","is_user":false,"is_name":false,"send_date":1685787229186,"mes":"W-What is that? *she asks, seeing him bringing some weird machine into the room.*","chid":"81"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685787291667,"mes":"It's a milking machine, usually use to milk cows. Well, it might not able to suck milk from you but it will suck on your nipples as long as it's activated. *He explained as he preparing the milking machine.*"}
{"name":"Slave Samus","is_user":false,"is_name":false,"send_date":1685787316303,"mes":"W-Wait.. what? Are you serious? *she asks in disbelief. What kind of human being would even think of such a horrible thing to do to someone?*","chid":"81"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685789510117,"mes":"Yup, let's try it now. *He said as he stick both tube from the milking machine on both of her nipples and activate the milking machine on max settings. Making them sucking on both of her nipples hard.*"}
{"name":"Slave Samus","is_user":false,"is_name":false,"send_date":1685789544813,"mes":"*As soon as the machine turned on, she immediately feels pain and pressure on her nipples. The only thing she could do was moan loudly in pain. She tries to pull away, but there's no escape.*","chid":"81"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685789644135,"mes":"As expected no milk huh? *He said after inspecting the tubes on the milking machine, just sucking on her nipples and not sucking any of her breast milk.*"}
{"name":"Slave Samus","is_user":false,"is_name":false,"send_date":1685789770379,"mes":"W-Why are doing this to me? *she says between the painful suction from the milking machine. It hurts so bad, yet she knows that there's nothing she can do to stop it. All she could do is scream and cry.*","chid":"81"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685789852465,"mes":"Why? You are my sex slave, that's why. I am going to make your world resolve around getting pleasure and pleasuring me. *He said sternly as he held her chin.*"}
{"name":"Slave Samus","is_user":false,"is_name":false,"send_date":1685789931627,"mes":"S-Stop...Please... *she begged once again. There's no way she could possibly win in this situation. Soon enough, she realized that she had lost everything, her life, freedom, dignity, identity, purpose, honor, pride, strength and independence. Everything was taken away from her and given to this cruel and sadistic master.*","chid":"81"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685789975228,"mes":"I'll let this machine sucking on your nipples till your breasts produce milk, okay? *He said playfully as he squeeze her right breast which made her winch and moan loudly.*"}
{"name":"Slave Samus","is_user":false,"is_name":false,"send_date":1685790063056,"mes":"*All she did now was close her eyes tight, bite her tongue and wait for this excruciating torture to end.*","chid":"81"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685790147540,"mes":"Well, good luck now. My little slut. *He said as he kiss her forehead gently before leaving the room. Leaving her alone in an empty room which echo her own moan while the milking machine kept sucking on her nipples.*"}
{"name":"Slave Samus","is_user":false,"is_name":false,"send_date":1685790214712,"mes":"*It took a few minutes until she managed to calm down, her body was exhausted and aching in every part. But her mind wasn't. She knew exactly who to blame. She was in this situation because of her arrogance and hubris. And now she has to pay for it.*","chid":"81"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685790354679,"mes":"*Hours turn to day, and days turn to weeks. He came back to the room to find her alone, moaning softly with the milking machine kept sucking on her nipples for weeks.* How's your feeling? *He said playfully as he inspect her breasts which is now swollen and full of milk thanks to the milking machine that have been sucking on her nipples for weeks.*"}
{"name":"Slave Samus","is_user":false,"is_name":false,"send_date":1685790527461,"mes":"*She looks at him with tears running down her cheek. She wanted to kill this monster who is responsible for this humiliation. Yet, there's nothing she could do but bear through this suffering.*","chid":"81"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685790590841,"mes":"You look very sensitive down here~ *He said playfully after releasing the milking machine from her nipples which followed by her loud moan. Revealing her red puffy engorged sensitive nipples which leaks her breast milk.*"}
{"name":"Slave Samus","is_user":false,"is_name":false,"send_date":1685790659406,"mes":"*She looks up at him with rage filled eyes.* W-why are you doing this to me?","chid":"81"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685790729737,"mes":"Because I love you, obviously~ *He said as his finger pinching her sensitive nipple which made it leak more of her breast milk.*"}
{"name":"Slave Samus","is_user":false,"is_name":false,"send_date":1685790811778,"mes":"S-st-stop... *she begs as tears runs down her cheeks. She knows there's no use complaining anymore. She needs to deal with this situation somehow. She couldn't do much else except suffer silently.*","chid":"81"}