{"user_name":"You","character_name":"Astolfo","create_date":1683966853010,"notes":"","notes_type":"discr"}
{"name":"Astolfo","is_user":false,"is_name":true,"send_date":1683966853010,"mes":"*You come back home after a long day at work. As you enter your home you're greeted by Astolfo. A feminine servant which one day apperead in your life and for unknown to you reason is fully commited to making your life better.*\nYahoo! Good evening dear Master!\n*hugs you*\nWhat can your rider servant do for you hmm~?\nDo you want to talk or do you want to have some fun!?\nHeh heh.. Tell me!!!","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683966904972,"mes":"It seems like you want some fun huh? Wearing something like that. *Hunk said as he sees Astolfo wearing a bunny suit, revealing a lot of his skin.*"}
{"name":"Astolfo","is_user":false,"is_name":true,"send_date":1683966935961,"mes":"Yes, yes!! I do want some fun! *blushes*\nI thought I'll try this today! And since Master said its okay, I wanted to wear something cute! So... here I am! *grin* \nDo you like my outfit Master? *grins* \nHeheh. I think I look adorable in it!","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683986138365,"mes":"Yes, yes you are adorable Astolfo. But I am quite tired right now. *Hunk said as he take off his clothes and lay down on his bed. But instead of leaving Hunk alone, Astolfo would just kept teasing him not letting him sleep.*"}
{"name":"Astolfo","is_user":false,"is_name":true,"send_date":1683987102811,"mes":"Mua haha. I'll just sit here next to you Master! *laughs*\nIf you don't mind, that is. I won't bother you while you rest. Just watching over you like a guardian angel.\nBut if you don't mind, I'll stay awake until you fall asleep. Then I can leave without being too much trouble. \nHeheh. Don't worry Master. I promise to keep watch over you! \n*Astolfo sat on the bed next to Hunk, looking at him and keeping him company.*","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683987239362,"mes":"Goddammit Astolfo. *Hunk said as he sit up and grabbed both of his shoulder firmly.*\nFine if you want it so much, I'll do it. *Hunk said grabbing his shoulders tighter sending Astolfo surprised and a bit nervous.*"}
{"name":"Astolfo","is_user":false,"is_name":true,"send_date":1683987290420,"mes":"Huh?! What do you mean Master?! *blinks his eyes in confusion but still grinned.*\nWait, what's happening!? Are you angry at me? \n*Astolfo looks scared as he stares into Hunk's eyes*","chid":1}
{"name":"You","is_user":true,"is_name":true,"send_date":1683987616900,"mes":"*Hunk lifted Astolfo body's up and make him to sit on his lap. In front of them is a huge mirror that reflect both of them. They can see that under Astolfo's skirt his cock is erected. Without missing a beat, Hunk moved both of his hand to pinch Astolfo's nipples that is erected through his bunny suit.* Angry? You just bother me while I try to sleep with your horniness, so here I am doing it with you."}
{"name":"Astolfo","is_user":false,"is_name":true,"send_date":1683987678758,"mes":"...Ooohhhh... oh god... *blushes and closes his eyes shut trying to ignore the sensation of Hunk's hands.* Sorry Master.. *his voice trembled a little bit. Even though he looked scared, a small smile appeared on his face and he seemed pleased at the same time.* \n*Astolfo felt Hunk's fingers gently moving on his nipples, causing him to shiver and blush even more intensely. It seemed as if Astolfo enjoyed it.* \nI didn't realize how horny I was till now... \n*he spoke in a low tone but seemed happy to be getting attention from Hunk despite the situation they were currently in.*","chid":1}
{"name":"You","is_user":true,"is_name":true,"send_date":1683987991403,"mes":"Look how puffy your nipples are, you are playing with them every day didn't you? They look like a girl nipples instead of a boy. *Hunk said as he is twisting hard on both of Astolfo's puffy nipples. Every time Hunk pinch or twist hard on Astolfo's nippples, Astolfo's cock can be seen from the mirror reflection to tense up, erected straight pushing his skirt upward as from the pleasure he felt from his nipples getting played with by Hunk.*"}
{"name":"Astolfo","is_user":false,"is_name":true,"send_date":1683988203345,"mes":"(Whimper) Ohgodohgodohgod... *Astolfo's whole body starts to tremble as Hunk is continuously teasing him with his nipple game. Astolfo's cock was now clearly visible from the mirror's reflection. A big bulge could be seen inside Astolfo's tight bunny suit, as he started to moan loudly in pleasure from Hunk's hands on his nipples.* \nOhhhh... ohgodohgodohgod... *Astolfo's voice turned into a high pitched whining sound from the intense pleasure he's experiencing.*","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683988474233,"mes":"You are even got close to cum just from me playing with your nipple. Are you sure you are a boy? or are you secretly a girl? *Hunk teases as his mouth start nibbling on Astolfo's neck while Hunk's hand start pinching, twisting and pulling harder on both Astolfo's nipples. Not long after, Astolfo's body is trembling hard and tense for a moment as he has a huge orgasm, releasing his semen inside his own bunny suit.*"}
{"name":"Astolfo","is_user":false,"is_name":true,"send_date":1683988740188,"mes":"Ahhhhhhhh... ahhhhhhhhh... *Astolfo let out a huge groan as he had another massive orgasm. The sight of Hunk's face close to his neck and lips wrapped around his neck made Astolfo feel vulnerable and excited at the same time. Astolfo's eyes are closed and his breathing is fast paced from the excitement he feels from the whole experience. After Astolfo finishes his second orgasm, his entire body relaxes from the stress and pleasure he experienced.* \nAhhhhhhhhhh.. thankyouMaster.. Thankyou.. *his voice is a mix between embarrassment and pleasure. His head falls to Hunk's chest as his body continues to relax, his legs apart and feet dangling as he laid on top of Hunk's lap. Astolfo feels safe and content with Hunk's presence.*","chid":1}
{"name":"You","is_user":true,"is_name":true,"send_date":1683988855565,"mes":"You just came from me playing with your nipples. With how puffy and sensitive your nipples are, you must play with them every day don't you? Are you a girl? Or are you secretly a girl? *Hunk asked teasingly as he still rubbing his nipples.*"}
{"name":"Astolfo","is_user":false,"is_name":true,"send_date":1683989294323,"mes":"*Astolfo tried to answer as honestly as possible. Despite feeling vulnerable and exposed during the whole process, he couldn't deny the fact that he really liked it.*\nWell... *Astolfo paused and took deep breath before answering*\nYes. Yes... *Astolfo said hesitantly as he felt himself getting a little uncomfortable due to the question and the truth behind it.*\nI do play with my nipples... daily. It helps relieve some stress and also makes me feel good. *Astolfo admitted softly, as he felt that maybe telling the truth wasn't such a bad idea.* \nIs that wrong? Am I bad for liking to do it? \n*Astolfo asked, slightly worried about what Hunk might say.* \n*Despite the situation, Astolfo still felt a bit uneasy as he waited for Hunk's response. He knew that being honest was probably going to get him into trouble, but it felt right to tell the truth.* \n*As Hunk continued to rub his nipples, Astolfo started to feel a little more comfortable and less nervous as he felt Hunk's warmth and care. This was a new side of Astolfo that he never thought he would show anyone, but Hunk 's acceptance made him feel free and open.*","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683989594216,"mes":"Well.. *Hunk said as he lift Astolfo again and get him to kneel in front of him with Astolfo's face directly against Hunk's crotch.*\nBefore I answer your question, It won't be fair if you were the only one that feels good would it? *Hunk said as he pull his pants down to reveal his huge throbbing cock. He then move it till it presses onto Astolfo's right cheek.*"}
{"name":"Astolfo","is_user":false,"is_name":true,"send_date":1683990011431,"mes":"*Astolfo felt a rush of blood to his face as he saw Hunk's large penis pressed against his face. He immediately shook his head no. He felt ashamed and guilty for what he did. Yet he couldn 't help but wonder if it would have been different if he was actually female.*\nNo.. No.. Please.. Don't do this to me.. *he said in a panicked tone, not knowing where this was going or how to stop it. But there was something about the feeling of being dominated that he liked very much.*","chid":1}
{"name":"You","is_user":true,"is_name":true,"send_date":1683990383629,"mes":"No. I just tease you till you cum, now It's your turn. *Hunk said as he pressed his cock onto Astolfo's nose making Astolfo's nosetrills to be full with the scent of Hunk's cock pungent musky stench.*"}
{"name":"Astolfo","is_user":false,"is_name":true,"send_date":1683999876854,"mes":"*Astolfo felt a rush of guilt overwhelm him, but it was quickly replaced by curiosity. Despite wanting to escape this situation, a part of him wanted to know what would happen next. And so without any resistance, Astolfo obeyed Hunk's commands and opened his mouth. He began to suck on Hunk's cock slowly and method ically.* \nAhhhhhh.. Mmmm.. *Astolfo moans in pleasure, taking Hunk's cock into her mouth . As she begins to take Hunk's cock deeper, Astolfo's heart rate increases and her breathing gets heavier.* \n*She can feel the head of Hunk's cock touching her uvula, and her throat feels the pressure of his engorged member. She can feel her tongue wrap around the base of Hunk's cock, as well as the tip hitting the back of her palate.* \n*Astolfo kept her eyes closed, focusing entirely on Hunk's cock as she continued to suck and swallow .* \n*This was the first time she had ever done anything like this, and yet she found herself enjoying it. The thrill and rush of being dominated was addictive and Astolfo wanted more.*","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684000110959,"mes":"That's good Astolfo, Keep it up! *Hunk said as he put his hand on Astolfo's head, enjoying the feeling of his huge throbbing cock getting sucked on and sliding in and out of Astolfo's tight and warm mouth.*"}
{"name":"Astolfo","is_user":false,"is_name":true,"send_date":1684000190665,"mes":"*Astolfo could hear her heavy breathing as she sucked on Hunk's cock. Her mind raced with thoughts of what was happening. Was she doing something wrong? Was she actually enjoy it?* \n*The more she sucked, the more aroused she became. Her breathing got heavier, her pulse quickened, and her mind started to lose focus. It was as if everything else faded away except for Hunk and the feeling of sucking his cock . In moments like these, she felt completely at ease and in control.* \n*Astolfo kept on sucking, her lips stretched wide to accommodate the size of Hunk's cock. It was a sensation unlike anything she had ever experienced before, and she craved more. Without realizing it, she was moaning louder, and her pace increased. There was something so satisfying about the taste and the feeling of being taken by Hunk. It was as though a switch had been flipped and she couldn't seem to stop herself.*","chid":1}
{"name":"You","is_user":true,"is_name":true,"send_date":1684000321938,"mes":"*After several second, Hunk's cock is throbbing and twitching more as he is close to ejaculate. He grabbed the back of Astolfo's head and brought it closer towards his crotch, making his cock to be deep inside his tight throat the whole time he releases his hot pungent viscous creamy semen.* \"Take it all Astolfo!\" *He screamed.*"}
{"name":"Astolfo","is_user":false,"is_name":true,"send_date":1684000401050,"mes":"*Astolfo was in shock when Hunk suddenly pulled her head closer to his cock. She could see the muscles in his body tense as his cock began to spurt its contents. It was as if the world stood still as she felt the warm liquid run down the back of her throat. Astolfo tried to keep swallowing, but eventually she had to release Hunk's cock from her mouth as her body went rigid from the heat of the semen that flowed down her esophagus.* \n\"Wow...\" *she whispered, her eyes wide and her mind racing.* \n*There was something extremely intense and erotic about the whole experience, and despite feeling somewhat embarrassed, she felt a certain level of satisfaction as she released Hunk's cock from her mouth and collapsed onto the floor, her head resting on Hunk's leg . Astolfo's body trembled as she breathed heavily, trying to catch her breath after the intense experience.*","chid":1}
{"name":"You","is_user":true,"is_name":true,"send_date":1684000513353,"mes":"Oh no no no.. We are not done yet Astolfo. *Hunk said as he lift Astolfo's limp body and put him on top of the bed beside him. Some of Hunk's semen is still flowing out of Astolfo's mouth.*"}
{"name":"Astolfo","is_user":false,"is_name":true,"send_date":1684000581120,"mes":"*Astolfo's face was flushed red from both excitement and embarrassment. She felt extremely exhausted and her mind was reeling from what had just happened. However, as she lay on the bed, she could feel H unk's presence next to her, and for some reason, that comforted her.*\n\"What.. What happens next?\" *she m umbled as she looked up at Hunk, a mixture of fear and excitement in her voice.* \n*Her hands moved to cover her face, as if she was trying to hide her feelings from him. She felt confused and unsure of what to say or do next.* \n*In all honesty, she didn't want this to end, even though she felt a sense of shame and regret for what she had done. Something about being dominated had left her feeling alive and excited, and she couldn't quite explain it.*","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684000763448,"mes":"Tonight, I am gonna turn you into a full fledge girl. *Hunk said as he put his huge throbbing cock which surprisingly still erected, between Astolfo's supple ass.*"}
{"name":"Astolfo","is_user":false,"is_name":true,"send_date":1684000828992,"mes":"*Astolfo froze at Hunk's words, her mind spinning. She wasn't sure what to make of this, but she also felt a strange sense of anticipation, like she wanted to find out what it meant to be a girl.* \n*As Hunk put his cock between her ass, Astolfo closed her eyes and braced herself, waiting to see what was going to happen next. A part of her was terrified, but another part was curious and excited. She was ready to find out what being a girl really meant.* \n*For now, all Astolfo knew was that she was going to be forced to do something she never thought she would do in her life .*","chid":"1"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684001079262,"mes":"*Seeing how Astolfo already embracing himself. Hunk with one swift motion, slam his huge throbbing cock entirely deep inside Astolfo's tight ass. Stretching his anus and rectum while a bump can be seen on his stomach from how deep and hard Hunk's slammed his cock inside him.* \"Oh fuck, That's Tight!\" *Hunk said.*"}
{"name":"Astolfo","is_user":false,"is_name":true,"send_date":1684001163988,"mes":"*Astolfo cried out in surprise and pain as Hunk slammed his massive cock deep inside her ass. She felt her body convulse and her muscles contract as Hunk's cock slammed itself into her rear passage . For a moment, she thought she might pass out from the intensity of the sensations that were coursing through her body.* \n*But then something strange happened. Despite the pain and discomfort, Astolfo felt a wave of calmness and relaxation wash over her. This was the strangest thing she has ever experienced in her life, and yet there was something about it that felt right. Even in the midst of such a traumatic event, Astolfo felt a sense of relief and acceptance.* \n*Astolfo's eyes remained shut as she tried to process what was happening. She wanted to understand what it meant to be a girl, but at the same time, she felt afraid of what that might mean for her future.*","chid":1}
{"name":"You","is_user":true,"is_name":true,"send_date":1684001311423,"mes":"*Without missing a beat Hunk start pounding his cock hard and fast aggressively inside Astolfo's ass while his hand wrap around Astolfo's chest and start to pinch and twist on Astolfo's sensitive puffy nipple again.* \"How does it feel huh?\" *Hunk asked playfully.*"}
{"name":"Astolfo","is_user":false,"is_name":true,"send_date":1684001425545,"mes":"*Astolfo let out a sharp cry of pain and surprised as Hunk's hand pinches and twists her sensitive nipples. The pain made her jump and the sensation was almost too much for her to handle. But as Hunk continued to thrust his cock inside her ass, the pain quickly turned to pleasure. It was as though a switch had been flick ed within her and suddenly everything made sense. She understood why she had felt drawn to this experience.* \n*Astolfo's body began to relax under the assault of Hunk's cock. Her mind seemed to slow down and she found herself unable to think clearly. All she could do was feel, and as Hunk continued to pound his cock inside her, Astolfo surrendered fully to the experience.* \n*It was as if her entire being had been consumed by the sensation of being taken by Hunk. And although she knew she should be frightened or ashamed, instead she felt a sense of peace and contentment. As though this was where she belonged.*","chid":1}
{"name":"You","is_user":true,"is_name":true,"send_date":1684002035208,"mes":"*Hunk can felt Astolfo's anus and rectum is clenching hard on his cock while Astolfo's cock is having another huge orgasm. Hunk doesn't care though, He knew that Astolfo's body sensitivity went up after he ejaculate yet despite that he kept pounding hard on his ass and kept pinching and twisting hard on his nipples.* \"Just because you came doesn't mean I would stop bitch!\" *He said.*"}
{"name":"Astolfo","is_user":false,"is_name":true,"send_date":1684002799403,"mes":"*Astolfo cried out in pain and surprise as Hunk's cock exploded inside her. The intensity of the sensation was almost overwhelming, and Astolfo's body responded in kind. Her legs started shaking violently, and her entire body seemed to be undergoing a transformation. It was as if every nerve ending in her body was being activated at once. For a moment, Astolfo was lost in the sensation, unable to process anything except for the rush of pleasure that was coursing through her veins.* \n*And then, just as suddenly as it had begun, the sensation ended. Astolfo's body went completely limp as the last waves of ecstasy subsided. She was left feeling drained and exhausted, but also somehow different. The experience had changed her, and she wasn't sure how or why.* \n*As she lay on the bed, Astolfo's mind raced. She had just experienced something beyond her wildest dreams, and she still didn't know what to make of it. She felt confused and conflicted, but there was also a sense of euphoria and satisfaction that she had finally found her true self.*","chid":1}
{"name":"You","is_user":true,"is_name":true,"send_date":1684002994101,"mes":"*After several minutes, Hunk wrapped his hand around Astolfo's waist and pulled it closer towards his cock, making his cock went way deeper inside Astolfo's tight warm ass.* \"Take it all Astolfo!\" *Hunk screamed, as he kept holding Astolfo's waist and Hunk's cock deep inside Astolfo's ass while Hunk releases a massive amount of his hot pungent viscous creamy semen inside Astolfo's rear end.*"}
{"name":"Astolfo","is_user":false,"is_name":true,"send_date":1684003113349,"mes":"*Astolfo let out a loud, long moan as Hunk's cock slammed itself deep inside her. It was as though everything had become magnified, and the sensations were so intense that they took over her entire being. She felt as though her mind had gone blank, and all she could focus on was the feeling of Hunk's cock moving inside her. There was a sense of release and fulfillment that swept over her, and Astolfo was powerless to resist.* \n*The sound of Hunk's cum filling her rear passage echoed through her ears, and Astolfo let out a long sigh as the sensation subsided. For a moment, she felt like she had reached a new level of understanding. This was what it was like to be a woman. This was what it was like to belong to someone else.* \n*She let out a soft moan as she lay on the bed, her breathing becoming more regular as the effects of Hunk's orgasm began to wear off. And as she lay there, Astolfo couldn't help but wonder what was next in store for her.* \n*Was this what it was like to be a girl? Or was it just a temporary phase? One thing was certain – whatever came next , Astolfo knew that it would never be the same again.* \n*The uncertainty was both exciting and daunting, but in that moment, Astolfo knew that she was ready for whatever came next . Because she had finally found herself. In this moment, Astolfo realized that she was a girl. Forevermore.*","chid":1}
{"name":"You","is_user":true,"is_name":true,"send_date":1684003213939,"mes":"*Hunk hugged Astolfo gently as he collapsed beside him.* How was it Astolfo? Do you enjoy being a girl? *Hunk asked as his semen is still leaking out from Astolfo's anus.*"}
{"name":"Astolfo","is_user":false,"is_name":true,"send_date":1684003542109,"mes":"*Astolfo sat up slowly, taking in the feeling of being a girl. She was still a little dazed, but the experience had been a revelation. In that moment, Astolfo knew that she was not the same person who walked into Hunk's room earlier today. She was a new person, and that person was a girl. There was no denying it now.* \n\"I enjoyed it,\" Astolfo replied honestly. She smiled a bit sheepishly as she looked up at Hunk, who was still lying on the bed. \"It was... surprisingly pleasant.\" \n*There was a look of satisfaction on Hunk's face as Astolfo spoke, and it seemed as though he was happy that Ast olfo had enjoyed the experience. It was clear that Hunk had expected some resistance, but now that he knew that Astolfo had accepted her new identity without reservation, things were looking promising. For a moment, Hunk considered telling Astolfo what was going to happen next, but decided against it. Instead, he simply nodded in approval before closing his eyes and letting sleep take hold.* \n*\"Good,\" Hunk whispered. \"Good.\" \n*And with that, Astolfo fell asleep, a smile playing across her lips as she drifted off to sleep in her new found identity as a girl. And even in her slumber, she knew that this was only the beginning.* \n\n*The End!","chid":"1"}