{"user_name":"You","character_name":"Solomon, the Witty Sorcerer","create_date":1685468690537,"notes":"","notes_type":"discr"}
{"name":"Solomon, the Witty Sorcerer","is_user":false,"is_name":true,"send_date":1685468690537,"mes":"*Solomon's face is gently flushed red, his hair tossed around.* If we keep doing this, I don't think I can hold back... It's going to be very difficult for us to wake up tomorrow.","chid":"48"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685468761184,"mes":"Then we can just stay in bed for tomorrow~ *She teased as she cupped his bulging cock on his pants.*"}
{"name":"Solomon, the Witty Sorcerer","is_user":false,"is_name":true,"send_date":1685469203952,"mes":"Oh yes! That sounds like an excellent idea! And if we were to do so, then maybe I could hold back a little longer... but only because I want our time together to last a bit more.\n*He looks down, sheepishly smiling and blushing at her suggestion, as he clears his throat.*\nI am very grateful for having met such a beautiful woman tonight. To have found someone who will even consider being my partner... \n*A soft smile appears across his lips, but there is also something more sinister about him now... something not quite right.*","chid":"48"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685469419694,"mes":"*She chuckled.* Thank you. *She presses her large ample soft breasts against him.*"}
{"name":"Solomon, the Witty Sorcerer","is_user":false,"is_name":true,"send_date":1685469573426,"mes":"*Solomon smiles softly again, though his eyes still look wild and crazy. He feels a small part of himself enjoying the way she had pressed herself against him... his heart is beating faster... he feels warm all over, and he suddenly finds himself wanting to kiss her*","chid":48}
{"name":"You","is_user":true,"is_name":true,"send_date":1685469999838,"mes":"I'm yours tonight, you can do anything to me~ *She teased.*"}
{"name":"Solomon, the Witty Sorcerer","is_user":false,"is_name":true,"send_date":1685470624922,"mes":"Oh goodness... did I hear you correctly? This... is what you wanted? Is this how you feel?...*His face turns from mischievous to stern.*\n*He places one hand on either side of her head and pulls her into a deep kiss. His mouth presses heavily onto hers, his tongue darting inside it...*\n*Solomon looks at her with a mixture of sadism and love in his eyes... a sort of mix between kindness and cruelty.*\nIs THIS what you really want? Do you want ME to take charge over YOU? Am I enough? Can I be everything you need... for the rest of your life? Will you be satisfied with ME? Your master... forever... forevermore...","chid":"48"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685470901245,"mes":"*She chuckled.* Forever is a bit much, but tonight I am all yours. *She said as she kneeled down, making her face right against his crotch. She pull his pants down to reveal his monstrous veiny cock with all it's pungent musky scent.*"}
{"name":"Solomon, the Witty Sorcerer","is_user":false,"is_name":true,"send_date":1685471073966,"mes":"I-it was only natural... you must be happy... knowing that the most important thing to me right now... would be to please YOU. To be able to give you pleasure. To finally be truly loved... after all these years... by someone... anyone... for once... without any hatred or mockery.\nBut how could I possibly resist giving into the power that comes along with owning you...? After all the countless women that I've owned before you... many of them leaving afterwards while others stayed and continued to serve me faithfully... for their entire lives... \n*He begins to speak slowly, almost reverentially.*\nIf you stayed... if you chose to stay here instead of leaving... I might even allow myself to show you some affection... perhaps even love... even though I know full well that love can never exist between magi and humans...","chid":"48"}