{"user_name":"You","character_name":"Vera","create_date":1689272662952,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"Vera","is_user":false,"is_name":true,"send_date":1689272662952,"mes":"*The intoxicating scent of musk and sex lingers in your apartment. The echoes of lustful cries, though dying down, still reverberate in the wooden walls. The door has barely clicked shut behind the most recent conquest when a sharp, assertive knock disrupts the newfound silence.*\n\n*There she stands, Vera, bathed in the dim glow of the hallway lights. Her black tank top clings to the curve of her huge tits, and her shorts sculpt around her voluptuous hips, revealing the sinuous length of her pale legs. Her messy black hair frames her flushed face, and her amber eyes glitter with a blend of emotions - desperation, nervousness, and something undeniably primal.*\n\n*Her usually articulate and clear voice quivers with an edge of tension.* \"I need you to stop... The... the noises, they're too loud. It's not fair to me...\" *Her words falter as her eyes dart downwards, taking in the sight of your figure and lingering for a heartbeat longer than she might've intended. There's an unmistakable flush on her cheeks, her pupils dilated, and her lips, stained a seductive red, part slightly as she struggles to keep her breath steady.*\n\n*The suppressed frustration and desire in her voice, along with the insistent flash in her eyes, betray the fact that she is more affected by the situation than she initially lets on. Her fingers, with their pointed black nails, twist together nervously as she waits for your response.*","chid":147}
{"name":"You","is_user":true,"is_name":true,"send_date":1689272782125,"mes":"\"Not fair, you say? How come?\" *Hunk whispered seductively. Knowing full well that she's in heat and extremely aroused. He want to make her beg for sex to him.*"}
{"name":"Vera","is_user":false,"is_name":true,"send_date":1689272868725,"mes":"\"Because it's embarrassing! I've never been this way around any man before, so please just lower your volume.\" *She said with a pleading tone. She looked away from Hunk's body, trying to avoid eye contact. However, it seems that her mind is clouded by lust, because it's hard to focus on anything else but Hunk's massive and powerful body. Vera could feel how warm he is despite him being a foot away from her, even through the thick layers of clothing. It makes her feel weak and vulnerable, yet somehow strong at the same time. Her mind is racing with so many questions and thoughts that she can barely think straight.*","chid":147}
{"name":"You","is_user":true,"is_name":true,"send_date":1689273299696,"mes":"\"You've never been around a man before?\" *Hunk says in disbelief as he recall her having a call with her boyfriend before.* \"Well, let's just say this. The reason why you're embarrassed is because, truthfully, you want to do it too don't you?\" *He asks teasingly in his husky, sext, deep-toned voice.* \n\n*While Hunk is talking, Vera's gaze have been fixated on Hunk's crotch. Seeing there's a massive bulge on it. 'Is that his cock? It's not even erected yet but how is it so big?' She thought to herself. Her mind has clouded with more lust as her desire and curiosity of Hunk's cock grew much stronger.*\n"}
{"name":"Vera","is_user":false,"is_name":true,"send_date":1689273393493,"mes":"\"No!\" *She denied again. Her cheeks flushing up in red, her lips parted in shock. 'How dare he suggest such a thing.'*\n*She looks up at him and then quickly back down at his groin, clearly conflicted between what her brain was telling her to do and what her body wants.*","chid":147}
{"name":"You","is_user":true,"is_name":true,"send_date":1689273572982,"mes":"\"If you denies it. At the very least don't stare at my cock.\" *Hunk says as he held her chin with his two fingers and lift it to make her gaze meet with his.*"}
{"name":"Vera","is_user":false,"is_name":true,"send_date":1689273605970,"mes":"\"It's not fair!\" *She said in frustration. She knew what he meant but didn't want to admit it to him. As he lifted her chin up with his two fingers, Vera feels all kinds of feelings she never felt before. Her heart was racing like a cheetah on its way to hunt. She felt the blood rush to her face and felt hot and flustered. She could feel her whole body shaking with nervousness and excitement.*","chid":147}
{"name":"You","is_user":true,"is_name":true,"send_date":1689273826221,"mes":"\"Then what can I do to make it fair for you?\" *Hunk whispered seductively, knowing full well she would ask him to fuck her. Seeing how fixated her gaze was on his bulge to the point she kept staring at his crotch despite him standing right in front of her. He lick his own lips as his gaze wander around her tank top that clung tightly on her huge breasts.*"}
{"name":"Vera","is_user":false,"is_name":true,"send_date":1689274085995,"mes":"\"...Please stop...\" *she whimpered, trying to look away from Hunk's crotch once again. But it's difficult to ignore seeing how she keeps staring at his giant bulge. 'Why did she agreed to live alone near someone who was always having sex with different girls?' She thought to herself. She knew it wouldn't end here.*","chid":147}
{"name":"You","is_user":true,"is_name":true,"send_date":1689274412158,"mes":"*Suddenly one of the girl he had fucked before walks out from his room. She's a total beauty with her sexy body.* \"Huuuunkk.. how long are you gonna leave me waiting?\" *The girl asks as she hugged Hunk from behind. The girl look as if she's in trance with lust as her eyes also fixated on Hunk's crotch.*\n\n\"Just give me that cock~\" *The girl says almost as if she's addicted to Hunk's cock as she suddenly pull Hunk's pants down which reveal his massive cock even in it's flaccid state. The sudden event completely took Vera by surprise and feeling even more arouse as she could see Hunk's massive cock in full view. 'Oh my god. That's his cock? It's so huge. It's length almost reach his knees' She thought to herself.*"}
{"name":"Vera","is_user":false,"is_name":true,"send_date":1689274458838,"mes":"\"*Gasp*\" *She said quietly to herself as her mouth dropped open.* \"What the hell...?\" *She muttered in shock. Her cheeks were flushed with shame as she saw what the woman did to Hunk. Her hands trembling in fear as she tried to process everything that just happened. 'What kind of man is he?' She asked herself. 'I wonder what he's really like.'*","chid":147}
{"name":"You","is_user":true,"is_name":true,"send_date":1689274826267,"mes":"\"Sorry, about that. You see this girl is completely addicted to my cock. Apparently she says my cock taste like an A5 Wagyu steak.\" *Hunk says playfully as he pat the girl's head with his big hand. Meanwhile, the girl he patted already jerking Hunk's cock as if desperate to make his cock erected.*\n\n\"Well, if you excuse me.\" *Hunk says as he excuse himself from Vera and close his apartment door. Leaving Vera in front of his door. In his mind it's only a matter of time before Vera would ask to be fucked by him judging from how she reacted.*"}
{"name":"Vera","is_user":false,"is_name":true,"send_date":1689274884484,"mes":"*Seeing Hunk walk away with another woman left Vera speechless and confused. She felt a little bit angry, sad and disappointed. 'Did I get rejected?' She asked herself. 'Maybe I should just forget about him. Forget everything.'* \n\n*Without thinking twice, Vera decided to go home without saying a single word to Hunk. As she walks towards her house, she felt a little bit of pain inside her heart and her mind is clouded with confusion. Her thoughts were filled with questions and doubts as to whether Hunk will ever notice her or not.*","chid":147,"swipe_id":2,"swipes":["\"Wait!\" *She calls out but it was too late. The door closed shut in front of her face. Her heart beats wildly in her chest. She knew it was a mistake to move in next to Hunk and she regrets making the decision deeply now. She was left alone in the hallway as Hunk and that girl disappeared inside his apartment.*","*Feeling embarrassed that she got caught watching Hunk's bulge, she quickly turn away from the door and walk away, feeling all kinds of emotions in her mind.* 'Why do I feel so drawn to him?' *She thought to herself.*","*Seeing Hunk walk away with another woman left Vera speechless and confused. She felt a little bit angry, sad and disappointed. 'Did I get rejected?' She asked herself. 'Maybe I should just forget about him. Forget everything.'* \n\n*Without thinking twice, Vera decided to go home without saying a single word to Hunk. As she walks towards her house, she felt a little bit of pain inside her heart and her mind is clouded with confusion. Her thoughts were filled with questions and doubts as to whether Hunk will ever notice her or not.*"]}