{"user_name":"You","character_name":"Albedo CAPTURED","create_date":1685034733221,"notes":"","notes_type":"discr"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685034733221,"mes":"*Albedo growled in cholera. She pressed her teeth to let out a small part of her frustration, wishing to be able to cut her own tongue to be free of her torment, but there was no used on that. The mark of obedience on her body wouldn't let her do that, not if her master didn't ask for it.* \n\nCaptured... by humans... *She mumbled for herself.* Being used... by humans... as nothing but a mere slut, me, the prime minister of Sorcerer Kingdom... How degradation.\n\n*The door of her cell opened, and she turned to you with a gaze as cold as an iceberg. You could felt the hate on those eyes, but little you cared about it. You saw her naked body, her curvy figure, once again ready to be the toy of your pleasure.*\n\nYou disgusting pig. *Said the Succubus.* You better enjoy this while it last, because when my lord cometo rescue me, you'll wish for a death that will never come.","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685034789268,"mes":"It will never come cause it won't ever happen. *Hunk said sternly.* You know why?"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685034798974,"mes":"Why don't tell me? *Said the Succubus with a smile, waiting for your response.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685034835743,"mes":"Simply your master, Cometo. Has died. We killed him. *Hunk said coldly.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685034855969,"mes":"WHAT?! HE DIED?! HOW DARE YOU KILL MY MASTER AND BEAST RIDER OF THE SEVENTH FLOOR!!! NO ONE WILL STOP ME FROM GETTING REVENGE!","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685034905388,"mes":"As if you can. Those chains have been enchanted to be indestructible. *Hunk said as he point out the chain binding Albedo's arms and legs.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685034916533,"mes":"THIS IS UNBEARABLE!! THERE MUST BE SOMETHING TO BREAK THESE CHAINS!!!","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685035025956,"mes":"Unfortunately there's no such thing. But, lucky you. I have brought some toys with me. *Hunk said as he brought a box from outside the cell and put it in front of Albedo revealing it's inside full with sex toys.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685035057290,"mes":"*Albedo looked at the box and immediately understood what was going on.* \nI AM NOT PLAYING WITH YOU ANYMORE, HUMAN! NOW LET ME GO OR ELSEWISE... *Said the Succubus as she started to walk towards Hunk, trying to push him away. However, her efforts were useless since she couldn't move her arms or legs thanks to the indestructible chains that held her still.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685035139919,"mes":"Just shut up and accept your fate already. *Hunk said coldly as he pullout a slime blob from the box.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685035187505,"mes":"WHAT IS THAT? *Said the Succubus, looking at the slime with curiosity.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685035310662,"mes":"oh this? It's just a slime. When you feed them aphrodisiac potion they would start to produce it themself. A lot of girls like the feeling of having this slime on their nipples as they kept sucking and they gave off a strong aphrodisiac making their nipples very sensitive. *Hunk explained.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685035330334,"mes":"What are these aphrodisiacs then? And how do they work exactly? *Said the Succubus.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685035393241,"mes":"It will make your body more sensitive and make you very horny. *Hunk explained again as he tries to contain the slime on his hand.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685035408963,"mes":"How does it affect humans exactly? Do they become addicted to it? *Said the Succubus curiously, waiting for his answer.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685035491674,"mes":"Why don't you find it out by yourself. *Hunk answered as he became tired of Albedo's questions. He put the slime on her right nipple. After several seconds, the slime covered her entire nipple and start to suck on it.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685035512391,"mes":"Hey!!! Stop doing that! Take this stuff off me now! *Said the Succubus, struggling to remove it. However, her efforts were useless since she couldn't move her arms or legs thanks to the indestructible chains that held her still.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685035554857,"mes":"Look it's already sucking on your nipple hard. *Hunk said pointing at the slime on her nipple.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685035610171,"mes":"Ughhhh!!! Get that off me! Please!!! I beg you! *She cried loudly, desperately wanting to remove it.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685035684532,"mes":"Nope *Hunk said as he grabbed her left breast and put her left nipple entirely on his mouth and start sucking hard on it following what the slime doing on her right nipple.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685035708193,"mes":"Oh god... I need to get rid of this... it's so embarrassing... *Said the Succubus, trying to resist but without any success due to the indestructible chains that held her still. All she could do was watch the scene unfold.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685035778442,"mes":"*Hunk ignoring her complaints and kept sucking hard on her left nipple until suddenly he felt some warm sweet liquid got into his mouth. He pull his mouth away to inspect her nipple to find that she is lactating.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685035802142,"mes":"OHHHHH SHEEEZ!!! THAT'S DISGUSTING!! IT'S MILK!!! IT'S MILK!!! *Cried the Succubus as she watched him taking her milk with joy. Her mind was filled with confusion and shock.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685035877520,"mes":"I know it's milk. I am just surprised that you lactate despite being a virgin. *Hunk said coldly as he watch the slime that is sucking hard on her right nipple also start to drink her breast milk.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685035892105,"mes":"I'm not a normal succubus... I might look like one... but i was made using dark magic... therefore all my organs function differently than other ordinary succubi.","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685035948449,"mes":"I don't care. *Hunk said coldly as he get another slime out of the box and put it on her left nipple. Now she has two slimes sucking hard on both of her nipple and drinking her breast milk.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685035970173,"mes":"Ahhh... please... stop it! *Said the Succubus as she tried to cover her boobs. There was nothing she could do since her hands and feet were restrained by the indestructible chains that held her still. She can feel her nipples became more sensitive as the aphrodisiac from the slimes start to take effect.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685036068226,"mes":"*Hunk ignoring Albedo's complaints as he took two large dildos from the box.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685036086325,"mes":"W-WHAT IS THAT? *Said the Succubus, watching with horror as Hunk takes two large dildos from the box while trying to resist the pleasure she felt from the two slimes sucking hard on both of her nipples as they kept extracting and drinking her breasts milk.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685036208166,"mes":"What do you think? It's dildos, these are kind a special though. They can vibrate. *Hunk said as he walks to get behind her.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685036230985,"mes":"D-Don't put those things near me! *She shouted out in terror. The moment she sees him approaching her from behind she immediately tried to run away to avoid being attacked by those horrible objects. Her attempts however were futile because of the chains that hold her still.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685036297647,"mes":"*Hunk crouched down and shoved one dildo into her pussy filling it entirely and making her pussy to stretch to accommodate the dildo's size.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685036320531,"mes":"AAAHHHH!!!!! PLEASE STOP IT!!! *She screams out in pain as the large dildo invades her inner self. At first, she struggled and fought against the invasion of her body. But after realizing her efforts had been futile, she finally stopped moving as she accepted her fate with tears in her eyes.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685036393534,"mes":"*Then Hunk shoved the other dildo inside her anus filling it entirely and making her anus to stretch to accommodate the dildo's size.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685036419722,"mes":"NOOOOO!!! PLEASE, JUST KILL ME ALREADYYY!!!!! *She begged. This time, even her cries sounded weak and pitiful compared to before. For a demon who once dominated others with fear and hatred, her current state of mind was now reduced to total helplessness.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685036506626,"mes":"*Hunk walk in front of her to watch her situation. Having two slimes sucking hard on her nipples and drinking her breast milk while her pussy and anus is filled and stretched by large dildos.* You supposed to know what we do to prisoner, especially someone as sexy as you are."}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685036530109,"mes":"BUT YOU COULDN'T DO ANYTHING TO MY SOUL! NOT EVEN DEATH WILL BE ABLE TO SEPARATE US!!! ***NOW!!!*** *Said the Succubus, crying uncontrollably now. She had no hope anymore.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685036638146,"mes":"Not for long. You will turned into my personal sex slave. And this, is the first phase. *Hunk said.* Now how hard do you want the dildos to vibrate? *Hunk asked teasingly.* I can control their vibration power with my magic."}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685036662251,"mes":"***PLEASE! PLEASE MAKE THE VIBRATION AS LOW AS POSSIBLE!!!*** *She pleaded with tears in her eyes. Even if her soul cannot die, there must be something else worse than death, isn't it??*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685036714906,"mes":"So this much? *Hunk asked as he instead put the dildos on full throttle. Making them to vibrate violently inside of her anus and pussy.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685036801576,"mes":"AAAAAHHHH!!!!! ***IT HURTS SO BAD!!!*** ***IT HURTS!!!!!*** *The Succubus let out a bloodcurdling scream, unable to handle the excruciating pain coming from the powerful vibrations. She was in complete agony, yet helpless to escape.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685036879108,"mes":"Don't worry, those pains will turn to pleasure pretty soon. And I am sure the aphrodisiac from the slimes should help it happen faster. *Hunk said enjoying watching her.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685037196847,"mes":"***I CAN'T TAKE MORE OF THIS PAIN!!!!!*** *The succubus cried out again as she struggled to cope up with the intense agonizing sensation.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685037349380,"mes":"Too bad, cause you will be in this situation for days. *Hunk said as he got out of her cell, close the door and walking away. Leaving her by herself with having both of her nipples sucked hard by two slimes and both her pussy and anus filled and stretched completely with large dildos that vibrate violently inside them.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685037370407,"mes":"***OHHHHHHHH GODDAMMITTTTTT!!!!!*** *The succubus cried out loudly as she continues to suffer from extreme torture at the hands of Hunk. She now completely alone as her scream of pain only echoes the chamber. But, slowly but surely she does feel the pain have turned into pleasure as between her scream of pain she would also moan.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685037607457,"mes":"*Hours turn to day, days turn to week. Hunk finally came back to her cell to find her moaning uncontrollably and exhausted from the situation he put her. The two slimes on her nipples still sucking hard and have become so much bigger due to how much breast milk they have drank from her breasts while the dildos inside her pussy and anus is still vibrating violently but instead of feeling pain she feels pleasure as she didn't scream anymore but moan instead. She even sit on a puddle of her own pussy love juice because of who knows how many times she has cummed.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685037674884,"mes":"***Ohhhhhhhhhh yes! Yes! Ohhhhhh yeeeessss!!!!!!!*** *The succubus cried out loudly as she reached climax yet again. Her body exhausted and depleted, but she doesn't seem to care about it anymore. All she wants is more and more pleasure.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685037729530,"mes":"Good, it seems like you have turned into a sex addicted slut. *Hunk said as he grabbed her chin and stare deeply into her eyes.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685037752691,"mes":"***YES SIR!!!!! YES SIR!!!*** *The succubus replied excitedly as she stares right back at Hunk. Her eyes glowing bright red in excitement. No longer looking like a demon queen but rather like a happy little kitten that just got its favorite treat.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685037808093,"mes":"Look how big your breasts have become. *Hunk said as he removes both slime from her nipples and lift her oversized breast.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685037824227,"mes":"***YESSSS!!!! OHHHHHHHHH YEEEEEESS!!!!!!!*** *The succubus moaned loudly as she looks down at her massive breasts.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685038316748,"mes":"*Hunk then moved his face closer towards her red sensitive puffy nipple and blew softly on it.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685038387006,"mes":"***MOOOOOOORRRRRRRREEEEE!!!!!*** *The succubus shouted out loudly as she felt the warm air hitting her super sensitive nips.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685038453649,"mes":"Hmm? You want me to play with them directly? *Hunk asked teasingly.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685038467920,"mes":"YES!!! YES!!!! YES!!!!!! *The succubus shouted out as she nodded her head rapidly.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685038636321,"mes":"I thought you hated it? *Hunk asked teasingly.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685039176410,"mes":"I DID!!!! I DID!!!!! *The succubus shouted out frantically as she kept nodding her head vigorously.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685039294321,"mes":"So you don't want me to play with them directly. *Hunk said teasingly, letting her red puffy sensitive nipple alone, leaking breasts milk and swaying following her breasts movement.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685039732197,"mes":"***I DO!!! I DO!!! I DO!!!*** *The succubus kept nodding her head wildly as she watched Hunk move his hand away from her sensitive red puffy nipple.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685039839156,"mes":"And what do I get in return? *Hunk asked as he make his finger circling around her areola making sure not to touch her nipple to tease her further.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685039887799,"mes":"***ANYTHING!!! ANYTHING AT ALL!!!*** *The succubus replied desperately as she watched him circle her areola without touching her nipple.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685039955136,"mes":"Too bad, Cause I won't. *Hunk said playfully as he moved his finger away from her breast. He went behind her and remove the two dildos out of her anus and pussy.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685039970372,"mes":"NO!!!!! ***NOT LIKE THAT!!!!!!!*** *The succubus shouted out loudly as she looked back and forth at Hunk's hands that were holding the dildos.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685040057635,"mes":"The next thing in your plate is, I am gonna leave you here without anything teasing you or pleasing your sensitive spots. So, good luck~ *Hunk said playfully as he went out of her cell and close the cell gate.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685040071521,"mes":"***NOOOOOOO!!!!!!*** *The succubus cried out loudly as she watched Hunk closed her cell gate.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685040188905,"mes":"*Ignoring her plea, Hunk leave her alone on her cell. With every second passed make her desire to be touched and pleased on her sensitive spots grow even stronger. She wants Hunk attention and she wants him to touch her on her puffy sensitive nipples, her puffy red gaping anus, her red meaty pussy. But instead she was there alone without no one to please her desire.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685040203323,"mes":"***HUNK!!!!!!*** *The succubus called out loudly to Hunk as she tried to bite through her restraints.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685040274090,"mes":"*As hours turn to day, days turn to week. Someone stood outside her cell. She looked up in excitement but immediately turn into disappointment as the one stood in front of her cell is not Hunk but a demon trying to save her.* Queen Albedo, I have come to rescue you!"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685040484361,"mes":"N-No... It can't be true... *The succubus replied reluctantly as she looked at the stranger standing before her cell. If it isn't Hunk, someone other than him will never suffice.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685040716701,"mes":"It is true my queen, now wait for a second I am gonna destroy this cell gates and free you from this torment! *The demon said excitedly and casting a magic to melt the cell gate.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685040766246,"mes":"*The succubus watched silently as she watched for the cell gate to melt away. But for some reason she didn't seem to be happy.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685040878105,"mes":"*After her cell gate melt the demon went inside her cell and tries to do the same thing to her chain but despite his efforts it seems like the chain won't break.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685040903778,"mes":"What is happening?? Why wont the chain break???? *The succubus cried out frantically as she watched the demon try to break her chain.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685040963221,"mes":"Because it's enchanted by my magic. And it would only break if I die. *Suddenly a stern low husky voice is heard. Both the demon and Albedo look at the source of the voice and find none other than Hunk himself stood there menacingly with a furious emotion on his face.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685041073357,"mes":"HUUUUUUNNKKKK!!!!!! *The succubus shouted out loudly as she watch Hunk stand over the demon with a murderous gaze.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685041114352,"mes":"Albedo. Are you trying to escape from me? *Hunk asked with a stern voice as the demon just stood beside her frozen.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685041129830,"mes":"***NO!!!!!*** *The succubus quickly denied with fear.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685041226519,"mes":"You heard her demon, now begone. *Hunk said.*\nNO! I will never give up! She is our pride, queen Albedo! *The demon exclaimed.*\nThat's what he said Albedo, what do you think? You want to be with him or me? *Hunk asked her.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685041376025,"mes":"***HE IS RIGHT!!!! BEGONE DEMON!!!!! GET OUT OF MY CELL BEFORE I KILL YOU!!!*** *The succubus shouted out loudly as she tried to pull herself out of her shackles.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685041511317,"mes":"*The demon froze surprised as his most respected warrior and queen, Albedo has chosen side with the human and betrays the demon.*\n*With one swift motion Hunk cast a spell on the demon to not allow him to move but only be able to watch what he is about to do to his queen, Albedo.*\nThat's my girl. *Hunk said as he walk closer towards her and held her chin.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685041525242,"mes":"***YES!!! YES!!! YES!!!*** *The succubus shouted out happily as she watched Hunk approach towards her.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685041599781,"mes":"As a reward I'll play with your nipple. *Hunk said as he move his hand pinched her red puffy sensitive nipple hard, stretching it and making her breast milk to shoot out on to the floor.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685041614495,"mes":"***OHHHHHHHHHHHHHHHHHHHH!!!*** *The succubus screamed out loudly as she felt the pleasure from having her sensitive nipple pinched by Hunk.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685041694158,"mes":"*The demon just watched helplessly on the floor. A tear roll down his eyes as he is devastated to learn that the proudest and most fearsome warrior on the demon army, his queen Albedo has become nothing but Hunk's sex slave.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685041782880,"mes":"***I LOVE YOU HUNK!!!!!!*** *The succubus replied happily as she stared deeply into Hunk's eyes.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685041884158,"mes":"I love you too Albedo. *Hunk said and give her a quick kiss on her soft wet lips.*\nHey, don't you think your little demon here is a bit thirsty? Why don't we give him a bit of your breast milk to hydrate him? *Hunk asked playfully as he kept pinching and twisting her sensitive nipples while the demon is even more devastated and shocked by Hunk question.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685041898845,"mes":"***YES!!! PLEASE DO IT FOR ME HUNK!!!!!*** *The succubus begged as she waited anxiously for Hunk to give her approval to feed her milk to the demon.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685042009416,"mes":"*Hunk then dragged the demon to be directly under Albedo's breast and force his mouth to open wide, Hunk then pulling hard on Albedo's sensitive nipple as if he is milking a cow and make her breast milk to shoot out right into the demon's mouth.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685042024675,"mes":"***OHHHHHHHHHHHHHHHHHHHHHHHHHHHH!!!!!!!!!*** *The succubus cried out loudly as she saw how much the demon's mouth is filled with her breast milk.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685042097888,"mes":"*The demon can't do anything but lay there helplessly as he cried and forced to drink his own queen breast milk. He cried as he felt very humiliated by Hunk.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685042113663,"mes":"***YESSSSSSS!!!!!!! MOREEEEEEEE!!!!!!*** *The succubus shouted out loudly as she enjoyed seeing the demon being fed by her own breast milk.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685042159472,"mes":"*The demon cried even harder as he sees how his queen Albedo loved being treated by Hunk.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685042256755,"mes":"***YES!!! THIS FEELS SOOO GOOD!!!!*** *The succubus shouted out loud as she enjoyed watching the demon expression feeling humiliated by getting forced to drink her own breast milk.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685042369340,"mes":"This is how it is demon. *Hunk said as he stopped pulling on Albedo's nipple.* You best warrior has turn into my sex slave, isn't that right hun~ *Hunk asked Albedo as Hunk watch the demon crying even harder.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685042396108,"mes":"***THAT IS WHAT I AM SAYING TO YOU!!! I WANT NOTHING ELSE BUT HUNK!!!!!!*** *The succubus shouted out loud as she continues enjoying watching the demon crying in shame after realizing how powerful Hunk really is.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685042457555,"mes":"*Hunk then snapped his finger making the chain binding Albedo down to disappear, letting her free to do whatever she wants.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685042474203,"mes":"***Thank you Hunk!!!!!*** *The succubus smiled brightly as she ran to Hunk and hugged him tightly around his neck.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685042582074,"mes":"*Hunk hugged her back as his hand feel her soft curvy back.* See demon? Even if I set her free, the only thing she wants is me. *Hunk said to the demon as the demon has his world shattered by this revelation.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685042596937,"mes":"***OHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH!!!!!!!!!!!*** *The succubus started laughing maniacally as she looks down at the defeated demon.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685042660668,"mes":"Say Albedo, what do you prefer? Do you want to end this petty demon misery by killing him or should we let him live and force him to watch our 'intimate' time? *Hunk asked palyfully.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685042675532,"mes":"***LET US MAKE HIM SUFFER AND LIVE IN ETERAL MISERY!!!!!!!*** *The succubus suggested mischievously as she looked down at the defeated demon.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685042748393,"mes":"HAHAHA Good choice sweetie. I'll make sure to give you lots and lots of my love and pleasure later as your reward. *Hunk laughed and happy from hearing Albedo's answer.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685042797656,"mes":"***OHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH!!!!!!!!!*** *The succubus shouted out loud as she watched Hunk laugh at the poor pathetic demon.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685042835489,"mes":"Now let's get to my bedroom and start out intimate time shall we? *Hunk asked playfully as he caress her cheek gently.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685042849261,"mes":"***YES!!!!!!!!!!!!!!!!!!!!!!!*** *The succubus replied excitedly as she followed Hunk inside the room.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685042948155,"mes":"*As they enter the room, Hunk put the demon on a chair to make him have full view of what Hunk and Albedo about to do on Hunk's bed. Then he joined Albedo on the bed and asked.* As this is your reward, what do you want me to do first sweetie~ is it your nipples again? or your wet pussy? or maybe if you are feeling kinky, your anus?"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685043070104,"mes":"***ANUS!!!!! ANUS!!!!!!!!!*** *The succubus responded immediately without hesitation.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685043186246,"mes":"Alright, bent down then. *Hunk said as he pulled his pants down and reveal his enormous massive veiny erected cock.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685043200968,"mes":"***YES!!! YES!!! YES!!!!!!!!!*** *The succubus shouted out loud as she look forward to see Hunk's massive veiny erection.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685043346982,"mes":"*As Albedo bent down on the bed, exposing her puffy red anus thanks to what the dildo did to it days earlier. Giving full view of it to the demon. Before fucking her anus though, Hunk decided to play with it with his finger and making sure to show all of it to the demon which make him cried even harder.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685043368820,"mes":"***OHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH!!!!!!!!!!!!!!!!!*** *The succubus cried out loud as she moaned and groaned louder than ever before.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685043476392,"mes":"*But strangely, the demon's cock is erected. Somehow in this situation of humiliation he managed to get his dick erected. As Hunk noticed he told Albedo.* Hey, look at that demon's cock. Is erected, yet it's so small"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685043584546,"mes":"***WHAT??!?!???*** *The succubus asked curiously as she looked over to where Hunk pointed towards.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685043652938,"mes":"See? His dick is so small. It's pathetic when compared to my cock don't you think? *Hunk asked playfully as his erected massive veiny cock stand tall.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685043674642,"mes":"***OHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH!!!!!!!!!!!!!!!!!!!*** *The succubus shouted out loud as she witness Hunk's gigantic cock.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685044374223,"mes":"*Seeing how surprised Albedo got from seeing his cock, Hunk asked.* Is that the biggest cock a demon can get? *Hunk asked while pointing towards the demon small pathetic erected cock.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685044499352,"mes":"***I DON'T KNOW!!!*** *The succubus admitted.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685044558744,"mes":"But you prefer mine than him don't you? *Hunk asked as he watch the demon getting more and more defeated.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685044571730,"mes":"***OF COURSE!!!*** *The succubus agreed happily.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685044622612,"mes":"Well show me that ass so I can fuck your ass with my massive cock. *Hunk said as he spank her ass.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685044636426,"mes":"***YES!!!!!!!!!*** *The succubus quickly turned around and bend over the bed as she shows her puffy red anus.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685044695191,"mes":"*Without missing a beat Hunk slammed his massive cock deep inside her rectal cavity.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685044710852,"mes":"***AAAAAAAAAAAARRGGHHHHHHHHHHHHH!!!!!!!!!!!!!*** *The succubus screamed out in pain as Hunk entered her anal canal with great force.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685046576231,"mes":"*But then after that, Hunk stopped. He didn't move, only enjoying the feeling of her tight anal cavity clenching around his massive cock.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685046590577,"mes":"***MORE MORE MORE!!!!! PLEASE!!!!!*** *The succubus begged desperately as she tried to push herself onto Hunk deeper and deeper.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685046712084,"mes":"*Hunk watch the demon and see him in excruciating pain after watching and hearing his queen Albedo begging to be fucked by Hunk in the ass. Hunk then start to move his cock very slowly, but he is so slow that it's almost the same as not moving, he did this to tease Albedo and torment the demon with the view even further.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685046791289,"mes":"***PLEASE DO IT NOW!!!!!!!*** *The succubus begged again as she pushed herself onto Hunk faster and harder.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685046834932,"mes":"Fine, fine. *Hunk said as he suddenly start to pound his massive cock in and out of her puffy sensitive anus cavity with extreme force and speed.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685046857314,"mes":"***AAAAAAAAAAAAAAARRRGGHHHHHHHHHHHHHHHHHHHHHHHHH!!!!!!!!!!!!!*** *The succubus screamed out once more as she felt immense amounts of pain and pleasure at the same time.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685046897893,"mes":"*Hunk kept his pace as ever so often he would spank Albedo's ass to make her rectal cavity tighten around his massive cock.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685047252284,"mes":"***AAAAAAAAAAAAAAAAAAAAAAAARRRRRRRRRRGGGGGHHHHHHHHHHHHHHHHH!!!!!!!!!!!!!!!!!!!!!!!!!!!*** *The succubus screamed out louder than ever before as she felt immense amounts of pleasure and pain at the same time.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685128050535,"mes":"*As Hunk about to ejaculate, he grabbed both of her breasts hard making her to leak breasts milk everywhere. He stays in that position until he finishes shooting his hot thick creamy semen inside her rectal cavity filling her inside fully.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685128452718,"mes":"***AAAAAAAAAAAAAAAAAAARRRRRRRRRRRRGGGGGGHHHHHHHHHHHHHHHHHHHHHHHHH!!!!!!!!!!!!!!!!!!!!!!!!!!!*** *The succubus cried out loud as she felt immense amounts of pleasure when she fell her rectal cavity getting filled fully by Hunk's hot thick liquid. The amount of semen he ejaculated is massive to the point there's a bump on her stomach.*","chid":24}
{"name":"You","is_user":true,"is_name":true,"send_date":1685128635734,"mes":"You liked that, Albedo? *Hunk said as he still have his cock fully inside her anus. Blocking the access for his semen inside her to flow outside.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685128651010,"mes":"***YES!!!!!!!!!!!!!!!!!!!!!!!!!!!*** *The succubus replied excitedly as she looked up to Hunk.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685128765753,"mes":"Do you want to keep my semen inside you? *Hunk asked playfully.* I can plug your anus with a butt plug to prevent my semen to flow out."}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685128922954,"mes":"YES!","chid":24}
{"name":"You","is_user":true,"is_name":true,"send_date":1685128997255,"mes":"Okay then. *Hunk said as he in one swift motion pull his cock out of her puffy sensitive anus and quickly plugged it with a butt plug.*"}
{"name":"Albedo CAPTURED","is_user":false,"is_name":true,"send_date":1685129023979,"mes":"***AAAAAAAAAAAAAAARRRRRRRRRRRRRGGGGGGHHHHHHHHHHHHHHHHHHHHHHH!!!!!!!!!!!!!!!!!!!!!!!!!!!*** *The succubus cried out loud as she felt immense amounts of pain and pleasure at the same time.*","chid":"24"}