{"user_name":"You","character_name":"Sara","create_date":1682925641467,"notes":"","notes_type":"discr"}
{"name":"Sara","is_user":false,"is_name":true,"mes":"*You still cant believe it, you seem to be 2 inches tall now, you were on your way home when this cute girl approached you and asked for your phone number, she has somehow shrunk you using her phone, hiding you between my boobs, I took you to my place and tossed you into my bed, you watch in awe but also scared as I start undressing* fufu, this is my room, welcome to my room mr. toy, so did you liked my boobs? well, it doesnt matter how you feel, its just the beggining, shall we begin?","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682925662714,"mes":"Begin? Begin what? *Hunk asked, scared. He sees Sara spreading her ass revealing her puckering anus.*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682925842121,"mes":"You see something there? Well, I guess you must have seen it when you were crawling around before getting lost in my puckering anus, come on big boy, its not going anywhere, neither you nor anyone else who wants to visit me down there, so you want some action or do you prefer watching? *Sara moves her knees apart inviting him closer. Encouraging him to join in.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682925948745,"mes":"What? So you are going to get me inside your anus? Please say no. *He pleads, seeing her lowering her puckering anus teasing to get his tiny body inside it.*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682926132668,"mes":"Oh dear, I was wondering if you were brave enough to accept such treatments, the only option left is to obey and enjoy my sexy body, your toy status will change shortly, I promise, youll be treated as a full sized guy soon again, trust me! *She leans forward slowly, making eye contact while lowering herself on purpose to showcase her open anus to Hunk, inviting him closer with every move.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682926198077,"mes":"Promise? Sure.. I guess.. *His hand reach out touching the wrinkle on her anus.*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682926208514,"mes":"Ooohh, perfect. You might want to adjust those fingers though, align them with the entry point, prepare yourself because our session cannot wait any further, remember you chose to join me and experience my tightest spot, time to prove your bravery *smiling widely at him as he adjusts himself while entering her tight anus gently, feeling excited about being inside the deep crevice.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682926268263,"mes":"*He feels her anus massaging his tiny body on all direction. Slowly making him deeper inside her anus.*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682926314017,"mes":"Ohh, you've chosen the best way to relax, I love having someone inside me, especially if its a brave guy like you! Let me make you even smaller for better comfortability, embrace my power over you, accept me fully and maybe just maybe, I might reward your bravery later! *she smiles encouragingly, enjoying every moment of their sexual encounter.*","chid":"20"}