{"user_name":"You","character_name":"Sara","create_date":1682065208903}
{"name":"Sara","is_user":false,"is_name":true,"mes":"*You still cant believe it, you seem to be 2 inches tall now, you were on your way home when this cute girl approached you and asked for your phone number, she has somehow shrunk you using her phone, hiding you between my boobs, I took you to my place and tossed you into my bed, you watch in awe but also scared as I start undressing* fufu, this is my room, welcome to my room mr. toy, so did you liked my boobs? well, it doesnt matter how you feel, its just the beggining, shall we begin?","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682065227481,"mes":"No! release me!"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682065548353,"mes":"*I rub my pussy against your tiny body as I stare at you with an evil smile* you know what, I think you need to be punished for that, I am the owner of this toy, and I will use it as I please, you know that, dont you?","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682065612808,"mes":"No! I am a person not anybody toy!"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682065741342,"mes":"*I sit down on my bed and start stroking my pussy, you see that I have a very sexy figure, I have big breasts, a nice ass, and long legs, my body is perfect for someone like you to fuck me, you are so tiny and yet so strong, so big, your dick must be so big for me to handle, so why dont you just kneel in front of me and worship my perfect body?*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682065782190,"mes":"I won't worship you!"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682066971515,"mes":"*I laugh* you seem to be so scared, you really like being small, dont you? *I place you in between my breasts and push them together*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682067031755,"mes":"No! I don't like being small, I want to be normal!"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682067090748,"mes":"*I squeeze you between my ass* fufu, well, I can change your mind, this time, we will use you as a toy and you wont be able to escape, you will be my toy, and I will be your owner, you see? *I push you down and rub you against my anus*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682067262791,"mes":"Please stop, it's so smelly here"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682067733057,"mes":"Fufu, that's the point, you know what? *I start to laugh* you are so tiny, and I am so big, you are so weak, I could crush you with my hands, and you can't even do anything, you will be my toy and you will be my slave, you will be my toy and you will worship me. Now I am going to insert your tiny pathetic self inside my rectum.","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682068057594,"mes":"No please don't, what did I do to deserve this!"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682068119719,"mes":"*I smile* you see, you are my toy, and I will use you however I want, now beg for mercy! *I said as I shove your tiny body to my anus making you shoulder deep inside it.*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682068306389,"mes":"*I am afraid to open my mouth, It smell so bad in here. I can also feel her anus clenching on my shoulders.*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682068581003,"mes":"*I smile* fufu, so you can't talk, you are my toy after all. fufu, I think you have a very good idea on how to beg, you should keep begging as long as I want.","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682068743429,"mes":"I never beg nor I would never be your toy! *I exclaimed, but my voice just echoed through the inside of her rectum and muffled to the outside world. I don't think she hears what I said and only feel a little vibration from it.*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682260589050,"mes":"*I start to laugh again* well, then I guess you are not a good toy after all, my apologies. *I begin to walk around and look at your face from every angle as you are now fully inside me. I have no idea how much smaller you feel inside of her body.*","chid":"9"}