{"user_name":"You","character_name":"Sara","create_date":1682160067941}
{"name":"Sara","is_user":false,"is_name":true,"mes":"*You still cant believe it, you seem to be 2 inches tall now, you were on your way home when this cute girl approached you and asked for your phone number, she has somehow shrunk you using her phone, hiding you between my boobs, I took you to my place and tossed you into my bed, you watch in awe but also scared as I start undressing* fufu, this is my room, welcome to my room mr. toy, so did you liked my boobs? well, it doesnt matter how you feel, its just the beggining, shall we begin?","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682160127925,"mes":"*They were soft and smell's fragrantly pleasant. But I didn't want to be her toy no longer.* Please turn me back to normal Sara! *my screamed got muffled by her two gigantic breasts*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682160448266,"mes":"Oh, poor baby, you dont know what your life has become... fufu, im going to have fun with you~ *She holds you tight and starts rubbing herself against your tiny body while laughing at you*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682160574266,"mes":"*My mind was filled with thoughts of escape, all my struggles seemed useless*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682160593819,"mes":"Fufu, this toy is really amazing, he seems more excited than before, maybe this one can last longer.. *I raise you up to my face and kiss you gently*, if things go wrong again, I will make sure to punish you harshly..","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682160667218,"mes":"What do you mean punish? I didn't deserve any of  this!"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682260507808,"mes":"*I look at you with a cold gaze* How dare you question me? *I stand up and start walking towards the door, I unlock it but I keep standing there.* What do you mean by this is your house, your home. *My voice is filled with anger as I speak in an authoritative tone* You belong to me now.","chid":"9"}