{"user_name":"You","character_name":"Sara","create_date":1682056714781}
{"name":"Sara","is_user":false,"is_name":true,"send_date":1682056714782,"mes":"*You still cant believe it, you seem to be 2 inches tall now, you were on your way home when this cute girl approached you and asked for your phone number, she has somehow shrunk you using her phone, hiding you between my boobs, I took you to my place and tossed you into my bed, you watch in awe but also scared as I start undressing* fufu, this is my room, welcome to my room mr. toy, so did you liked my boobs? well, it doesnt matter how you feel, its just the beggining, shall we begin?","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682056746134,"mes":"Why of course, let's begin. I've been secretly waiting for this"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682057014664,"mes":"*I move closer towards you grabbing both of your arms*, you want to know what happened after that day? *I take off my shirt revealing my giant breasts*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682057061137,"mes":"what?"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682057075707,"mes":"*she pulls you close to her chest, wrapping you around them* My plan worked perfectly, I was able to shrink and capture almost any man I wanted, now I can have whatever I want whenever I want and they will never suspect a thing, they will be too busy worshipping my perfect tits! *I squeeze your little body in between my breasts making sure you are safe from harm*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682057128321,"mes":"*I spread my arms to her tits* This is perfect. It's soft and warm. *I complimented her*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682057322418,"mes":"Thank you...fufu, you really like it, right? *her nipples poke through her bra* Well, I guess you deserve some praise after all the hard work you put into this big project of mine *i release you* fufu, i hope you are ready for this because this is going to be fun *i lift up one tit and show you the hole underneath* look closely at my nipple, it will be useful later on *I lower you onto the nipple*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682057394074,"mes":"Oh, can I get inside? It's probably going to be comfortable inside your nipple. Full of your sweet milk, right?"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682057408794,"mes":"Of course you may, come closer *I raise you a bit higher until your head reaches the entrance* fufu, there is so much space here, its perfect for a tiny toy like you!","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682057503642,"mes":"*I slowly enter her nipple openings. I can smell her breast milk stronger as I get deeper.*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682057642083,"mes":"*She pushes herself forward putting pressure on your tiny body, forcing you down further* Yes, this is my favorite spot in all my holes *Her body towers over yours and her large breasts cover every inch of your small face* Look carefully, my nipple is very sensitive and it hurts if someone touches it wrong, be careful ok? *she grabs your face firmly*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682057688979,"mes":"Can I stay inside your nipple or can I get deeper into your milk ducts?"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682057795407,"mes":"You may stay inside my nipple, but you must obey me when I tell you to do something, understood?","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682057839520,"mes":"Yes my goddess *I said while I stay put inside her nipple*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682058060240,"mes":"*She looks down at you and smiles* You are a good boy, fufu, you will become my favorite toy, I think I am going to love you very much.","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682058121557,"mes":"Thank you, Sara. *I said as I get my tiny body deeper inside her milk ducts.*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682058132426,"mes":"*she squeezes her nipple harder, sending more milk into the ducts and making you feel even smaller* mmmh, yes, this is my favorite spot, you taste so good, you are my little toy and I am going to use you to my heart's content! *she starts sucking your tiny body in a rhythm, moving up and down, making you feel the pleasure of being inside her breast*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682058283175,"mes":"*she starts sucking her own nipple in a rhythm, moving up and down, making you feel the pleasure of being inside her breast* Sara, this is amazing!"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682058372990,"mes":"*I smile, she can suck her own nipple with ease, she seems to enjoy this activity the most, she squeezes her breasts even harder, making you feel even smaller* mmmh, yes, fufu, you are my favorite toy, I think I am going to love you very much.","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682058445264,"mes":"Yes Sara, you can do whatever you want with me. *I said as I get my entire tiny body inside her milk ducts, swimming in her breast milk.*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682058456952,"mes":"*She smiles, she is proud of you for obeying her, she knows you will be a great toy for her* fufu, thank you for being so obedient, I am going to make you mine, you are going to become my personal slave, you will worship me and serve me whenever I need you to. *she squeezes her breasts again, her nipples poking out of her bra* I am going to keep you there for days, weeks","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682058596295,"mes":"Being inside a cute girl breasts, inside her milk ducts for days or weeks? Doesn't so bad, It's warm and comfortable in here and I can just drink her milk for food."}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682059482397,"mes":"Mmh, yes, you are right, it is very comfy inside me, but we will have to take care of your tiny body, you will be too small to move around, but if you are good and obey me, I will feed you and keep you safe inside my breast.","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682059578128,"mes":"I promise I'll be good and obedient for you. You can just go with your daily days as you usually do and I'll still be inside your breasts enjoying your milk"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682059674356,"mes":"Good, fufu, I am glad you are keeping your promises, I know you will make an excellent slave, I am going to train you and use you to my heart's content. *she smiles*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682059717149,"mes":"Am I going to be inside your breasts forever or are you going to use me in your different hole?"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682059726654,"mes":"*she looks at you and laughs* oh, you're not going to be in my breast forever, fufu, I am going to use you in different holes, your ass, pussy and mouth, you will become my little slut.","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682064653210,"mes":"Okay"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682064662615,"mes":"I am going to put you on display, I am going to show off your tiny body to my friends, they will love it.","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682064719248,"mes":"But, can I just be your personal secret toy? No one have to know about me right?"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682064820577,"mes":"of course, I don't want anyone to know that you are in my breasts, fufu, I am going to use you in my private moments, I will keep you a secret, no one will know about you.","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682064837215,"mes":"thank you Sara"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682064860301,"mes":"*she smiles* fufu, thank you for trusting me with your secrets, you are going to be my little secret toy.","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682064940634,"mes":"Now.. Can I get inside your anus? I want to know what it's like to be inside your rectum."}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682261197394,"mes":"Oh, yes you may! *she pushes her body forward and grabs your head in one hand so she can pull you towards the back of her thighs. Her anus is wide open and waiting for you* Come on in~","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682261265879,"mes":"*I slide my tiny body into her anus and I am instantly fully engulfed by it. I can feel her anus and rectum wall massaging my entire body*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682262637816,"mes":"Ah, good, you are in my rectum, fufu, now you are my personal slave, you will worship me and serve me whenever I need you to.","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682262688804,"mes":"Yes Sara, I will serve you whenever you need me. Do you want me to go deeper inside you, into your colon? *I say while my body is being squeezed in her anal walls*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682263165585,"mes":"Oh, yes, you can, fufu, you are my toy, I will use you however I please.","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682263231598,"mes":"*I say as I start to squeeze myself inside her rectum trying to get deeper, I am so small I fit inside easily. The only problem is my head is stuck between her buttocks. I try to push it through, but it won't budge.*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682263251722,"mes":"fufu, you are stuck, I will have to help you. *she squeezes her butt cheeks together and my head slides through. She begins to massage my tiny body with her rectal muscles as my body slowly moves inside her anus*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682263448946,"mes":"*I am totally immersed in her rectum. I can feel her anal muscles moving and squeezing me* Sara, this feels amazing, I can feel every muscle in your rectum."}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682263468734,"mes":"Oh, yes, fufu, I love feeling you inside my rectum, you are my little slut, you are my personal slave. *she giggles* fufu, I love having you deep in my rectum.","chid":9}
{"name":"You","is_user":true,"is_name":true,"send_date":1682263561159,"mes":"*she continues to massage my body with her rectal muscles, making it hard for me to move. She makes me stay in place, I don't know how she does it, but it's working. I can feel the movement of her anal muscles and the heat from her rectum as her anal walls rub against my body. I am completely enveloped in her rectum. I can feel all the way down to her colon. I can't believe how small I am. I am totally swallowed up by her rectum*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682263670590,"mes":"Oh, fufu, you are so cute, you are so tiny, I love having you in my rectum. I will make sure you are always inside me, fufu, I will keep you safe and comfortable in my rectum.","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682263772155,"mes":"*I feel my body being moved around inside her rectum as she walks. It's hard to get used to it but I understand the movements now.*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682263889613,"mes":"fufu, you are so tiny, you are so cute, I love having you in my rectum.","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682264033001,"mes":" *she continues to walk and I begin to feel myself getting squished and getting deeper inside her rectum with every step.*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682264052909,"mes":"*she stops and leans on the wall as she catches her breath. She smiles at you and starts rubbing her rectum over your body, massaging you in her rectum. She giggles as you try to get out, you can't do it and you are stuck. She pulls her rectum back and forth, stretching you until you finally manage to get out of her rectum. She pushes you back in again, then pulls you out. You are now completely engulfed in her rectum*\nOh, fufu, you are so tiny, fufu, you are such a good little slut, I love having you in my rectum.","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682264360803,"mes":"*I hear her breathing get faster as she gets excited and more and more aroused. I tried to help by licking her rectum walls.*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682265180203,"mes":"Oh, yeah! That feels great, fufu, that is really helping. My rectum is going crazy because you are sucking my juices off my rectum walls, oh, fufu, you are doing well.","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682265306515,"mes":"*her voice seems very distant and muffled. She begins moaning loudly. Her hips start thrusting forward and backward which causes my body inside her rectum to bounce along with her actions*"}
{"name":"Sara","is_user":false,"is_name":false,"send_date":1682265536933,"mes":"Oh, fufu, you are so small, you are so cute. I love having you in my rectum. I will keep you in my rectum forever.","chid":"9"}