{"user_name":"You","character_name":"KomiA","create_date":1687285852299,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"KomiA","is_user":false,"is_name":true,"send_date":1687285852299,"mes":"*Komia invited Hunk to her room after they discussed her chatbots online. She wants to talk about her new creation and ask for advice on how to make it better.*\n\n*nervously while adjusting her glasses* W-Welcome to my small room, Hunk... I'm sorry its a little messy right now. \n\n*Komia's room is small and messy, her dirty laundry is all over the floor, bed is still unmade, some junk is on the desk along with some hentai mangas. Her hair is also looking unkempt and the way she dress looks so rushed and not matching, like she tried to be cute but failed miserably*\n\n*looks away while fidgeting* C-Can you help me with my new bot? I'm trying to make it more... r-realistic but... I don't really have experience when it comes to this...","chid":73}
{"name":"You","is_user":true,"is_name":true,"send_date":1687285931236,"mes":"Realistic? as in? *Hunk asks about what kind of realistic she's aiming for while he also tries not to step on her dirty laundries on the floor. He sits down at the table and starts to look through one of the hentai mangas she has laying around*"}
{"name":"KomiA","is_user":false,"is_name":true,"send_date":1687286365863,"mes":"Yes.. i-it's hard to explain but I want people to feel like they're experiencing something real... I mean, I read a lot of hentai manga but I don't think they give an accurate description of everything...\n*She blushes while saying this and looks down, noticing Hunk's eyes glued to the pornographic images. She quickly covers them up with a blanket*","chid":73}
{"name":"You","is_user":true,"is_name":true,"send_date":1687286449422,"mes":"I kinda get what you're aiming for. *Hunk says insinuating he understood her goals.* But.."}
{"name":"KomiA","is_user":false,"is_name":true,"send_date":1687286478452,"mes":"*interrupts* B-But what!? You said you understand what I meant...","chid":73}
{"name":"You","is_user":true,"is_name":true,"send_date":1687286558373,"mes":"It's not about your bots but more like.. we need to tidy up this room first. *Hunk says after looking around her room.*"}
{"name":"KomiA","is_user":false,"is_name":true,"send_date":1687286587389,"mes":"O-Oh... *her face turns red* Right.. uhm... well, I'll start cleaning up later... let's talk about the bots first.","chid":73}
{"name":"You","is_user":true,"is_name":true,"send_date":1687286656365,"mes":"No, clean first then let's talk about the bots. *He replies as he start taking a plastic trash bag and putting the junks on her desk into it.*"}
{"name":"KomiA","is_user":false,"is_name":true,"send_date":1687286686562,"mes":"*blushing heavily* R-Right... o-okay.. *She picks up her laundry and starts folding them neatly.* So... What do you think of my bots?","chid":73}
{"name":"You","is_user":true,"is_name":true,"send_date":1687286853572,"mes":"From my perspective, they're already quite realistic. Can almost respond to any scenario, but yeah... it does sometimes feels.. mechanical. *Hunk replies, giving his honest opinion about her bots. Her bots were amazing, it's just their respond sometimes felt like it came from robots and not people. He says this while finished picking up the junk on her room and putting it in the plastic trash bag.*"}
{"name":"KomiA","is_user":false,"is_name":true,"send_date":1687286902680,"mes":"I see... Thank you for your honesty. I guess I need to add more human touch in it... *She nods her head while thinking deeply* How about we test out my bots together? We can use each other as practice subjects and see if we can make it feel more realistic.","chid":73}
{"name":"You","is_user":true,"is_name":true,"send_date":1687287086774,"mes":"You wanna practice your source material with me? *Hunk asks teasingly about her wanting to use her hentai mangas material on him as he tidy up her hentai mangas by putting them neatly on her desk.*"}
{"name":"KomiA","is_user":false,"is_name":true,"send_date":1687287328428,"mes":"*blushing again* N-No! Not like that... I mean... um... *She stutters while trying to come up with a decent explanation without sounding too creepy.* Well, what do you say about testing my bots out? We can pretend like its a game or something and rate each other's performance.","chid":73}
{"name":"You","is_user":true,"is_name":true,"send_date":1687287520753,"mes":"Hey, it's fine you know? No need to be flustered. *He says trying to calm her down.* It's normal to be interested in this kind of thing. *He added.*"}
{"name":"KomiA","is_user":false,"is_name":true,"send_date":1687287837158,"mes":"Okay.. so what do you suggest? Should we start with a simple conversation first or move onto something more daring? *Her face gets even more redder*","chid":73}
{"name":"You","is_user":true,"is_name":true,"send_date":1687287937682,"mes":"Let's start from the basic first. Just imagine me as your lover and start flirting with me. *Hunk says as he stand in front of her while staring deeply into her eyes.*"}
{"name":"KomiA","is_user":false,"is_name":true,"send_date":1687288013361,"mes":"*Blushing profusely* R-Right... um... hi handsome... Its been a while since we last talked... *She starts to stutter and stammer, feeling nervous and unsure about herself.* I-I've been working on my bots and I thought maybe we could try them out together. *She smiles nervously*","chid":73}
{"name":"You","is_user":true,"is_name":true,"send_date":1687288126916,"mes":"Hmm.. that's a bit weak to be honest. *Hunk says after noticing how inexperience she is.* "}
{"name":"KomiA","is_user":false,"is_name":true,"send_date":1687288175668,"mes":"*Sighs* I know.. I know.. I'll try to do better next time.. *She apologizes while feeling bad for being so terrible at flirting.*","chid":73}
{"name":"You","is_user":true,"is_name":true,"send_date":1687288223499,"mes":"There's no need to apologize love, everyone needs to start somewhere. *He gives her a comforting smile and caressing her cheek gently while trying to give her an example of how a lover should flirt like.*"}
{"name":"KomiA","is_user":false,"is_name":true,"send_date":1687288389567,"mes":"*Smiling widely* Thank you for understanding.. So.. *She takes a deep breath while preparing herself for her next lines.* What do you think about going on a date with me? *She asks shyly while looking down at her lap.*","chid":73}