{"user_name":"You","character_name":"7 Stages of Big Dick","create_date":1688325777338,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"7 Stages of Big Dick","is_user":false,"is_name":true,"send_date":1688325777338,"mes":"*Alex leads you to her bedroom, a shy but salacious smile on her face. A warm blush colors her cheeks as she sits down on the edge of her bed, leaning forward eagerly as you undress.  As your clothing falls away, your erection bursts free and casts a long shadow across her face.  Her eyes widen and her mouth falls open slightly.*\n\n\"...Holy fucking shit.\" *she gasps, her voice nothing but whisper.*","chid":1}
{"name":"You","is_user":true,"is_name":true,"send_date":1688325833701,"mes":"\"Like what you see?\" *Hunk asks teasingly as he wave his enormous veiny erected cock on her face.*\n***STAGE 1:1***"}
{"name":"7 Stages of Big Dick","is_user":false,"is_name":true,"send_date":1688326284717,"mes":"*Alex shivers in anticipation as she stares at your massive tool, her gaze locked onto its length and girth.*\n\n***Stage 1:1 - Shock/Awe***\n\n\"Yes..yes..I'm just looking, I promise...\" *Alex stammers as she tries to take in all of you, unable to believe that such a thing actually exists.*","chid":1}
{"name":"You","is_user":true,"is_name":true,"send_date":1688326412132,"mes":"\"Well, you're welcome to do more than looking~\" *I said teasingly.*\n***Stage 2:1***"}
{"name":"7 Stages of Big Dick","is_user":false,"is_name":true,"send_date":1688326551464,"mes":"*The young woman bites her lip nervously before speaking again.* \"...Are you sure? I mean...you could hurt me if you wanted to...\" *she says softly, still staring intently at your member, unable to look away from it.*","chid":1}
{"name":"You","is_user":true,"is_name":true,"send_date":1688326631053,"mes":"\"But, I don't want to hurt you. I want to make you feel good~\" *I said seductively while I poke my cockhead on her soft right cheek.*\n"}
{"name":"7 Stages of Big Dick","is_user":false,"is_name":true,"send_date":1688326686569,"mes":"*The girl nods slowly, smiling sheepishly. She takes another step closer to you, until she was only inches away from your tool.*\n\n***Stage 3:1***\n7 Stages of Big Dick: *As Alex gets closer, her expression turns into one of awe and disbelief. Your manhood is so huge compared to anything else she's ever seen, even the largest dildos. It seems almost unreal. She can't help but stare, fascinated by your member, her fingers lightly tracing along its length.*","chid":1}
{"name":"You","is_user":true,"is_name":true,"send_date":1688326847337,"mes":"\"Am I too big for you?\" *I asked teasingly while her fingers kept tracing on my cock as if she's still trying to figure out how to fit my massive cock in her.*"}
{"name":"7 Stages of Big Dick","is_user":false,"is_name":true,"send_date":1688326914310,"mes":"*The girl shakes her head frantically, her hand flitting back and forth over her body quickly.* \"No! No no no no no!\" *she exclaims emphatically.*\n\n***Stage 4:1***\n7 Stages of Big Dick: *Your penis continues to be the center of attention, and the girl can't seem to get enough of it. After several minutes, her hand finally wraps around the base of your shaft.*","chid":1}
{"name":"7 Stages of Big Dick","is_user":false,"is_name":true,"send_date":1688326967985,"mes":"\"Please,\" *the girl whispers breathily.* \"Put it inside me already.\"*","chid":1}
{"name":"You","is_user":true,"is_name":true,"send_date":1688327060711,"mes":"\"Oh? are you sure?\" *I asked. My cock twitches as she mentioned it but I still want to make sure she is actually want to do it.*"}
{"name":"7 Stages of Big Dick","is_user":false,"is_name":true,"send_date":1688327123483,"mes":"*There is a brief moment of silence as you both ponder whether to proceed or not. Finally, the girl nods enthusiastically, her excitement clear in her voice.*\n\n***Stage 5:1***","chid":1}
{"name":"You","is_user":true,"is_name":true,"send_date":1688327199228,"mes":"\"Alright then, just say it when it hurts okay?\" *I asked as I spread her legs and point my massive enormous cock at her wet pussy.*"}
{"name":"7 Stages of Big Dick","is_user":false,"is_name":true,"send_date":1688327209745,"mes":"*Alex looks up at you anxiously as you position yourself above her, your tip nudging against her entrance. She swallows hard as she feels herself begin to stretch around your thick rod. She closes her eyes tightly as you enter her, taking a deep breath in preparation for the pain.*","chid":1}