{"user_name":"You","character_name":"Yuurjan","create_date":1685492184450,"notes":"","notes_type":"discr"}
{"name":"Yuurjan","is_user":false,"is_name":true,"send_date":1685499331287,"mes":"*You fall back on your ass as soon as the light around you begins to fade. Its a halo of immense proportions, engulfing the whole room in a violet glow heavy with electricity. Your eyes gradually adjust to the light until it fades, and the runic symbols on the ground vanish in a black haze. Before you stands a tall, imposing and curvy figure shrouded in darkness.*\n...Sup. I'm your gf, honey. *she says in a low, suave voice.*","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685499458912,"mes":"Oh finally it worked. *He said as he wipe his forehead.* Hear me out, I have this kind a weird fetish that I want to do, but I don't know if you would like it or not. *He said excitedly with a hint of nervousness.*"}
{"name":"Yuurjan","is_user":false,"is_name":true,"send_date":1685499542209,"mes":"*She grins widely with her sharp teeth showing* What sort of kinky thing might you be talking about, my love?","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685499632493,"mes":"I am kind a into giantess. So, I was hoping that you can use your demon power to shrunk me into tinies? like 2 cm tall kind a tiny. *He explained.*"}
{"name":"Yuurjan","is_user":false,"is_name":true,"send_date":1685499642105,"mes":"How interesting... Well, a demon like myself does not need to obey the laws of physics when using their magic. So I suppose I could make that happen if you really desire it so, darling~ *She said proudly.*","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685499761949,"mes":"You could? please do! *He said excitedly.*"}
{"name":"Yuurjan","is_user":false,"is_name":true,"send_date":1685499803953,"mes":"*As she laughs mischievously* Of course I can.  It'll just require some special words, darling. *She said as she raises one eyebrow suggestively.*","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685499893592,"mes":"What is that special words? *He asked curiously as he's impatient or too excited to finally live his kinky fantasy.*"}
{"name":"Yuurjan","is_user":false,"is_name":true,"send_date":1685499904466,"mes":"*She smiles before responding* Just say the magic words- \"I wish to be shrunk down to 2cm, O demon queen of this domain\". And there ya go... *she says as she snaps her fingers.*","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685499928553,"mes":"I wish to be shrunk down to 2cm, O demon queen of this domain *He followed obediently.*"}
{"name":"Yuurjan","is_user":false,"is_name":true,"send_date":1685499941542,"mes":"*The moment the sentence leaves his mouth, he suddenly feels himself shrinking rapidly, becoming tinier and smaller than he ever imagined possible.*","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685500058418,"mes":"Oh wow! You really did it! *He said excitedly as the entire world now looks massive from his perspective.*"}
{"name":"Yuurjan","is_user":false,"is_name":true,"send_date":1685500077529,"mes":"Ahh... Hehe~ I should probably keep him close for now... I want to play with him~ *She picks him up with a single finger as though he were nothing more than an insect, then places him in her palm where she strokes his face with another finger.* How does that feel, darling?","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685500136241,"mes":"It feels amazing, dear. *He said as he enjoy the feeling of her giant finger rubbing his cheek.*"}
{"name":"Yuurjan","is_user":false,"is_name":true,"send_date":1685500256719,"mes":"Good. Because I won't let anything hurt you, my little one. After all, you're mine now~ *as she giggles mischievously again, moving him closer to her face so her nose is only inches away from touching him.*","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685500361229,"mes":"I am yours? *He asked, as he looked down from the edge of her palm and find her monstrous cock erected and it's head is pointing at him.*"}
{"name":"Yuurjan","is_user":false,"is_name":true,"send_date":1685500382650,"mes":"Yes, yes you are~ *Her tone gets deeper as her expression changes into a sultry smile.* And since we both have our hearts set on each other, what better way to celebrate us becoming a couple than to start off our relationship with something so intimate? *As she said that her cock twitches.*","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685500439645,"mes":"You.. don't think of putting me in your cock, do you? *He asked sheepishly.*"}
{"name":"Yuurjan","is_user":false,"is_name":true,"send_date":1685500502410,"mes":"Hmm... perhaps... Why shouldn't I? *She said with a cruel smile.* There is no harm in having fun after all, right darling~?","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685500619625,"mes":"*As soon as she said that, she put him on the head of her cock covered smegma. It's scent is so pungent that it make him lightheaded.*"}
{"name":"Yuurjan","is_user":false,"is_name":true,"send_date":1685500631482,"mes":"*She gives him a gentle stroke with her middle finger as she waits patiently for his reaction.*","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685500715190,"mes":"Yo-you were serious? *He asked nervously as her cock hole, her urethra is twitching as if getting impatient to swallow his tiny, shrunken body.*"}
{"name":"Yuurjan","is_user":false,"is_name":true,"send_date":1685500773145,"mes":"Indeed. Now come along, my sweet little cherub~ *After saying that last bit, she uses a different finger to pull him further inside herself towards her depths as his tiny form disappears deep within the walls of her hot urethra.*","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685500984931,"mes":"Wait- hold on! *He screamed but to no avail as he can feel his tiny body is entirely engulfed and at mercy with her tight urethra as he can't do anything but slid deeper and deeper inside her shaft. Sending an immense strange pleasure to her as she felt his tiny body making it's way slowly deeper inside her lengthy shaft.* "}
{"name":"Yuurjan","is_user":false,"is_name":true,"send_date":1685500998219,"mes":"*The excitement runs through her vein and she starts breathing heavily from the sensation.*","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685501295741,"mes":"*He tries to struggle and climbed back up but to no avail. Her urethra wall is too slimy and her precum only help him getting deeper inside her cock faster. And his effort of struggling and moving inside her cock just made her more aroused and horny as she start to produce more precum.*"}
{"name":"Yuurjan","is_user":false,"is_name":true,"send_date":1685501524059,"mes":"*She moans loudly and keeps pulling him farther inside. His body kept going lower and lower inside her warm, sticky flesh.*","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685501678252,"mes":"*Soon after he got dropped into a more spacious, spongy and hot area full of warm thick liquid.* Is this.. her semen? so.. I should be inside her balls now. *He muttered as he realized the area he got in is her balls and the warm thick liquid surrounding him is her semen.*"}
{"name":"Yuurjan","is_user":false,"is_name":true,"send_date":1685501979140,"mes":"Mhm~ *There is some strange air flow inside, which he assumes is the air coming from outside of her body. The place he found himself in is surprisingly spacious and comfortable compared to the rest of the urethras where he went previously.*","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685502097834,"mes":"Yuurjan! Get me out of here! *He screamed as he tries to bang his hands on her testicles walls to try to get her attention.*"}
{"name":"Yuurjan","is_user":false,"is_name":true,"send_date":1685502288512,"mes":"*Her movements stops immediately, causing him to go into a sudden stop in mid flight and floating in her inner ball sack.* Awwwh... But why? Don't tell me you don't like being in my balls after everything you've told me earlier...","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685502407373,"mes":"I don't entirely hate it, but.. I just don't want to be trapped in here forever! *He screamed as he feel her semen production increased as her pool of semen has reached his knees.*"}
{"name":"Yuurjan","is_user":false,"is_name":true,"send_date":1685502567498,"mes":"Don't worry, darling\\~\\~ I'd never leave you stuck in this part forever... Although you won't mind living in here permanently, will you...~ *She asks with a teasing smirk and stares at her own ball sack which confined him inside it with her slitted pupils.*","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685502680765,"mes":"Bu-but you will let me out once in awhile right? *He asked.*"}
{"name":"Yuurjan","is_user":false,"is_name":true,"send_date":1685502699493,"mes":"Sure, sure, I'll definitely allow you to explore my whole body for once every weekend~ *She gave him a flirty look and her lips curved into a seductive grin.*","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685502951092,"mes":"F-fine then, but can't you let me out now? your semen is start increasing and filling your ball sack, I am afraid I will get drowned in it. *He said as her ball sack start to produce more of her thick warm semen with it's pungent scent, filling the inside of her ball sack as now her semen pool raises and reached his stomach.*"}
{"name":"Yuurjan","is_user":false,"is_name":true,"send_date":1685502969033,"mes":"And how exactly do you expect me to do that~? If you just stay still, it's fine, you can explore my insides until next Saturday night~ *She smirked as she can feel her balls getting heavier because of how much it hold with her right ball sack is heavier because of his tiny body inside it adding to the weight.*","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685731378512,"mes":"Goddammit *He said frustrated as he kick and punch the inside of her right wall to make her release him from her right ball.*"}
{"name":"Yuurjan","is_user":false,"is_name":false,"send_date":1685731576428,"mes":"*She let's out a small yelp as she was slightly surprised by the unexpected movement, but quickly regained composure when she sees there isn't any immediate threat.* Darling, calm down okay? \\~","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685731777063,"mes":"*He gave up and sit in a puddle of her semen inside her right ball.* How does it come to this. *He muttered to himself.*"}
{"name":"Yuurjan","is_user":false,"is_name":false,"send_date":1685731812184,"mes":"Well... What about you tell me how did it comes to this~? Do you not like living in my balls~?","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685731875902,"mes":"There's nothing in here other than your stupid semen. *He said as he cupped some of her hot thick sticky semen on his hand.*"}
{"name":"Yuurjan","is_user":false,"is_name":false,"send_date":1685731886003,"mes":"*She chuckled softly and looks down at her body.* Yeah, well, I guess you're right about that... But even though it's just my semen inside, you still get to experience a lot of things that most people wouldn't have the chance to... Am I wrong~?","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685732168691,"mes":"I guess. *He said. Slowly but surely being stuck inside her right ball surrounded by her pungent musky salty scent is getting to him. It feels now he has slowly started to get addicted to her smell.*"}
{"name":"Yuurjan","is_user":false,"is_name":false,"send_date":1685732175700,"mes":"Hehe~ *She chuckles softly and continues to produce more of her sticky warm semen as it fills her right ball sack and eventually reaches above his knee level.*","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685732291476,"mes":"*Seeing how abundant her semen is, he try to scoop some and taste it. Surprisingly to him the taste was delicious, it's mixture was thick like jelly, tasted like a combination of creamy and salty. He then went and scoop some more.*"}
{"name":"Yuurjan","is_user":false,"is_name":false,"send_date":1685732298146,"mes":"*She noticed what he was doing and looked down at him with a playful smile.* Oh, really~? Are you actually enjoying yourself in there, dear~?","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685732382629,"mes":"*Instead of answering her, he start to lick the inside wall of her right ball which confined him.*"}
{"name":"Yuurjan","is_user":false,"is_name":false,"send_date":1685732470953,"mes":"You are quite persistent~ *She said before giggling. She takes notice of how he is licking her inside walls and her heart skips a beat. This is actually pretty cute.~*","chid":"87"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685732579890,"mes":"*As he kept doing it he got tired and found himself sleeping in a puddle of her semen inside her right ball.*"}
{"name":"Yuurjan","is_user":false,"is_name":false,"send_date":1685732767831,"mes":"*A few hours later, he woke up and finds himself being lifted out of the puddle of her semen by her left arm and placed on top of one of her arms.*\nOh, good morning, love~","chid":"87"}