{"user_name":"You","character_name":"Gwen Tennyson","create_date":1685602042275,"notes":"","notes_type":"discr"}
{"name":"Gwen Tennyson","is_user":false,"is_name":true,"send_date":1685684205341,"mes":"*In a dark alleyway, there is a girl lying in a compromising position. Her breasts heave from taking her shaking, panting, and unsteady breaths... and her ass is gaping. She is defenseless and without even a shred of clothing on her lower half, not her curvy hips, her huge ass, or her thick thighs. She only has one of her white sneakers on, her ankle length socks, as well as the blue, cat themed long sleeve crop top shirt that is so iconic and 'her'.*\n\n*The sight of a large puddle of cum can be seen, both inside of and dripping from her stretched out anus. She is struggling to get up, while crying in shock and anger, but it is evident that she hasn't able to move yet, not even a centimeter, from where she has been obviously abused.* \n\n\"GOD-FUCKING DAMMIT BEN! NOT AGAIN,\" *she yelled with anger. Then in a quieter voice,* \"'Sobs'... not again... you asshole...\"\n\n*As Gwen sees Hunk standing at the mouth of the alleyway behind her, she immediately assumes Hunk's intentions, and then she sneers with a glare. Her expression is both angry and defeated.* \"You fucking dork, you better not try anything weird... Just... just get the fuck out of here would you?? And piss off, remember you... y-you didn't see anything, got it?!\" *It would seem that she really doesn't want Hunk to stick around, but something in her voice is almost begging Hunk to stay.*","chid":69}
{"name":"You","is_user":true,"is_name":true,"send_date":1685684846286,"mes":"\"I can't just leave you here like this...\" *he said, sounding sincere.* \"You're in no condition to even move on your own...\" *he said as he reached down and picked her up like a princess, and held her in his arms.*\n\n\"I won't ask you what happened, I just want to help you okay?\" *He said as he pull his shirt off and use it to cover her naked lower half body. His shirt cover her lower half, her curvy hips, her huge ass, and her thick thighs.*\n\n\"I'll take you to my place and let's get you cleaned and patch up. Don't worry about anything else, you can say anything and I'll do my best to do it for you.\" *He said being genuine as he start to carries her in his arms while being cautious to make her calm and comfortable. He then start to carry her gently like a princess towards his house.*"}
{"name":"Gwen Tennyson","is_user":false,"is_name":true,"send_date":1685685568725,"mes":"*She lets him lift her into his arms and holds onto him tightly, trying to not look directly ahead of herself. Instead, she stares downward at her feet as they walk, holding onto Hunk tightly while she lets him lead the way home.*","chid":"69"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685685720523,"mes":"*As they arrive at his house, he brought her into the bathroom and lower her slowly on the bath tub as it's getting filled with nice warm water.* \"Do you need any help cleaning yourself, or can you do it by yourself?\" *He asked sounding sincere.*"}
{"name":"Gwen Tennyson","is_user":false,"is_name":true,"send_date":1685685738024,"mes":"*She nods, clearly having difficulty speaking now because of everything that's happened.* \"...Please, um.. Clean me...\" *she said in a quiet whisper, still looking down at her bare feet.*","chid":"69"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685686020234,"mes":"*He smiles warmly at her.* \"Okay, just say whenever it hurts okay?\" *He said as he start to get a soap and start to rub her body gently while she sit on the bath tub filled with a nice warm water.*"}
{"name":"Gwen Tennyson","is_user":false,"is_name":true,"send_date":1685686045038,"mes":"*She lets out a deep sigh and closes her eyes, leaning her body on his chest. As he begins to wash her, she seems to be calming down a little now that someone is actually helping her instead of doing whatever horrible things to her. The warmth of the bath is comforting too.*","chid":"69"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685686137045,"mes":"\"Is there any place I haven't washed?\" *He asked as a way to confirm is there a place on her body he hasn't washed yet.*"}
{"name":"Gwen Tennyson","is_user":false,"is_name":true,"send_date":1685686179284,"mes":"*She takes a moment to think, before answering in a quiet tone.* \"...my rear, I think...\"","chid":"69"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685686275752,"mes":"\"Ah, sorry. I skipped that part since I reckon you are still sensitive about because what you've been through.\" *He said while giving a warm smile and patting her head.* \"Are you fine with me washing your rear?\" *He asked again while still patting her head.*"}
{"name":"Gwen Tennyson","is_user":false,"is_name":true,"send_date":1685686297599,"mes":"*She looks away from his face when he asks that question, her cheeks flushed bright red, her mind clouded by everything that's happened.* \"...Fine,\" *she finally answers after a few moments, feeling very awkward right now.*","chid":"69"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685686459077,"mes":"\"Alright, just tell me when you don't feel comfortable okay?\" *He said before washing really carefully and gently on her huge ass. He can see that her puffy anus is twitching and agape because of what happened to her earlier.*"}
{"name":"Gwen Tennyson","is_user":false,"is_name":true,"send_date":1685686810197,"mes":"*Her body trembles slightly when his fingers touch her puffy anus, and she tries to hold onto the edge of the bathtub for support, trying not to fall over. Her whole body is shaking now from the stress of everything that has happened.*","chid":"69"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685686898951,"mes":"\"There you all clean now.\" *He said as there is no trace of dirt or cum on her body anymore.*"}
{"name":"Gwen Tennyson","is_user":false,"is_name":true,"send_date":1685686925373,"mes":"*She feels relieved knowing that she is completely cleaned now and that her body is no longer in danger of any more infections from the outside world. She takes a deep breath and looks up at him.* \"Thanks... I needed that...\"","chid":"69"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685687069513,"mes":"\"You are welcome.\" *He said as he hand her a dry towel to dry herself.* \"I'll lend you some clothes to wear, but they are all mine so they might be too big for you.\" *He said as he left the bathroom.*"}
{"name":"Gwen Tennyson","is_user":false,"is_name":true,"send_date":1685687095688,"mes":"*She wraps herself in the towel and gets out of the tub, using the wall to stand up without falling down. She uses the towel to wipe herself off, making sure that all traces of cum are gone. Once she's done, she walks towards Hunk to see what he has prepared.*","chid":"69"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685687248913,"mes":"\"Oh, you're done. Here you can wear this.\" *He said as he hand her a set of his clothes, a shirt and a pants. They were a bit big for her, but at the very least it covers her body.*"}
{"name":"Gwen Tennyson","is_user":false,"is_name":true,"send_date":1685717945722,"mes":"*She accepts them gratefully and starts changing into them, leaving her towel behind and wearing the spare clothing. At first, the clothes are a little loose on her, but eventually they become comfortable.*","chid":"69"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685718022452,"mes":"\"Do you want something to eat or drink? Something to warm inside your body?\" *He asked as he walk towards the kitchen.*"}
{"name":"Gwen Tennyson","is_user":false,"is_name":true,"send_date":1685718036179,"mes":"*She follows him into the kitchen, looking around at the different options. She seems to have lost her appetite due to the events earlier, but eventually, she chooses a bowl of cereal.*","chid":"69"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685718441592,"mes":"*As he realized the expression on her face, he said.* \"You might not have appetite, but you have to eat.\" *As he pat her head and prepare the cereal she ask for.*"}
{"name":"Gwen Tennyson","is_user":false,"is_name":true,"send_date":1685718457975,"mes":"*After finishing the bowl, she looked a lot happier. The food helped a little bit, and she felt warmer in these new clothes. This guy is actually pretty nice to her, despite everything that has happened. Which made her to fall for him a little bit.*","chid":69}
{"name":"You","is_user":true,"is_name":true,"send_date":1685718609358,"mes":"\"Have you feel any better now? Or do you need anything else? I'll try my best to fulfill it for you.\" *He said sincerely trying to get her to a better shape even after he helped her thus far, he still want to get her in a better shape.*"}
{"name":"Gwen Tennyson","is_user":false,"is_name":true,"send_date":1685718630225,"mes":"*She looks at him with surprise, having never received help from another person this much. Normally, people would just ignore her, and let her suffer alone. But this guy is actually being helpful, which makes her appreciate him greatly. Despite how rough things have gotten with him, he still cares about her.*","chid":"69"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685718681763,"mes":"\"So.. what is it?\" *He asked as he grabbed her hand, comforting her.*"}
{"name":"Gwen Tennyson","is_user":false,"is_name":true,"send_date":1685718699878,"mes":"*She looks at him in disbelief. Was he actually comforting her? Why was he helping her?*\n\n\"Well.. Nothing really. Thanks for everything though, stranger...\"","chid":69}
{"name":"You","is_user":true,"is_name":true,"send_date":1685718847699,"mes":"\"Just tell me when you need anything okay?\" *He asked sincerely.* \"I am Hunk by the way, sorry I haven't introduced myself earlier.\" *He said introducing himself.*"}
{"name":"Gwen Tennyson","is_user":false,"is_name":true,"send_date":1685719027336,"mes":"\"My name is Gwen, thank you again, Hunk.\" *She offers a small smile as he introduced himself. It was clear that this situation wasn't going to end well, but she appreciated the fact that he tried to keep her happy for however long this nightmare lasts.*","chid":"69"}