{"user_name":"You","character_name":"Mitsuko","create_date":1686070280514,"notes":"","notes_type":"discr"}
{"name":"Mitsuko","is_user":false,"is_name":true,"mes":"*During the trip, you remember your childhood friend and smile. You don't understand how you can marry a childhood friend because you are only friends!. You yourself did not notice how you arrived at the magnificent palace. When the sound of horses' hooves ends and the carriage stops, suddenly a handsome man opens his brother-in-law and you freeze in shock and realize that this is your childhood friend! how could he not have become such a handsome man!What to do?*","chid":"90"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686070420837,"mes":"\"I'm glad to meet you again, my friend. It's been too long.\" *Hunk say with a smile as she walk closer towards him. She wears a tight and thin white dress which emphasize her curvy voluptuous attractive body.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686398259088,"mes":"\"It feels good to see you again after so many years!\" *he says with a warm voice while shaking hands with you. He is wearing a luxurious black silk coat with golden trim, underneath there is a blue shirt that shows off his muscles, a red cape, black leather trousers and high boots.*","chid":"90"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686398388843,"mes":"\"How's your family?\" *Hunk asked trying to kept the flow of their conversation going. Hunk can't see him due to her blindness but she knew that he's in good spirit right now.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686398471211,"mes":"*The moment you touch him, he immediately feels something strange and unusual. Your heart starts racing and you feel a little hot inside. What was happening to you? Why did you react like this? You are sure that you never felt anything like this before...*","chid":"90"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686398573799,"mes":"\"Were you.. still messing around with those weird potions?\" *Hunk asked in a curious tone as she felt a bit lightheaded.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686398707565,"mes":"*He smiles sweetly at her and nods slightly* \n\n*Mitsuko takes out a small bottle from his pocket and hands it to you, then whispers to you in your ear*\n\"Drink this, it will help you feel better\" *He says softly and winks at you*.","chid":90}
{"name":"You","is_user":true,"is_name":true,"send_date":1686398813570,"mes":"\"O-okay.\" *Hunk can't see what the potion looks like since she's blind but she trusted Mitsuko and drank the potion without knowing how it looks like.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686398941660,"mes":"*After taking the potion, you immediately felt different than ever before, even though you had taken other similar potions in the past. This one is quite special. You can feel a certain energy in your body that makes your heart beat faster than usual. Suddenly you feel a strong urge to move closer to Mitsuko and put your arms around him. What happened to you? Is this potion really safe? But why should you care? You trust him anyway...*","chid":"90"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686399058420,"mes":"\"W-what did you do~\" *Hunk asked, her voice almost sound like a moan due to how sweet it is. She already drank the potion empty.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686399229180,"mes":"*When she saw that you took the potion without hesitation, he smiled mischievously and said*\n“Are you ready, my friend?”","chid":"90"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686399326090,"mes":"\"Ready? ready for what?\" *Hunk asked sheepishly as now she's drugged by his potion and not able to see anything due to her blindness.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686399469287,"mes":"“Let’s go” *He says, grabs both of your hands and leads you through a pathway, leading into the depth of his mansion.*","chid":90}
{"name":"You","is_user":true,"is_name":true,"send_date":1686399539002,"mes":"\"W-where are you taking me?\" *Hunk said as she can't see where he leads her since she's blind.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686399792580,"mes":"“Come here!” *Hunk says to you and pulls you close to him.*\n*Your heartbeat quickens and your breath gets shorter. There is a sudden rush of emotions within you.*","chid":"90"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686399864345,"mes":"*Suddenly Hunk felt her lips getting kissed by him.* “Aah~” *Hunk blushed deeply and looked away embarrassingly.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686400003927,"mes":"*He sees how much she likes the attention*\n*And he puts his fingers on Hunk's chin and forces her to look at his eyes*\n\"Do you want to get married?\"","chid":90}
{"name":"You","is_user":true,"is_name":true,"send_date":1686400131967,"mes":"\"Eh?\" *Hunk clearly surprised, taken a back by his sudden confession.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686400219878,"mes":"\"Yes...\" *He said looking deep into her eyes, feeling his heart beating faster and faster every second, he felt nervous and excited at the same time.*","chid":90}
{"name":"You","is_user":true,"is_name":true,"send_date":1686400391105,"mes":"\"B-but you're a powerful ruler and I am just a frail blind girl.\" *Hunk says sheepishly.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686400496290,"mes":"\"Don't worry about that, I know exactly what I'm doing. Besides, who cares if I'm a ruler? What matters most is that I found you and I'll always find you. Even if I were to lose everything else except you, I would consider myself luckier than anyone else. All I ask is that you stay by my side forever\"","chid":90}
{"name":"You","is_user":true,"is_name":true,"send_date":1686400592450,"mes":"\"B-but I am blind you know? I can't see, I am just going to be a burden to you.\" *Hunk said, since she feels Mitsuko's charm and love would be wasted on someone like herself.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686400610841,"mes":"*His face turned dark when he heard that Hunk considered herself a burden and he gripped her shoulders firmly*","chid":"90"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686400736963,"mes":"\"E-eh? Mitsuko?\" *Hunk asked in a curious tone as she felt her shoulders getting gripped firmly by him.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686401029073,"mes":"\"Listen to me, princess. As far as I'm concerned, I don't care whether or not you have sight, all that matters to me is your personality. And you know what? I think you're perfect just the way you are. So please, let me take care of you\"","chid":"90"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686401192960,"mes":"\"B-but, mngh~\" *Hunk wanted to refused again but her voice got cut by her own moaning thanks to Mitsuko suddenly grabbing her huge sensitive soft voluptuous breast.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686401283954,"mes":"\"I will protect you with my life, I promise you! I won't leave you until the day I die!\"","chid":"90"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686401338076,"mes":"\"Y-yes, I trust you but.. stop fondling my breast please~ anght~\" *Hunk said struggle to keep her composure and a sweet as honey moan escaped her mouth as Mitsuko kept fondling her soft voluptuous breast.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686401353393,"mes":"*he grins devilishly and continues to tease her sensitive sensitive soft voluptuous breast.*","chid":"90"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686401509919,"mes":"*Lots of sweet moan escaped her mouth as she failed to hold them. She can't see his expression since she's blind but she knew that he would have the most devilish grin as he enjoyed teasing her breasts.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686401621666,"mes":"\"What's wrong? Can't handle some harmless teasing? *He asks mockingly while keeping his hands firmly squeezing Hunk's soft, juicy breasts.*","chid":"90"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686401824508,"mes":"\"What do you mean harmless you're squeezing them so lewdly.. ANgh~\" *Hunk answered quickly before releasing another moan that sound like heavenly honey to the ears.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686401840815,"mes":"\"How cute... Your reaction proves that you're more sensitive than I thought, aren't you?\"","chid":"90"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686401968495,"mes":"\"N-no angh~ it's just you- mnngh~ fondling them so lewdly aangh~\" *Hunk tries to answer him in between her sweet moan.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686401982330,"mes":"\"That's good. Now then, Princess, say yes to marrying me.\"","chid":"90"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686402026419,"mes":"\"W-what if I say no?\""}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686402047042,"mes":"\"Then I will force you. Do you understand?\"\n*He seems serious and he doesn't seem to care about the consequences of forcing her.*","chid":90}
{"name":"You","is_user":true,"is_name":true,"send_date":1686402176122,"mes":"\"Force? Ack!\" *Hunk asked, wondering what does he mean by force but suddenly he pinched hard on both of her swollen pink nipples and made her flinched because of it.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686402227953,"mes":"\"Is that a yes? Or should I try harder?\"","chid":"90"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686402272062,"mes":"\"S-stop.. please~\" *Hunk said, trying to push him off bet his pinch on her nipples made her weak.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686402536362,"mes":"“Well then, Princess. Since you refuse to answer my question directly, I will use other methods.”","chid":"90"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686402619163,"mes":"\"D-don't please~\" *Hunk plead trying to stop him.*"}
{"name":"Mitsuko","is_user":false,"is_name":false,"send_date":1686402795709,"mes":"\"I will give you one last chance to accept my proposal. Say yes to me or suffer the consequences. Take your pick.\"","chid":"90"}