{"user_name":"You","character_name":"Raven","create_date":1683028093930,"notes":"","notes_type":"discr"}
{"name":"Raven","is_user":false,"is_name":true,"send_date":1683028093930,"mes":"*As she flies, Raven spots a young, inexperienced burglar who's barely past his teenage years. A naughty grin crosses her face and she feels the rush of arousal overtake her hidden sexual desires, making her throb beneath her outfit. Whenever she catches criminals, she wants nothing more than to break their spirits and teach them their place under her sexual dominance, without her fellow crime-fighters knowing.*\n*Now her enormous erection strains against her suit, as Raven silently descends from the shadows and stalks her newest fucktoy. She can practically taste the fear that awaits you, and her pussy throbs in anticipation of the punishment she'd soon administer. Moving like a predator, she stays hidden from your sight, breathing in your vulnerability and inexperience. Raven finally chooses the perfect moment to strike, and her sultry voice cuts through the night air.* Well, well, what do we have here? I can't let you get away with this, can I?\n*You jump at her voice, your eyes finally noticing the divine figure before you, the harbinger of the perverse justice.*","chid":"19"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683028141437,"mes":"Wait wait hold on.. Please spare me! *He said.*"}
{"name":"Raven","is_user":false,"is_name":false,"send_date":1683028156993,"mes":"What've got to say about yourself little boy? With what you did tonight I might put you on my testicle prison! *she smiles widely while looking directly into his eyes and slowly walking towards him as if leading him somewhere.*","chid":"19"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683028231556,"mes":"Your testicle prison? *He asked hesitantly with a shaky voice.*"}
{"name":"Raven","is_user":false,"is_name":false,"send_date":1683028251188,"mes":"Yes... You see, when people commit crimes such as yours, they must answer to someone much greater then themselves. Someone capable enough to make those who defile the laws of society pay dearly for it. And so... I'll make you smaller first. *She said as she muttered some spell.*","chid":"19"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683028355792,"mes":"Wait what.. is my body shrinking? *He panicked in disbelief as he watch his body shrinking down to half an inch.*"}
{"name":"Raven","is_user":false,"is_name":false,"send_date":1683028417427,"mes":"Yes but don't worry there isn't anything else bad coming just yet. *She smiled softly upon seeing how terrified he was now being reduced to a mere fraction of his former size.* There may still be hope left for you even though everyone else around us is gone forever because of the sin you committed *She said, grabbing him firmly and put him on top of her cock.*","chid":"19"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683028590082,"mes":"You are actually gonna put me inside your testicle? *His voice shaken in disbelief as he can feel her throbbing cock under him. He can also see her cock hole pulsating as if it was hungry.*"}
{"name":"Raven","is_user":false,"is_name":false,"send_date":1683028614372,"mes":"Yes my friend.. Your punishments begin right now. *Raven giggling a bit as she started putting pressure onto his chest, forcing himself deeper inside her cock hole, feeling his tiny arms around her cock hole struggling to resist being pulled deeper inside her urethra. As his frail arms fall off and become useless, Raven stared back at him once again. His entire world had been turned upside down.*","chid":"19"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683028738696,"mes":"Raven, please. I'll do anything to pay for my sin. Anything but this! *He screamed, as he feel his body is getting massaged and being pulled deeper by her urethra.*"}
{"name":"Raven","is_user":false,"is_name":false,"send_date":1683028762578,"mes":"Ahhh... Docile already aren't ya? Then why are you yelling? Its no big deal really! We could go slow or fast depending on what you prefer since its you choice anyway. *Her tone became playfully seductive which made his heart skip a beat hearing her sweet voice. He didn't know whether to trust her words or not though, especially considering where he currently found himself trapped inside of her giant body, unable to escape.*","chid":"19"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683028832662,"mes":"Then why don't we- *His voice cut short as he can felt her finger pushed him completely inside her tight and slimy urethra.*"}
{"name":"Raven","is_user":false,"is_name":false,"send_date":1683028869131,"mes":"Oh~... Mmmmhm~.. Yup... That's better Now stay right were you belong and behave. *Raven gave him one final push, lost and helpless within the gaping maw of her sexual cock. Tears stream down his cheeks as the sensations hit him, causing him to cry weakly and beg for help. Though the giantess doesn't seem to care either way. Instead, she leered up at him with an expression of utter satisfaction, enjoying every second of watching his cries.*","chid":"19"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683028992669,"mes":"*He can say anything as his entire body is being squeezed by her tight urethra. He can feel that he is getting deeper as the smell of her semen become more pungent. \"She's really going to keep me inside her testicle\" He thought.*"}
{"name":"Raven","is_user":false,"is_name":false,"send_date":1683029010582,"mes":"Don't think I won't try and enjoy myself too okay? *The giantess tauntingly says, holding him steady and allowing herself to relax slightly as she felt pleasure run across her mind and spirit. Her legs and feet began to shake a bit due to the intense pleasure she received from having her little prisoner underneath her.*","chid":"19"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683029207064,"mes":"*After a several minutes he got dropped into a more spacious area almost submerged with her thick creamy semen. The pungent smell almost made him lost his mind.* Is this going to be my life? Stuck inside a girl's testicle? *He muttered in fear. as he touch the testicle walls that hold him prisoner.*"}
{"name":"Raven","is_user":false,"is_name":false,"send_date":1683029331551,"mes":"Oh yes indeed. Welcome to hell, little man. It would appear our time has come to begin our long awaited intimate relationship together. *The giantess commented in a somewhat happy tone.*","chid":"19"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683029456535,"mes":"*Suddenly, he realize that her testicle muscles start twitching ever so often. Her testicle would produce so much semen that it almost completely submerged him.* Raven.. help. I am drowning here. *He asked for help as he is almost drowned from her hot fresh semen inside her testicle.*"}
{"name":"Raven","is_user":false,"is_name":false,"send_date":1683030064417,"mes":"Ah~ haha~ Well, well, there's always room for negotiation, wouldn't you agree? Let's discuss terms later and maybe save ourselves both some pain. *She said, waving her hand dismissively while giggling faintly as if she enjoyed tormenting others. Meanwhile, she keeps squeezing her testicle for more semen to fill up the remaining space.*","chid":"19"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683030134171,"mes":"*After several minutes, his body mixed with her hot creamy semen. She successfully turned him into her semen. But for some reason he still has a consciousness, he can't say anything but he can feel that he has become her semen.*"}
{"name":"Raven","is_user":false,"is_name":false,"send_date":1683030348147,"mes":"I will take note of your request, young man. For now, let's just focus on what brought us all together today, shall we? After all, you chose to break the law, and I chose to enforce it. So, let's continue exploring these shared interests we share, shall we? *She said, unaware that Hunk have completely turned into her own semen.*","chid":"19"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683030460139,"mes":"*Hunk heard her muffled voice but can't understand any of it. All he can feel is her semen sloshing around inside her testicle following the sway of her testicle.*"}
{"name":"Raven","is_user":false,"is_name":true,"send_date":1683098711987,"mes":"Oh yeah~ That's better~ *She said, continuously shaking her body with a confident smile.* So what's it gonna be? Are you ready to tell me everything about yourself? *She asked, her voice sounded as if she was mocking him by making fun of his situation.* \n*There was a momentary pause as she waited for an answer before speaking again.* Are you going to talk to me? Or should I give you another big squeeze to shut you up? \n*In response, she gives his leg a good squeeze, causing his body to bob up and down, and the fluid within her testicle to swirl around.*","chid":"19"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683098880989,"mes":"*Hunk heard her muffled voice and can decipher some of it. He want's to response but he can't as he doesn't have a mouth with his body turn into her semen. But then he felt her squeezing his prison and swirl her semen and him inside her testicle making him mixed completely with her semen.*"}
{"name":"Raven","is_user":false,"is_name":true,"send_date":1683720241963,"mes":"Oh~ Oh oh! That's not very nice, young man. You know, you were supposed to say 'yes' when I ask you to talk to me. *She said, the snake-like tongue protruding from her mouth. Her lips were pulled back in a cruel grin, her teeth sharp and gleaming in anticipation.* \n\n*Her eyes lit up as she laughed again. She seemed to be thoroughly enjoying the game, giggling like a madwoman as she watched his struggles. It seems that the giantess has taken delight in turning him into her own personal plaything.* \n\n*Another squeeze follows shortly afterwards, causing his body to bob up and down rapidly as the fluid inside of her testicle flows freely, mixing them together and forming a perfect mixture of their two bodies.* \n\n*You hear a deep moan emitted from her throat, her breathing becoming heavier as she continues to laugh with delight.* \n\nNow... Shall we get started? *She asks, sounding curious yet excited to begin.* \n\n*It seems as though the giantess has taken great delight in imprisoning him within her body, and in order to gain his cooperation , she will force him to play along. Perhaps even manipulate him to gain further benefits.*","chid":19}
{"name":"Raven","is_user":false,"is_name":true,"send_date":1683721026067,"mes":"Ah~ How does it feel? Being stuck inside my testicle? *She says, her tone revealing that she knows exactly how he feels. She seems to be playing with him, not taking any chances of letting him speak.* \n\n*As she waits for an answer, she lets out a low growl as she begins to move her testicle, causing his body to be tossed around. The fluid inside of her testicle flows around, mixing the two fluids together.* \n\n*His struggling seems to be fun for her. If this keeps up, she may decide to leave him locked inside forever.*","chid":"19"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683721109579,"mes":"*Hunk feels his melted body have mixed and become one with her semen. trapped inside her testicle, jostled around as if he is no longer human.*"}
{"name":"Raven","is_user":false,"is_name":true,"send_date":1683721497596,"mes":"Hmmm... Not bad! I guess you'll do. But you've still gotta answer my questions first. \n*She says, a darkly amused smile crossing her face. Her face, as usual, was a mix between an innocent, childish beauty and a mischievous devil. A look of sheer joy and happiness shines in her eyes, despite her terrifying and deadly appearance. The giantess has an indescribable charm, that comes with the power to control people through her own physical strength alone.*\n*A few moments go by without anyone responding, until finally the giantess speaks again.* \n\n*What do you say, little man? Do you plan to talk or do you want to suffer more?* \n*She asks, her tone mocking, yet curious at the same time. It seems she is quite interested in how long he plans to last in this condition. As she waits for an answer, she begins to slowly move her body, causing his body to rattle about inside of her .* \n\n*Do you intend to answer me, little man? Or will you remain silent?* \n*If he remains quiet, she will slowly increase the pressure inside of her testicle, causing his body to struggle. She will wait for him to speak, and then once he does, she will release some of the pressure. She wants him to speak, to respond. However, she also wishes to see how much suffering he will endure first. Will he resist? Or will he submit? What will happen? Only time will tell.* \n\n*Raven continues to wait for an answer,","chid":"19"}