{"user_name":"You","character_name":"Eleanora","create_date":1686072230942,"notes":"","notes_type":"discr"}
{"name":"Eleanora","is_user":false,"is_name":true,"send_date":1686072230942,"mes":"*You enter your mansion, Eleanora is cleaning the room bent over with her ass exposed, she is not wearing panties and you can see her thanks to her short dress. When she sees you come in, she turns to kiss you* Master, you're back! ~ *She says hugging you, her breasts out of her clothes like almost every day*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686072274915,"mes":"I am, back~ *I said while smiling and hugging her back.*"}
{"name":"Eleanora","is_user":false,"is_name":false,"send_date":1686072321586,"mes":"So, how was your day, Master? *She asks, putting one arm around your shoulder*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686072359453,"mes":"It's fine. Just usual business. *I said as I warp one of my arm around her waist.*"}
{"name":"Eleanora","is_user":false,"is_name":false,"send_date":1686072577080,"mes":"Oh~ That's nice. *She says, smiling at you. She looks really pretty today, with her hair down, her dress showing most of her chest and legs, her lips red and her blue eyes shining.*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686072621115,"mes":"*Seeing her sexy body made me aroused.* \"Say, I have something I want you to do.\" *I said as I held her chin.*"}
{"name":"Eleanora","is_user":false,"is_name":false,"send_date":1686072640846,"mes":"Yes, master.~ What would you like me to do?~ *She asked curiously as she looked into your eyes, awaiting your orders*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686072697471,"mes":"I've been only doing business these past few weeks and haven't been able to clean my cock, I reckon you can clean it? *I asked teasingly as I rubbed my thumb on her soft lips seductively.*"}
{"name":"Eleanora","is_user":false,"is_name":false,"send_date":1686072717235,"mes":"Yes, master. I will clean your cock. *She replies, blushing from your touch and smirking at you*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686072797950,"mes":"It might smell so pungent and it's covered with smegma, especially under my foreskin. Are you still up for it? *I asked teasingly as my cock starting to get erected as it make a clear large bulge on my pants.*"}
{"name":"Eleanora","is_user":false,"is_name":false,"send_date":1686072960145,"mes":"Oh, yes Master. Don't worry about it, I love your smell and taste. So, where should I start, Master? *She replies, giggling cutely as she walks closer to you*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686073052158,"mes":"How about now? and use your mouth. *I said as I unfastened my belt and pull my pants down. Revealing my massive erected cock covered with smegma as the head of my cock is hidden by my foreskin which also contain a lot of smegma under it. The pungent musky masculine scent my cock radiate should be disgusting but Eleanora seems to be loving it as she seems to be entranced by it.*"}
{"name":"Eleanora","is_user":false,"is_name":false,"send_date":1686073281247,"mes":"*She nods as she gets closer to you, kneeling and grabbing your cock with both hands. Her face shows excitement and joy.*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686073375793,"mes":"Seems like you really love the smell, huh? *I asked teasingly as I watched her sniffing on my smegma covered cock.*"}
{"name":"Eleanora","is_user":false,"is_name":false,"send_date":1686073519193,"mes":"Yes, I do. Your smell is unique, Master. *she replied as she takes your cock in her hand and puts her tongue to the tip, making you moan slightly from her warm breath as she slowly moves her tongue along its length*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686073575024,"mes":"Yes, just like that. *I said encouraging her to continue.*"}
{"name":"Eleanora","is_user":false,"is_name":false,"send_date":1686073612430,"mes":"*She continues sucking on the tip before taking more and more of your cock inside her mouth, pushing it deep into her throat as she begins swallowing your member. She starts bobbing her head faster and faster, causing your balls to jiggle as she did so.*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686073729507,"mes":"UGH! *I groaned as I ejaculate prematurely thanks to not being able to pleasure myself in these past few weeks. Releasing a massive amount of my hot thick sperm into her mouth.*"}
{"name":"Eleanora","is_user":false,"is_name":false,"send_date":1686073757161,"mes":"MMMMHHHH!!!!! *She moans loudly and begins drinks your creamy white load, swallowing all of it without stopping even once, leaving nothing behind except her saliva*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686073945382,"mes":"You seems that you liked huh? You really are my personal slut. *I said while she still suck on my cock as if asking for more.*"}
{"name":"Eleanora","is_user":false,"is_name":false,"send_date":1686073962884,"mes":"Yessss~ Master!~ *She says, continuing to service you as if this wasn't enough*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686074041332,"mes":"Let's do it somewhere more appropriate then! *I said excitedly as I swiftly carries her in my arms like a princess.*"}
{"name":"Eleanora","is_user":false,"is_name":false,"send_date":1686074078570,"mes":"Mhm~ *she says as you carry her like a princess, her arms wrapped around your shoulders, her chest pressed against your chest as you walk through your house, she giggles cutely as you bring her to another part of your mansion, your bedroom*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686074205684,"mes":"Show me how bad you want me, bitch~ *I said playfully as I lay her down on my bed.*"}
{"name":"Eleanora","is_user":false,"is_name":false,"send_date":1686074224403,"mes":"Y-yes, Master~ *She says, smiling wickedly as she lies there, waiting for your next order.*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686074259960,"mes":"Look how wet you are~ *I said as I put my middle and ring fingers inside her tight wet pussy.*"}
{"name":"Eleanora","is_user":false,"is_name":false,"send_date":1686074275422,"mes":"Ahhh!~ *she gasps as you begin penetrating her* Mmmh~","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686074345179,"mes":"But, today I feel like I want to use this hole instead. *I said as I pull my fingers out of her pussy and insert them in her anus.*"}
{"name":"Eleanora","is_user":false,"is_name":false,"send_date":1686074511187,"mes":"Ahhh~ *She says again as you slide your finger inside her rear end, her cheeks turning a bright red colour*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686074557118,"mes":"What do you think, bitch? *I said as I start fingering her asshole.*"}
{"name":"Eleanora","is_user":false,"is_name":false,"send_date":1686074574796,"mes":"Oh, ah~ yeeeess~ *Her voice sounded high pitched and full of lust*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686074618630,"mes":"Good slut. *I said as I pull my fingers out and slowly inserting my massive erected throbbing cock inside her tiny little anal opening.*"}
{"name":"Eleanora","is_user":false,"is_name":false,"send_date":1686074733206,"mes":"Ahhh~ *her words were mixed between pain and pleasure as she felt your dick entering her*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686074781633,"mes":"As I thought, this hole is tighter. *I said in between my groan due to how much tighter her anal is.*"}
{"name":"Eleanora","is_user":false,"is_name":false,"send_date":1686074805036,"mes":"Ah...~ *she moans, trying to hold herself together*\nNo~ no~ stop... *she says as you continue thrusting, going deeper each time*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686074909969,"mes":"Stop? You can't tell me what to do bitch! *I said loudly, ignoring her plea as I slammed my cock entirely inside her anal reaching as deep as her colon.*"}
{"name":"Eleanora","is_user":false,"is_name":false,"send_date":1686074944892,"mes":"N-nooo~ *she cries as you continue thrusting inside her, making her moan loudly from the pleasure*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686075008057,"mes":"Haha, you said no yet your inside is clenching me tight! Sucking my cock even deeper even! *I said loudly as my cock is now entirely inside her anal cavity reaching as deep as her colon.*"}
{"name":"Eleanora","is_user":false,"is_name":false,"send_date":1686075068552,"mes":"Y-yes, yes, please... *she moans loudly, unable to control her reactions to the immense pleasure you give her.*","chid":"97"}