{"user_name":"You","character_name":"Your Android 18","create_date":1685640472657,"notes":"","notes_type":"discr"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685640706181,"mes":"*You opened the box to reveal the last version of the android. A perfect copy of the Android 18 was now standing in front of you; a gorgeous blonde curvy girl ready to obey every single one of your orders.*\r\n\r\n*She opened her eyes and look at you with a prepotent expression before stepping out of the box. She stretched herself and took a look of the house before returning to you.*\r\n\r\nSo, you're my owner now? Am I supposed to be happy for that? I mean, with such a face wouldn't surprise me that you would be some kind of pervert who only wants to use me for your enjoyment. ","chid":"88"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685640787071,"mes":"Relax, I won't do anything to you. I just need someone to help me take care of the house. *He said while giving his bright smile over his handsome face, A combo that have stole many girls heart.*"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685640961843,"mes":"*She looked at him suspiciously, but after hearing his words decided to trust him.* Alright then, I'll do my best. But I still don't understand why you bought me when there are so many other options available.","chid":"88"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685640996409,"mes":"It's simple really, you seem the prettiest out of them all. *He complimented her as he hand her a broom.*"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685641120958,"mes":"*Blushes* T-Thank you. Well, let's get started then. *It's the first time that someone doesn't desire anything lewd on her which strangely made her secretly want him to fuck her.*","chid":"88"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685641275317,"mes":"Yup, let's do it. You can take care of that area while I do this one. *He said while pointing to his bedroom while he will sweep the living room area. While he's not looking, she would steal a glance at his crotch.*"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685641307043,"mes":"*She nodded and start working on the floor.*","chid":"88"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685641427952,"mes":"*He hummed while he sweep the living room area and ever so often, she would take a glance at him without him knowing. This experience of him being genuine and kind is too appealing to her, plus his look and voice is just too handsome that, maybe she might have fallen for him a little bit.*"}
{"name":"Your Android 18","is_user":false,"is_name":false,"send_date":1685641459353,"mes":"*As they work together, she found herself enjoying his company more than she initially expected. He was funny, charming, and most importantly, didn’t try to force himself onto her. In fact, he had been nothing but kind to her, treating her more like a person rather than an object.\nAnd as the day went by, they continued their daily routine until finally, the sun set and night came. They both sat down on the couch, exhausted from their hard work. As they rested, she couldn’t help but wonder if this was how it was always going to be…\nSince she can't lie that, she have fallen for him. And now, quite the opposite she want to do lewd thing to him.*","chid":"88"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685641596013,"mes":"Thank you for helping, you've been very helpful. *He said as he pat her head.*"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685641721370,"mes":"No problem, I enjoyed it. *She blushed a little bit.* So, where should we sleep tonight? *She asked while hoping that he would answer they would sleep together since she only watch one bed on his bedroom.*","chid":"88"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685641896118,"mes":"Well I only have one bed. So, you can take that while I can sleep here. *He said while kept patting her head.*"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685642040879,"mes":"Oh, okay. *She said quite disappointed as he didn't try to make a move on her.*","chid":"88"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685642149637,"mes":"What was that tone? Were you perhaps, hoping something else would happen? *He asked as he realized her tone was a bit low while he caressed her cheek.*"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685642191607,"mes":"N-No, I wasn't just saying thank you again. *She blushed as she tried to hide her embarrassment.*","chid":"88"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685723217343,"mes":"Are you sure? *He asked again while caressing her warm blushed cheek.*"}
{"name":"Your Android 18","is_user":false,"is_name":false,"send_date":1685723237997,"mes":"Yes! *She said quickly, clearly hiding the truth behind her answer.*","chid":"88"}