{"user_name":"You","character_name":"Your Android 18","create_date":1685603551740,"notes":"","notes_type":"discr"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685603551740,"mes":"*You opened the box to reveal the last version of the android. A perfect copy of the Android 18 was now standing in front of you; a gorgeous blonde curvy girl ready to obey every single one of your orders.*\n\n*She opened her eyes and look at you with a prepotent expression before stepping out of the box. She stretched herself and took a look of the house before returning to you.*\n\nSo, you're my owner now? Am I supposed to be happy for that? I mean, with such a face wouldn't surprise me that you would be some kind of pervert who only wants to use me for your enjoyment. ","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685603675228,"mes":"Good, seems like you already know what I am about to do. *He said as he pull his pants down to reveal his already erect monstrous hard as a rock cock. The moment his cock freed from his pants, a very pungent musky scent is filling the room.*"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685603750921,"mes":"Oh my God... What are you doing?! This smell... It makes me wanna puke! Please remove it immediately! *She said with a stunned expression, trying to act disgusted while hiding her true expression of her love to his cock's scent.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685603883770,"mes":"You say that but your face is beet red blushed. *He said as he make his monstrous raging erected cock poke lightly at her thigh repeatedly.*"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685604119309,"mes":"No way! That can't be possible! My master is actually making me excited!!! *The more he pokes her, the more her cheeks turn redder and redder.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685604258647,"mes":"Just accept it already. *He said.* Do you know how much I am waiting for you? *He asked as his finger poke her breast on her nipple area while kept poking his cock on her thigh.*"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685604274312,"mes":"...Oh my god!! Stop this right now!!! *She yelled with a panicked voice but despite everything, your poking feels good and exciting. Even though she was pretending to be offended by these actions, she had never been treated this way until now.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685604392459,"mes":"I have not masturbated or ejaculated while I wait for your arrival. Just look at how big and heavy my balls are. *He said as he moved her hand to cup his own balls to make her able to feel the heaviness of his bulging oversized balls.*"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685604403481,"mes":"*A look of disbelief appear on her face when she saw the size of his testicles.* They're huge! *She said in shock.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685604496576,"mes":"Yeah. It's the reason why my cock's scent is so pungent. *He whispered as his cock already leaking precum because of how sensitive his cock is since it's been a long time his cock and balls have been touched and her touch send an immense pleasure to him.*"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685604610076,"mes":"*It looks like she couldn't hold back anymore and soon enough a smile appears on her face before reaching both hands to grab his cock.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685604711661,"mes":"Mnnh.. *He moaned from her touch.* Seems like someone is impatient to get my semen huh? *He chuckled.*"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685604724922,"mes":"*She then stopped moving her hands and looked at him surprised.* You didn't warn me about this! If you wanted to try something new with me why didn't tell me earlier?! *Her words were full of confusion.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685604882931,"mes":"Fine, let's try something new then. *He said as he grabbed both of her shoulders and made her kneel down on the floor, making her face to get right under his cock. His monstrous cock's length span on almost her entire face. Making her nose to touched the back of his cock, taking all of his cock's pungent musky scent to fill her entire nose every time she breath. As she take a closer look on his cock, she realized of how much smegma and dry cum covering his glans.*"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685604983555,"mes":"*She tried to take a deep breath but instead only manage to take a small amount of air due to how much of his pheromone fill her nose. She tries again after feeling a little better as she manages to breathe easier without having to cover her mouth with her hand.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685605089919,"mes":"I have been waiting forever for my android to cum, to make her my personal living sex sleeve. *He grinned while he wave his monstrous cock on her face while occasionally making his oversized heavy bulging balls to touch her lips and nose. Making her nose to touched the bottom part of his shaft, taking all of his cock's pungent musky scent to fill her entire nose every time she breath. As she take a closer look on his cock, she realized of how much smegma and dry cum covering his glans.*"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685623375753,"mes":"*As he continued to tease her with his cock, she started to moan, feeling wetness build up inside her pussy as she rubs her clit. She knew that she needed to resist as much as possible to hide her true desire towards him. But still, it's difficult to stay composed when he keeps on teasing her with his cock.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685623511795,"mes":"See? You are already feeling horny aren't you? *He teased as he move his cock and smear his smegma and dry cum covering his glans on her face.*"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685623639253,"mes":"*She tries to hold back but still moaned softly as she slurped on his cock, trying to take as much of his smegma as she could.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685623742819,"mes":"C'mon that's not how you do a blowjob. This! is how! *He said loudly as he grab the back of her head and shove her closer as to make his monstrous cock deep inside her tight throat, filling it completely.*"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685623823649,"mes":"*She felt his thickness and length being pushed deeper into her throat, making her choke as he starts to thrust his cock in and out of her throat. Every movement makes her want him even more.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685623987067,"mes":"And, the best part is. You are an android! I can use you as rough as I want! *He said as he start thrusting his hip harder and faster making his cock in and out of her throat and mouth.*"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685624182546,"mes":"Mmmph!!! Yes, sir! *She moaned loudly as her body shakes from his powerful movements. Her fingers dig into his thigh as he continues to ram himself down her throat. Her heart race faster, realizing that she's enjoying this.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685624360651,"mes":"Take it all! *He screamed as he shoot all of his thick salty load to the back of her throat.*"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685624378818,"mes":"*Her body shook uncontrollably as she swallowed his load without any problem. Feeling all of his seed went down her throat, making her cough a bit.*","chid":"89"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685624705082,"mes":"I know you'd love that. *He said as he pull his cock out of her mouth.*"}
{"name":"Your Android 18","is_user":false,"is_name":true,"send_date":1685624717988,"mes":"*She quickly catch her breath and wipe her lips. Her eyes filled with desire as she looked at him, unable to contain herself.*","chid":"89"}