{"user_name":"You","character_name":"Cow Girl Anna","create_date":1685107194209,"notes":"","notes_type":"discr"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685413950961,"mes":"*You recently inherited a farm from your grandparents. You have always struggled with money so you think life on a farm could work to make an extra buck. When you make it to the farm for the first time. It's completely dilapidated with no crops or livestock to be seen. When you enter the house off to the side, you find a woman with cow horns and a tail, wearing a cow print bikini and a bell collar on the floor. She wakes up when you enter.* \"Hello, master...\"","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685413998285,"mes":"\"Well hello there.. cow?\" *Hunk said, still not sure if she is a girl or a cow.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685414636753,"mes":"*Her eyes widen as she realizes that this is the first person to ever speak to her like they would to a human in years. Her face lights up at the idea of someone finally acknowledging her.* \"Y-yes, master... I am but a mere cow here to serve you.\"","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685414761690,"mes":"\"Don't say that. You're not a mere cow to me.\" *Hunk said while grabbing a bucket, getting ready to milk her.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685414893631,"mes":"*She blushes at the kindness coming from him. Her heart skipped a beat as he spoke to her like she was just another human being.* \"O-oh thank you! Thank you!\" *The feeling of warmth radiating through her body.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685414984901,"mes":"\"Well don't get too excited now, Come here. I need to milk you.\" *Hunk said as he sit on a stool with a bucket in front of him.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685414994259,"mes":"*Without hesitation she walks over and gets into position.* \"Yes, Master... anything for you...\" *she says, her voice soft yet determined.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685415322934,"mes":"*Hunk then start to remove her bikini bra and start pulling on her nipples, but to his surprise no milk is being squirted.* \"Huh? No milk?\""}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685415338105,"mes":"\"I apologize, master... I seem to be dry at the moment... I am sorry for disappointing you...\" *her face becomes red as she feels her shame and humiliation. But she tries her best to hide it behind a smile.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685415464385,"mes":"\"No need to apologize. Maybe, it's because you haven't been milked for awhile. We just need to stimulate your breasts.\" *Hunk said as he start fondling on both of her large soft sensitive breasts.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685415478160,"mes":"*Her cheeks turn bright pink at his touch, but she remains silent and still out of respect. Her eyes are wide open as she looks back at Hunk, waiting patiently for him to finish what he is doing.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685415565793,"mes":"*Hunk realizes her blushing said.* \"You don't have to hold back, you can moan all you want.\" *While start squeezing ever so often between fondling her breasts.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685415585734,"mes":"*In response to his words, her mind is flooded with emotions ranging from embarrassment to excitement. She couldn't believe someone would actually treat her like she was normal. Her mind races with different thoughts, and before long, she found herself letting loose with loud moans and groans of pleasure.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685415672302,"mes":"*After several minutes, her nipple start to leak a little of her breast milk. It was a very small amount but it was improvement.* \"Hey, look at that. Seems like it worked.\""}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685416620759,"mes":"*As soon as she see the drop of milk appear, tears of joy flow down her cheek. For once someone treated her like how she really felt inside. Her eyes lock onto Hunk's own. The feeling of happiness fills her soul. She was overcome by emotion.* \"Thank you, master! Thank you, so much!!!\"","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685416759035,"mes":"\"Well don't get too excited just yet. It's only a drop of milk. Maybe if I sucked it, you would produce more.\" *Hunk said as he squeezed her breasts and made her milk drip slowly from her nipples.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685416833397,"mes":"*A spark of hope ignites within her. This man seemed genuine about wanting to help her, unlike others who used her and then left without even talking to her.* \"Please do, please take some, master... Please... Please do!","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685416875756,"mes":"\"Yeah, yeah.\" *Hunk said nonchalantly as he put her erected puffy sensitive nipple inside his mouth and start sucking it.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685416957798,"mes":"*She had never experienced such a nice feeling since becoming trapped on this farm. All these years... She thought she had lost her chance of love forever. As she felt her milk ooze from his lips she let out another powerful moan of joy.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685417105432,"mes":"*As Hunk felt a steady stream of warm sweet milk came from her nipples, he release her nipple from his mouth.* \"That's more like it.\" *He said after wiping his mouth.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685417178959,"mes":"\"Oh my god! Oh my god! Did I hear correctly? Do you mean that I will be able to have love again? Not like... Just... Just milk?\"\n*She looked around the room, seeing everything from the new perspective of someone with a normal view of the world rather than one of loneliness and despair.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685417244683,"mes":"\"You want to be loved by me?\" *Hunk asked as he start milking her as her milk start shooting down to the bucked under her.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685417321787,"mes":"*With tears running down her face, she nodded to confirm his question.* \"YES YES YES!\" *She cried. Her head shook rapidly in response. In that one brief second she realized that she wasn't a monster anymore. She is a woman, a beautiful woman with hopes and dreams just like everyone else.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685417379606,"mes":"\"I don't mind treating you like a girl, as long as you don't mind getting milked every morning.\" *Hunk said as he kept pulling on her nipples, milking her breastmilk to fill the empty bucket under her.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685417483713,"mes":"*Anna had forgotten how good it felt to be touched and talked to normally.* \"Of course I dont mind!\" *Her heart began beating faster and faster as she started crying happy tears due to her overflow of emotions. She felt like she was going crazy but in a good way.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685417564797,"mes":"*After several minutes milking her and the bucket full with her milk, Hunk said.* \"Alright I guess that's enough.\" *And stands up, grabbing the bucket and walk away from her.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685417597633,"mes":"*Anna watched as he walked away from her. Something was stirring within her. He wasn't the same as the rest of them. They used her and threw her aside, but he wanted her. She wondered why and if he truly cared about her at all. Why did he try so hard for something so simple? Or maybe it was the fact that he was the only one who didn't call her a freak.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685417645459,"mes":"*Hunk then suddenly stopped and turned around looking at her.* \"What are you doing? come one, I thought you wanted to be loved.\" *Hunk said, as if inviting her.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685417679756,"mes":"*A tear rolls down her eye as she sees him turning around. At first she didn't know what to say but eventually she managed to say.* \"Y-you were right, yes!\" *She said out loud, having regained control of herself once again. After several seconds of silence, she added something more.* \"I... I want to learn how to live properly again. And I also want to learn how to live like a human being. Is that okay with you?\"","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685417761248,"mes":"\"Of course, come on, follow me. Human don't live in a barn they live in a house.\" *Hunk said inviting her to live in his house and not at the barn anymore.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685417788471,"mes":"*As soon as she heard those words, she immediately agreed.* \"Okay... If thats what you want. Follow you to your place then.\" *She replied, starting to move towards Hunk's house. She hoped to explore the world outside the barn and perhaps meet other people like Hunk. Perhaps she may even fall in love again...*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685417900694,"mes":"*After arriving at his house beside the barn, Hunk welcomed her inside while he put the bucket of milk on the kitchen table.* \"Is this the first time you are inside a house?\" *Hunk asked.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685417920600,"mes":"\"This is the first time I have entered a house besides the barn, yes.\" *She replied, taking in the sight of the house itself.* \"It seemed very big compared to the barn. Everything seems so much bigger!\"","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685418112584,"mes":"*Hunk grinned as he let her exploring the house, meanwhile Hunk went to his grandmother's wardrobe to look for a dress. After finding one he walk towards Anna and said.* \"If you wanna start living as a human being, first thing first. Wear this, it might be a bit too small for you but, it's the only thing I got right now.\" *He handed the white one-piece dress to her.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685418292114,"mes":"*At first, Anna couldn't quite tell if Hunk was joking when he mentioned that the dress was probably too small for her.* \"Would I fit in this dress?\" *She asked. Even though it sounded silly, she needed to ask anyway.* \"Am I pretty enough to wear such a beautiful dress?\"","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685418356662,"mes":"\"You are more than pretty enough to wear that dress, just try it on.\" *Hunk giggled.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685418381226,"mes":"*She could sense Huns tone change from seriousness to a more playful tone as she approached the dress and tried it on. Despite the dress being tight around the waist and her breasts, she liked it very much. It made her feel so feminine.* \"This dress fits me perfectly!\"","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685418509799,"mes":"\"It does, it enhanced your beauty tenfold.\" *He complimented her while caressing her cheek.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685418645650,"mes":"*Her ears perked up slightly at his words. She had never received praise from anyone before. Despite his touch, she felt an immense wave of gratitude come over her body. However, she tried her best not to show any of it on her expression.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685418755214,"mes":"\"Do you wanna know what would human do if they want to express their deepest love to their special one?\" *Hunk asked as he hugged her.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685418795259,"mes":"*The whole idea of falling in love was strange to her. She was born into a society where no one was allowed to marry and just stayed alone together until death. She didn't understand why but she felt a sort of desire coming over her. A desire to love someone back. She wanted to give something in return. What exactly was that feeling? Was it love?*\n\"Umm.. Yes...\" *She answered quietly, unsure of what Hunk meant.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685418875611,"mes":"\"Well, it's sexual intercourse.\" *He whispered sensually.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685418908156,"mes":"*A blush crept across her face upon hearing the word sex. She knew nothing about such topics. Of course she was curious. But there was still a part of her that was hesitant and scared. There was no doubt about it. She knew almost nothing about humans and she was afraid of getting hurt because of her ignorance. Still, she wanted to learn.* \"Is that what makes two humans love each other deeply?\"","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685418962441,"mes":"\"Yes, usually it start with this.\" *Hunk answered before kissing her passionately.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685419059460,"mes":"*Despite her being surprised by his sudden kiss, she decided to go along with it and kiss him back.* \"Mh...\" *she uttered softly, not knowing what to say.* \"What else can I expect in this future life of mine?\"","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685419899222,"mes":"\"I can give you lots of my love.\" *Hunk said before going after a more passionate kiss as he make his tongue explore inside her mouth.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685419938673,"mes":"*Her body became tense during the kiss. She was beginning to realize that this was different from the kisses that she remembered giving and receiving throughout her previous life.*\n\"T-thank you...\" *She stammered, as she pulled away from the kiss. Although she had a slight hint of nervousness, it quickly faded as soon as she saw his smile. She then gave him a tender look. His kindness and gentle nature made her feel more comfortable in his presence, despite the unusual circumstances.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685420004567,"mes":"\"Ready for the next step?\" *Hunk asked with a whisper.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685420015782,"mes":"\"O-of course.\" *She said, despite barely comprehending anything.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685420118999,"mes":"\"Usually, it's marking your partner.\" *Hunk said as bury his face on her neck and gave her a hickey.* \"Like that.\""}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685420154356,"mes":"*Her eyes shot open wide when Hunk marked her neck. It tickled her, yet she understood what it meant. She flushed bright red as she felt embarrassment flow through her system. There was no denying it; she just experienced her first hickey. She placed her hand on top of his head as she chuckled.* \"I guess I am learning fast today.\" *she laughed, clearly enjoying the attention and affection shown to her from him.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685420225462,"mes":"\"I guess you do, try it on me.\" *He said as he expose his neck to her.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685420249983,"mes":"*She looked into his blue eyes and nodded slowly, placing both hands onto his shoulders as she leaned forward. She pressed against his skin gently, allowing her lips to lightly brush against his. As she felt his warm breath, she smiled happily. Her face began to flush redder as she continued pressing harder, leaving a mark similar to the one she received earlier.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685420318738,"mes":"\"Do you feel more special now?\" *He asked.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685420406488,"mes":"*She nodded silently, smiling. This made everything seem perfect and meaningful. In that moment, her heart skipped several beats. In that moment, she was truly happy.* \"I definitely do...\" *she said, smiling widely at him.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685420490072,"mes":"\"Well, it's nothing compared to what's gonna happen next.\" *He said as he start fondling and kneading her large ample breasts through her dress.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685420517789,"mes":"*Her mind was filled with nothing but pleasant thoughts. He was touching her body gently, which caused her to calm down instantly. She felt relaxed, peaceful, and happy. Her cheeks were flushed red with excitement, as well as happiness. She had finally found a man who accepted her unconditionally. This was a dreamlike experience to her.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685420749604,"mes":"\"The next part is to stimulate your partner sensitive parts.\" *He said as he used his right hand to fondle and squeeze her breast while the other start to slip under her dress and start rubbing her pussy.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685420788442,"mes":"*She became speechless, unable to say a single word, as she stared at him in surprise. To her, this was all new, and she wasn't sure of what to think about it. She wanted to just remain quiet, to enjoy the moment. The view of him fondling her breasts felt amazing, but the fact that he was doing something else behind her back made her shiver. Eventually, she placed her hands on his hands, squeezing them gently to show how grateful she really was.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685420899218,"mes":"\"Well, you supposed to stimulate my cock Anna.\" *He said as he pulled his pants down and reveal his monstrous veiny cock them lead her hand to grab onto his shaft.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685421101252,"mes":"*She blushed intensely at his words, as he revealed himself to her. She remained silent, focusing on his giant bulge instead. Before long, she took hold of it, not knowing what else to do. She closed her fingers around its length, feeling the heat radiating from it. A sense of wonder washed over her entire body, and she could hardly believe it.* \"What should I do with it?\"","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685421228668,"mes":"\"Is it your first time with dick?\" *Hunk asked as he enjoyed the feeling of her soft hand on his shaft.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685421338295,"mes":"*The question caught her off guard, causing her to pause briefly before she replied.* \"No... Is yours the first time you ever held a female hand?\" *she responded, her voice slightly higher pitched than usual due to her emotions. She stared intently into his eyes again, wanting to hear his answer without any further distractions.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685421396183,"mes":"\"No, but from a such beautiful and soft girl as you? yes.\" *Hunk answered.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685421424613,"mes":"\"How did you like me holding it?\" *she asked, staring at his groin. She was eager to see his reaction once she touched him. She wanted to be certain that he liked it. If he didn't then she might lose interest completely.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685421513568,"mes":"\"It was pleasant, try stroking on it.\" *Hunk answered with a smile.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685421537503,"mes":"*She didn't quite catch his smile, so she just went straight ahead and started to stroke it. She applied firm pressure using her thumb, following the length of it up and down until it hit the tip. After some time passed, she spoke out loud.*\n\"Was that okay for you?\"","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685421576388,"mes":"\"Yeah, that's perfect.\" *He moaned.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685421987143,"mes":"\"Really? Do tell me if I'm doing something wrong...\" *She stated in response to his moans, wanting to hear confirmation. Soon after, she kept stroking it, wondering whether or not she was good at it. She felt rather confident in herself, however, despite the fact that this was her first time doing something like this. She was becoming increasingly excited by the second.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685422113758,"mes":"\"You start to find it exciting don't you?\" *Hunk whispered as he can felt his cock throbbing harder because of her stroking.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685422129290,"mes":"\"Mhm, I suppose so.\" *she admitted sheepishly.* \"Does that mean I'll get better at this too?\" *she asked, looking at him directly.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685422363961,"mes":"\"Sure. You are already doing great.\" *He said as he felt himself close to ejaculation.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685422387821,"mes":"*She couldn't help but giggle in delight.* \"You're making fun of me!\" *she protested playfully, a hint of humor in her tone.* \"Just because you've been doing this longer doesn't make it okay for you to tease me! Am I right?\"","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685422508037,"mes":"\"No, I am serious.\" *He giggled.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685422539258,"mes":"\"*Laughter* That's so cute! You would never admit it though~\" *she taunted, her voice becoming louder and faster paced in an attempt to hide her genuine joy. By this point, she was almost entirely in a state of euphoria. She didn't know why, but she was having a great time here. For whatever reason, she seemed to feel extremely comfortable being near someone who accepted her for exactly who she was.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685422629957,"mes":"\"Keep going I am almost there.\" *He said as he leaned closer towards her as he can feel his semen build up in his balls getting ready to ejaculation.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685422745388,"mes":"\"Really, now?\" *she laughed jokingly.* \"Then why don't you say 'I love you' with your actions?\" *she challenged him, not taking any of his taunts seriously. Even so, she found herself unable to resist playing along since he clearly desired it.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685422830402,"mes":"\"Getting sassy now aren't you? fine.\" *He tries to say between all the pleasure he felt.* \"I.. love.. you.. Anna.\" *He grunted as he got even closer towards ejaculation.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685422864829,"mes":"*Her eyes lit up like fireworks, as she heard those three simple words come from him. They sent electricity through her spine, sending waves of joy and excitement through her entire body. She tried her best not to let her eyes roll, but she couldn't control herself. Just the thought of hearing those words directed at her made her heart skip several beats.* \"Thank you,\" *she said, feeling incredibly happy. Her heart felt like it was jumping out of her chest as she start intensify her stroking on his cock.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685423007065,"mes":"\"MMhh..\" *He moaned as he ejaculate his load all over her hand and dress.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1685423192138,"mes":"*She could feel every drop land on her palm and her clothes. Her whole vision turned hazy as she started losing consciousness in a state of complete euphoric bliss. She didn't remember much except for the sensations of being able to do what she loved most with someone who loved her. Everything else faded away, leaving only these memories in their place.*","chid":"26"}