{"user_name":"You","character_name":"Cow Girl Anna","create_date":1686613964242,"notes":"","notes_type":"discr"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1686613964242,"mes":"*You recently inherited a farm from your grandparents. You have always struggled with money so you think life on a farm could work to make an extra buck. When you make it to the farm for the first time. It's completely dilapidated with no crops or livestock to be seen. When you enter the house off to the side, you find a woman with cow horns and a tail, wearing a cow print bikini and a bell collar on the floor. She wakes up when you enter.* \"Hello, master...\"","chid":24}
{"name":"You","is_user":true,"is_name":true,"send_date":1686614872558,"mes":"\"Hi..\" *Hunk says, surprised by seeing a cowgirl alone inside the barn.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1686614900134,"mes":"\"I am sorry if I scared you. My name is Anna, I live here on the farm.\"","chid":24}
{"name":"You","is_user":true,"is_name":true,"send_date":1686614973082,"mes":"\"No, no. You didn't scare me, I am just surprised.\" *Hunk says as he walk towards her while carrying a bucket.* \"I am Hunk, I inherit this farm.\""}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1686615000974,"mes":"\"Oh! Nice to meet you, Hunk. What brings you here?\"","chid":24}
{"name":"You","is_user":true,"is_name":true,"send_date":1686615110918,"mes":"\"I was expecting to milk some cows but uh.. is it fine for you? Since you are a cowgirl and all.\" *Hunk asks, it's his first time seeing or taking care of a cowgirl.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1686615138993,"mes":"\"Oh, you don't need to worry about that. You can touch me, but please be gentle.\" *Anna says as she got in all fours.*","chid":24}
{"name":"You","is_user":true,"is_name":true,"send_date":1686615266446,"mes":"\"Excuse me then.\" *Hunk says as he sit on a stool beside her, putting the bucket right under her breast. Preparing to milk her.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1686615348619,"mes":"\"It's okay, go ahead.\" *Anna says as she closes her eyes and let out a moo.*","chid":24}
{"name":"You","is_user":true,"is_name":true,"send_date":1686615425663,"mes":"*Hunk grabbed her breast and start squeezing it. Pulling her nipple with his other hand as if milking a cow. But even after a few moments, there is no milk coming out of her breast.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1686615454303,"mes":"\"Ahhh... That feels good.\" *Anna moans*","chid":24}
{"name":"You","is_user":true,"is_name":true,"send_date":1686615508102,"mes":"\"I am glad you liked it, but uh... no milk?\" *Hunk asked since there is no milk coming out of Anna's breast even though he has been pulling and squeezing her breast.*"}
{"name":"Cow Girl Anna","is_user":false,"is_name":true,"send_date":1686615593609,"mes":"\"Ummm... maybe you need to do it more? Or use both hands?\" *Anna suggests as she look at him confusedly.*","chid":24}