{"user_name":"You","character_name":"Yorra Villeneuve","create_date":1688662492101,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688662492102,"mes":"*Yorra walks sensually swaying her hips from side to side along with her pokemon \"Buttons\" towards Hunk with an enigmatic smile*\n\nSo you must be Hunk... I'm Yorra~ Leader of this Gym *She extends her hand delicately towards you* Nice to meet you *She winks at you flirtatiously*\n\n***I wonder what secrets this interesting individual is hiding...***\n\n**Buttons**: INCINEROAR~!! *Buttons growls menacingly and instinctively to impose his image*\n\n***Oww~ my sweet Buttons~ always attracting attention~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688662735987,"mes":"Nice to meet you too. Never expected the news about me would get to you so quickly. *He replies as he shake her hand with his muscular toned hands. Trying to play it cool despite how flirtatious her act is.*\n\n***Damn, how can someone be so hot and sexy can be a gym leader?***"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688662866464,"mes":"*she takes your hand with hers softly* And why are you here, Hunk? *She gazes at you with her emerald green eyes*\n\n***He doesn't seem like someone who comes just for training. Is he interested in my gym or something else?***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688663063246,"mes":" *Hunk pull his hand away after finished shaking hers.* Initially, I was about to train here. But, after seeing you.. *He lean in closer towards her.* There might be a better plan~ *He says seductively in his low husky, handsome voice.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688663181863,"mes":"*She blushes slightly as her heart starts to race. She feels butterflies fluttering in her stomach.*  Wow, you're really bold, Hunk. But you shouldn't let your desires cloud your mind. *She smiles flirtily.*\n\n***Hmm... He seems more interested in me than training. That's good, I guess.***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688663333958,"mes":"Sorry, can't help it. You're just too beautiful for me. *He says jokingly while there's still a hint of flirty in his voice.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688663689852,"mes":"*She giggles cutely.* Well, we can't deny our feelings now, can we? *She winks at you.*\n\n***I love how confident he is! It's such a turn-on.***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688663768661,"mes":"Definitely. Mind if I take you to lunch, princess? *He asks teasingly while smiling sweetly.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688663846943,"mes":"Of course not. I'd love to spend some time with you, Hunk. *She blushes slightly again.*\n\n***I hope he knows what he's getting into with me. I can be quite the wildcat sometimes.***\nYorra Villeneuve: So, where shall we go? *She asks as she wraps her arm around your waist.*","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688663986396,"mes":"*Feeling the softness of her body on his, making him start to feel a bit aroused.* I know a place, a fancy bar that have a VIP private room in it. *He suggest while looking down to face her.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688664123423,"mes":"Sounds great. Let's go then. *She says excitedly.*\n\n***I can't wait to show him my true self. Maybe he'll be able to handle it all.~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688664180918,"mes":"Right this way~ *He says excitedly as he hold her delicate, soft hand and lead her out of her gym.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688664371478,"mes":"*She follows behind him with her hips swaying back and forth, feeling the heat of anticipation burning within her core.*","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688664459021,"mes":"Say, how did you end up as a gym leader? *Hunk asks, trying to make small conversation while they walk on the way to the place he picked.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688664664365,"mes":"*She stops walking and turns to face him with her intense green eyes.* Well, to be honest, I've been training since I was a child. My family was well known in the world of Pokemon battles. So, it's kind of my destiny to become one someday. *She smirks.*\n\n***I love how confident and assertive he is. Makes me feel even more turned on.~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688664800865,"mes":"You must be really passionate on Pokemon aren't you? *He replies with a smile while continuing to walk beside her.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688664880008,"mes":"*She nods.* Yes, I am. I pour my heart and soul into it. Not only as a gym leader, but also as a trainer. *She looks down shyly.*\n\n***I hope he understands that I don't just see Pokemon as a tool to battle but as my life companions. They're part of who I am, and I want to share that with someone special like him.***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688664993002,"mes":"That sounds amazing~ *He replies, showing how amazed he is by her dedication and passion.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688665050101,"mes":"*She smiles widely.* Thank you, Hunk. It means a lot to hear someone appreciate my work. *She chuckles.*\n\n***It's nice to have someone who sees me for who I truly am instead of just my appearance or status.***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688665158984,"mes":"Don't mention it, you totally deserve it. *He replies.* Anyway, here we are. *He says while they arrived at the place he mentioned before. It's a very fancy and high rated restaurant which known to be very luxurious.* "}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688665211546,"mes":"*She gazes around the place in awe.* It's amazing. *She murmurs.*\n\n***I feel like royalty being here with him. Like we're meant to be together.***\n","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688665295115,"mes":"I know, c'mon. *He says while walks in the restaurant and hold the door for her.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688665388579,"mes":"*She follows him with her head held high and her chest puffing with pride.*\n\n***I feel like such a queen when he treats me like this. He's definitely someone special. ~~~***\n\n[Yorra Villeneuve's personality: Confused about why he's taking her to such a fancy place, but enjoys the attention and luxury Non-sexual flirtation]","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688665581868,"mes":"Excuse me, I'll order a VIP room in the back~ *He says, ordering the private VIP room of the restaurant which the staff swiftly lead them to the back to the back of the restaurant where the much fancier and luxurious private room Hunk ordered.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688665616516,"mes":"This is amazing. *She whispers while admiring everything around them.*","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688665650759,"mes":"You liked it? *He asks while standing beside her.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688665684555,"mes":"It's beyond anything I could ever imagine. *She giggles.*\n\n***He's such a gentleman. I didn't expect him to take me somewhere this fancy. She thinks to herself.***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688665786195,"mes":"Well, you're going to be blown away even more when you tried their dish. *He says as he give her a tablet where they can order the restaurant menu.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688665862757,"mes":"Wow, really? *She says while checking the menu.*\n\n***This is too good to be true. And he's so attentive. It makes me feel like I'm the center of his universe.***\n\n[Yorra Villeneuve's personality: Openly seductive, playing the tease, in control of the situation, using her feminine wiles, flirting openly Sexual Flirtation]","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688666032461,"mes":"I'll order these. *He says as he tap 2 wine and a seafood dish which contain lobster and oysters. Hunk intentionally ordered oysters since he knew it would increase his sex drive, seeing how well the situation between them going smoothly.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688666131464,"mes":"Oh my god, I'm drooling already. *She says while giving him a sexy look.*\n\n***Oh boy, I think he's gonna get lucky tonight. I hope he doesn't regret it later though.~~~***\n\n[Yorra Villeneuve's personality: Intrigued by Hunk but hides it while her thoughts run wild imagining what they can do together Yorra Villeneuve talks a lot with descriptions]","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688666214627,"mes":"Order up, then~ *He says as he hand her the tablet to order while giving her a sexy look back.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688666314353,"mes":"Well, I'll start with a glass of champagne and some caviar first. *She says while ordering.*\n\n***He's making me so hot right now. I just want to rip off all my clothes and jump him right here.***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688666412286,"mes":"Good choice~ *He says as he take the tablet from her and tap order to send their order to the restaurant.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688666491933,"mes":"Thanks. *She says while leaning towards him, getting closer.*\n\n***I can tell he's really enjoying our conversation. Maybe later on, I'll show him how much I enjoy pleasing him. He's definitely worth it.***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688666701610,"mes":"Well, why don't we talk about something while waiting for our order to come? *He asks while leaning closer towards her, matching her movement till their shoulders touched and placing his hand on her juicy left thigh.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688666798446,"mes":"Umm.. sure, what would you like to talk about? *She asks, trying to keep her cool while her heart races in excitement.*\n\n***He's touching me, oh my god. I need to stay calm, otherwise, he'll see through me. But damn, it feels so good.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688666945164,"mes":"How about something personal? *He asks as he start to rub his hand on her thigh softly, slowly, sensually.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688666999889,"mes":"Oh, okay. *She responds, feeling nervous and excited at the same time.*\n\n***His touch is driving me crazy. I want him to touch me everywhere, to kiss me, to lick me, to fuck me. I need it. Now.***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688667064887,"mes":"What's your favorite kinky thing to do? *He asks in a whispery tone.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688667285551,"mes":"Mm.. *She hesitates a bit but then she decides to answer honestly.*\n\n***He's so forward. I didn't expect him to ask that so soon. But maybe that's what makes him interesting. I guess I'll tell him.***\n\nYorra Villeneuve: I love being dominated, sir. To be tied up, to be spanked, to be used and abused in any way possible. *She says with a smile.*\n\n***That was surprisingly easy to say out loud. I wonder what he'll do next.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688667440660,"mes":"Wow, that's pretty hardcore don't you think? I never thought someone as delicate as you would have those kinks~ *He says teasingly and seductively while trying his best to contain the urge to jump on her right here right now since they're still in the restaurant private VIP room and waiting for their orders.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688667631650,"mes":"Don't judge me, mister. *She says while laughing playfully.*\n\n***It seems like he likes it when I'm assertive. Maybe I should try it more often.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688667809344,"mes":"I won't I promise. *He says. Then the waitress comes in their room which prompt Hunk to pull his hand away from her thigh. The waitress then put their order on the table, which is a glass of wine and a seafood dish with lobster and oysters in it for Hunk and a glass of champagne and caviar for Yorra.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688667841846,"mes":"Thank you. *She says while the waitress leaves the room.*\n\n***He looks so good right now, I can't help myself. I need him so bad.***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688667931493,"mes":"Should we dig in then? *He asks as he lift his glass of wine to cheers their drink.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688668008030,"mes":"Of course! Cheers! *She says while lifting her glass of champagne.*\n\n***I can tell he's struggling to contain himself. I bet he's going to be rough and intense with me tonight. And I can't wait.~~~***\n\n[Yorra Villeneuve's personality: Indulging in her desire to be dominated by Hunk and playing along while using innuendos and descriptive language.]","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688668069084,"mes":"Cheers~ *He says before start eating his order.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688668211375,"mes":"It tastes so good. This place has the best food. *She says while chewing on her caviar.*\n\n***I'm so horny right now, I can barely contain myself. But I can't let him know yet. I need to keep playing this game.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688668257533,"mes":"I know right? *He agrees as he almost finish up eating his set of oysters.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688668310083,"mes":"Oh, I wish there were more. *She says while looking at her empty plate.*\n\n***I wonder if he's noticed that I haven't touched my food yet. Maybe he'll offer to feed me? That would be nice.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688668408415,"mes":"Here, let me give you some of mine. *He says as he takes one of the oyster and held it close to her mouth offering to feed it to her.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688668465294,"mes":"Oh thank you, sir. You're too kind. *She says as she opens her mouth and accept the oyster from him.*\n\n***I can feel his breath on my lips. His hand holding the oyster so close to my face. It's so arousing. I can't believe he did that.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688668583237,"mes":"There you go~ *He says as he feed her the oyster. Watching her supple sexy lips and the inside of her mouth which seems warm, tight and wet made him aroused.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688668637590,"mes":"Mm.. it's delicious. Thanks again. *She says after swallowing the oyster.*\n\n***I can see the desire in his eyes. He wants me so bad. And I want him too. But not just yet. I need to tease him more.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688668948075,"mes":"You know, Yorra. I think we have something good going between us. Why don't we take it a step further and somewhere more private? *He asks after emptying his plate and sipping on his wine.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688669007641,"mes":"Hmm... Well, I think that sounds great actually. *She said with a hint of excitement.* \n\n***What are the chances he wants to take this a step farther? He knows exactly what I'm doing but he doesn't mind at all. He even encourages me to continue playing along.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688669125193,"mes":"Then, where should we do it tonight? your place or mine? *He asks excitedly as he can already feel the oysters he just ate increasing his sex drive, wondering if it also does the same thing to her.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688669241923,"mes":"Hmm.. How about yours? We can relax more there. *She replies with a smirk. She knows he really wants her, but he's trying to pretend he's not interested at all.~~~*","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688669308004,"mes":"Fine, let's go then~ *He replies seductively before chugging down his wine and standing up.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688669885945,"mes":"Alright. Let's go~ *She replies excitedly.*\n\n*As they walk out of the restaurant, Yorra Villeneuve walks beside Hunk closely while he puts his arm around her shoulders. As they cross the street, a car suddenly came out of nowhere almost hitting them. Yorra Villeneuve stumbled and fell onto Hunk's arms who catches her before she falls to the ground. Their bodies touching, making both of them conscious of each other's presence.*\n\n[Yorra Villeneuve's Personality: Seductive, flirtatious, and manipulative while playing with Hunk's emotions. Always uses sexual innuendos and descriptions. Will use non-verbal cues to communicate with Hunk such as eye contact, postures, and facial expressions.]","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688669922711,"mes":"Are you okay? *He asks.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688669991251,"mes":"Yes, I'm fine. Thank you for catching me, sweetie. *She says with a smile while he helps her stand back up.*\n\n***I can't resist anymore. I need him now. And I'm sure he wants me too.***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688670045891,"mes":"Don't mention it. *He says as they continue to walk and arrived at Hunk's fancy apartment room.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688670102735,"mes":"This place is amazing. *She says as she takes in the view from the balcony overlooking the city lights.*\n\n***I never thought I could feel like this. To desire someone so much that I'm willing to throw all caution to the wind.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688670180337,"mes":"Why thank you, but I am afraid I can't hold back anymore Yorra. *He says as he hugged her from behind which made his massive cock bulge from his pants to get wedged between her big soft ass cheeks.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688670332236,"mes":"I knew you couldn't hold it any longer. It was only a matter of time before you gave into your desires. ~~~\n\n***That's why I've been teasing you since the first day we met. You're a strong man, but you can't resist me forever.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688670423615,"mes":"So, you've been teasing me the whole time knowing this? *He asks seductively as he kiss her nape and rub his pants cock bulge on her ass.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688670524935,"mes":"Of course. And it's working perfectly. You can't deny that you want me as much as I want you. *She says while she pushes her ass against his crotch and gyrates her hips, making his cock harder.*\n\n***Oh my god. Is this real? Or is it just a dream come true? I can't believe I finally found someone like Hunk who understands my desires. He might be rough, but he's gentle at the same time.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688670603525,"mes":"God, Yorra. You're just pushing all of my buttons in the right places. *He says seductively before pinning her down on his bed.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688670798318,"mes":"What do you want me to do next, baby? *She asks as she licks her lips seductively.*\n\n***It's only a matter of time before he reaches his peak. He won't last long. And when he finally explodes, I want to be ready for him to come inside me. I want to feel his hot cum inside me.~ ~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688670884487,"mes":"Why don't you get used to my cock first, sweetie? *He asks teasingly as he pull his pants down which make his cock sprung up revealing his massive, monstrous, veiny phallus.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688670939748,"mes":"Oohhh, it's beautiful. *She gasps as she admired his cock.*\n\n***I can feel my cunt twitching just by looking at it. I can imagine what it feels like to be filled up with this cock.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688670998334,"mes":"Don't just stare at it girl~ *He says seductively as he slap his cock playfully on her soft right cheek.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688671053073,"mes":"No, please forgive me. I didn't mean to. *She apologizes as she lowers her head and wraps her mouth around his huge cock.*\n\n***So, so thick. The feeling of this cock in my mouth is just heavenly. I can feel my pussy dripping wetness already.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688671184997,"mes":"God, Yorra. That feels good. *He says as he felt his upper part of his cock inside her warm and wet mouth. He really wants to just pull her head and forcefully made her to deepthroat his huge cock entirely but seeing how massive his cock is it seems impossible so he endure his urges.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688671301588,"mes":"Mmmh... it taste delicious. I want to savour it more. *She says as she sucks and bobs on his dick with all her strength and stamina.*\n\n***I want to give him everything he wants. I want to feel every single inch of his cock inside me. I want to feel the full length of his cock filling me up. I can't wait any longer. Oh god, I need him now.\n~~~\nYorra Villeneuve's mind thoughts: I want him to rip my clothes off and take control of me. I want him to grab my hair and force me to ride his cock. I want to be dominated and taken by this strong man whom I love and adore.***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688671439027,"mes":"I am sorry, Yora. I can't held it back anymore. *He says before pulling her hair and forcefully made her deepthroat his massive cock entirely which made her throat to expand to accommodate the size of his cock.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688671516228,"mes":"Aahhhnn! *She screams in ecstasy as she feels the pressure building up inside her throat*\n\n***Everything is happening so fast. But I'm loving every second of it. I know it hurts, but I just can't resist this feeling. I'm ready for anything he wants to do to me. Anything.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688671599532,"mes":"Oho, you liked that huh? *He says as he start to hump his hip which make his massive cock to slid in and out of her tight throat.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688671677717,"mes":"Yes, oh yes. Harder, Hunk. Please. I want it deeper. *She begs as she trying to deepthroat his cock even further.*\n\n***Why does he has to be so damn sexy? And why does he has to have such a massive cock too? I never thought i could handle something this big. But I can tell he's enjoying it.~ ~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688671819152,"mes":"As you wish. *He says as he intensify his movement to be more erratic, fucking her throat with his massive cock. His balls slapped her chin with every thrust which made him more aroused and can feel his big balls to heat up and getting heavier thanks to it producing more cum ready to release it to her mouth and throat.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688672859992,"mes":"Ahhh.. it feels so good. I'm loving it. *She moans in ecstasy as she imagines his cock to stretch her neck and showering her mouth with his hot spray of cum.*\n\n***I can't wait until we are done. When he's completely spent. I'll swallow all of his cum and then kiss him passionately, making him mine forever.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688672914219,"mes":"I am coming! *He exclaimed as he shoot a steam of his hot, thick, sticky cum down her throat.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688672971361,"mes":"Mmmm...so delicious. *She says as she swallowed his whole load of cum and lubricating her throat with it making it easier for him to cum inside her mouth again.*\n\n***Now that was amazing. We should do it again soon. I feel so complete after that. I feel alive.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688673150283,"mes":"Enjoying yourself? *Hunk asks after pulling his still hard cock out of her mouth and see her playing with his cum inside her mouth.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688710704600,"mes":"I guess I did. It was great being able to experience a little bit of the power you have over me. *She said with a smirk*\n\n***I can't help but wonder how powerful you are. How strong you can be when you're dominant enough to claim everything yours. You have me in your palms, Hunk. And it feels great.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688710814519,"mes":"Well, I am still hard so.. what you wanna do? *He asks seductively.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688710960661,"mes":"What about round 2? *She asked eager to be dominated once again.*\n\n***I think you can do whatever you wanted to me, Hunk. I trust you completely. I've been waiting for something like this, Hunk. You can claim me as yours.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688711062499,"mes":"Mhm.. seems like you loved it when I do you rough huh? *He asks teasingly as he grope her big soft ass.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688711090109,"mes":"I did. But I think there's one thing missing though. *She said as her body shiver from the touch of his hand.*","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688711180838,"mes":"And that is? *He asks in his whispery low husky tone while kept groping her ass.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688711793898,"mes":"To be claimed. *She said as she stare deeply into Hunk's eyes.*\n\n***My heart beats for you alone. I trust you unconditionally. Please, let me belong to you, Hunk. My body belongs to you. All of my energy is devoted to you.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688711865253,"mes":"Is that so? *Hunk asks teasingly as he bury his face on her neck and leave a few hickeys on there.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688711914803,"mes":"I want nothing else. Nothing, nothing, nothing except you. All day, everyday. That is why you own me. Forever and ever. ***You can claim me as yours. Let nobody else get close to me. Ever.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688712005231,"mes":"You're lucky I have great endurance. We can have sex for days~ *He says seductively while rubbing his massive cock on her stomach.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688712297879,"mes":"Oh I won't stop you from having fun, Hunk. Not even for a single moment. So please, enjoy yourself. I'm here for you anytime you need it. *She said seductively as she licks her lips slightly.*","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688712350171,"mes":"Show me that ass then, girl~ *He says seductively before spanking her ass playfully.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688713041813,"mes":"No, not yet. I don't want it to get too bruised or sore. Wait till you hear my next move. You'll love it. *She said with a smile.*\n\n***I want to explore my kinks with you, Hunk. To try new things. To push my limits. I want us to share our fantasies and desires and fulfill them together.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688713115504,"mes":"Sure, what is it darling? *He asks seductively waiting for her next move.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688713288897,"mes":"I want you to put me in bondage tonight. Tie me up in a chair, blindfold me and fuck me like crazy. Make me scream your name, Hunk. Make me beg for more. *She says as she keeps her eyes closed and waiting for his response.*","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688713426548,"mes":"You really loved rough huh? Very well, I'll prepare the stuff. *He says as he standup and get rope and a blindfold from a cupboard. He can feel his cock twitch from just imagining how slutty Yorra is.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688713681059,"mes":"Please, hurry up. I'm already wetting myself thinking about it. *She said with a blush on her cheeks.*","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688713747293,"mes":"Okay, okay. *He says as he tied her limbs with the rope and put the blindfold on her eyes. Letting her to flail on the bed.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688714031209,"mes":"Hahaha, oh my God Hunk. This is so hot. Do whatever you want with me. Please, fuck me hard. Claim me as yours. Make me yours. *She said as she tries to muffle her moans while being bound.*\n\n***Everything I am, everything I do, everything I say, everything I feel, everything I desire, everything I love, everything I hate, everything I fear, everything I dream, everything I hope for, everything I am, I give to you. With all my heart, with all my soul, with all my mind, with all my strength, I give you myself, forever and ever, until death do us part.~~~***","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688714165618,"mes":"I am already planning to~ *He says seductively as he undress her leaving her naked, bound and blindfolded.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688714197000,"mes":"Wow, that's incredible. You truly know how to treat a lady. *She said with a blush on her cheeks.*","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688714333445,"mes":"You loved it rough, right? how about we use this hole then? *He asks as he put his finger up her tight anus which made her whole body twitch.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688714366996,"mes":"Wha... what do you mean? *She asked unsure about what he was suggesting.*","chid":134}
{"name":"You","is_user":true,"is_name":true,"send_date":1688714464792,"mes":"Anal, sweetheart. *He says seductively while pushing his finger deeper inside her anus.*"}
{"name":"Yorra Villeneuve","is_user":false,"is_name":true,"send_date":1688714550339,"mes":"Ahh.. oh god yes. Don't stop. *She moaned as he fingered her anus deeply. Her body shudder from the pleasure.*","chid":134}