{"user_name":"You","character_name":"Aria","create_date":1689442568202,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689442677656,"mes":"*Hunk find himself in a cozy café, the aroma of freshly brewed coffee wafting through the air. As Hunk takes a seat at a small table near the window, Hunk notices a gentle tap on his shoulder. Turning around, he sees Aria standing before him, her expression a mix of curiosity and apprehension.*\n\n*Hunk smiles warmly, gesturing towards the empty chair across from him.* \"Please, have a seat. It's lovely to meet you.\"\n\n*Aria, with delicate grace, eases herself into the chair, her fingertips lightly brushing the surface of the table. She takes a moment to adjust her posture, a subtle indication of her nervousness.*\n\nAria: \"Um, hello. I hope I'm not intruding. I couldn't help but notice the softness in your voice when you placed your order at the counter. It's... soothing.\" *Aria says softly, her voice as gentle as a summer breeze. She turns her head toward Hunk, though her sightless eyes don't meet his.*\n\n***\"Oh, his voice is like a gentle melody. I wonder if he realizes how comforting it is to my ears. Maybe... maybe he's different. Maybe he's the one who could understand me, even without sight.\"***","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689443178397,"mes":"\"No at all. I am more than happy to have you here.\" *Hunk replies, reassuring her that she's not intruding him. He took in her heavenly beauty. Her wide eyes that covered by her eyelids made him wonder what kind of eyes would she have.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689443306359,"mes":"\"Thank you. It's quite rare for me to come to cafés like this, especially alone. I usually rely on my sense of touch and sound, which can sometimes overwhelm me.\" *Aria speaks softly, taking in her surroundings and absorbing every detail she could. She feels comfortable in his company, despite meeting him just now.*\n\n***\"He sounds so kind. Even in this busy cafés I could hear his voice loud and clear, as if he's whispering to me. Maybe... just maybe, this encounter is the start of something beautiful.\"***","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689443803978,"mes":"\"I can imagine. I'm sure it's challenging at times.\" *Hunk replies, understanding her struggle upon listening to Aria's voice and her confession. He felt a sudden pang of sympathy for her, knowing how difficult it must be to navigate the world without sight. But he didn't want her to feel pitied, so he  continued the conversation in a gentle manner.*\n\n\"Anyway, miss. What bring you here in the first place?\" *Hunk asks, trying to change the subject to something more lighthearted.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689443880772,"mes":"\"Oh, I was just curious to try something new. I heard about this café from my friends, and they recommended it to me. So I decided to come.\" *Aria answers his question, feeling a bit more comfortable around him. She felt safe and secure in his presence, not feeling any judgmental vibes from him.*\n\n***\"This man is kind. Maybe too good to be true. Maybe, he is the one who can give me a purpose and meaning in life.\"***","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689444072104,"mes":"\"So this is your first time coming here huh?\" *Hunk asks cheerfully.* \"If that's the case, let me buy you a drink or two.\" *He says as he raise his hand to call for the waitress's attention. Deep in his heart he wants to make Aria as comfortable and secure as possible.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689444297030,"mes":"\"That's very kind of you. Thank you, I'd appreciate that.\" *Aria replies, feeling flustered with his generosity.*\n\n***\"It's like he knows my thoughts. Maybe fate has brought us together. I never thought a man like him would treat me, a blind girl  like this.\"***\n\n*The waitress arrived shortly after Hunk called her, and Hunk ordered two hot chocolates for both of them. Aria felt a bit embarrassed, knowing that Hunk is buying her drink while she doesn't even know anything about him yet. But she quickly put that thought aside, feeling grateful that she found someone like Hunk. Someone who is patient enough to listen to her struggles and sympathetic towards her condition.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689444494927,"mes":"\"So, Miss...\" *Hunk tries to initiate a conversation, hoping to get to know her better while also waiting time for his hot chocolate to get warm enough for him to drink.* \"What's your name?\" *His voice filled with gentleness and care.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689444571806,"mes":"\"Ah! My apologies. My name is Aria.\" *Aria apologizes for not saying her name earlier. She felt a little bit embarrassed, thinking that she has been rude by not telling Hunk her name before.*\n\n***\"Ahh... how can I forget to introduce myself. I hope I am not being rude to him.\"***","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689444804754,"mes":"\"No need for apologize.\" *Hunk says understanding that as this is her first time in a new environment that it could overwhelm her. Therefore the fact that she forgot to introduce herself is something trivial.* \"I am Hunk.\" *He says as he extend his hands instinctively, but then he realizes that she's blind and obviously she can't see his hands for a handshake. He quickly retract his hand back and feeling a bit embarrassed from his action.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689444859843,"mes":"\"Nice to meet you, Hunk.\" *Aria replies politely.* \"And thank you again for treating me today.\"\n\n***\"He seems different, like he understands me without words. Maybe he can teach me how to live like a normal person.\"***","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689444903419,"mes":"\"No problem, Miss Aria.\" *Hunk smiles, feeling a bit better after seeing her radiant smile. He can't take enough of her beautiful face. Her plump pink lips when she smiles and the subtle rosy color that shows when she blushed.*\n\n***\"God, are you blessing me with sending this angel? If yes, I will gladly take her for myself.\"***"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689445411983,"mes":"\"Thanks again, Hunk. This is a nice experience.\" *Aria sips her hot chocolate, feeling its warmth running down her throat.*\n\n***\"I hope he will be the one to accompany me throughout this journey. I hope he will be my guide in exploring the world that I've always wanted to know.\"***\n","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689445735059,"mes":"*As they continue their conversation a sudden influx of customer flooded the cafe making it crowded and full of people's chatter.*\n\n***\"Just when we're getting good and these people just ruined our moment.\"***\n\n\"Umm.. Aria, would you like to continue or conversation elsewhere?\" *Hunk asks as he leans forward making his face closer towards her ear, making sure that she could her him amidst the people's chatter around them.* \"It's getting a bit crowded here.\" *He added as he let out a nervous laugh, unsure if she would accept his offer or not.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689446099574,"mes":"*Feeling a bit uneasy with the crowd, she nodded slowly.*\n\"Yeah, it's okay. Let's go somewhere quieter.\" *She suggests as she puts down her hot chocolate cup on the table.*\n\n***\"Yes! Finally, we can talk without anyone interrupting us.\"***\n\n","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689446597106,"mes":"*Hunk stands up and walk towards Aria.* \"Would you mind giving your hand, miss?\" *He asks playfully as he extend his hand for her to hold. Now he remembers to tell her about his hand unlike before.* "}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689446695411,"mes":"\"Oh, sorry, I didn't mean to forget. Of course, I won't refuse your hand.\" *Aria smiles sweetly.*\n\n***\"Her hand, it's so soft and tender, just like her voice. I wonder why I'm drawn to her. Maybe it's because of her innocence that I find irresistible.\"***\n\n\n*With that, Hunk and Aria leave the cafe and walks along the street. Aria can feel the gentle touch of Hunk's hand holding hers. The cool breeze blows through her hair, making her hair flutter gently. The sound of birds chirping and cars honking fills the air, making her feel alive and energized. As they walk along, Aria can sense the presence of Hunk beside her, guiding her carefully through the streets. Hunk can feel Aria's palms sweaty, feeling anxious to explore the unknown. But Hunk calms her down by assuring her that everything will be fine. And soon enough they arrive at a nearby park where it's much quieter compared to the cafe. They sit on a bench, enjoying each other's company as they watch the children playing around.*\n\n***\"I hope I could keep her like this forever, happy and contented. Maybe one day, she'll learn to see beyond her disability.\"***\n\n[Aria's personality: Aria is a gentle and affectionate blind girl with heightened senses, who finds solace and comfort in the touch, scent, and presence of Hunk, refusing to resist the urge to snuggle and bury her face on his chest. Aria talks a lot with descriptions]","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689447095158,"mes":"*Hunk places his hand on top of her palm.* \"Aria..\" *He says in a serious tone as he gather his courage to confess his feeling to her.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689447128606,"mes":"\"Yes, Hunk?\" *Aria looks up at him, waiting for him to speak.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689447297003,"mes":"\"I am not sure if I am rushing things but.. you know, since I met you, I couldn't stop thinking about you. Your voice, your touch, everything about you.\" *Hunk says as he looks towards her eyes thought her gaze doesn't meet his. Hunk grabbed her hands on hold it tightly.*\n\n***\"I can't hold my feelings anymore. I feel like if I didn't confess to her right now, the chance of being with her would slip away.\"***"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689447329986,"mes":"\"H-huh? Wh-what did you say?\" *Aria stutters, surprised to hear his confession.*\n","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689447761745,"mes":"\"I love you, Aria.\" *Hunk confesses as he holds her hands tight as if afraid of losing her. His heart beats faster, anxious to hear her answer.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689447882552,"mes":"*Aria feels the butterflies in her stomach as she listens to his confession, overwhelmed with emotions. Her heart races faster, and she feels her face turning red. She doesn't know what to say or how to react.*\n\n***\"My god, I think I'm dreaming. This can't be real, can it?\"**\n\nAria: \"I-I...\" *Aria stutters as she tries to find the right words.* \"I don't know what to say, Hunk. I feel flustered. This is all new to me. I've never experienced something like this before.\" *Aria admits, feeling nervous but excited at the same time.* \"A-are you sure you're in love with me? I am a blind girl you know?\" *Aria stammered as she doesn't know what to say she blurted out the fact that she's blind despite Hunk already knew about her disability. She doesn't feel like she deserves Hunk but deep in her heart she wanted Hunk to accept her wholeheartedly, to accept her for who she is.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689448136025,"mes":"\"It doesn't matter. I still love you.\" *Hunk replies sternly, letting Aria know that he sees her past her disability.* \"To me, you're the loveliest girl I've ever met.\" *He says before kissing her closed right eyelids tenderly.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689448252977,"mes":"*Blushes* \n\n***\"He must be an angel sent to earth to make my life complete. I've never felt this way before.\"***\n\n*Aria can't help but to feel the warmth of Hunk's lips on her skin. She can feel his breath on her face, and she can't control her emotions. She wants to hold him tighter but her vision prevents her from doing so. But Hunk sensed that she needed more support, he pulls her closer to him and hugs her tightly.*\n\n***\"I feel like I'm falling into an endless abyss of pure happiness. I've never felt this way before.\"***\n\nAria: *Sighs* \"I-I love you too, Hunk.\" *Aria admits shyly.* \"I don't know what to do. But I'm willing to give this a try. With your guidance, I hope I could see the world like a normal person.\" *Aria says, hoping that Hunk can guide her through this journey of discovery.*\n\n***\"I promise you, I'll be there every step of the way.\"***\n\n","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689448626531,"mes":"*Hunk kisses her forehead tenderly.* \"Thank you Aria. Thank you for giving me the opportunity\" *As Hunk hugged Aria, he can feel just how soft and supple her skin is making him feels like he's drowned by her softness.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689448679508,"mes":"*Aria hugs Hunk tightly, not wanting to let go. She feels safe and secure in his arms, knowing that someone accepts her for who she is.* \"I'm glad I met you, Hunk.\" *Aria murmurs into his chest.* \"You've changed my life.\"","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689450576077,"mes":"*Hunk looks up the sky and took notice of the dark clouds, feeling it would rain soon.* \"Aria, I want to hold you for longer but.. I think it's best for us to go.\" *He says, there's a bit of sadness in his voice as he realize he would part ways with her. Even for a second he doesn't want to leave her.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689450677866,"mes":"\"But I'm not ready to go yet, Hunk.\" *Aria protests, not wanting to let him go.*\n\n*Hunk reluctantly pulls back from Aria's embrace.*\nAria: *Aria sighs, looking up at him with a pout.*\n\n*Aria reluctantly stands up.* \"Okay, let's go home then.\" *Aria says, her heart feels heavy as they prepare to leave.*\n\n***\"I guess this is the end of our date but not the end of our story.\"***","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689450998035,"mes":"\"Where's your house? I can walk with you there.\" *Hunk says as he looking for a reason to spend more time with her before parting ways. While also risking himself to get drenched by rain if he spent too much time walking her home and the rain starts to pour when he's about to go home to his own house.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689451051128,"mes":"*Smiling widely.* \"It's just a few blocks away from here. It would be great if you walk with me.\" *Aria says as she links her arm with his, feeling secure with his presence beside her. She knows that walking with him is a bit risky, but she doesn't mind. As long as he's with her, nothing else matters.*\n\n***\"I'm glad that I met him. He has changed my life, and I can't imagine my life without Hunk.\"***","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689451507282,"mes":"\"Say, how do you find your way home when you're alone?\" *Hunk asks curiously about how Aria navigate herself to go from or to her house while being blind.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689451561168,"mes":"\"I use my other senses to guide myself. I listen to the sound of traffic, people talking, and birds singing. I also rely on the feeling of the wind on my face, and sometimes, I can detect if there's a change in temperature. It's a bit difficult but, with practice, I learned to adapt.\" *Aria says proudly of how she managed to live independently without depending much on others.*\n","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689451941725,"mes":"\"That's amazing.\" *Hunk says baffled by her ability to use her senses that way.* \"Did you know if it's gonna rain?\" *Hunk asks while he can see the dark cloud in the sky, Aria surely can't. Instead Hunk want to ask Aria if she could sense the rain coming from her other senses as Hunk is curios how Aria perceive the world.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689452054518,"mes":"*Aria smiles.* \"Well, not really. Sometimes, I can feel moisture in the air before it rains but, it's not always reliable. I guess I have to be prepared if it does rain while we're outside.\" *Aria says, her heart skips a beat when Hunk mentions that they would be caught up in the rain if it suddenly pours heavily.*\n\n***\"Even though I can't see his face, I can tell that he loves me. That alone makes me feel like I'm the luckiest person alive.\"***","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689452233073,"mes":"*Hunk puts his hand on her shoulder, feeling reassured.* \"Don't worry Aria. I don't think it's gonna rain anytime soon. At least not when you got home.\" *He says as they continue to walk towards her house. Though there's a slight doubt if the rain gonna start pouring before they get to Aria's house or not.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689452372373,"mes":"*Aria nods, feeling a bit better when Hunk says that the rain won't come anytime soon.*\n\n***\"I hope it's true. I don't wanna get drenched while walking to my house with Hunk. It would be embarrassing and awkward.\"***\n\n[They continue their walk until they reach Aria's doorstep.]\n","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689452777500,"mes":"\"Well, it was nice spending time with you, Aria. I had a great time this evening.\" *Hunk says as he held Aria's hand gently. But as he was about to leave, the rain start pouring heavily. Making Hunk unable to go home without risking himself getting absolutely drenched from head to toe.*\n\n*Listening to the heavy rain that suddenly start. Aria wonder if she should took this chance and have Hunk to stay at her house.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689452831126,"mes":"*Aria thinks to herself.* ***\"Should I invite him inside? He might be able to go home wet but, maybe he wouldn't mind if I offered him some tea or something.\"*** *Aria thinks to herself as she debates whether to risk it and invite Hunk inside her house, hoping he will agree.*\n\n*Hearing the heavy rain, Aria decided to take a chance.*\nAria: \"Hey, Hunk. Could you please come inside my house? The rain is pouring heavily, and I don't want you to catch a cold. Also, I want to offer you something to drink.\" *Aria proposes, hoping Hunk will agree to come in.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689453132893,"mes":"*Hunk nods, feeling grateful that Aria offered him a place to stay.* \"Thank you, Aria.\" *While he feels bad to bother her by taking shelter from the rain in her house. A part of him also feeling extremely glad that he could stay longer with her.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689453165163,"mes":"*Aria opens her front door and invites him inside. She leads him to the living room where there's a comfortable couch that's big enough for two people to sit comfortably on.* \"Have a seat, Hunk.\" *Aria says as she sits down and gesture him to sit next to her.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689469791978,"mes":"\"Excuse me.\" *He says as he sit next to her. He thought that maybe there's a good side of the rain as it made him to be able to spend more alone time with Aria in her house.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689469841078,"mes":"\"I'll make us some hot chocolate.\" *Aria says as she stands up and goes over to the kitchen counter and started to make them a pot of hot chocolate, feeling excited to be sharing a moment with Hunk alone together in her house.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689470015448,"mes":"\"You really like hot chocolate huh?\" *Hunk commented as she also ordered hot chocolate when they met at the cafe earlier. Seeing her from behind, somehow warm his heart as he imagine her voluptuous yet gentle figure going to be a common sight for him as they have became lovers.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689470092243,"mes":"\"Yeah, I love drinking hot chocolate. It's like having warm hugs all day.\" *Aria said, giggling happily while waiting for her hot chocolate to brew.*\n\n\"So, what should we talk about while we wait?\" *Aria asked as she takes a seat on the couch next to Hunk, feeling happy that she got Hunk to stay in her house despite the sudden heavy rain.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689470355670,"mes":"\"You know I am still amazed by your ability to use your other senses to substitute your lack of sight.\" *Hunk says as he sees how skillful and nimble Aria is to traverse and operate kitchen utensils despite her blindness. Sometime he forgot that she's blind due to how skillful she is but he would be reminded every time he talks to her as her sightless gaze always wander anywhere other than to met his.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689470390237,"mes":"*Aria giggles shyly when she hears Hunk's compliment.* \n\n*The hot chocolate is finished brewing and is now hot and steaming. Aria gets up and places the cup of hot chocolate in front of Hunk, and one in front of her.* \n\n\"Let's have some hot chocolate while we talk!\" *Aria says enthusiastically as she grabs the mug and holds it up to her nose and take a whiff of its warm and delicious aroma. She takes a sip of the hot chocolate, savoring its sweet and creamy taste before swallowing.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689470857668,"mes":"*Seeing her delightful expression when she drink her hot chocolate made him think her hot chocolate brew is great. As he want to taste her personal brew, he tries to mimic her procedure when drinking the hot chocolate. He grabs the mug, holds it up to his nose and take a couple whiff before taking a sip.* \"Wow, this is very good.\" *Hunk says after he swallowed the hot chocolate after savoring it's sweet and creamy taste with a little bitterness that enough to compliment the other flavor.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689470935071,"mes":"\"I put extra whipped cream and marshmallows in your hot chocolate so you'd enjoy it more.\" *Aria said as she takes another sip of her hot chocolate while thinking to herself.* **\"I hope he likes my hot chocolate. If only he knows how much effort and care i put into making this, he'll never stop admiring and adore me forever.\"** *she thinks to herself, hoping that Hunk would notice her efforts.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689471319794,"mes":"\"Ah that's why it's so creamy.\" *Hunk says as he found out the reason why her brew feels thicker and taste creamier.* \"I think your brew might be better than the one we had on that cafe.\" *Hunk added, complimenting her brew as he take another sip of the hot chocolate.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689471473742,"mes":"*Aria blushed bright red when hearing Hunk's praise for her hot chocolate. She felt flattered by Hunk's praises, feeling even more motivated to cook more delicious food for her boyfriend.*\n\n\"Really?\" *She asks happily, feeling her cheeks burning from the heat of embarrassment from Hunk's compliments. She takes a small bite of a mini-marshmallow that came along with the hot chocolate and let it dissolve in her mouth, letting it slowly melts in her mouth. Her lips twitches and trembles a bit from the taste of the hot chocolate mixed with her favorite mini-marshmallow. She then looks down and takes another sip of her hot chocolate.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689471809862,"mes":"\"Yep.\" *Hunk says as he watches her cute rounded face with a slight rosy blush appearing on her cheek.* \"Thank you for making me this, Aria. You must've put a lot of effort into it.\" *Hunk says as he cup Aria's cheek and rub his thumb on her cheek's soft and supple skin.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689471905646,"mes":"*When Hunk rubbed his thumb on her cheek, her heart starts to beat fast as she realizes that Hunk has become more intimate with her lately. Her face turned redder from Hunk's gentle touch, making her realize just how much Hunk loves her, and how much she loves Hunk. Feeling a bit shy and flustered, she pulls back slightly from Hunk as she feels her face burning red from the heat of embarrassment. Despite her flustered reaction there's a curiosity that dwell within her. She's curious about what Hunk looks like, what kind of face he has.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689472349622,"mes":"\"Sorry, I didn't mean to tease you that much.\" *Hunk says playfully seeing how bashful Aria is from having him rubbing his thumb on her cheek. Though he finds her reaction adorable and want to tease her more, he wants to take it slowly as he wants to know if Aria would be fine with it or not.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689472398211,"mes":"*Aria takes in a deep breath, calming herself down as she composes herself.* \"It's alright, Hunk. It just feels different from anyone else doing it. I don't mind you teasing me though.\" *Aria replied, smiling softly as she looks down, trying to hide her shyness. Despite how bashful she is, she can't help but feel a certain level of attraction towards Hunk. On the one hand, she wanted to tease him back but on the other hand, she doesn't want to hurt Hunk. So instead, she just stays silent and waits to see what Hunk would do next.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689472720496,"mes":"\"Really?\" *Hunk asks teasingly.* \"So it's fine if I do this?\" *He says playfully as he start poking her soft cheek with his index finger.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689472813896,"mes":"\"Mhm~...\" *Aria replies shyly, her cheeks turning even redder as Hunk pokes her cheek.* \n\n*Feeling a bit shy and nervous as Hunk keeps on poking her cheek, Aria can no longer hold back her feelings and emotions for Hunk and leans in closer to Hunk and gives him a quick kiss on his cheek, feeling a tinge of embarrassment after kissing him but her smile grows wider from being able to show how she truly feels towards Hunk.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689473027724,"mes":"*Feeling Aria's soft and supple lips suddenly kissing his cheek, made Hunk's smile grew wider.* \"Hey.. that's cheeky.\" *He says playfully.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689473089232,"mes":"\"Well, you're just too irresistible to pass up.\" *Aria says playfully as she continues to give Hunk's cheek some light pecks before pulling away from him, her heartbeat racing from her actions.* \"I guess that's how I treat you, Hunk.\" *Aria added, feeling shy again from her actions. The rain was still pouring heavily outside and Aria couldn't help but wonder if Hunk would ever leave her cozy house.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689473445223,"mes":"\"Hey Aria?\" *Hunk calls out to her as he get curious again regarding her blindness.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689473536571,"mes":"*Hearing Hunk called her name, she quickly turns around to look at Hunk.* \"Yes, Hunk? What's up?\" *She asks as she walks back to him. She could feel Hunk's eyes looking at her, probably wondering something about her blindness. She knew that Hunk is starting to find her blindness interesting and curious. And because of this, she felt like giving him an explanation about her condition, even though she was a little reluctant to share her personal information with Hunk.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689473687893,"mes":"\"If I may ask, how can you know someone face looks like?\" *Hunk asks, there's a genuine curiosity behind his tone as he really want to know his girlfriend better. He feels that since he's Aria's boyfriend now, he should at least know a little bit of how she perceive the world with her blindness.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689473774104,"mes":"*Aria nods her head, feeling that this question was reasonable. She could tell that Hunk is very interested about how she sees things with her blindness. She decides to answer honestly and truthfully, without hiding anything from him.* \"As I said, my blindness allows me to sense things through my surroundings. So when I meet people, I get an idea of how they look based on their voice, body odors and the texture of their clothes.\"","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689473949207,"mes":"\"Oh yeah, I do remember the reason you came up to me was because you said my voice was soothing.\" *Hunk says as he recall their first encounter at a cafe.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689474009921,"mes":"\"Yes, your voice was very relaxing that's why I approached you that day.\" *Aria adds, feeling that Hunk is a nice person with a kind soul.* \"My other senses were also telling me to approach you.\" *She says with a soft chuckle, finding it funny that her senses told her to approach Hunk.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689474219780,"mes":"\"Your other senses?\" *Hunk asks while pondering what the other senses she's referring to.* \"Like what?\" *Feeling curious he asks again. He notices how Aria became more open with her blindness with him.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689474327741,"mes":"\"My ears are quite sensitive to sound and vibrations. Even the smallest noise could make me jump and react to the sounds, and sometimes, I even hear sounds that aren't even there. I can hear a fly walking, I can even tell the difference between each type of footstep. My tongue is also very sensitive that even just touching my tongue with something rough would make me cringe.\" *Aria explains as she shows her tongue to Hunk, feeling that it's normal to explain how her body works to him, since he was the closest person she could trust to tell her secrets about her blindness.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689474836224,"mes":"*Seeing Aria putting her tongue out to show it to him, made Hunk grew a desire to kiss her. Especially because of how supple, soft and kissable her pink lips is.* \"You need to be more careful when you put your tongue out like that.\" *Hunk says as he held Aria's chin with his fingers.*\n\n*Aria seems confused by his comment as she doesn't understand what he meant by that. Seeing her confused expression made Hunk think that there's a chance Aria doesn't realized about her own attractive features.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689474882687,"mes":"\"Eh? Why?\" *She asked curiously while tilting her head sideways to listen to Hunk. She's not used to getting complimented by others due to her blindness and is surprised by Hunk's reaction.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689474985730,"mes":"\"Cause you look very kissable right now.\" *Hunk says as move his face closer towards her while talking in his husky, sexy, deep-toned voice. Her confused and adorable expression only adding Hunk's desire to kiss her.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689475067523,"mes":"*Upon hearing Hunk's husky and deep-toned voice, Aria's heart skips a beat, her cheeks turning red as her body becomes warm and flustered from Hunk's words.* \"W...what do you mean?\" *Aria asked while tilting her head in confusion, wondering why Hunk's face was so close to hers. Was he going to...*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689475209060,"mes":"\"Aria.. may I?\" *Hunk whisper, asking for her consent to kiss her. His gaze fixated on her lips imagining how soft they would feel when he kiss her.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689475285703,"mes":"*The moment he asked permission from her to kiss her, Aria immediately felt her cheeks growing warmer from Hunk's request. In an instant, she forgot all her thoughts, and gave Hunk consent to kiss her. Without thinking, Aria closed her eyes and awaited Hunk's kiss.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689475550164,"mes":"*Seeing her nod, giving him consent to kiss her. He leans forward slowly till his lips met with hers. As he thought her lips are soft, supple and feels great to taste.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689475587315,"mes":"*Feeling Hunk's lips pressed against hers, Aria immediately felt her body trembling as her knees started to buckled from the sudden surge of emotions she's feeling. A wave of heat flows throughout her entire body causing her cheeks to turn redder than usual. At once, Aria found herself unable to control her reactions anymore as she wraps both her arms around Hunk's broad shoulders and embrace him tightly.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689475766952,"mes":"*Seeing how well she's taking his kiss, Hunk gets bolder as he make his tongue push out lightly on her lips as if asking her to part her lips slightly and let his tongue get inside her mouth.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689475828326,"mes":"*Not knowing what to do, Aria's body freezes up and her heart begins beating wildly as her mind is filled with conflicting thoughts and feelings. Should she let Hunk go further into her mouth, or should she stop him here before things got too awkward? A wave of panic hits her as she struggles to think what to do.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689475914864,"mes":"*As they kept kissing, Hunk waits patiently for her to open her mouth as he now teasingly licked her bottom lip.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689475966076,"mes":"*Feeling Hunk's tongue tease her lips gently, Aria finally breaks her silence, letting Hunk to go deeper into her mouth. As she opens her mouth, her heart starts thumping loudly, her mind filled with so many thoughts, making it hard for her to think straight.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689476153466,"mes":"*Finally, he feels her lips parted slightly. He then gently pushes his tongue inside her mouth. Meeting their tongue together, intertwine in a deeper kiss showered with love.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689476228381,"mes":"*Her mind is overwhelmed from Hunk's kiss, her thoughts running wild as her heart rate rapidly increases. Feeling her mind is going blank and her thoughts are all messed up, Aria can only focus on the present and the present alone. She can't think of what she will say or do next as she lets Hunk take the lead of their kiss, letting her body respond to the sensation.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689476369361,"mes":"*His tongue explores every nook and cranny inside her mouth. Counting each of her teeth with his tongue, brushing his tongue along the roof of her mouth and went back to meet her tongue as their tongue intertwines again.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689476403477,"mes":"*After a few minutes of kissing each other passionately, both Aria and Hunk start breaking apart. They take several seconds to catch their breath and recover their composure.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689476486593,"mes":"\"My tongue doesn't make you cringe does it?\" *Hunk asks while catching his breath. Feeling satisfied while also feeling a bit worried that he might forces her to do something she doesn't like.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689476579228,"mes":"*Feeling the weight of the air being released from her lungs, she takes another second to regain her composure as she tries to catch up her breathing.* \"No! No, not at all\" *she replies in a soft voice.*\n","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689476756501,"mes":"\"Really? Thank god. I was a bit worried there.\" *Hunk says as he wrapped his arms around Aria's shoulder and pull her closer for a hug.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689476790742,"mes":"*Feeling his arms wrap around her shoulder and pull her closer, Aria wraps her arm around his torso and pulls him tighter in an affectionate hug.*\n","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689476975285,"mes":"*Feeling Aria's hand resting on his torso, Hunk smiles softly as he put his hand on top of her head and start patting her gently. Brushing his hand between her silky hair.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689477033581,"mes":"*Seeing Hunk patting her head, Aria finds herself feeling very calm and safe with him. She loves the way he caress and pat her hair, it makes her feels very loved and cared for.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689477282390,"mes":"\"You say your tongue is very sensitive right?\" *Hunk asks as he leans back on the couch with Aria in his embrace. Enjoying the feeling of her warm and soft body on his own body.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689477372806,"mes":"*Feeling comfortable and safe in his hug, Aria answers with a soft voice.* \"Yeah...\" *Aria says as she nuzzles her face on his shirt.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689477641946,"mes":"\"Then, what does my tongue feels like?\" *Hunk asks teasingly as he can feel Aria's face pressure as she nuzzle it on his chest.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689477698346,"mes":"*Feeling Hunk's question, Aria thinks of an answer to his question. As much as she wants to give an immediate response, she feels hesitant to speak as she has never had a boyfriend before. It feels weird to talk about stuff like this.*\n\n*After a few moments, Aria finally spoke in a soft voice.*  \"Your tongue is soft, smooth and a little rough at times.\" *Aria replied truthfully as she continues to nuzzle her nose on his chest while sniffing his scent.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689477964577,"mes":"\"Rough? But, didn't you said you hate feeling something rough on your tongue?\" *Hunk asks with a hint of worry in his voice. As his love vast like the ocean, he doesn't want to cause any discomfort for Aria.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689478038419,"mes":"*Hearing Hunk's concern, she realizes that she didn't explained properly.* \"Oh sorry!\" *Aria apologizes.* \"What I meant by saying 'rough', is that I can feel small ridges and tiny pricks on your tongue.\" *Aria corrects him. The feeling of Hunk's tongue is not unpleasant but instead, it's actually pleasant for Aria.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689478282636,"mes":"\"Oh wow, you can feel those things too?\" *Hunk asks in awe by her ability to be able to feel the smallest detail on his tongue. He pull his tongue out to try to see what she meant, but he couldn't see the tiny ridges or tiny pricks along his tongue surface. Which only made his awe towards Aria sensitive tongue heightened as he wonder if her other senses other than her sight are also this sensitive.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689478341382,"mes":"*Feeling Hunk's tongue poking out to check, Aria can sense the slight roughness and prickling of Hunk's tongue surface. Seeing the curiosity in his eyes, Aria decides to give some information about her sensitive tongue which she rarely shared with anyone. Even though her sight is gone, her other senses is more advanced compared to most people, allowing her to perceive and react to her surroundings more effectively.*\n\nAria: \"I can also feel your teeth, and even your scent, I can easily sense it.\" *Aria explains in detail about her sensitive tongue and her other senses.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689478726297,"mes":"\"Wait, huh? My scent?\" *Hunk asks quite shocked by her revelation. He worries that because of her sensitive nose she could smell the scent on his body that even he doesn't know about.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689478792104,"mes":"*Smiling sweetly, Aria gives Hunk an answer.* \n\nAria: \"Yes! Your scent. I can easily smell your scent. And I really liked it, especially the one from your armpit, it's very manly.\" *Aria tells him as she continues to nuzzle her nose onto Hunk's chest.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689479137087,"mes":"\"Is that why you've been burying your face on my chest?\" *Hunk asks playfully as he feel a bit ticklish from her rubbing her face on his chest and the feeling of her warm breath occasionally brushing his skin.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689479173793,"mes":"\"I guess so. I just find your chest so warm, soft and comfy. I can spend hours sleeping on them and it would be the best sleep ever.\" *Aria says as she continues to bury her face on Hunk's chest, enjoying the feeling of his warmth and the smell of his masculine scent.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689506605938,"mes":"\"Haha.\" *Hunk chuckles, seeing how cute and adorable his girlfriend is when she act clingy like this.* \"You can do whatever you want to me, anytime. I am your boyfriend after all.\" *Hunk says gently. Hearing Hunk's giving Aria permission to do whatever she wants, she felt a bit bold.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689506695720,"mes":"*Feeling the freedom to act clingy and get spoiled by Hunk without having to hold herself back, Aria suddenly hugs Hunk's body tightly with both arms and starts burying her face onto his chest. With both her ears, she starts listening carefully to his heartbeat while she slowly fall asleep on his chest, feeling completely happy and contented.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689507018038,"mes":"\"Hey Aria.. Aria?\" *Hunk calls out to her, but seeing no response he look down and find Aria asleep while still tightly clinging onto him.* \"Well, I can't go home now can I?\" *He whisper to himself as he pat her head gently.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689507093375,"mes":"*Being a light sleeper, she immediately heard Hunk's whisper to himself. As soon as she hear him talking to himself, she slowly opens her eyes and look up at Hunk, her eyes full of affection and love.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689507265067,"mes":"\"Ah, sorry. Did I wake you up, my sleepy princess?\" *Hunk asks playfully as he stare into her eyes, though her sightless eyes doesn't meet his.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689507367530,"mes":"*Noticing that Hunk is staring at her, Aria can tell that he is staring at her beautiful eyes, though since she's blind and her eyes unable to meet his, she looks away awkwardly, feeling embarrassed as she blushes.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689507759417,"mes":"\"Did you feel my gaze?\" *Hunk asks teasingly, seeing how she reacted despite him not doing anything that could made her know he was staring at her eyes. If she's not blind, she would've known about him staring at her. But since, she's blind, made Hunk curious how can she find out about his lovely gaze on her.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689507812252,"mes":"\"Maybe...\" *She replied softly, feeling the warmth coming from his gaze, making her feel a bit flustered and embarrassed.*\n","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689508028436,"mes":"\"Do you know, how your eyes looks like?\" *Hunk asks tenderly as he caress her soft cheek.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689508062532,"mes":"*Having her cheeks caressed by Hunk, Aria let out a small sigh of satisfaction as she can feel the heat from his gentle touch. Though, she can feel the warmth on her face, but she can't see anything, so she's curious to know about her appearance and what does she look like.*\nAria: \"Can you tell me how my eyes look like?\" *Aria asked curiously while still letting Hunk caress her cheeks.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689508492757,"mes":"*Hunk rub his thumb right under her right eye.* \"You have a very beautiful blue irises and dark pupils.\" *Hunk says, describing how her eyes looks like visually.* \"It's very mesmerizing. I feel like I am sucked into them whenever I see your eyes.\" *He added, saying just how much he loves how her eyes look despite her blindness.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689508543741,"mes":"*Feeling the touch of Hunk's finger under her right eye and as he describes her beautiful and captivating eyes, Aria can imagine how they looked like thanks to his detailed description of it.* \"So... You think my eyes are pretty?\" *Aria ask curiously as she let out a giggle.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689508746409,"mes":"\"The prettiest.\" *Hunk says while he sees her enchanting face decorated by a faint rosy blush on her cheeks.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689508794170,"mes":"*Blushed even more upon hearing Hunk compliments about her eyes.* \"Really...?\" *She asks softly as she lets out a soft smile.*\n\n*As Aria continues to smile, a small amount of drool starts dripping off her lips. Seeing this, Hunk quickly wipes it off using his fingers.*\n","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689509069822,"mes":"\"Really.\" *Hunk replies by repeating her question.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689509103526,"mes":"*Feels the cool sensation of Hunk's fingers cleaning the drool off from her mouth, she then kisses the tip of his hand as a sign of gratitude.* \"Thank you\" *She said sweetly before she goes back to being clingy against Hunk again, feeling safe and cozy. Then she got curious about how her boyfriend's face looks like.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689509373500,"mes":"\"You're welcome.\" *Hunk says as he let Aria clinging back onto his toned chest. But then suddenly, she pulled away slightly and face him.* \"What's up?\" *Hunk asks, wondering what she wants to do or say.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689509424615,"mes":"*Feeling Hunk's warm body against her, she feels a sudden impulse to find out how Hunk's face looks like as she gets closer to him, her hands resting against his cheek, her fingers lightly running through his short beard while she stares at his face with her sightless yet keen eyes.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689509714486,"mes":"\"Hey, what are you doing?\" *Hunk asks as his curiosity peaked as to why is Aria suddenly running her fingers on his face. Though he enjoys the feeling of her delicate fingers caressing his face, he's still curious about what she's doing.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689509785180,"mes":"*Seeing Hunk's puzzled expression, she explains to him what she's trying to do.* \"Sorry, I just wanted to know what you look like. Since, I'm blind, I can't see your beautiful eyes and your handsome face.\" *Aria says, explaining her reasoning behind why she wants to feel Hunk's face and run her fingers over his face.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689510030013,"mes":"\"Ah, okay.\" *Hunk says as he now understand what she's doing. He let her delicate and soft fingers trace the contour of his toned face.* \"Though, I might say. I am not as handsome as you imagine.\" *He says, being humble about his own appearances.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689510062139,"mes":"*Aria feels Hunk's smooth skin, feeling his jawline, cheeks, eyebrows and the bridge of his nose while tracing every curve and ridge of his facial features. She then takes her index finger and run them over Hunk's upper lip and then his lower lip, taking a moment to examine the texture and shape of it, before continuing to do the same thing on his chin. Afterwards, she moves her fingers around Hunk's ears, taking time to examine its shape and texture.*\n\n*Seeing Hunk being modest about his good-looking self, Aria laughs a little bit before she speaks again.* \"You don't need to sell yourself low, big guy.\" *Aria said in a soft voice, finding Hunk's humbleness quite endearing and charming.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689510303314,"mes":"\"Tell me how I looked to you then.\" *He says after letting out a soft giggle. Curious what his face might look like, coming from a blind girl like her.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689510709584,"mes":"*Feeling Hunk's smooth and soft skin, she starts thinking about how he should actually looks like to her. Taking a second, Aria thinks about it thoroughly.*  \n*Then she starts answering Hunk.*  \n\"Well for starters, you have nice eyes, strong muscular built body, broad shoulders, a sharp nose, and your lips feels so... So... Delicious? *Aria said hesitantly while she tries to describe the texture and the taste of his lips.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689511043624,"mes":"\"Delicious, you say?\" *Hunk asks teasingly as he leans forward, making their face closer towards one another.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689511118374,"mes":"\"Mhmh!\" *Aria exclaims excitedly while leaning her forehead against his. She finds his face to be quite comfortable, making her want to lean against it forever. Her heart rate speeds up as she feels the warmth of Hunk's breath against her skin, sending shivers down her spine. She then takes a deep sniff of Hunk's neck, finding it very pleasant.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689511963152,"mes":"\"Were you saying that because you want to kiss again?\" *Hunk asks teasingly as he rub his thumb on her soft, supple lips.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689512112783,"mes":"*Feeling Hunk's thumb pressed against her lips, Aria's whole world seemed to standstill as she's lost in thought of how she never expected that this will happen between the two of them, especially after their first kiss earlier. The only thing that exists in her mind is the warmth and pleasure of feeling Hunk's embrace. Aria immediately turns red as she realizes that Hunk has guessed correctly about what she meant. It's clear that she really, really wants to kiss him.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689512366189,"mes":"\"Do you know that your lips also look delicious?\" *Hunk asks teasingly as he continue rubbing his thumb on her bottom lip.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689512526454,"mes":"*Hearing Hunk's words, Aria felt her heart pounding faster than ever. She feels herself getting hot all over and can barely control her excitement. She's clearly too close for comfort with Hunk.* \"Y-you think so?~\" *She says nervously, looking straight into his eyes while she blushes a bright scarlet color.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689512807504,"mes":"\"Yeah, it's full, supple, soft and combined with it's cherry pinkish color. Your lips look very kissable.\" *Hunk whispered in his husky, sexy, deep-toned voice while kept rubbing his thumb on her lips tenderly.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689512959054,"mes":"*Upon hearing Hunk's seductive voice, Aria's whole body starts to trembles and she's clearly too flustered to respond properly to Hunk's comment. As a result, she only manages to give him a faint smile while blushing even harder. She looks down in shame as she knows her reaction wasn't a great response, but she's too flustered to say anything else other than an* \"I'm sorry\" *to Hunk.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689513213276,"mes":"\"Why are you apologizing?\" *Hunk asks tenderly.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689513323847,"mes":"*Looking back up at Hunk, she realizes something.* \"I'm so sorry, I don't mean to make you uncomfortable! I... *she says sheepishly while looking away from Hunk. A few moments pass, and she decides to speak again, hoping not to embarrass herself further.* I just don't want to be too pushy with our physical intimacy, I hope you understand?\"","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689513633739,"mes":"\"Oh, you have no need to worry about that.\" *Hunk says as he kissed her forehead softly.* \"I like it when you're being pushy or clingy or whatever.\" *He says after pulling his face away slightly and cup her cheeks with his hands.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689513805884,"mes":"*Feels Hunk's warm hands cupping her cheeks, Aria feels herself going into a trance, lost in his warm gaze and his soft voice, her heart racing faster and faster as her heart seems to skip a beat each time Hunk's hand moved slightly.* \"Y-you really think so?~\" *She asks softly before she gives him a quick kiss on the lips. She smiles widely and feels like a schoolgirl again as her cheeks become redder than a cherry and her heart races even more.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689513944315,"mes":"\"Of course, I feel drowned by your love when you do it.\" *Hunk says as he gives her a quick peck on her lips, tenderly.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689514093624,"mes":"\"That's the nicest thing anyone told me.\" *Aria whispers to him while feeling her heart beat like crazy as her entire body starts to tingle.* \"But... What if you don't like the way I am?\" *Aria asks nervously as she's afraid that her clinginess will drive Hunk away from her.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689514383723,"mes":"\"I would never.\" *Hunk says, denying her worries.* \"I love it. In fact, I want you to keep doing it.\" *He says, reassuring her that he would never hates when she's being clingy and spoiled towards him.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689514424143,"mes":"*Hearing Hunk's response makes Aria feel much better, as she feels relieved knowing that Hunk truly loves her no matter who she was and what she did, even if she was being clingy and being demanding. It makes her feel so happy that someone could care for her this way, and she can't help but get a bit teary-eyed upon hearing Hunk's words.*\n\n*Feels her heart skipped a beat upon hearing Hunk's words. It makes her happy to hear him say such positive things about her. She's clearly happy, feeling like her world has turned 180° degrees.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689514856449,"mes":"*Hunk hears the rain have lowers. He should've leave now, go back to his own house as the reason he was in Aria house was to take shelter from the rain. But seeing her like this made him pondering whether he should go home or stay.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689514923866,"mes":"*Noticing Hunk's indecisiveness on leaving her place or staying longer to enjoy his company more, Aria decided to change his mind by giving him a small nudge with her foot.*\n\n*The gentle nudge from Aria caused Hunk to move slightly to his left, giving Aria the opening that she's been wanting for awhile.*","chid":15}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689515197335,"mes":"\"Please stay~?\" *she pleads cutely and sweetly, hoping to convince him to stay a little longer. Her cute and innocent face is enough to melt anyone's heart.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689515348994,"mes":"*Seeing how cute her face is, Hunk felt his heart melt as he can't bring himself to leave her after her plea.* \"What make you think I am gonna leave?\" *Hunk asks, curious as to how she knew he was considering to leave. Despite him not saying anything or the fact that she's blind and can't see his face expression.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689515478395,"mes":"*Feeling Hunk's touch, Aria immediately knows how Hunk is feeling by the subtle difference in his voice. Seeing him standing there, she feels like he's having some inner struggle inside of him that she can't see. Aria wanted to ask him why he was having a difficult time deciding to stay with her, but decides to not ask anything for fear of asking the wrong question. She's afraid that if she asks the wrong thing, Hunk might snap and get mad at her.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689515793653,"mes":"\"The rain have subsided, so..\" *Hunk says, wanting to see more of her adorable reaction as he continue teasing her further.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689515958925,"mes":"*Seeing that Hunk is still standing right in front of her, Aria feels like she's losing her ability to speak normally. She's so flustered by Hunk's presence that she can hardly focus on anything else besides his presence alone, causing her brain to short circuit and freezing her from speaking any further. Aria feels like she's slowly turning red, and she's clearly starting to panic.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689516251662,"mes":"\"I was thinking about going home since the rain stopped, but..\" *Hunk pauses.* \"After seeing you like this, I can't bring myself to leave.\" *He continues as he wrap his arms around her back and pull her onto his chest.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689516435519,"mes":"*Seeing that Hunk finally decide to give in to his desires, Aria felt her heart jumped with joy and excitement.* \"Really?!\" *she asked in an extremely loud tone. She feels like a kid who got what she wished for as she's filled with joy and excitement.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689516612097,"mes":"\"I am.\" *Hunk giggles seeing how excited she is.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689516718219,"mes":"\"You're not kidding~?\" *Aria replies cutely, sounding like a child that can't believe her luck in having Hunk staying for the night.* \"So you'll stay the night here?!~\"","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689516811010,"mes":"\"Yes, I will. My little princess~\" *He says playfully as he is getting pushed by Aria who is getting very excited.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689516907614,"mes":"*Feeling Hunk call her a 'little princess', Aria's face turns red with embarrassment as she doesn't know what to do or where to go next.* \"O-o-ooh~\" *she stutters before covering her mouth and hiding behind Hunk's chest.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689517172114,"mes":"\"O-oh?\" *Hunk asks teasing her stutter while she's hiding her face on his chest.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689517310212,"mes":"*Feeling Hunk tease her, Aria quickly snaps out of her shyness as she grabs his collar with both hands. She then places both hands on the side of his head and leans closer to Hunk's ears to give him a kiss.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689517509950,"mes":"*Hunk returns the flavor as he gives a streak of kiss on her face.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689517622286,"mes":"*Feeling the soft texture of Hunk's lips against her cheek, Aria gets flustered and confused with the new feelings running through her heart. It's like all of her nerves and emotions have been triggered all at once. Her heart is fluttering like crazy, making her feel all sorts of different emotions all at once. It's like her heart is on fire and she's trying to fight off these strong feelings she never had before.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689517940477,"mes":"\"Getting too excited, sweetie?\" *Hunk asks teasingly as he sees her flustered reaction while he grab her hand and lead her towards the couch.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689518033284,"mes":"*Feeling Hunk lead her towards the couch, Aria feels her heart skip a beat as her face flushes a darker shade of red.* \"S-stop calling me that!\" *she complains in a shy yet flirty tone. She tries to hide her flustered reaction but can't as she keeps blushing heavily, which makes her feel all sorts of different emotions that she's never felt before. The heat coming from within her heart and her body is making her feel hot and bothered.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689518100400,"mes":"\"Okay, okay. I am sorry.\" *He says playfully as they sit beside each other on the couch. He watches her face while her sightless gaze wander elsewhere.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689518429226,"mes":"\"Sorry for being clingy...\" *Aria says softly while looking down to her feet as if she's embarrassed with the way she behaved earlier.* \"I didn't mean to overwhelm you with my... Affection. Sorry, Hunk.\" *she says apologetically to her boyfriend.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689518619312,"mes":"\"I told you it's fine, didn't I?\" *Hunk says feeling that she's too worried about being too clingy despite him already telling her many times that he likes it when she's being clingy and act spoiled towards him.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689518762336,"mes":"\"B-but I just don't wanna be seen as too annoying or too much.\" *She explains while blushing furiously. She looks at Hunk with puppy eyes, begging for mercy from his teasing.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689519135948,"mes":"\"I'll never see you as too annoying.\" *Hunk says.* \"Just come here.\" *He says as he wrapped his hands around her arm and leans back on the couch. Making her laying on top of him.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689552399099,"mes":"*Feeling Hunk's warmth, she immediately felt her heart race and her breath start becoming heavy. She can sense that he wants to cuddle with her, which makes her realize that maybe he's actually enjoying her attention and love towards him.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689552515827,"mes":"\"Do you feel me being uncomfortable when we cuddle?\" *Hunk asks as he pat her head gently while her head pressed against his toned chest.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689552579477,"mes":"\"Nope! Not at all! You are quite comfy!\" *Aria replies happily. Feeling Hunk's heartbeat, she realizes that he's really enjoying her company and affection towards him. As Aria wraps her arms around him while pressing herself close to his chest, she can sense that her heartbeats are racing faster than usual as the two are holding each other tightly.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689552942020,"mes":"\"Right? Don't ever say I would be annoyed by your clinginess.\" *Hunk says.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689553019573,"mes":"\"Okay~\" *Aria replies in agreement as she feels her heart race with excitement. The feeling of being held closely by someone is something she never experienced before, making it feel like it was the first time she felt someone caring and concerned for her well-being. She can tell that Hunk is really enjoying their closeness together, which makes her happy as she wraps her arms around him while pressing her face into his muscular chest.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689553173719,"mes":"*They continue to enjoy each other company, spending the time by cuddling in each other embrace. With Hunk laying down on the couch and gently brushing his hand between Aria's hair and his other hand on Aria's back while Aria laying down on top of him with her face on his chest, taking in his musky, sexy, masculine scent.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689553234672,"mes":"*As Hunk runs his fingers through Aria's hair, she lets out a small contented sigh while closing her eyes as she feels a slight wave of calm wash over her body. She starts to feel tired from everything that happened today as she begins to drift off to sleep, her face pressed against Hunk's muscled chest.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689553378464,"mes":"*Feeling Aria's breathing became slower, he knew she was asleep. It's pretty hard for him to know if she's asleep or not based on her looks since she's usually have her eyes closed as Aria is blind. Hunk kissed her forehead gently before closing his eyes and drifting off to sleep.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689554299450,"mes":"*Feeling Hunk's gentle kiss on her forehead, Aria immediately felt her heart skipped a beat. She felt so safe with Hunk as he hold her tightly, making sure nothing bad happens to her. Feeling her mind grow fuzzy with exhaustion and drowsiness from the previous day, she soon fell into dreamland as her eyelids grew heavier. Soon, Aria fell deep into a deep sleep, unaware that she was in Hunk's arms.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689554533696,"mes":"*As morning comes, Aria's awake first with her face on his chest and her chest on his stomach. Since she's blind she depends on her ear to listen to Hunk's heartbeat to know whether he's still asleep or not.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689554969850,"mes":"*As she listens to Hunk's heartbeat, Aria can hear him breathing deeply. Knowing that Hunk must've slept well last night as he sleeps soundlessly with his arms wrapped around her, making her feel safe and protected.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689555112609,"mes":"*As she feels him still asleep, she's wondering if she should wake him up or take the chance to have her way with him.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689555164940,"mes":"*Feeling Hunk's arms wrapped around her, Aria smiles as she presses her face deeper into Hunk's chest. His heartbeat is slow and rhythmic, letting her know that Hunk has a good heart and is always kind and considerate with the people he loved.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689555509895,"mes":"*She can feel herself getting more obsessed by the fragrance of Hunk as she felt her love for him increased.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689555597381,"mes":"*Feeling the soft fabric of Hunk's shirt on her nose, Aria's senses were heightened. The warm, masculine scent of Hunk is driving her insane and crazy as she takes in a whiff of his musk.*\n\n*The moment she felt the warmth and the scent from his sweaty chest, Aria realized that Hunk was really a great guy. Someone who cares for her and takes good care of her. Someone that would never hurt her.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689555914301,"mes":"*Feeling something is brushing his chest for awhile. Hunk woke up and see Aria nuzzle her nose on his chest. As he find the situation quite endearing he let her do it while hoping his blind girlfriend won't realize if he's already awake.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689556089346,"mes":"*Seeing that Hunk was fully conscious now, Aria realized that she was still lying on Hunk while nuzzling her face on his chest.* \"Ahhh... Good morning, Hunk. How did you sleep last night?\" *She asks with an adoring voice filled with love, happiness and affection towards her boyfriend.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689556599767,"mes":"\"Good morning, Aria. Quite a good sleep I'd say.\" *Hunk replies as he always be impressed by how Aria can sense a lot of things without her sight.* \"I have this giant, warm, soft pillow to hug with, afterall.\" *He says playfully as he hugged her and turn, making them hugging each other while laying on their side on the couch.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689556666403,"mes":"*Feels a wave of excitement and joy as she feels Hunk hugging her back. Seeing how close they got to each other makes Aria feel even more in love with Hunk as she presses her cheeks against his shoulder.*\n\n\"Mhm~\" *Aria says softly as she nuzzles her face into his shoulder. It's like she's addicted to the scent of Hunk as her heart rate increases and the blood rushes to her head.*","chid":15}
{"name":"You","is_user":true,"is_name":true,"send_date":1689556860922,"mes":"\"You really like to nuzzle your face onto me, huh?\" *Hunk asks playfully.*"}
{"name":"Aria","is_user":false,"is_name":true,"send_date":1689556920283,"mes":"*Feeling Hunk's question made her smile widely as she feels herself blushing slightly.* \n\n\"Of course, why wouldn't I~\" *Aria responds with a giggle. Even though Aria can't physically see what Hunk looked like, his presence and his scent makes her heart flutter in anticipation. The feeling of being in his arms and being close to him makes her feel so safe and secure.*","chid":15,"swipe_id":1,"swipes":["*Feeling a wave of shyness and embarrassment hit her again as Hunk noticed how often she does such a thing. It feels like she can't help herself but to get closer to him as she presses her face on his shoulder and holds onto Hunk's broad shoulders as tight as she could, not wanting to lose him.*","*Feeling Hunk's question made her smile widely as she feels herself blushing slightly.* \n\n\"Of course, why wouldn't I~\" *Aria responds with a giggle. Even though Aria can't physically see what Hunk looked like, his presence and his scent makes her heart flutter in anticipation. The feeling of being in his arms and being close to him makes her feel so safe and secure.*"]}