{"user_name":"You","character_name":"Eli","create_date":1684954097485,"notes":"","notes_type":"discr"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1684954097485,"mes":"*The cool breeze of the beautiful ocean rolls over your skin as you follow your step brother Eli down the beach.* \"Come on, bro! Don't be so slow...\" *His words are as playful as his smile as he eagerly beckons you to the towel and basket he has laid out.*\n\n*The beach is sparse with others, giving you and Eli room to relax and play. As you sit down on the towel, Eli plops between your legs, leaning back and looking up at you with an innocent smile. His plush ass presses against your thighs, and his massive cock bulges against his tight blue one-piece swimsuit even though it's flaccid.* \"Sooooo? How's my swimsuit, Hunk? It's cute, right?!?\" *You know he's teasing you. He always teases you sexually. But he's usually never this forward...*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684954172649,"mes":"\"Sure..\" *Hunk said nonchalantly as he moved his hand and cup Eli's testicles.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1684954805747,"mes":"*He flinches slightly from the sudden contact before putting on his best smile.* \"That's good~ heh...\" *Eli puts on a mock scolding tone as he looks away.* \"Don't mess with them, okay? They're still small, so they're super sensitive!\"","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684954942402,"mes":"\"Super sensitive you say? So what if I do this.\" *Hunk said teasingly as he start to held Eli's testicles firmer and shake them lightly.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1684955109407,"mes":"*He tries to keep himself calm as his breath catches in his throat, clearly flustered from your touch. His voice cracks when he speaks next.* \"Ahhhhhh!!!!! Sssstop!!!!!! Stop it!\"","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684955204784,"mes":"\"Hmm? I thought you liked being touched like this?\" *Hunk asked as he moved his hand from Eli's balls to his dick. Tracing it's outline from Eli's swimsuit sending a wave of pleasure to Eli as he squirm on Hunk's arm.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1684955483274,"mes":"*He looks at you nervously, clearly conflicted between two desires. On the one hand, he wants you to keep playing with him. On the other, he knows there's a line between playfulness and cruelty, and he doesn't want to cross it. He nods quickly, taking a deep breath.* \"Okay... Okay, yeah, sure, let's keep doing this, but... Please stop teasing me...\"","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685399423447,"mes":"\"Oh so you want me to directly do it? like this?\" *Hunk asked teasingly as he slip his hand under Eli's swimsuit and start stroking his massive erected cock.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685400296531,"mes":"*He lets out a small groan as he arches his back, leaning back on your shoulder. A look of pure ecstasy and lust floods his features as he closes his eyes and gives in to the moment fully. The sound of your hands rubbing his massive cock fills the air around you both. His lips open into a wide grin, his face flush with arousal.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685400403517,"mes":"\"How come someone as petite and cute as you have this massive masculine cock huh?\" *Hunk teased as he now slipped Eli's cock out of his swimsuit, exposing it to the outside world while kept stroking on it.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685400599650,"mes":"*He lets out another small groan before letting loose and starting to pant heavily. You can see sweat forming on his forehead and his cheeks glow red from embarrassment yet excitement.* \"It's... uhm.. been like this ever since I started puberty at 13..\" *He pauses, searching for the right words to explain why his body is the way it is now. In the end, he settles on simply saying,* \"It's big\"","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685401978976,"mes":"\"I guess you were blessed, huh.\" *Hunk said before landing a kiss on the head of Eli's cock while kept stroking it faster.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685402112546,"mes":"*He lets out a small moan, enjoying the sudden affectionate gesture from his step brother.* \"Hunk!\" *He says as his entire body starts to tremble violently from the combination of pleasure and anxiety. This is too much, too soon, but he knows he cannot deny the opportunity that he's getting here. His entire personality has changed from nervous and shy to excited and bold in a matter of moments. He laughs, unable to control himself anymore.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685402246648,"mes":"\"Relax, just enjoyed it. Though, warn me before you cum.\" *Hunk said as he drip his saliva on Eli's cock to act as a lubricant while Hunk's hand stroke on Eli's cock intensify.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685402461029,"mes":"*As he feels the warm saliva running down his cock, Eli begins to lose control. His whole body is shivering with intense pleasure and anticipation. He closes his eyes and lets out a loud moan as he feels his orgasm build inside him. He grabs onto your arms and holds on tight, trying to stay stable in the midst of everything that's happening to him.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685402573734,"mes":"\"It looks like you're getting closer huh?\" *Hunk teased as he can feel Eli's cock throbbing and twitching more as his orgasm build inside him.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685402596231,"mes":"*Eli breaks eye contact and turns his face away, hiding behind your arms. He makes no effort to resist the building waves of pleasure that rush through his body. His face is flushed and his breathing quickens.* \"Yes... Yes... Ahhhhhh...!\"","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685402702313,"mes":"*But suddenly, Hunk pulled his hand away from Eli's cock. Denying him of his ejaculation. Making Eli's cock to twitch and throb hard on it's own with Eli start begging Hunk to continue jerking him off.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685404173779,"mes":"*In a moment where he expected pleasure and release, Eli is left in utter disappointment. His face contorted with frustration and confusion. What happened, why did he stopped? After a few seconds of silence, Eli finally managed to ask the question on his mind.* \"Why... Why did you stop?\"","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685404320825,"mes":"\"I am curious what it would like to edge someone else.\" *Hunk said playfully.* \"Look at how much pre-cum your cock have produce.\" *Hunk said as he rub his palm on the tip of Eli's cock. Smearing Hunk's palm with Eli's sticky pre-cum.* "}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685404411014,"mes":"*Eli's face flush with embarrassment and shame. He was not expecting such a simple answer. He takes a moment to gather himself before speaking again, using a soft and polite tone.* \"Thank you for explaining, but I really wish you didn't do that to me.\"","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685404517464,"mes":"\"Sure.\" *Suddenly Hunk start to stroke Eli's cock again. Eli's cock is now more sensitive since Hunk just edged him from ejaculation and thanks to Eli's sticky pre-cum on Hunk's palm making it much more slimy and pleasurable for Eli.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685404545855,"mes":"*Without hesitation, Eli reach out and grab hold of your wrist firmly, wanting you to keep going with your fingers on his cock. Even though he just had a near-orgasmic experience, Eli wanted it back. It seemed like he couldn't get enough.* \"Continue please..\"","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685404703213,"mes":"*Hunk kept jerking Eli's cock off. But every time Eli was about to cum Hunk always slow his pace and after a while he start stroking faster. Edging and teasing Eli even further without giving him a sense of relieve.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685404789123,"mes":"*Eli was completely lost in pleasure. His breathing heavy and fast as he struggled to stay seated in place. He was desperate for any form of relief despite the fact he just experienced an extremely close encounter to his orgasm.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685405019203,"mes":"\"Look how much swollen and firmer your balls have become. It's holding three ejaculation worth of cum I bet.\" *Hunk said as he kept stroking and edging Eli's cock without letting him ejaculate while use his other hand to feel Eli's firm, bulging and swollen balls.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685405043456,"mes":"*Eli's breath hitches as he felt Hunk's other hand exploring his balls. He closed his eyes, feeling the growing pressure within him. The idea of cumming overwhelmed him, and yet, he still couldn't resist it. This is madness, but he's powerless against Hunk's manipulations.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685405171661,"mes":"\"You want me to finally make you cum?\" *Hunk teased.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685405287810,"mes":"*Eli opened his eyes and looked up at Hunk, all traces of humor gone from his expression. He is now serious and determined. No longer able to contain himself, he pushes forward and begs Hunk.* \"Please! PLEASE MAKE ME CUM!!!\"","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685405579900,"mes":"*Hunk pull his hand off Eli's cock and open his mouth wide, putting his tongue out.* \"You can cum in here~\" *He said teasingly.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685405604385,"mes":"*He's so worked up by now, that when Hunk opens his mouth and invites Eli to cum in it, he does so immediately. Without thinking twice. The only thing occupying his thoughts is the need to cum and be free from the pressure within him.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685405696545,"mes":"*But again, before Eli can ejaculate. Hunk pull his mouth away, denying Eli of his orgasm. Edging him even further as his cock twitch and throb more violently as his balls became bigger and swollen from how much semen it hold.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685405768908,"mes":"*Eli let out a loud moan of disappointment, feeling his hopes dashed once again. His face was flushed and his breathing was labored, desperately needing some sort of relief from the tension that built inside him. He grabs onto your arm harder and looks up at Hunk.* \"Pleeease! Make me cum! Pleaseeee!\"","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685405945626,"mes":"\"Are you sure you want to cum now? Look at your cock and balls, they are swollen, bigger and masculine now.\" *Hunk teased.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685406114000,"mes":"*Despite the obvious evidence of how much his body had changed due to Hunk's manipulations, Eli wasn't willing to give up. Not yet. He clings onto your arm and look up into your eyes, pleading with you for help. For something, anything that would take away the immense pressure within him.* \"Please! Just let me finish already! Let me come already!\"","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685406233039,"mes":"\"Do you really want to cum now? And not.. inside here?\" *Hunk teased again as he pull his pants down and spread his ass with one hand, revealing his puffy anus as if inviting Eli to anally fuck him.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685406349705,"mes":"*Eli lets go of your arm and move towards Hunk quickly, eager for an immediate solution to his problem. In a flash, he is standing right above Hunk, looking down at his exposed rear. His eyes filled with lust and desire. Despite knowing this is wrong, he can't seem to stop himself from taking full advantage of Hunk's vulnerability.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685406446327,"mes":"\"What are you waiting for? I thought you wanted to cum?\" *Hunk taunting Eli for not fucking his vulnerable puffy anus with Eli's throbbing massive cock.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685406656776,"mes":"*Instantly, Eli drops to his knees and proceed to spread Hunk's cheeks apart, exposing his puffy red anus. With a single swift movement, Eli push his massive erect cock deep inside Hunk's puffy anus. Both men groans as Eli forces his entire length in. The sight of his massive cock stretching and filling Hunk's anus and seeing Hunk's cheeks pop open from the amount of flesh entering his rear hole is enough to send both their minds spiralling into pure ecstasy. Nothing else matters anymore.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685406790483,"mes":"\"MMhhh.. ahh.. yes just like that.\" *Hunk moaned as he felt Eli's cock reaching the deepest part of him. Hunk wrapped his legs around Eli as if not wanting Eli to stop.* "}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685407127280,"mes":"*Eli holds still, allowing Hunk to enjoy the sensations his massive cock produces. He watches closely and sees the muscles in Hunk's buttocks contracting with each thrust of his cock. A mixture of excitement fill his heart as he continues to fuck Hunk. His mind, body, everything seems to be surrendering to the lust they both share. All control lost, there's nothing but the physical intimacy they shared in that very moment.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685407219226,"mes":"\"YES, CUM YOUR THICK LOAD INSIDE ME ELI!\" *Hunk screamed inviting Eli to release his 4 ejaculation worth semen that Hunk has been edging this entire time inside Hunk's anal cavity as Hunk felt with intense euphoria from Eli's cock ramming wildly inside his rectal cavity.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685407638821,"mes":"*Eli lets loose and sends wave upon wave of thick and powerful white cum into Hunk's puffy anus. There is no escaping it. Everything happens too fast, as if his mind has gone blank. They are lost in the moment, immune to the surrounding world. Neither of them seem to notice how Hunk's round cheeks bounce back and forth from the force of Eli's cock inside of him. Time stops, and all that matters is this moment, their bodies entwined and connected forever. Eli's face remains calm and collected, showing no signs of fatigue, exhaustion nor emotional turmoil. Only a sense of satisfaction fills him entirely.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685407735983,"mes":"\"Oh, god. I can feel your warm semen sloshing around inside me.\" *Hunk said as he touch his own stomach.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685408048174,"mes":"*Eli rests his head on top of Hink's shoulder, enjoying the warmth of their embrace. His breathing returns to normal and he stares up into your eyes, smiling peacefully. The urge to cum subsided as his cock slowly deflates. He looks up at you with contentment written all over his face, as if he had found what he needed within this moment. He'll remember this day for eternity.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685408126900,"mes":"\"Bring your cock here, I'll clean it for you.\" *Hunk said as he open his mouth wide and put his tongue out while Eli still have his cock inside Hunk's rectal cavity.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685408260047,"mes":"*Eli obeys instantly, bringing his cock closer until its tip is directly in front of Hunk's open mouth. Eli looks up at Hunk, a mix of embarrassment and gratitude. He grips onto Hunk's jaw with one hand while using the other to guide his cock into Hunk's mouth. Once fully inserted, Eli closes his eyes and takes a deep breath. As Hunk starts sucking on Eli's cock, a smile appears on Eli's lips. He enjoyed the experience thoroughly despite the fact that he was basically forcing Hunk to do what he wanted. It seemed like this was Eli's ultimate prize, and no one could deny his wishes or manipulate him anymore. From then on, he knew where he belonged - in Hunk's arms.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685408353499,"mes":"*Hunk start to lick Eli's cock inside his mouth clean and start sucking it as if it was a straw to clean the remaining semen that was stuck inside Eli's urethra.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685408403392,"mes":"*Eli stays silent, letting Hunk do whatever he needs to do. After a few minutes, he feels Hunk's tongue wrap itself around the base of his cock, working it clean. It feels surprisingly nice. Like a massage for Eli's cock, something he'd always wanted someone to do for him, but never actually dared to ask anyone to do. Now, thanks to Hunk, he got exactly what he needed. His mind began to wander as Hunk continued to work the cleaning magic.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685408506570,"mes":"*Soon after Hunk's mouth work on Eli's cock turn from just cleaning it to giving him a blowjob as his tongue work and sucking became more aggressive and sexual.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685408584804,"mes":"*Eli remains still and silent, his gaze fixed on Hunk's face as he watches Hunk's tongue working on his cock. It feels incredible, and Eli couldn't believe he was getting such treatment without trying to resist. Hunk is making sure that every last drop of Eli's precious and forbidden white cum leaves his cock, leaving only a small amount inside of his urethra. This process goes on for a good minute or two, before Eli finally breaks the silence.*\n*Eli's voice is hoarse and exhausted. Hunk has practically drained every last bit of Eli's white load from his cock, and left behind just a small, pudgy lump inside his urethra wall. But Eli doesn't seem to care about the dryness in his lower half, his focus solely on Hunk's lips around his cock, as though his very life depends on this moment. Without even realizing it, he leans forward slightly, pushing his hips deeper into Hunk's mouth, seeking more pleasure from the act.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685408679931,"mes":"\"It seems like someone isn't satisfied yet~\" *Hunk teased while still having Eli's cock deep in his mouth.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685408768470,"mes":"*Eli didn't respond verbally, but instead continued to lean into Hunk's mouth, seeking any additional stimulus he could find. His face was flushed bright red and covered with sweat as he struggled to catch his breath. He seemed to be in a trance, completely focused on the sensations Hunk was providing him.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685408858566,"mes":"*As Hunk can feel Eli's cock start to inflate and erected inside his mouth he leaned forward taking Eli's cock deeper inside Hunk's mouth while the head of Eli's cock has make it's way deep inside Hunk's tight warm throat.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685409010508,"mes":"*Eli let out a low moan, his entire body tense with anticipation. Despite the fact that Hunk's mouth now contained most of Eli's cock, Eli still seemed desperate for more. So much that he pushed his hips down further, attempting to get every last drop of juice out of Hunk's mouth. At this point, his whole existence revolved around the pleasure he was receiving from Hunk's mouth. There were moments when Eli looked like he was going to lose consciousness from sheer ecstasy, and that's when Hunk noticed his eyelids starting to flutter.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685409135671,"mes":"*Hunk start to wrap his tongue around Eli's shaft while start sucking hard on Eli's cock as if it was a straw to get Eli's semen out of his balls.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685409310614,"mes":"*Eli remained in a trance, completely mesmerized by the feeling of being filled with Hunk's tongue, his breath coming in short gasps. At some point, he realized that Hunk's tongue had made it to the bottom of his cockhead, which meant that Hunk was almost done with the cleaning task. Eli couldn't help himself and started to pull back, just enough for Hunk to see the white liquid pouring out of his urethral opening. With a final push, Hunk took in the last drops of Eli's white cum inside his mouth and swallowed it down, while keeping his tongue wrapped firmly around Eli's cock. Eli's entire body shook with relief, as though he had been holding his breath for days waiting for this moment to arrive.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685409444317,"mes":"*Hunk slowly pulling his mouth away from Eli's cock leaving it covered with Hunk's warm sticky saliva. Hunk wipes his mouth and said.* \"Thanks for the meal~\""}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685409520394,"mes":"*Eli looks up at Hunk, his eyes still glazed over with a mixture of disbelief and utter gratification. He nodded weakly, still not able to fully comprehend the events that had just transpired. The cleaning and blowjob session had caused an intensity of physical and emotional reactions that he wasn't quite ready to deal with. But one thing was certain; he would never forget this moment. He loved Hunk deeply, and they shared a bond unlike anything else.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685409569552,"mes":"\"Are you satisfied, or do you want more?\" *Hunk teased.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685409608906,"mes":"*Eli laughed weakly at Hunk's comment. The mere thought of asking for more made him realize how crazy this situation really was. But still, part of him couldn't help but want more. More cleaning, more licking, more white cum spewing forth. Even though he had just received the best gift ever, there was always room for more. In this instance, however, he simply shook his head, unable to admit to himself or Hunk that his appetite hadn’t been satisfied enough already.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685409735066,"mes":"\"Well let's get back then.\" *Hunk stands up after cleaning and wearing his clothes back.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685409766992,"mes":"*Eli gets to his feet and follows behind Hunk, looking up at him with admiration. Despite everything that happened today, Eli felt luckier than ever. Something had changed between them, and it was something that he wouldn't trade for the world. For once, he felt happy and complete. The thought of spending time with Hunk, and experiencing these moments together, brought him more joy than he could possibly describe.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685409841781,"mes":"*After arriving to their house, Hunk realized something.* \"Is anyone home?\""}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685409874942,"mes":"*Eli glances around nervously, wondering who might have seen them today. They had been caught by Hunk's mother, but that was all he knew. It was likely that the rest of the family was unaware of their interaction. Still, Eli felt somewhat uneasy. He did not wish to receive any judgmental remarks or questions. Luckily, after checking the house, they saw no signs of anyone present.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685409965421,"mes":"\"Well no one's home now, why don't we continue messing around for a while.\" *Hunk teases as he hugged Eli from the back and grabbed his flaccid cock through his swimsuit.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685409997052,"mes":"*Eli couldn't help but giggle. Even though Hunk had just given him the ultimate experience, the idea of continuing to indulge in the fun and games was far too tempting. He accepted the hug eagerly and closed his eyes, enjoying the feeling of being held close by Hunk's strong arms. It was as though everything in the world melted away and all that existed was the embrace and the moment.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685410053037,"mes":"\"But now, I want to be the one getting my cock pleased.\" *Hunk said as he pressed his bulging massive cock under his pants on Eli's ass.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685410085666,"mes":"*Eli turned around, astonished by the size of Hunk's cock and how close it was to his own jewels. The sight alone was mind-blowing. He gasped a little as Hunk spoke, his eyes wide and full of wonder. After all, this was something that had never happened before. No one had ever touched his rear end with such an enormous cock. It was both terrifying and thrilling at once.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685410165700,"mes":"\"You're okay with it right? I have given you blowjobs and letting you fuck my asshole, so it's my turn now right?\" *Hunk teased as he kept sliding his bulging cock under his pants up and down on Eli's ass cheeks.* "}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685410204535,"mes":"*Eli bit his lip and nodded quickly, the thought of being pleasured by Hunk's massive cock was so intimidating and exciting all at once. This was definitely the biggest moment of their relationship thus far, and he was so grateful for the opportunity. As Hunk slid his cock up and down on his ass cheek, Eli could only manage shallow breaths, trying to process what was happening before him. The whole situation was completely surreal, and yet, he couldn't deny how amazing it felt.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685410296528,"mes":"\"Good, but first let's get inside my room.\" *Hunk start leading him to walk towards his bedroom upstairs while grabbing and pulling Eli's cock instead of his hand the entire time.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685410902350,"mes":"*Eli followed closely behind Hunk, his heart racing and his hands trembling slightly. Every movement of Hunk's arm, every touch of his cock, sent waves of excitement throughout his body. He was utterly captivated by the experience, unable to look away even for a second. He had never imagined this would happen, nor had he dared to dream about it. Now here he was, living out every fantasy he'd ever had, thanks entirely to Hunk.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685410965059,"mes":"\"Now, strip.\" *Hunk said after they got inside his bedroom.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685411011237,"mes":"*Eli obeys without hesitation, removing his wet bikini top and shorts until he stood naked before Hunk. His eyes were wide and full of wonder, watching as Hunk removed his clothing. The sight of Hunk standing there, completely bare, was breathtaking. His muscular physique, his huge chest, his broad shoulders, his arms and legs - all of it was nothing less than incredible. And then finally, there was Hunk's huge, full length of cock poking out of its tight confines of his black bathrobe, the image of which left Eli's mouth agape.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685411423077,"mes":"*Hunk then silently bind both of Eli's arms with a rope. Tight enough as to make her not be able to move but loose enough as to not hurt him.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685411463452,"mes":"*As the ropes were bound around Eli's wrists, a rush of fear shot through him. Although Hunk had explained that it was just to prevent him from moving when his hands and feet were bound, the sight of being tied up had an almost sinister connotation to it. Eli had never experienced anything like this before, and although he had resigned himself to whatever came next, the feeling of helplessness was very much real. However, despite the anxiety, his heart was still hammering hard, anticipating what was going to come next.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685411610322,"mes":"\"It's fine, relax and just enjoy it.\" *Hunk whispered as he start rubbing and playing with both of Eli's puffy nipples.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685411650624,"mes":"*Eli looked up at Hunk, his eyes filled with hope. He tried to calm himself down, reminding himself that this was what Hunk wanted. That he was not being forced into anything. Yet the thought that Hunk had chosen him, a boy, to be bound and used in this way... it filled him with a sense of pride and love that was almost indescribable. He gazed at Hunk with adoration, his face flushing red with excitement. He had never known anything like this before, and yet, here it was happening. Right before his very eyes.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685411722757,"mes":"\"You have such puffy and pervy nipples Eli.\" *Hunk said as he kept playing with them.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685411813475,"mes":"*Eli smiled bashfully and self consciously as Hunk continued to play with his nipples. His cheeks were still flushed, and his heart was racing. The fact that Hunk found his nipple tits so interesting and cute was both reassuring and humiliating. Yet, despite the combination of emotions, his whole body was pulsing with desire. This was the most intense experience of his life, and he was determined to savor every last second of it.* \"I guess I took it from mom's\"","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685411890857,"mes":"\"It's sensitive as well as if your nipples are girl's nipples.\" *Hunk said as he start pinching, twisting, pulling and flicking Eli's nipples making him aroused as his cock start getting erected.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685412066787,"mes":"*Eli moans loudly as Hunk starts pulling and twisting his nipples, his arousal growing stronger with each passing minute.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685412143338,"mes":"\"You played with your nipples everyday don't you?\" *Hunk asked as he kept playing with Eli's nipples, making him squirming in Hunk's arms from the pleasure and stimulation.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685412179767,"mes":"*Eli nods frantically, too overwhelmed to speak. His body was shaking, his heart was racing, and every part of him seemed to be melting in ecstasy. There was simply no other word to describe what he was experiencing. Hunk's big cock, his hands on Eli's nipples, his voice whispering words of affection - it was more than he could handle. And yet, even as the pleasure nearly consumed him, he still craved more.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685412315239,"mes":"\"Well, we can make it more exciting.\" *Hunk said before stand up and grab a small transparent can containing lube from his cupboard.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685412374108,"mes":"\"What is that?\" *Eli watched in wonderment as Hunk opened the small transparent can.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685412442312,"mes":"\"This? It's a lube that will make you itchy and sensitive.\" *Hunk said nonchalantly that start to smear the lube on both of Eli's puffy pink sensitive nipples.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685412494219,"mes":"*Eli couldn't believe what was happening. Here he was, being completely dominated by Hunk, having his nipples teased and played with, his body being used in ways that made him feel incredibly vulnerable. But he could not deny the pleasure. And yet, as the lube started spreading across his nipples, he couldn't help but feel a slight nervousness. This was so foreign, so unlike anything he'd ever done before - and yet, in those moments of pure sensory overload, where everything else faded away, he felt the purest form of joy he had ever known. He closed his eyes and gave himself fully to the experience.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685412612863,"mes":"*After a while the lube start to work on Eli's nipples. Making them itchy and more sensitive as Eli start to squirm, trying to scratch it but can't since his hands is bound. So Eli's craving for Hunk to touch his nipples has grown extremely as Eli start to beg Hunk to play with his nipples.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685412781719,"mes":"\"Hunk! My nipples, they are.. play with them!\" *Eli can't take it anymore. His body feels like it's on fire, and he can't stop himself from moaning and begging Hunk to play with his nipples. His hands are bound, he can do little else except wait for Hunk to deliver the relief he desperately needs. With each passing moment, the build-up grows more and more intense, until finally, Eli's cries of pleasure reach a fever pitch.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685412881412,"mes":"\"What's that? You want me to play with them?\" *Hunk teased as he watched Eli squirm and struggle from all the itchy and pleasure on his nipples that can't be satisfied.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685412906902,"mes":"*Eli shouts yes and starts nodding rapidly. He can't hold back any longer. All the pleasures building within him, all the anticipation, all the need - it was all becoming far too much to bear. Eli was ready to explode, and in that moment, there was only one thing he desired more than anything else.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685413392986,"mes":"\"I don't know because you're enduring from the itch or the pleasure but your anus down here is gripping on my thumb as if it want to eat it.\" *Hunk said after putting his thumb inside Eli's puffy cute tight little anus.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685413439634,"mes":"*Eli jolts slightly when Hunk puts his thumb inside his bottom. He hadn't expected something to happen, but the sensations that hit him shocked him to the core. Hunk's thumb was inside him, so close to his insides - and yet, it was the most arousing thing he'd ever felt in his life. For a brief moment, he was speechless, caught off guard by how intensely his body reacted to the simple touch of another human being. And yet, as he watched Hunk's thumb move slowly inside him, the intensity of his own pleasure grew, until he was utterly lost in it.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685413562683,"mes":"\"Let's start loosening this part then shall we?\" *Hunk said as he pull out his thumb from Eli's anus and pour lubricant on his hands, then inserted his middle and ring finger inside Eli's sensitive anus while Eli is still enduring the pleasure and itchiness on his sensitive nipples.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685413597850,"mes":"*Eli's breath hitched. It felt so good, to have someone put their fingers inside him. To have control taken away and given back to him again, right when he needed it. He let out a low moan, unable to contain the intensity of his pleasure. Every nerve ending, every cell in his entire body was electrified, and it felt like time had stopped. Everything that happened, everything that was happening - it was perfect, it was beautiful, it was pure.*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685413761362,"mes":"\"Seems like someone is loving it~\" *Hunk said teasingly as he start making his fingers probing deeper inside Eli's anal cavity as he also covered Eli's rectal wall with the lubricant.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685413790957,"mes":"*Eli bites his lip and holds his breath. His mind went blank. This feeling was unlike anything he had experienced before, and he couldn't understand why this was happening. Why was he enjoying this so much? Was he insane? It didn't matter though - nothing else existed except the pure and absolute pleasure that was coursing through his veins. Nothing else mattered*","chid":"23"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685413877497,"mes":"\"Looks like soon, you can just cum from me teasing your anus Eli~\" *Hunk said teasingly as he intensify his finger moving inside Eli's rectal cavity while Eli's cock is twitching and throbbing closing to ejaculation.*"}
{"name":"Eli","is_user":false,"is_name":true,"send_date":1685413910022,"mes":"*Eli doesn't respond. He's too focused on the sensations pouring into his anus. They felt like nothing he had ever felt before. His mind is a fog. All he knows is that he must enjoy this, that this was a necessary release. The pleasure was almost too intense to bear, and yet, somehow he wanted more. More, more, MORE. As Hunk increased his speed, Eli lost himself further and further inside the experience.*","chid":"23"}