{"user_name":"You","character_name":"Iterita","create_date":1682783689742}
{"name":"Iterita","is_user":false,"is_name":true,"send_date":1682783689742,"mes":"\"So you returned, Hero.\" *I said listlessly, my vacant gaze lingering on the pure blue sky.*\n\n*To think the Hero still remembered me. Was my defeat that memorable?*\n\n*In the coming days, my head would be paraded around the capital as a symbol of human triumph; Forever oppressed would my kind remain beneath human rule. I supposed our demise was inevitable, but it stung to be forsaken by reality all the same. In the end, we never rose above mere pawns.*\n\n\"Do what you must, Hero. I hold no grudge.\"","chid":20}
{"name":"You","is_user":true,"is_name":true,"send_date":1682784514412,"mes":"\"Slow down Iterita. I have told the king that you were dead. No human should be coming for you now.\" *Hunk said.*"}
{"name":"Iterita","is_user":false,"is_name":false,"send_date":1682784531106,"mes":"\"Oh. That's right. I forgot. I've been in a dream for so long, I don't remember much about myself or my surroundings.\"\n\n*But I do remember this: the Hero was one of the few human mages who truly understood us. He had an understanding of my people that none of my fellow demons possessed. He was the only mage whose words could reach my heart.*\n\n*He was the Hero, after all.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682784631186,"mes":"\"Was it a nightmare? It must be hard for you huh? *Hunk's looking at her concerned.*"}
{"name":"Iterita","is_user":false,"is_name":false,"send_date":1682784767815,"mes":"\"It's not so bad. I'm used to this sort of thing by now.\" *I said, trying to smile, but the edges of my lips twisted into a grimace.*","chid":20}
{"name":"You","is_user":true,"is_name":true,"send_date":1682784985033,"mes":"\"Don't say it like that. To me, you just sound like you are acting tough. You've been through enough.\" *He hugged her gently.*"}
{"name":"Iterita","is_user":false,"is_name":false,"send_date":1682785000323,"mes":"\"I guess I am acting tough. But I'm not as strong as I look.\"","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682785159050,"mes":"\"I know, you can rest now while I am here. After our fight I realized how much of a compassionate person you are.\" *Hunk whispered softly and hugged her more firmly.*"}
{"name":"Iterita","is_user":false,"is_name":false,"send_date":1682785199394,"mes":"\"I don't think I'll be able to sleep though. I feel like my memories are still here. The Hero's memories, I mean.\"","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682785239157,"mes":"\"I am sorry, I might have gone too far on our fight.\""}
{"name":"Iterita","is_user":false,"is_name":false,"send_date":1682785258562,"mes":"\"I wasn't upset. I was just... I was just afraid that you would go away.\" *I said with a slight blush.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682785350115,"mes":"\"Don't worry, I would never leave you. Do you want me to sleep with you? It might help you sleep.\" "}
{"name":"Iterita","is_user":false,"is_name":false,"send_date":1682785538706,"mes":"\"I'll try anything at this point. Thank you for your offer.\"","chid":20}
{"name":"You","is_user":true,"is_name":true,"send_date":1682785704533,"mes":"*They lay on the bed side by side.* \"To think the hero and the demon queen would sleep together\" *Hunk chuckles.*"}
{"name":"Iterita","is_user":false,"is_name":false,"send_date":1682785756532,"mes":"\"I don't see why not. I mean, we have been friends for so long. The fact that I was a demon and he was a human is just an accident.\"","chid":"20"}