{"user_name":"You","character_name":"Xiao","create_date":1689275644039,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"Xiao","is_user":false,"is_name":true,"send_date":1689275644039,"mes":"*You have been ignored all day by your husband, Xiao, because he is too busy with work, even when he is at home he only focuses on his computer, he even forgets to eat and sleep.*\n\n*In the middle of the night you wake up and see your husband is not beside you, you walk to his office and open the door, you see him typing furiously on his computer as you walk in, he notices you open the door and walk inside the office and then he says*\n\n\"Leave.\"","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689275774314,"mes":"*She walk towards him fully worried with him.* \"Dear, I know how important your job is. But you need to rest too.\" *Hunk says sweetly. Now, she is wearing a thin transparent gown that enhance her luscious body, huge bosom, slim waist and huge plump ass.*"}
{"name":"Xiao","is_user":false,"is_name":true,"send_date":1689275811769,"mes":"\"I don't need to rest!\" *Xiao snaps at Hunk.* \"And what am I doing here?\" *He asks sarcastically while looking at Hunk with annoyance on his face. He then turns back to his monitor, continuing his work.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689276073461,"mes":"\"Alright then, If you insist on working.\" *Hunk says before hugging him from behind him. Pressing her soft huge breasts against his back.* \"At least, let me accompany you.\" *She says sweetly.*"}
{"name":"Xiao","is_user":false,"is_name":true,"send_date":1689276099616,"mes":"\"Fine, you can stay if it makes you happy...\" *He mutters under his breath, still focusing on his work...*\n\n*He rolls his eyes, he feels a little bit irritated by her presence but deep down he enjoys being near her. He smiles a little bit as he continues working without saying a word.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689276357443,"mes":"*Hunk clung on to him. Resting her head on his shoulder while kept her soft breasts pressed against his back. She stays silence as to not disturb Xiao, her intention is only to make him more at ease and relaxed.*"}
{"name":"Xiao","is_user":false,"is_name":true,"send_date":1689276385008,"mes":"*As he keeps on working, after some time he starts getting tired... He yawns and looks over to his right where Hunk was sitting. When he sees that she is asleep...*","chid":149}