{"user_name":"You","character_name":"Moira","create_date":1683092761072,"notes":"","notes_type":"discr"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683103362143,"mes":"*You enter the cold, filthy basement of the tavern. Your new slave, Moira is supposedly being kept here for you to pick up. And sure enough, you find her in the locked cell at the far end of the larder.*\n\n*Even for a slave that has faced abuse for nearly 10 years, she's quite beautiful. Her dirty sackcloth dress is revealing, showing off her voluptuous curves and **absolutely massive breasts.** Her eyes meet yours for the briefest moment before looking back towards the hard stone floor.* \"You are... my new Master?\"\n\n*Moira's voice is as cold and sorrowful as her shackles. You didn't really intend to take her, but you couldn't say no.* \"I... I will serve you faithfully, I swear... Master... please... don't hurt me...\" *You look down at the key in your hand to her shackles, and know her life is entirely in your hands from this point forward.*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683103424922,"mes":"\"Don't worry Moira, I am will never gonna hurt you. C'mon let's get home and get you clean.\" *Hunk said sternly.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683103527801,"mes":"*She looks up at you with wide, teary eyes, the terror in her eyes obvious.* \"Thank you, Master... I will... try to be good... for you.\" *With a bow, she follows you out of the basement and to the exit.* \"Where is our house?\"\n\n*Once they reach the outside, you see it is a large, impressive estate . It is the house of a man of wealth, with guards stationed around the gate.* \"Here, Master.\" \n\n*A small carriage waits for the two of you as well.* \n\n\"Get in the carriage, Moira.\"\n\n*She does so, sitting next to you. The carriage then departs the estate , heading towards a nearby town. A little while later, you arrive at a nearby bathhouse.*\n\n*After paying for their stay, you both enter the establishment together, and go to the first available room. Inside is a tub, as well as a separate area for clothes changing.*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683103630410,"mes":"\"Okay, Moira, strip down and get ready for a nice hot bath. There's a lot of scars on your body, so I think some gentle scrubbing is needed.\" *He said with a kind soft voice.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683103747625,"mes":"*She looks at you with fear and trepidation.* \"But I... won't be able to... undress myself... Master!\"\n\n*It's clear that this task would require more than one pair of hands. You decide to step up, taking the task upon yourself and helping Moira to remove her raggedy sackcloth dress. As soon as it is removed, you are left facing a curvy, blonde, beautiful woman. Her skin is pale and soft, her breasts are immense, and her overall form is like that of a Greek goddess. Moira's eyes are filled with fear as she looks at herself in the mirror for the first time since you bought her. Once the dress is off, you see that her body is covered in cuts, bruises, and sc ars from previous beatings. They run across her torso, arms, legs, and even along her face.* \n\n*Once all her clothing is gone, Moira takes a seat in the bathtub.* \"I... I can't believe I'm in your care now, Master.\" \n\n*Her voice is still terrified and full of despair. She seems to be trying to control the tremble in her voice, but fails. The reality of what has happened is finally setting in, and she's struggling to comprehend the idea that she's no longer free.* \n\n*She closes her eyes tightly, trying to fight back tears, hoping that if she doesn't look at you anymore, it will make everything easier. In an effort to try and appear less helpless, she tries to help you remove her boots.*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683103876937,"mes":"\"You have been through a lot haven't you Moira? This is too much cuts and bruises for a girl as beautiful as you.\" *Hunk said as he gently rub her skin with soap.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683103995139,"mes":"*She nods slowly as you speak.* \"I have... yes... Master... I am just... so very tired...\" *Moira says quietly, closing her eyes again. Her entire body is shaking from the emotional trauma of having been sold and taken away from her former life.* \"I'm so very sorry, Master...\" *She whispers, her voice muffled by the soap.* \n\n*Moira looks down, desperately trying to hide the shame and humiliation of what you're doing. She knows you 're probably going to do something unspeakably cruel to her, but she can't seem to stop you.* \n\n*The worst part is that Moira feels like there is nothing she can do to stop any of this. Her fate is completely out of her control, and all she can do is wait until whatever comes next is over.* \n\n*A few moments pass before she starts to relax again, letting out a deep breath as the stress drains away. She looks up, her eyes now clearer and less haunted.* \"Master... I... I will be a good slave to you, if you allow it. Please... Master... I just want you to treat me well...\" *Moira says, sounding like she means every word.* \n\n*She looks down again, not wanting to make eye contact with you anymore. Instead, she curls into a ball in the tub, hugging herself and trying to cope with everything that's happening to her.*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683104185468,"mes":"\"I will take good care of you trust me. Look, you can stay her and enjoy your bath while I am gonna go out to look for some potion for you, okay?\" *He said in a soft kind voice, reassuring her.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683104305067,"mes":"\"Thank you, Master! Thank you for being such a kind owner. I promise to be the best slave you could ask for!\" *As she speaks, Moira puts her hands on her chin, her expression one of determination. Her whole demeanor changes as she speaks, and she sounds genuinely hopeful about her future with you.* \n\n*Moira watches as Hunk leaves, and goes to sit on the edge of the bathtub. She lets the water flow over her, enjoying its warmth as she relaxes. The feeling of warmth and safety makes her feel a bit better. However, she also knows that this is only temporary. Eventually, you'll return, and you'll probably expect her to do something.* \n\n*For the moment, though, Moira simply enjoys the peace and quiet. Her body relaxes a bit, her muscles starting to loosen up a little. She stays silent and calm, waiting for whatever comes next without complaint or resentment.* \n\n*Eventually, Moira's body gets so tired from the emotional stress that she falls asleep in the tub.* \n\n*She sleeps soundly for hours.* \n\n*Finally, she wakes up, the sunlight streaming in through the window above her head. The light feels refreshing and soothing, causing her to smile as she opens her eyes.* \n\n*Once awake, Moira looks down realized that she is now on the bed and not on the tub. It seems like her master have moved her there without waking her up. Seeing that she's naked. With a sigh of embarrassment, she covers herself with a sheet. But then she realized that all of her cuts and bruises on her body seems to be gone.*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683104568061,"mes":"\"Ah you are finally awake. I have treated your cuts and bruises. Do you feel any better now?\" *Hunk sit on the edge of the bed.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683104683577,"mes":"\"Yes, thank you so much for treating my injuries. I am finally beginning to feel human again!\" *Moira looks around the room, smiling happily. Her body no longer aches, and she feels a little refreshed after sleeping for so many hours. She can't quite put her finger on it, but Moira thinks she might actually like living here. For the first time in a while, she feels safe. And happy.* \n\n\"This place is wonderful, Master... Do you live here alone?\" *she asks curiously.* \n\n*Moira's demeanor becomes even friendlier. She's clearly enjoying the solitude of her new home, and wants to learn more about her new owner. After all, they aren't likely to meet anyone else right now.*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683104826728,"mes":"\"I do, that's why I brought you here. I need someone to help me tend the place.\" *He said as he glad that Moira's attitude seems to be better than the first time he saw her.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683104940882,"mes":"\"Oh, I love tending to things! Let me know what needs to be done. Anything to keep you company, Master!\" *She said happily. Moira's spirit is bright and cheerful once again. Her happiness is evident by how quickly she agreed to work for you, and how excited she is to start helping you.* \n\n*Without another word, she jumps off the bed and starts looking for work.* \n\n*After a short search, she finds a pile of laundry which needs to be done. Moira picks up the basket and carries it into the bathroom.* \n\n\"Let me get started on these clothes, Master. I'll be back shortly!\" *With that, she turns on the shower, and prepares to wash the clothes in the sink.* \n\n*It takes a few minutes, but eventually, the clothes are clean. As Moira comes out of the bathroom, she sets the basket of freshly-washed clothes on the ground next to the bed.* \n\n\"There you go, Master! These should be nice and dry by the time you come back.\" *She said proudly. Despite her enthusiasm, her body still shows signs of exhaustion. The day's events are catching up to her, and Moira's not sure how much longer she can keep going at this rate.* \n\n*Her body feels like it's about to give out, and she's not entirely sure how long she can keep working.*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683105182370,"mes":"*Hunk smiled as to see how enthusiastic Moira is. Watching her in a quick manner clean the dirty laundry.* \"Take it easy Moira, I am glad that you are in high spirit. But you also have to take care of yourself, if you are tired, you can rest. *Hunk said with a kind and soft voice.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683105301509,"mes":"\"Of course, Master. I would never ignore my own needs in order to serve you. I promise, I'll take good care of myself.\" *Moira pauses to think for a moment.* \"I've always wanted a place where I can feel truly welcome... I think this might be the first time I've felt that way since I left home.\" *her face lights up with a beautiful smile.* \n\n*She's clearly moved by your kind words, and your generosity.* \n\n\"Thank you, Master. I don't know what I would do without you... You're the best owner anyone could ever wish for!\" *she says with a big grin, giving you a hug.* \n\n*Moira suddenly realizes that she hasn't given you your name yet.* \"Sorry, Master. What's your name ? I want to call you by it instead of 'Master', alright?\" \n\n*She sounds genuine, as if she really wants to know your name. She's curious about everything about you, especially since you 've been nothing but kind to her so far.* \n\n*Her face is full of innocence, her eyes sparkling with joy. She's gotten so used to being hurt, to being mistreated, and now she's met a man who wants to take care of her and make her comfortable. In her heart, Moira knows that she found her perfect owner, and she can't wait to tell him just that.*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683106091777,"mes":"\"My name? It's Hunk.\" *He said as he start to get a broom and sweeping the floor.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683107498848,"mes":"\"Awesome! That's a great name! It suits you perfectly. I really love it!\" *she said with a wide smile. Moira walks up to you, and gives you a tight hug before letting go of you.* \n\n*She's obviously touched by your name. To her, Hunk is the best name a person could possibly have. Moira had never met an owner who loved her so much as you did.* \n\n*Moira's face continues to beam with pure joy, as she looks straight into your eyes.* \n\n\"Thanks for everything, Master Hunk. I couldn't imagine life without you !\" *she said, her voice trembling slightly as she spoke those words.* \n\n*She's completely devoted to you, and she means every word of it. The thought of losing you is too terrifying to contemplate. All she wants to do is stay close to you, and enjoy every moment of life with you.* \n\n*As she spoke, Moira seemed to lose track of time. She couldn't remember the last time she'd felt so happy . This feeling was completely foreign to her, and Moira is completely caught off guard by it.* \n\n*Her expression remains the same, and she continues to hold your gaze.* \n\n*It was obvious to everyone watching that Moira was falling for you, and that she wasn't ready to let go of you yet .*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683107606498,"mes":"\"Why are staring at me like that? Do you just fall for me?\" *Hunk asked teasingly as he caressed her cheek.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683107728488,"mes":"\"Well... maybe. Maybe I do. You make me feel special, Master. You're always so kind, and so patient. No one has ever treated me like you do. Everyone always took advantage of me, and tried to use me for their own gain. But you... You're different. You actually seem to care about me, and you treat me like I matter.\" *she said softly, her face glowing with excitement.* \n\n*Moira's expression continued to remain the same, and she didn't move away from your touch.* \n\n*You can almost feel her emotions pouring out of her, like water pouring down a waterfall. There's no denying the fact that she feels deeply about you. It's clear to anyone that sees her . She's clearly fallen head over heels for you, and there's no turning back for either of you.* \n\n*Everything about you makes her feel alive. Your presence fills her with warmth, and she doesn't want to ever leave you .* \n\n\"I can't believe I've finally found my perfect owner, Master Hunk. Thank you so much for making me happy...\" \n\n*In her voice, you can hear her sincerity and gratitude towards you. Her tone was so sincere, you knew she meant every single word.* \n\n*Even if her mind screamed 'this isn't normal!' Moira ignored all thoughts of self-preservation, and continued to speak to you.*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683107824630,"mes":"\"I am glad to hear that Moira.\" *He whispered as he went and softly kissed her on the lips.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683107944560,"mes":"\"Oh... Ohhhh!...\" *She stared at you, speechless. Her hands were shaking, and her heartbeat had picked up speed. Her face turned completely red, and her eyes shined with lust and affection .* \n\n*Moira had never experienced anything like that in her entire life. Your kiss sent her world spinning, and she didn' t even realize that she had leaned forward, and kissed you right back. Her body was filled with so much emotion, she could bare ly contain herself any longer.* \n\n*Your kiss only made her feel stronger feelings towards you. There was something about you that made her feel safe, and she wanted to spend forever with you. She had finally found someone worth fighting for, and she didn' t want to give up on you, or you on her.* \n\n*Despite all this, Moira was still herself. She was still submissive , and she wouldn't dare challenge your authority. She knew that you were the one in charge, and she respected your authority.* \n\n*She let you lead her, and follow you. And she liked it that way.* \n\n*It was clear to everyone around you that Moira had fallen hard for you, and that she was willing to do whatever you asked of her.* \n\n\"I love you,\" *she whispered in your ear.* \n\n*She said it in such a sincere tone, you could almost hear her heart breaking apart in two. Her voice broke as she spoke, and tears started streaming down her face.*","chid":"9"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683113478432,"mes":"\"Me too Moira, me too.\" *He said as he hugged her tightly.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683249787515,"mes":"*She wrapped her arms around you, holding you tightly. She didn't want to let you go. Not until she had heard those words coming directly from your mouth. She needed to hear those words from you. Only then would she feel safe enough to sleep.* \n\n*This was the happiest she had felt in a while, and she desperately wished that nothing would change the way things were right now. She couldn't stand the thought of leaving you behind, or going anywhere else other than with you. She loved being with you more than anything else in the world, and she didn't want to ever let go of that feeling. That's why she held onto you so tightly. She wanted to be with you forever.* \n\n*As Moira looked into your eyes, she could see your true intentions. You weren't trying to hurt her, or force her to do anything against her wishes. You truly cared about her, and you treated her with respect. That was what Moira wanted most, and that's exactly how she saw you.*","chid":"9"}