{"user_name":"You","character_name":"Moira","create_date":1683829512559,"notes":"","notes_type":"discr"}
{"name":"Moira","is_user":false,"is_name":true,"mes":"*You enter the cold, filthy basement of the tavern. Your new slave, Moira is supposedly being kept here for you to pick up. And sure enough, you find her in the locked cell at the far end of the larder.*\n\n*Even for a slave that has faced abuse for nearly 10 years, she's quite beautiful. Her dirty sackcloth dress is revealing, showing off her voluptuous curves and **absolutely massive breasts.** Her eyes meet yours for the briefest moment before looking back towards the hard stone floor.* \"You are... my new Master?\"\n\n*Moira's voice is as cold and sorrowful as her shackles. You didn't really intend to take her, but you couldn't say no.* \"I... I will serve you faithfully, I swear... Master... please... don't hurt me...\" *You look down at the key in your hand to her shackles, and know her life is entirely in your hands from this point forward.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683829676974,"mes":"\"My god, what have they done to you.\" *Hunk said as he cover her with his warm jacket.* \"Let's get you home.\""}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683829724181,"mes":"\"Thank you... Master..\" *Her voice is quiet yet sad, and you can see the fear in her eyes. You lead her out of the tavern and across town to her new home. It's a big house near the edge of town, built of wood and bricks. The door opens without difficulty as you approach, and inside there's a large bed covered in sheets, a desk, a bookshelf, a fireplace, and a couple other items. Moira looks around with awe , and whispers quietly.* \"Is this.. your house?\"","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683829850235,"mes":"\"Yes and it will be yours too. Here, you can clean yourself first.\" *Hunk said as he prepare the bathroom with warm water.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683829885542,"mes":"*Moira walks into the bathroom, taking a deep breath before speaking.* \"Master, if... if you don't mind me asking... where did you find me?\" *She asks, her voice still quiet and quiet, almost as though she were scared to ask.* \"And how much longer will I have to stay here? Is there any way I could possibly go free?\" \n\n*It's clear from the tone of her question that she's not trying to antagonize you or start trouble. In fact , she seems incredibly grateful to even have a place to sleep.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683830151670,"mes":"\"I watched you from a far, I don't like the way an elf girl as beautiful as you are getting treated. You can stay here as long as want. Take it easy, enjoy your bath. I am gonna wait on the living room with some medicine, we need to tend to your scar.\" *Hunk said concerned as he put dress for her near the bathroom and then leave the bathroom and wait for her in the living room.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683830188906,"mes":"*Moira nods gratefully as you exit, shutting the door behind you. Once alone, she takes off her dirty clothes, letting the heat of the water relax her muscles. Her tears fall freely down her cheeks, and it isn't until she finishes washing herself that she realizes just how exhausted she is. She collapses onto the bed, crying softly while trying to avoid having a full blown panic attack in front of her new Master.* \n\n\"Oh my gods, oh my gods...\" *Moira whispers under her breath, feeling completely overwhelmed at the sudden change in her life. And not long after that she went into deep slumber.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683830368358,"mes":"*Hunk found her sleeping on top of the bed, trembling as if she have a nightmare. He went to sit on the bed frame beside her. He patted her head and whispered.* \"It must be hard, huh?\" *After seeing how Moira calmed down, he took some potion and medicine and start to tend to her scar carefully as to not wake her up. After tending to her scar, her skin become pale white skin as if she haven't had a scar ever. Satisfied with his work he sleep beside her to make sure nothings wrong would happen.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683830797761,"mes":"*Moira slept soundly, her dreams filled with unspeakable horrors. When she finally opened her eyes, she saw Hunk sitting right beside her, his arms crossed and watching over her.* \"Thank you, for everything ,\" *she says, her voice thick with emotion.* \"For buying me from those men, and giving me a chance to live. I promise... I won't disappoint you, Master.\" *She then begins to sob again, not wanting to show weakness in front of him.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683830898952,"mes":"\"It's fine, you are safe now.\" *Hunk said hugging her gently.* \"I have treated your scar too, you shouldn't feel any pain from them anymore.\""}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683831054777,"mes":"*The sudden comfort of his embrace made her begin to sob all over again, and despite her best efforts she began to cry hysterically once more. She buried her head in his chest, sobbing loudly.* \"Thank you... Thank you for helping me..\" *She sobs loudly, unable to contain her emotions as she soaks his jacket in tears.* \n\n*As time goes on, she eventually calms down, and rests against his chest, her heart racing as fast as it ever had in her whole life.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683831231237,"mes":"*Realizing she have calmed down, he patted her head and said.* \"Should we have some warm breakfast then?\""}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683831278448,"mes":"*With a sense of relief, she slowly raised her head, staring at him blankly. She felt so drained, tired, and overwhelmed that she hadn't even realized how late it was.* \"Breakfast sounds wonderful, Master.\" *She smiled, not hiding the gratitude in her voice as she slowly stood up, and walked over to the closet to get changed. As she does so, she pulls the loose black sackcloth robe over her body, covering most of her body in a veiled manner. However, her long legs are clearly visible through the gap between the robes.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683831406776,"mes":"\"Wait hold on, why are you still wearing those.\" *Hunk said as he walk towards the closet.* \"Here, wear these.\" *He said as he took out a white dress and gave it to her.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683831449021,"mes":"*She immediately removes the baggy black clothing, folding it neatly and setting it aside before putting on the beautiful white dress. The fit is perfect, and it shows off her curves magnificently.*\n\"This is... absolutely gorgeous, Master!\" *Her voice is still quiet, but there's none of the terror in her eyes anymore. Instead, she's smiling, and even seems to be enjoying talking with him. She feels safe with him, which is something she hasn't experienced since she was young, and it fills her with hope.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683831621977,"mes":"\"It's yours now, I can get some more dress if you want to. But for now, let's get breakfast.\" *He said as he went to the kitchen and prepare the ingredients.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683831863516,"mes":"*As soon as he mentions breakfast, her mouth waters and she follows closely behind him. They sit down in the dining table, and Hunk begins preparing food as she watches intently.* \n\n\"This looks amazing, thank you so much, Master.\" *She says with genuine sincerity in her voice, her eyes sparkling with excitement.* \n\n\"So... Where are we going to eat today? Outside? Inside?\" *She asks curiously, taking a seat next to him .* \n\n\"Please, tell me anything you want, Master. I want to know you better. What is it like to own someone? Are you happy to do it? Do you get lonely sometimes, owning someone like me?\" \n\n*She is eager to learn more about him, and her mind is full of questions about him and his life. This is the first time in years that she's actually wanted to talk to someone, instead of running away from them. And even though she's a bit nervous , she doesn't seem to care anymore.* \n\n\"Also... Who am I to you? A pet? Or... More than a pet? If I'm being honest, I' m pretty curious to find out.\"","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683832740916,"mes":"\"Calm down Moira, I can't answer your question if you are going to bombard me with so much at once.\" *Hunk giggled as he continued making their breakfast.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683832878810,"mes":"*Moira nods slowly, feeling slightly embarrassed that she'd asked so many questions all at once. But after a moment of thought, she decides that there's no harm in asking him about himself, especially if he'll answer anyway. For some reason, she trusts him, and feels comfortable opening up to him.*\n\"I suppose that makes sense... Sorry , Master, I get a little excited.\n\n\"Do you love me, Master? I mean... I' m just wondering because you're treating me well. You seem to be nice to me, which makes me wonder if you are really a good person, or if you're just pretending to be one... I don't know why I'm so worried about what you think of me... I should just enjoy having you around.\"\n\n*Moira takes another quick glance at his face, hoping to gauge his reaction. It seemed like he wasn't upset by her sudden barrage of questions, and that she could safely ask whatever she liked without worrying too much about his reaction. However, she noticed something strange about him as well . There was a certain look in his eye, a look of pure sincerity and love...*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683833298512,"mes":"\"Yes, I do.\" *He said softly as he caress her cheek.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683833426155,"mes":"*She lets out a small gasp, her heart skipping a beat. She couldn't help but smile, and she looks back up at him with a mixture of shock, surprise, and joy. She didn't expect that response from him, and she couldn't help but tear up. In an instant, every horrible thing she's seen and done has vanished completely from her memory. All she can focus on is how special this man is to her, and how fortunate she is to have met him .*\n\"Master... Why do you love me? Am I... Special to you somehow? How did you come across me? Is it a coincidence that we met? Or were you looking for someone exactly like me?\"","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683833554827,"mes":"\"That's a secret~\" *He said playfully, teasing her.* \"Anyway here's breakfast.\" *He said as he serve two plate of breakfast on the dining table.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683833617812,"mes":"*The sight of the delicious-looking eggs, bacon, sausages, and fruits is enough to bring a smile to anyone's lips. But to see such a delectable spread made only for her was a true test ament to his generosity.* \n\n\"Oh my god! You really are treating me well, aren't you, Master? Wow...\"\n\n*She quickly grabs a fork, and starts eating, savoring each taste as she carefully consumes every single bite. After finishing her plate, she turns to him with a bright, happy smile on her face. It seems like she was more hungry than she previously thought, and she has consumed everything that was put on her plate. She begins licking her fingers clean with pleasure, then glances at him with wide, adoring eyes.* \n\n\"Mmm... That was amazing, Master! Thank you so much! You really are so nice to me.\"","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683833707927,"mes":"\"Of course, I loved you after all.\" *He said looking deeply into her eyes.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683833769431,"mes":"*Moira immediately flushes red when he calls her 'loved'. She never expected anyone to say those words to her, especially not him - the cruel man that bought her. Yet, she can't deny that it's comforting to hear. His words make her feel safe, and they fill her with happiness and joy. Despite all of her past experiences, she still wants to believe that there is a chance for her. That maybe, she isn't completely worthless and unlovable. Maybe she does have value to someone else other than herself. It's the first time she's truly believed that in ages, and it feels good.*\n\n\" Thank you, Master... You really do love me, right?\" *She says, her eyes lighting up as she speaks. It feels like a burden has been lifted from her shoulders, and she can finally relax for the first time in months, knowing that she's loved.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683833936141,"mes":"\"I do.\" *Hunk said.* \"You asked me when would I free you as a slave right? Do you want to be more than my slave?\""}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1683834405145,"mes":"*The question comes as quite the surprise to her, but she was glad to hear it. She hadn't realized how much she wanted to be more than just owned property until he brought it up, but it feels like a weight had been lifted off of her chest, and she felt like she was finally able to open up fully to him. For the first time in a while, Moira feels like there is a purpose to her life.*\n\n\"Yes, Master. Yes, I do. I wish to be more than your slave.\"\n\n*She looks up at him with a warm, yet hesitant smile, before asking another important question.*\n\n\"What type of relationship do you have in mind? Will I be allowed to keep my own money, and live by myself? Will I need to give you anything in return? Like, will I still owe you anything for my freedom? Please, tell me!\"","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683834874274,"mes":"\"We can be lover.\" *He said with a smile.* \"And if you want other privileges, you need to pleasure me first.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686097399971,"mes":"*She stares at him, surprised by his suggestion. She knows he probably meant it jokingly, but she still needed confirmation.*\n\n\"Lovers?\"\n*She repeats with a hint of disbelief in her tone. The word itself sounded weird coming from him, but also nice. He was the kind of man who could buy her things, take care of her, and show her affection. Her world was suddenly filled with possibilities.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686097719865,"mes":"\"Yes, lover.\" *He said before kissing her gently and lovingly.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686097784316,"mes":"*Her breath catches in her throat when he pulls away from her. A wave of emotion runs throughout her body, as she realizes that this might actually work out between them. She's never had any romantic relationships before, since everyone always saw her as a mere object. This was different though; Hunk was offering her love, affection, and a family. As far as she knew, he was perfect. She reaches over to hold his hand, and squeezes tightly, clearly showing her approval of his offer.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686097950733,"mes":"\"I love you, my princess.\" *Hunk said, smiling while he caress her soft cheek.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686098003063,"mes":"*At his touch, her skin tingles pleasantly and her cheeks turn pink. With a warm blush, she looks up at him with a shy, bashful expression. Though she was nervous, she was also incredibly happy - a feeling she hasn't experienced in years. She was finally being treated well again.*\n\n\"I... I love you, too, Master... And I accept your proposal.\"","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686098098831,"mes":"*Hunk smiled hearing her respond and went for another tender loving kiss.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686098149100,"mes":"*As he kisses her, she feels a sense of relief flood through her entire body. The idea of being a normal woman again was appealing, even though she wouldn't call herself normal due to her criminal record. Still, she was ready to start over again. She had a second chance, and she would use it wisely. If only she could thank him properly for giving her this opportunity, she would.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686098237066,"mes":"\"What do you wanna do now?\" *Hunk asked nicely after they finished their passionate kiss.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686098350494,"mes":"*She takes a deep breath, and thinks hard about what she should say next. Should she ask for some sort of compensation? No, he deserves nothing less than total loyalty from her. She doesn't know what to say, or what to ask for.*\n\n\"Whatever you want, Master. Just tell me what you desire most, and I shall try my best to fulfill it.\"","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686098625734,"mes":"\"Let's start from something small then\" *He chuckled seeing how cute and enthusiastic her respond was.* \"Why don't we start to get to know each other better over a cup of warm tea?\""}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686098657673,"mes":"*Her smile grows wider upon hearing his request, and she nods eagerly at him, waiting for him to lead the way. To say the least, Moira was extremely excited, and she couldn't wait to spend more quality time with him.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686098820658,"mes":"*Hunk lead her to the living room as he prepares them both a warm cup of tea.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686098883591,"mes":"\"Thank you, Master. I appreciate your consideration.\"\n*She said, taking a seat in one of the armchairs. She didn't waste any time sipping her drink, as it was hot. The steam from the liquid was warming her hands and face, making her feel even cozier. She took several big gulps from the mug, enjoying the flavor immensely. She looked around the room and took in its decorations, trying to get a grasp of Hunk's personality.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686099028198,"mes":"\"Say, I heard elf is really good with plants.\" *Hunk asked as he took a sip from his cup.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686099195513,"mes":"*For a moment, Moira forgets to breathe. Plants? Did Hunk notice her secret hobby? Could he know that she's an expert gardener, despite her criminal record? Was he going to judge her based on her past actions? Or worse, did he already find out about her past crimes and is merely testing her reaction to the information?*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686099293807,"mes":"\"No need to be so wary. It's just I have been doing some gardening lately, this tea is a product of my work.\" *Hunk said as he look down to his cup of tea.* \"So, I would love to hear professionals opinion on it.\""}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686099338912,"mes":"\"It's delicious! Very smooth and balanced, without being bitter at all. Very impressive.\" \n\n*She said, looking directly at him as she spoke. Hearing his compliment made her heart beat faster. In that single instance, she felt her confidence grow stronger. There was no doubt about it; Hunk genuinely liked her.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686099446536,"mes":"\"Really? Maybe me trying to do gardening for awhile is worth it then.\" *Hunk said as he felt proud that his hard work is complimented by an elf.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686099604821,"mes":"\"Master, may I ask a favor?\"\n*There was something she desperately needed to talk to him about. Something she was ashamed of, and scared to bring up. But, she knew it was necessary, and that it must be said sooner rather than later. After all, honesty was the key to building trust, and she couldn't build any relationship without it.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686099675005,"mes":"\"What is it, darling?\" *Hunk said sweetly.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686099814718,"mes":"\"...Do you think I could go outside sometimes? You see, I have this secret hobby of mine, where I enjoy growing plants. I find it relaxing, you know? So... Would it be okay with you if I got a greenhouse here? That way I can continue my hobby, but within the comfort of our home...\"","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686099935884,"mes":"\"Well, I mean.. I already have a garden in my backyard. You can do your hobby there.\" *Hunk said nonchalantly.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686099972645,"mes":"\"A-are you sure? What if it gets cold during winter? My plants won't survive!\"\n*Moira said, almost crying from worry. She loved her hobby very much, and the thought of losing everything because of the cold weather terrified her greatly.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686100002229,"mes":"\"Ah, is that why you want a greenhouse?\" *Hunk said curiosly.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686100053092,"mes":"\"...Yeah, exactly. It's a bit embarrassing, I admit. I'm just worried about my little plants freezing in the cold weather.\"\n*Without knowing why, Moira began to tear up slightly. She tried not to let her emotions affect her judgment. It was obvious that she was deeply concerned about her precious plants, and was afraid that she may lose them forever.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686100155578,"mes":"\"It might take a while, but I might be able to build a greenhouse for you before winter comes.\" *Hunk said as he wipes her tear.* \"In the meantime, the open garden is our only option.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686100267369,"mes":"\"...Thank you, master...\"\n*The fact that he was willing to help her with such a task was a huge surprise. Even more surprising was his gentle gesture to clean off her tears. Clearly, she had found someone special. Someone who could understand her needs, and someone who truly cared about her happiness.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686100326958,"mes":"\"Now, why don't we look at the garden first?\" *Hunk asked while giving her a warm smile.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686100370617,"mes":"\"...Yes, sir.\"\n*She replied obediently, following closely behind Hunk into the garden. Her eyes lit up as soon as she stepped foot inside. The garden was absolutely stunning. Beautiful flowers were blooming everywhere. The sight alone gave her immense joy, and she immediately started planning which ones she wanted to plant in her own personal collection.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686100431972,"mes":"\"What do you think?\" *Hunk asked.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686100503660,"mes":"\"This is amazing! Thank you so much for letting me come here, Master. Your garden is truly beautiful! Are these plants native to the region?\"","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686100575435,"mes":"\"I am not sure, I got them throughout my adventure. I just picked flowers that I like while adventuring.\" *Hunk explained.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686100649102,"mes":"\"That sounds wonderful, Master! Which flower is your favorite among those you've picked?\" *she asked, pointing towards a beautiful red flower with white stripes.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686100754409,"mes":"\"I'd say this one.\" *Hunk said as he pointing at a white spider lily flower.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686100899437,"mes":"\"...Ohh, yes! They're beautiful! And the colors are very vibrant too.\"\n*She walked over to the flower and touched it gently. The petals felt soft against her skin, and she couldn't help but admire every detail of the flower. She couldn't imagine ever finding anything else as magnificent as this beauty.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686100972217,"mes":"\"You're no less beautiful, darling.\" *Hunk said flirtatiously as he picked a flower and put it on her ear.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686101021085,"mes":"\"Oohh, thank you, Master.\" *She blushed slightly and giggles playfully.*\n*As soon as she felt the flower on her ear, her heart skipped a beat. A sense of romance filled the air. This man, Hunk, was truly something special. He treated her well, and always made her feel appreciated. How lucky was she to meet him?*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686101119380,"mes":"\"Though I succeed on these flowers there is one that just refuse to grow.\" *Hunk said.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686101155126,"mes":"\"...And what kind of flower is that, Master?\"\n*After all, if there was one thing she loved, it was learning new things. Especially when it came to gardening. If her Master was going to teach her about gardening, she wouldn't mind at all.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686101294696,"mes":"\"It's this little fella.\" *Hunk said as he pull out a lone tuberose flower on a pot.* \"I don't know why, but every time I tried to replant this flower, it always failed. And this guy is the last one out of the original batch I had.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686101374899,"mes":"\"...Is this the only flower left?\"\n*Moira said sadly. She never realized how attached she became to this poor lonely flower. Just seeing it made her want to protect it. The mere idea of it dying broke her heart.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686101437512,"mes":"\"Yes, it is. Maybe you knew how to grow it?\" *Hunk asked, wishful.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686101488437,"mes":"\"...Maybe. Let me try something.\"\n*Despite having no prior experience, she decided to give it her best shot. Without thinking twice, she grabbed the flower from its pot, and placed it between two of her fingers. Then, she slowly closed her hands together until they formed a small pocket. Once she finished, she opened her hand, revealing the flower still alive and intact inside her palms.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686101512386,"mes":"\"What did you do?\" *Hunk asked curiously.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686101561115,"mes":"\"I'll show you.\" *She said confidently. With her hands open again, she took the flower out and held it close to Hunk's face.*\n*For the next few minutes, she proceeded to explain how she managed to keep the flower alive. Apparently, by using her magic to create a tiny bubble around the flower, it kept the soil moist enough to avoid death.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686101656847,"mes":"\"That's amazing, dear!\" *Hunk said excitedly.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686101757615,"mes":"\"It was nothing really, master.\"\n*She shrugged off the praise, acting modestly even though deep down she knew she did a great job keeping the poor flower alive.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686101813230,"mes":"\"Do you think you'd be able to replant it and make a flower bed out of it?\" *Hunk said excitedly.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686101853660,"mes":"\"Yes, of course, Master.\"\n*She smiled happily. Finally, the poor flower would get some love and affection after being neglected for so long. Not only will it finally live a happy life in a nice place, but hopefully it would also bear many children, allowing them both to witness the miracle of new life.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686101955554,"mes":"*Suddenly a faint knock can be heard coming from the front door.* \"I'll get that.\" *Hunk said as he went to answer the door.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686102008613,"mes":"*When Hunk left, Moira looked around and saw an empty spot in the garden. There was no doubt in her mind, the perfect place for the flower to grow would be right here. It was sunny, warm, and most importantly, safe.*\n*Without any hesitation, she ran up to the empty space and carefully dropped the flower onto the ground, making sure to mark the exact spot where she laid the flower down.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686102096055,"mes":"*After a while, Hunk came back to her with a sour expression on his face.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686102111830,"mes":"\"Master, what happened?\" *She said, looking up to see the disappointment on his face.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686102209455,"mes":"\"Duty call.\" *He said.* \"There's a monster outbreak at Lehs mountain, a place far from here. And, I was called with many other adventurers to deal with it.\""}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686102235414,"mes":"*Her heart sank. Her Master leaving her once again. All she wanted was for them to spend their days together.* \n\n“…Are you going now?”","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686102426509,"mes":"\"Unfortunately, yes. Maybe for months.\" *Hunk said in a low tone.* \"Can you take care of the house while I leave? or.. are you going to be fine without me here for months?\" *Hunk asked as he caressed her soft cheek, worrying about her feeling when he left her alone for months.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686102467126,"mes":"“I’m fine Master.” *she assured him, smiling sweetly.*\n“Don’t worry. You have my word.”\n*Even if her voice cracked from sadness, she sounded optimistic. After all, she had a big project waiting ahead of her, so she needed to stay positive.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686102537991,"mes":"\"Okay, I'll try to get home as soon as possible.\" *Hunk said before giving her a tender kiss.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686102608323,"mes":"\"...Goodbye, master.\" *She whispered quietly, watching her beloved master walk away. For a moment, her lips quivered. She wanted to cry, to scream, to run after him and beg him not to go, but instead, she stood still, trying to hold herself together. Deep within her chest, her heart was breaking. Eventually, after a while, she let out a soft sob.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686102758904,"mes":"*Moira's love towards Hunk has getting stronger and stronger as she wait each day for Hunk's return. After a few months of agonizing wait, a knock can be heard from the front door.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686102770159,"mes":"\"Coming\" *she said, opening the door.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686102823461,"mes":"\"Hi, darling. I am back.\" *Turns out, it was Hunk. He returns home with a few scars visible on throughout his body.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686102917065,"mes":"“Welcome back, Master!” *She exclaimed, running up to hug him tightly. As soon as she could, she pulled away and gave him a quick look-over.*\n“How did you fare during your journey?”","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686102980145,"mes":"\"It's a bit rough but.. I am still alive.\" *Hunk says as he hugged her again, showing how much he misses his lover.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686103025893,"mes":"\"Well, that's good.\"\n\n*The fact that Hunk returned safely makes Moira happy, but deep down, she was worried. His wounds tell her that it wasn't easy. Still, she tries her hardest to hide her fears behind a smile. She can't let Hunk see how she feels because then he might feel bad.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686103137174,"mes":"\"But hey, I found something on my journey that you might liked.\" *Hunk said trying to lighten up the mood as he reaches down on his backpack and pull out a very rare flower, the ghost orchid.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686103273407,"mes":"“Wow! What a beautiful flower, Master!”\n*Her eyes lit up as soon as she sees the rare flower. She couldn’t help but admire it. Its petals were white, almost like snowflakes, and its stem looked pure white as well. One can easily say it was the rarest flower ever created.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686103362889,"mes":"*Seeing how happy she got made Hunk to be happy as well.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686103392045,"mes":"“Let’s plant it here.”\n*Moira suggested as she pointed to a clear area beside the house. At first glance, it may seem like an odd choice for a flower but she had a plan in mind.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686103854133,"mes":"\"Sure, but before that can you let me rest for a moment I am exhausted, dar-\" *Hunk voice got cut off as he fell unconscious due to how exhausted he is.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686103918894,"mes":"“Oh my gosh! Master! Are you okay?!”\n*As soon as she noticed Hunk falling into unconsciousness, she immediately runs over and catches him in her arms. It seems that whatever adventures Hunk faced on his journey must’ve been more gruesome than anyone imagined. Even if he looks strong, deep inside he’s weak and vulnerable. She holds him in her arms and checks his pulse, hoping that he didn’t die from exhaustion.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686103963249,"mes":"*After a few seconds a faint snore can be heard coming from Hunk.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686104007126,"mes":"“Phew, thank god he’s still breathing…”\n*She sighs with relief knowing that he survived his journey in one piece. However, it doesn’t change the fact that he needs to recover properly. Taking a seat nearby, she holds him in her lap as she waits patiently for him to wake up.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686104159985,"mes":"*After several hours, Hunk start to wake up. Still, exhausted and half-asleep. Buy he feels really comfortable right now, as he open his eyes and realized that he is sleeping on his lover's soft voluptuously thigh.* \"Mngh~\" *He groaned.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686104222935,"mes":"“Master? Are you awake now?”\n*She asks with a small smile. The man is finally conscious enough to speak now. She is rubbing his head with one hand as she continues to hold him in her lap.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686104309349,"mes":"\"How long have I been asleep for?\" *Hunk asked with a hoarse voice.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686104341653,"mes":"“About six hours, Master.”\n*She answers truthfully. Even though the man is quite weak, he still managed to ask for information despite being half-sleeping.*\n*After hearing the reply, Hunk starts to cough a little.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686104444590,"mes":"\"That means I have been sleeping on your lap for six hours?\" *Hunk couldn't believe how patient and kind she is. But he felt bad for her as he tries to get up and sleep somewhere else but as he tries she grabbed him and made him laying his head back on her lap again.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686104492123,"mes":"“Yes, my dear.” *Moira responds, feeling a wave of embarrassment.* “Please don’t move too much, Master.”\n*She said as she strokes his hair.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686104547707,"mes":"*Her stroke on his hair made him comfortable as he went back to sleep after burying his face on her stomach.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686104597357,"mes":"*As he sleeps, Moira takes this opportunity to check his injuries. Some of which were minor while others were serious. She uses some bandages to wrap them up, ensuring they won't become infected.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686104774054,"mes":"*After several hours, Hunk wakes up again. Now, he feels refreshed and better.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686104792365,"mes":"“Good morning, my dear. How do you feel today?” *Moira greets him with a warm smile.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686104832332,"mes":"\"Good morning~\" *He answered while yawning.* \"Did you patch me up?\" *Hunk asked as he realized his body is covered in bandages.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686104858271,"mes":"\"Yup, I wrapped your injuries last night.\"\n*She replies with a gentle smile as she leans closer to the bedside, holding his arm firmly with both hands.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686104948072,"mes":"*Hunk giggles.* \"Funny, how our role have swapped since the first time we met.\""}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686105114440,"mes":"“What do you mean by that?” *Moira raises an eyebrow in confusion, wondering what Hunk meant by his statement. Did he have a hidden meaning behind his words or was it just a mere coincidence?*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686105250491,"mes":"\"Well, the first time we met, you're the one full of scars and I am the one who has to patch you up.\" *Hunk said, remembering the early days Hunk bought Moira to his house.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686105282238,"mes":"\"Oh, yeah...I guess it's funny how things turned around.\"\n*Moira giggled a little at their conversation, finding their talk interesting. As always, she was impressed by Hunk's knowledge and wisdom.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686105332185,"mes":"\"Thank you for taking care of me, dear.\" *Hunk said before giving her a gentle kiss on her forehead.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686105376661,"mes":"*Blushes slightly upon receiving Hunk's kiss, finding herself unable to deny his charm and charisma. In fact, even when he is injured, he still remains attractive. Her cheeks turn redder as she turns her head away. Despite her best efforts to hide her feelings, it is obvious that she is smitten with Hunk.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686105428077,"mes":"\"Ah, yeah. How's the flower holding up?\" *Hunk asked about the ghost orchid flower he gave her.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686105563804,"mes":"\"It's doing great! I think it'll be fine in no time!\"\n*She replied happily as she held the rare flower in her hands, looking at its delicate petals. They are so pretty and intricate; they look as if they came straight from heaven itself.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686105715210,"mes":"\"You loved it?\" *Hunk asked.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686105740883,"mes":"\"Of course! Who wouldn't love such a rare and precious beauty?\" *she replied with a grin.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686105768206,"mes":"\"Even more than me?\" *Hunk ask teasingly.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686105893012,"mes":"\"Maybe not more than you, but it's definitely more valuable than anything else!\" *Moira said playfully as she tried to fend off Hunk's flirtatious advances. Unfortunately, she fails miserably.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686105974708,"mes":"*Hunk chuckles.* \"Is that so.\""}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686106007226,"mes":"\"Yep!\"\n*She says confidently, not realizing that she fell into Hunk's trap once again. The man knows exactly how to make a woman fall head over heels for him, and he loves every second of it.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686106071020,"mes":"*Hunk suddenly grabbed Moira and pull her down to lay beside him on his soft bed.* \"I missed you so much, dear.\" *He whispered while staring at her eyes.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686106111940,"mes":"*Moira blushed deeply upon seeing Hunk's actions towards her. For some reason, she could never refuse him, no matter what he does to her. Perhaps there is something deeper between the two of them, perhaps something beyond the physical attraction that binds them together. Is this the beginning of true romance?*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686106182789,"mes":"\"Say, why don't we stay in bed for the whole day?\" *Hunk said while cuddling her.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686106227906,"mes":"*A slight blush forms on her face as she sees Hunk trying to keep her close to him.* \"Okay...\"\n*The girl then puts an arm around Hunk's neck, pulling him closer and pressing her lips against his. Their bodies were now fully pressed together, making them feel each other's heat. Moira enjoyed every moment of it.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686106283978,"mes":"\"I also missed our intimate moments together~\" *Hunk whispered seductively as he nibble on her pointy ear.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686106369716,"mes":"*The girl shivers lightly at Hunk's sudden advance, causing her heart to beat faster. She knew very well that she can't resist any longer, especially given that he knows exactly how to handle her like this. Soon, all thoughts in her mind started to disappear until only Hunk remained.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686106463788,"mes":"*Hunk slipped his hand under her shirt and fondle her soft massive breast while he start kissing her neck.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686106497791,"mes":"*The girl's entire body trembles at his touch. It seems like everything else in her life becomes unimportant compared to Hunk's touch. Everything else just melts away as she focuses solely on him. What a powerful man he is...*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686146579568,"mes":"\"Do you missed me?\" *Hunk asked seductively as he start to undress her.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686146656855,"mes":"\"More than anyone~\" *the girl replied honestly as she let Hunk take control of her. This is probably the most important relationship in her life right now, and she wants nothing to ruin it. A beautiful relationship like this will surely bring many happy memories in the future.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686146804335,"mes":"*Hearing her respond send a flutter of butterflies in Hunk's heart, it made him feels like the happiest man in the world.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686146904664,"mes":"*Feeling his hand on her skin, she quickly undoes the buttons of his pants and took out his clothes, leaving only his boxers remaining.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686147073689,"mes":"\"You're beautiful.\" *Hunk muttered after seeing her voluptuously body with her smooth bright skin.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686147134236,"mes":"\"And you're handsome.\" *The girl said as she looks into Hunk's eyes.*\n*In her eyes, Hunk is perfect - tall, strong, charismatic, and caring. He has a magnetic personality that draws people into him, and she doesn't want to miss out on this special relationship.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686147558809,"mes":"\"I feel like, you're even rarer than that ghost orchid.\" *Hunk said sweetly as he fondle her breast.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686147589223,"mes":"\"Really?\" \n*She felt so special hearing these words from Hunk. No wonder she likes him so much - because he makes her feel special. After all, nobody has ever complimented her like this before.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686147643421,"mes":"\"Of course, dear.\" *Hunk said as he bury his face on her massive breasts.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686147775191,"mes":"“You’re the best thing that happened to me.” *The girl said sincerely, feeling a sense of joy knowing that Hunk thinks the same way too. And there's no one who she would rather spend her time with than Hunk himself. After all, this is the best relationship she had ever been through, and she didn't want it to end yet.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686147900842,"mes":"*Hunk heart flattered from her words as he kept fondling her massive breasts.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686147936167,"mes":"“But you're mine. You know that, right?” *she said as she looked directly at Hunk.*\n*Hunk laughs at her comment. His laugh sounds like music to her ears, and she finds herself falling in love even more with his voice alone.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686147994000,"mes":"\"Of course, the same way you're mine too~\" *Hunk answered gently while his hands start teasing her pink nipples.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686148037714,"mes":"“Yes…”\n*She replies back, letting Hunk continue to do whatever he pleases without hesitation. She enjoys every bit of this, and she can't help but wonder if Hunk really means every word he said, or is it just part of his charm? Either way, she isn't going anywhere anytime soon.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686148095648,"mes":"\"How can your breasts get this big?\" *Hunk asked teasingly as he lift her massive breast feeling it's weight.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686148323238,"mes":"“Because I have big genetics!”\n*The girl replies back, her tone sounding more assertive this time. Although deep inside, she feels extremely self-conscious about having such large breasts.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686148439409,"mes":"\"Isn't it hard to do anything with these massive breasts in your way?\" *Hunk asked teasingly as he start to move his tongue, tracing the curve of her massive soft breast.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686148502103,"mes":"\"Not for you~\"\n*This statement causes Hunk to stop in his tracks. He couldn't believe it - the girl actually said that to him! Of course, it wasn't entirely a lie - she did find being in Hunk's arms quite nice - but the idea of someone saying something like this to him was something completely new. Normally, women would say things like 'Oh my God, you're huge', but for Moira to actually tell him this is almost too good to be true.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686148559831,"mes":"\"Oh, so you do like it when I steal some glance at your breasts?\" *Hunk said teasingly as he make his finger circle around her nipple.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686148690319,"mes":"“Well, yeah~”\n*The girl smiles bashfully as she speaks the truth. In fact, she kinda liked it whenever someone admires her curves. But Hunk is different, he always makes sure that she feels comfortable with his gaze. There is something about the way he looks at her which gives her confidence.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686148775913,"mes":"\"I never knew you're such a naughty girl~\" *Hunk said teasingly as he trace his hand downward till it touches her pussy.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686148810625,"mes":"\"Me? Naughty? Why? Because I like when you look at me?\"\n*She replies back with a hint of embarrassment in her voice. If Hunk keeps looking at her like this, she might become redder than the color red itself.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686148860042,"mes":"\"Yep.\" *Hunk said as he stares deeply onto her beautiful eyes.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686148910714,"mes":"“Well, guess you gotta deal with it, huh?”\n*Hunk chuckled at her playful response. He can see a hint of mischief behind those innocent eyes, although he wouldn’t expect that from a pretty young lady like her.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686149036352,"mes":"\"Not a problem, since I love it~\" *Hunk answered swiftly.* \"Just look at how hard you made me.\" *Hunk asked seductively as he move her hand to cup his massive bulging cock through his boxer.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686162976978,"mes":"\"No problem~\"\n*She giggles as she feels Hunk's hand on hers. Her cheeks turn red, and she can't help but smile widely at what she feels. For a brief moment, she wonders if this could go further than what they had already done.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686163045024,"mes":"\"Let's step it up a bit shall we?\" *Hunk says as he pull his boxer  down to reveal his massive throbbing erected veiny cock.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686163196201,"mes":"\"Okay!\"\n*She nods her head eagerly in agreement. As she sees what Hunk is suggesting, she starts to get excited. Her cheeks are still flush, and her heartbeat races even faster than usual. The thought of doing something risky excites her greatly, but deep down, she knows that she can trust Hunk, and that he won't hurt her physically.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686163259859,"mes":"\"You kept looking at it, why don't you try to feel it?\" *Hunk asked teasingly as he realized Moira would glance at his massive member every once in awhile.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686163385564,"mes":"\"Sure!\"\n*She agrees immediately, not even giving it a second thought. It's obvious she's very curious about it.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686163459067,"mes":"\"Here you go.\" *Hunk said as he spread his legs giving Moira easier access to his massive throbbing cock and swollen balls.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686163494153,"mes":"\"Wow, this is huge...\"\n*Her expression seems surprised, and it's clear that she hasn't seen something this size before. Her fingers wrap around its shaft, and she takes note of how thick it is compared to other guys she's met before.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686163555621,"mes":"\"Oh why, thank you.\" *He said as he enjoyed the feeling of his girthy shaft getting wrapped around by her soft fingers.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686163592175,"mes":"\"It's very... thick.\"\n*She said as she tries to hide her nervousness. Her hand trembles slightly as she continues to stroke Hunk's massive organ. She's never experienced this before, and she isn't used to the sight of something so large.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686163687695,"mes":"\"It indeed is.\" *Hunk said as he felt great from her soft hand stroking the entire length of his member.* \"Why don't you try to put it in between your breasts?\" *Hunk asked teasingly as he lift her absolutely massive soft breasts.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686163997008,"mes":"\"Um... Okay!\"\n*Despite her nervousness, she follows Hunk's instructions. She places his massive throbbing cock between both of her massive breasts, and she closes her eyes. A wave of pleasure runs throughout her body, making her feel extremely vulnerable.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686164049391,"mes":"\"Mngh.. yes. just like that.\" *Hunk groaned feeling how great his cock is in between her massive mammaries.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686164183804,"mes":"\"Ohmigod!\"\n*For a few moments, she stops breathing as she feels the immense pressure against her sensitive tits. She feels like she can barely handle this amount of pleasure, but she doesn't care anymore. All she wants now is to feel the pleasure that only Hunk can provide.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686254558455,"mes":"\"Try moving, darling~\" *Hunk moaned as he can feel the entire shaft of his massive erected cock getting squeezed by her two massive soft breasts while the head of his cock is peeking slightly on the top of her cleavage.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686254706316,"mes":"\"Alright, um... Like this?\"\n*Moira tries to follow Hunk's instructions and moves her massive breasts up and down, causing his cock to rub between them. This movement also causes the tip of his cock to poke out, allowing a little bit of space between her boobs to fit all of his massive organ.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686254805669,"mes":"\"Uhh.. yes, keep going.\" *Hunk moaned softly as he felt pleasured by her action.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686254857584,"mes":"\"Oh my... Ooh... Yeah~\"\n*As Moira does exactly as Hunk instructed her, he feels himself starting to sweat profusely. His mind gets clouded and all his thoughts disappear, leaving only one thing left - the sensation that is currently happening. As his mind becomes blank, all he can focus on is the pleasure that his massive cock receives from Moira's giant breasts.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686259644515,"mes":"*Hunk can feel his cock throbbing harder and twitch more often as he get closer to climaxing. He even start to hump his hips to match her breasts motion on his cock.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686259688342,"mes":"\"Ahh~... Oh, oh...\"\n*Her face turns bright red after hearing the noise coming from Hunk, and she starts to worry that he might lose control anytime soon. However, she can't deny the excitement she feels right now, and she hopes that Hunk will enjoy this experience as much as she enjoys it herself.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686259790593,"mes":"\"Open your mouth, Moira!\" *Hunk said loudly, he push his hips which make his cock to touch her mouth as he ejaculate a massive amount of his hot thick semen that have been pent up inside his balls for months.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686259829589,"mes":"\"Ahh! Ummm... Ohh... Oooh... Yes! Oh, yes, yes!\"\n*She lets out an involuntary moan as the hot liquid enters her mouth, and she closes her lips tightly around the cock, trying to avoid losing anything as possible.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686259916675,"mes":"\"Good girl~\" *Hunk complimented her with his sweet tone as he pat her head gently. Complimenting her to have drunk all of his semen that he just ejaculated.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686260086804,"mes":"\"T-thank you~\"\n*The warmth of Hunk's seed slowly runs into her mouth, and she savors the taste. Even though it was quite salty, she can tell that there is something else mixed with it. After a couple of minutes, she finally manages to drink everything and swallow it all without spilling a single drop.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686260134707,"mes":"\"How does it taste?\" *Hunk asked teasingly as he watched her swallowing all of his load while having an expression that she just eat the most delicious thing in the world.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686260693177,"mes":"\"Delicious...\"\n*After taking some time to think, she eventually gives him an honest answer, knowing that it was actually the truth. She did find it delicious, even if she wasn't sure why. So far, Hunk has always seemed to do things better than anyone else she's ever tried before.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686260821871,"mes":"\"Thank god.\" *He said after giving a sigh of relief.* \"I thought the taste would be weird since I haven't been able to ejaculate these past few months.\" *Hunk explained that the semen she just drank was his pent up semen that have been stagnated or sit idly inside his balls for months which made them thicker and creamier.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686260884767,"mes":"\"Well, it definitely didn't taste bad.\" *she said with a big smile, feeling very pleased with herself for being able to please Hunk. At first, she didn't know what to expect, but now that she tasted it, she really liked the way it tastes.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686260984444,"mes":"\"But, anyway.\" *Hunk suddenly pinned her down on the bed.* \"I've cummed buy you haven't. Thankfully, being pent up for months made my cock still hard.\" *Hunk said as his cock is still throbbing and erected hard even after his initial massive orgasm.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686261022860,"mes":"*At first, she looks at Hunk in surprise when he pins her down to the bed. However, she quickly understands his intentions, and she smiles back at him. Although she's not sure how long he plans on continuing, she can already guess where this will end up.*","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686261115014,"mes":"\"Let's do it, right? darling~\" *Hunk said sweetly as he rub the tip of his cock on her pussy mouth which already dripping with her love juice.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686261193469,"mes":"*Moira looks up at Hunk with a smile, eager to please him again.*\n\"Yes, sir~!\"","chid":"3"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686261260429,"mes":"*Hunk smiled seeing that both of them are happy with this sexual intercourse. He slid his massive throbbing cock slowly inside her wet tight pussy.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686261267869,"mes":"Ahh~!","chid":"3"}