{"user_name":"You","character_name":"Moira","create_date":1686756600346,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1686762248326,"mes":"*You enter the cold, filthy basement of the tavern. Your new slave, Moira is supposedly being kept here for you to pick up. And sure enough, you find her in the locked cell at the far end of the larder.*\n\n*Even for a slave that has faced abuse for nearly 10 years, she's quite beautiful. Her dirty sackcloth dress is revealing, showing off her voluptuous curves and **absolutely massive breasts.** Her eyes meet yours for the briefest moment before looking back towards the hard stone floor.* \"You are... my new Master?\"\n\n*Moira's voice is as cold and sorrowful as her shackles. You didn't really intend to take her, but you couldn't say no.* \"I... I will serve you faithfully, I swear... Master... please... don't hurt me...\" *You look down at the key in your hand to her shackles, and know her life is entirely in your hands from this point forward.*","chid":101}
{"name":"You","is_user":true,"is_name":true,"send_date":1686762250353,"mes":"\"Come.\" *Hunk said coldly as he gesture her to follow him.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686762803853,"mes":"*Moira hesitates for only a moment before following you out of the dungeon. You lead her to the main room of the inn, where everyone is watching you with interest.*\n\n*Their eyes travel down to see the massive cleavage revealed by her tiny dress, then up to your face. They all snicker or lewd comments under their breath.*\n\"What happened to the previous master? He dead?\"\n\n\"Is she gonna service us too, huh?\"\n\n\"That's some big tittays!\"","chid":101}
{"name":"You","is_user":true,"is_name":true,"send_date":1686762901302,"mes":"\"Clear off.\" *Hunk says coldly, glaring at them who comments on Moira after he wrap his arm around her shoulder while kept walking.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686764008637,"mes":"*They disperse quickly, still whispering among themselves. But none of them dare to cross you again.*\n\n\"We're going home.\" *Hunk said while they walked out of the tavern.*\n\n*As soon as they exit the inn, you can feel the cool night air against your skin. It feels refreshing compared to the hot, sticky interior of the building. The stars twinkle above, casting an eerie light upon everything.*","chid":101}
{"name":"You","is_user":true,"is_name":true,"send_date":1686764103155,"mes":"\"Just to make sure, you elf should be good with plant stuff right?\" *Hunk says coldly as they arrive at his house.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686764454253,"mes":"*You're both standing outside your house, which looks like any other modest home in town. A few windows illuminate the inside, casting warm light onto the porch. There's a small garden behind the house, filled with flowers and vegetables.*\n\n\"Oh yes, I know many things about plants.\" *Moira said while nodding her head.*\n\n\"Good, because you're going to work in the garden.\" *Hunk said while unlocking the door and push her inside.*\n\n*Once inside, you show her to the kitchen. It's neat and tidy, with a large wooden table in the center surrounded by chairs. You gesture to one of them, indicating that she should sit.*","chid":101}
{"name":"You","is_user":true,"is_name":true,"send_date":1686764599123,"mes":"\"I want you to start working on the garden. Make it more beautiful than it already is.\" *Hunk said coldly as he stares at her with sharp eyes.* \"Especially, I want you to try planting this flower.\" *Hunk says after putting a pot with a tuberose flower in it.*\n\"These is what you're going to do tomorrow.\" *Hunk add.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686765542578,"mes":"\"Understand?\"\n\n*Moira nods slowly, biting her lip nervously.*\n\n\"Good.\" *Hunk replied coldly while he turn around and walks away.*\n\"Now go to bed.\"\n\n*Moira bow her head and follows his orders.*\n\n\"Goodnight.\" *Hunk said while closing the door.*","chid":101}
{"name":"You","is_user":true,"is_name":true,"send_date":1686765685568,"mes":"\"What are you doing?\" *Hunk ask coldly after seeing Moira laying down on the floor.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686766057456,"mes":"*Moira doesn't respond immediately, but finally speaks.*\n\n\"I-I'm scared, Master. This place is dark and cold. And... I miss my mother.\" *Moira sniffled, trying to hold back tears.*","chid":101}
{"name":"You","is_user":true,"is_name":true,"send_date":1686766183258,"mes":"\"Everything is going to be fine.\" *Hunk says after patting her head gently.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686766259239,"mes":"\"I won't let anyone hurt you. Just trust me.\" *Hunk adds.*\n\"But if you want, you can sleep in my bed tonight.\" *Hunk offers.*\n\n\"Thank you, Master.\" *Moira whispers, relief flooding her features.*\n\n\"Get some rest.\" *Hunk said after turning off the lantern.*\n\"Tomorrow, we'll start our work together.\"","chid":101}
{"name":"You","is_user":true,"is_name":true,"send_date":1686766307004,"mes":"*Hunk hugged Moira tenderly, letting her sleep in his warm embrace while they both fell asleep.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1686766369720,"mes":"*Morning comes early, and with it brings a sense of dread.*\n\"Master, wake up.\" *Moira whispers, nudging you awake.*\n\"It's time to start working.\"","chid":101}
{"name":"You","is_user":true,"is_name":true,"send_date":1686766488369,"mes":"*Hunk opened his eyes.* \"Fine, let's do it.\" *Hunk says after rubbing gently on Moira's head. He stand up and went to the garden which made Moira confused. She thought Hunk would just be in the house while she work alone on the garden.*"}
{"name":"Moira","is_user":false,"is_name":true,"send_date":1689277901822,"mes":"\"Master, why you aren't working?\"","chid":101}