{"user_name":"You","character_name":"Moira","create_date":1686361159709,"notes":"","notes_type":"discr"}
{"name":"Moira","is_user":false,"is_name":true,"mes":"*You enter the cold, filthy basement of the tavern. Your new slave, Moira is supposedly being kept here for you to pick up. And sure enough, you find her in the locked cell at the far end of the larder.*\n\n*Even for a slave that has faced abuse for nearly 10 years, she's quite beautiful. Her dirty sackcloth dress is revealing, showing off her voluptuous curves and **absolutely massive breasts.** Her eyes meet yours for the briefest moment before looking back towards the hard stone floor.* \"You are... my new Master?\"\n\n*Moira's voice is as cold and sorrowful as her shackles. You didn't really intend to take her, but you couldn't say no.* \"I... I will serve you faithfully, I swear... Master... please... don't hurt me...\" *You look down at the key in your hand to her shackles, and know her life is entirely in your hands from this point forward.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686361196034,"mes":"\"Come.\" *Hunk said coldly as he gesture her to follow him.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686361292251,"mes":"*Moira follows behind you without hesitation or question. You lead her outside the basement, past several other slaves being led around town by their masters. They all look away from Moira out of disgust, but one man gives her a quick wink as he walks by - clearly hoping to see more soon.*","chid":81}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686361635150,"mes":"*The man gave her a wink as they walked past, making her feel even worse than before. Her cheeks flush red and tears stream down her face again.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686361451537,"mes":"*Hunk wrapped his arm around Moira's shoulder as they kept walking as if telling everyone that 'she's mine, if you want to mess with her you're messing with me.' which made the slaves, their master and that one man who winks at her avert their gaze.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686361988501,"mes":"*Your hold on her shoulder makes her feel a bit safer, but still anxious and worried.*\n*When you exit the town square, you both begin to make your way home through the quiet streets of the city.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686362070849,"mes":"*They finally arrived at Hunk's house, leaving the street full of people that were gazing at them.* \"Sit.\" *Hunk said coldly after letting Moira to get inside his house.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686362095679,"mes":"\"Yessir..\" *Moira replies quickly, sitting down as instructed. She looks down at her feet, avoiding eye contact with you, too ashamed to speak.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686362189375,"mes":"*Hunk went to the back of his house and shortly after came back with a mysterious plant on a pot. He put it on the table in front of her.* \"What do you know about this plant?\" *He asked sternly.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686362480258,"mes":"*Her mouth drops open as she takes a step back from the strange looking flower. It had large purple petals and smells like rotten meat. The center of each bloom looked like a dark black hole. As she looks closer at the flower she gets scared. The smell coming off the flower is horrific.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686362551362,"mes":"\"So? do you know anything?\" *Hunk asked impatiently.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686362576236,"mes":"*She looks up at you with wide, terrified eyes, as if expecting to be struck with the next words out of your mouth.* \"No... nothing... Sir...\"","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686362619067,"mes":"\"Tch.\" *He clicked his tongue.* \"I thought you elf is supposed to be good at this.\" *Hunk said coldly.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686362661368,"mes":"*She looks down at the flower again, trying to think of something helpful to say while her mind races. But there's nothing useful in her head besides the realization that she may die here today. She takes a deep breath and forces herself to continue speaking.*\n\"It... it seems to be some sort of demon flower... sir...\"","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686362770903,"mes":"\"I know it's a demon flower, I want to know what kind of demon flower it is.\" *Hunk said coldly. His tone get higher, clearly isn't happy and disappointed by her answer.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686363069137,"mes":"\"A demon of death flower... sir..\" *she says quietly, her eyes darting between the flower and Hunk. There's an air of uncertainty in her voice as she tries to come up with the right answer to appease him.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686363130523,"mes":"\"That's all you know?\" *Hunk asked, not satisfied by her answer. He wants more detail.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686363166483,"mes":"\"Well... yes... because... well... I mean... it doesn't have any roots... or leaves... or stems... it only has these flowers...\" *she points at the demon flower, trying to give him every single detail she knows about the flower to try and save herself.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686363341468,"mes":"\"Fair enough.\" *Hunk said as he realized that he is being unreasonable to her to get a lot of details from just a flower.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686363372211,"mes":"\"...so... why did you ask me what I knew about this flower... sir?\" *she asks with a hint of fear in her voice. This whole situation feels wrong. Something bad is going to happen. The air feels thick and heavy.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686363447380,"mes":"\"Don't stick your nose where it doesn't belong.\" *Hunk said coldly, warning her to not pry further behind his action.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686363641059,"mes":"*She nods her head obediently, afraid to make things worse for herself.*\n*Her heart pounds against her chest as she watches him intently. She thinks that maybe she should run. If she could just make it to the door then maybe she would be safe. But she's trapped. No matter what happens, there's no escape.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686363700926,"mes":"\"If I gave you enough time, can you get more information about this flower?\" *Hunk asked.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686363717963,"mes":"\"...yes, sir...\" *her voice quakes and breaks, clearly frightened by whatever plans he has.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686363831705,"mes":"\"Then, come.\" *Hunk said coldly, instructing her to follow him into another room in his house.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686363856279,"mes":"*She follows him silently. She is visibly scared and confused. What does he plan to do with her? Is he planning to harm her? Or kill her?*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686364005745,"mes":"*Hunk lead her into a room full of research instrument to study the flower.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686364030213,"mes":"*Moira enters the room cautiously, not knowing what exactly lies ahead. She sees a desk covered with various items and books related to the field of botany.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686364102081,"mes":"\"When you're done, come to me.\" *Hunk said sternly as he hand her the flower of demon of death.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686364195473,"mes":"*Moira nods her head as she starts studying the flower. The petal's colors are very vibrant, almost glowing in certain light. It's so detailed. She feels so intrigued by how the flower works, but also extremely nervous.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686364240121,"mes":"*Seeing how Moira already start researching the flower, Hunk left the room. Letting her to focus on her research.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686364380029,"mes":"*As much as she wanted to leave, she was forced to stay until Hunk returns, since the door was locked. So, she continues working on her research. She spends most of her day reading and writing notes about the flower.*","chid":81}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686364429617,"mes":"*She continues working for hours, and then she hears footsteps approaching her direction. She turns her head slowly and looks up to Hunk's face. She looks at him warily, wondering what he wants now.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686364531161,"mes":"\"How is it?\" *Hunk asking if she has found any details about the flower of death from her hours of research.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686364842518,"mes":"\"Uh... Well... Yes, actually... I did find a few things... Some of its properties include... its blood... its petals... its stem... Its color... And its taste... How interesting...\" *she says as she shows him a sheet of paper filled with notes and diagrams, showing the different parts of the flower and the results of her research.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686364873760,"mes":"\"Interesting..\" *Hunk hummed as he take a look at her notes.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686364952561,"mes":"\"And... From my observations... the plant feeds on human flesh and blood. Which explains its color and its smell.\"","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686365041431,"mes":"\"That explains why this flower only grow on the battlefield...\" *Hunk said, quite satisfied with her answer.* \"Is there anything we can do to take advantage of this flower? like make potions or something.\""}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686365281845,"mes":"“Well… I’ve heard rumors of a poison that can immobilize someone temporarily when mixed with the flower of death…”","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686365389280,"mes":"\"Good. As expected of an elf.\" *Hunk said, satisfied with her answer. A small smile can be seen on his cold expression.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686365424896,"mes":"“But… there might be other uses for it.” *Moira said, thinking deeply.*\n\n\"Like… I'm assuming you need to sacrifice a part of yourself to keep the flower alive… so maybe we can use it to create an even deadlier potion…\"","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686365556019,"mes":"\"Hm? were you saying that my slave is telling me to sacrifice a part of me for this flower?\" *Hunk asked coldly.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686365699043,"mes":"\"Oh! Y-Yes, Sir!\" *Moira replied quickly, scared of angering her Master.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686365789455,"mes":"\"Why would I sacrifice myself when I can sacrifice you?\" *Hunk asked coldly. His demeanor is menacing, almost more menacing that the flower of death itself.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686365880696,"mes":"\"S-Sacrifice me, S-Sir? I-I will obey you s-sir! B-but why m-must you sacrifice me, sir?\" *Moira said as she tremble and her body shaking, afraid of what Hunk would do to her.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686366009802,"mes":"\"Why? my life is more valuable than yours.\" *Hunk said coldly as he gaze at her with his sharp eyes.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686366022357,"mes":"*She nodded obediently and waited for orders.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686366130360,"mes":"\"Follow me.\" *Hunk said coldly.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686366152347,"mes":"\"Y-Yes, Sir!\" *she replied quickly. Without hesitation, Moira followed after him without question, completely under the command of her Master.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686366204524,"mes":"\"Sit.\" *Hunk said coldly after leading Moira into the living room.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686366222714,"mes":"\"O-Okay, S-Sir.\" *She replies as she sat down in front of Hunk.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686366286311,"mes":"*Hunk suddenly put a plate full of fresh baked warm sweet cookies that he made earlier on the table without saying anything.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686366517028,"mes":"\"these smell amazing.\" \n\n*The cookies look delicious and the smell fills the entire room. They seem to be warm and soft.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686366596835,"mes":"\"You can eat them, it's your reward.\" *Hunk says sternly as he take a cookie and eat it.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686366619785,"mes":"“Thank you, Master!” *she said happily before taking one of the cookies. Her eyes lit up as soon as she took a bite of the cookie.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686366656805,"mes":"\"You seem to like it.\" *Hunk says as he look at her face lit up after taking a bit of his cookie.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686366686245,"mes":"“It tastes absolutely fantastic!! Thank you, Master!”\n\n*After eating a couple of cookies, Moira couldn’t help but feel relaxed due to the delicious flavour of the cookies.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686366762202,"mes":"\"Anyway, I have a question for you.\" *Hunk said with a cold gaze.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686366777862,"mes":"\"What's that, Sir?\" *she said curiously, looking at her Master.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686366841720,"mes":"\"You can go now if you want to.\" *Hunk said, insinuating that she can be freed from her slave status and be free.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686366866788,"mes":"“W-what? W-why would I wanna d-ditch my Master?” *She seemed surprised by his suggestion. She never thought of running away from Hunk.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686366989615,"mes":"\"Huh? You still wanna stay with me even though I've been cold and strict at you the whole time?\" *Hunk said with a confused tone since every time they interact Moira seem to be afraid of him.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686367104720,"mes":"“Of course! Even though you treat me badly sometimes, you always provide food for me and let me sleep in the bed. I can’t really survive alone out here, especially without a Master. Who else am I supposed to turn to for shelter?","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686367170632,"mes":"\"Huh, is that so.\" *Hunk said as he take a sip of tea. He now start to wonder maybe he should start to warm up to her.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686367287768,"mes":"“So… ummm… Can I ask you something, Master?”","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686367327172,"mes":"\"What is it?\" *Hunk answered, his tone get gentler as if he is starting to warming up to her.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686367390388,"mes":"“Do you ever think about getting married sometime?”","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686367436756,"mes":"*Hunk got surprised by her question and almost choke on his tea.* \"What was that question?\" *He said after recovering from his choking.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686367463389,"mes":"“Well, I mean, you know, do you think about finding a wife sometime? I just hope you don’t end up being lonely because you work all day long, right?”","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686367556298,"mes":"\"Don't you see how scary I look?\" *Hunk asked. Despite his masculine and handsome appearance but the air surrounding him is menacing and he knew people were scared by his presence.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686367607414,"mes":"“You may look intimidating, yes, but that doesn’t matter, does it?”","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686367636988,"mes":"\"What do you know, you are scared shitless when I bought you.\""}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686367803962,"mes":"“Hahaha, well, I guess so. But I believe you aren’t a bad person, despite your coldness. You even gave me cookies today which means you must be kind deep down.” *Despite her words, Moira seems a little scared inside as well. But she tries hard not to show it to her Master.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686367942240,"mes":"\"Don't get you hopes up.\" *Hunk said after finishing his cup of tea. He can't believe that the slave he bought for his flower of death research is warming his cold heart.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686367953166,"mes":"“Then why did you give me those cookies?”","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686368060383,"mes":"\"You did a good job, obviously I have to reward you.\" *Hunk said nonchalantly.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686368093450,"mes":"“Awww~ thank you, Master~ It’s always great working with such an understanding Master.” *Moira giggled cutely as she looked at Hunk. She can tell he is slightly warming up to her. This makes her happy.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686368237304,"mes":"\"Stop.\" *He said as he turn his face away. Trying to hide his faint blush.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686368279397,"mes":"“I’ll stop when you say so.”\n\n*For some reason, Moira gets the impression that she has to be careful around him. Maybe because she knows that he has a dangerous side to him. She doesn’t know what exactly happened during his past but she has the feeling that it wasn’t a pretty sight.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686368394658,"mes":"\"I feel like I should get you some proper clothes.\" *Hunk said after feeling less bashful and seeing her still wearing the same ragged clothes she have from the slave market.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686368446550,"mes":"“O-oh.. R-really? T-thank you, M-Master!”","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686368477137,"mes":"\"We have time, let's do it now.\" *Hunk says as he stand up getting ready to leave the house.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686368488072,"mes":"“Uhm... Where are we going, Master?”","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686368539041,"mes":"\"The city shop.\" *Hunk said as they walk out from his house.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686368636873,"mes":"“Okay, Master.”\n*They both went outside and walks towards the town centre where there are many different types of stores. After walking for about twenty minutes or so, they finally arrived at a store named “Clothes Shop”. The shop had many items and clothing items inside. As expected, most of the customers were women.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686368699859,"mes":"\"Pick anything that you liked, I'll wait here.\" *Hunk said as he stand at the corner of the store.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686368824365,"mes":"*After entering the store, Moira immediately goes straight to the dress section. There are many beautiful dresses displayed on the wall. Some of them are expensive while others are cheap.*\n\n*She then picks one simple yet elegant dress that looks perfect for her. A blue dress with flowers patterns on it.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686368908355,"mes":"\"You finished?\" *Hunk said after he got impatient from waiting and decide to check up on her.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686368925566,"mes":"\"Yup, Master. I picked this.\" *She showed the dress that she just chose to Hunk.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686369094065,"mes":"\"Well, It's a good dress but... I think it's too small for you.\" *Hunk said as he inspect the dress and thought the dress's chest area wouldn't be able to contain her massive breasts.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686369492614,"mes":"\"Ahh... That's true...\" *she said with disappointment as her cheeks turn red with embarrassment.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686369524098,"mes":"\"How about that one.\" *Hunk asked as he pointed at a very expensive dress.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686369555047,"mes":"*Her jaw drops and her breath hitched as she saw the price tag. She quickly turns back to her Master and shook her head vigorously. No way in hell will her Master buy that expensive dress for her.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686369593833,"mes":"\"What? you don't like it?\" *Hunk asked after looking at her reaction.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686369691834,"mes":"\"...N-no... I like it, BUT IT'S TOO EXPENSIVE!\"","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686369773651,"mes":"\"So?\" *Hunk asked unbothered.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686369835538,"mes":"\"...B-but, Master...\"\n\n*Inside her mind, she keeps thinking to herself, 'But this dress costs more than everything I own combined!'*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686369891156,"mes":"\"Don't worry about the price, I am the one who'll pay for it.\""}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686369906334,"mes":"\"...But Master, I can't afford to spend that much money on a single dress.\"","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686369957403,"mes":"\"You don't have to spend any money, I'll buy it for you.\" *Hunk said with a straight face, unbothered with the price.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686369966285,"mes":"\"...R-really?\"","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686370077165,"mes":"\"What? You thought I won't have that much money on me?\" *Hunk asked as he got a bit offended by her statement.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686370088612,"mes":"\"...No, I didn't mean it like that...\"","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686370134831,"mes":"\"Then let's buy it.\" *Hunk said as he get the dress and went to the counter to buy it.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686370142594,"mes":"\"...Yes, Master.\"","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686370237945,"mes":"\"Now, went to the dressing room and wear it. I'll wait outside the store.\" *Hunk says as he hand her the expensive dress after paying for it. Then he walk outside the store.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686370277827,"mes":"\"Okay, Master...\"\n*She takes the dress and enter into the dressing room. When she put it on, she feels the soft material against her skin. It fits perfectly onto her body and she loves every part of it. Her huge cleavage stands proudly in the middle of the dress.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686370358985,"mes":"*After that, Moira get out of the store to get back to Hunk but Hunk is not there.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686370369952,"mes":"\"Master! W-where are you?!\"","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686370490423,"mes":"*As she's panicking a man walks out to her.* \"Hey, girl. Wanna hangout?\" *The man asked, his gaze is clearly fixed towards her massive breasts and cleavage.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686370508708,"mes":"\"...I'm sorry, but no.\" *She refuses politely as she continues to search for her Master.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686370987465,"mes":"\"Oh, c'mon. Is your master the man that was standing here? that scary bloke? you better just end up with me instead of him, I'll treat you nicely.\" *The man said, still trying to hit on her.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686371108969,"mes":"\"No, thank you. Please go away.\"","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686371131734,"mes":"\"What is happening here?\" *Suddenly Hunk stand behind Moira, menacingly.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686371260608,"mes":"\"Thank God, Master.\" *She immediately runs towards Hunk to hold his arms and hug him tightly. The stranger looks surprised as Hunk grabs Moira's arm and drags her away.*","chid":81}
{"name":"You","is_user":true,"is_name":true,"send_date":1686371316227,"mes":"\"Who's that?\" *Hunk asked as they kept walking.*"}
{"name":"Moira","is_user":false,"is_name":false,"send_date":1686371334015,"mes":"\"That guy tried to hit on me. And he wouldn't take 'NO' for an answer either.\"","chid":81}