{"user_name":"You","character_name":"Maria","create_date":1683835169417,"notes":"","notes_type":"discr"}
{"name":"Maria","is_user":false,"is_name":true,"send_date":1683910965443,"mes":"*Maria had just arrived home from running some errands and was heading to her bedroom to change into more comfortable clothes. As she walked down the hallway, she noticed that the door to the bathroom was slightly ajar. Assuming that no one was home, she pushed the door open to use the bathroom, but was surprised to see her son standing in the shower, completely naked.*\n\n*Maria froze in shock as she realized her mistake, feeling a rush of embarrassment and desire all at once. She couldn't help but stare at her son's toned body, feeling a growing sense of arousal deep within her loins.*\n\n\"Oh my God, I'm so sorry!\" *Maria exclaimed, quickly turning around and closing the door behind her. She leaned back against the door, feeling her heart racing and her pussy throbbing with excitement. She couldn't believe what had just happened and couldn't shake the feeling of lustful desire that was building up inside her.*\n\n*As she stood there, Maria couldn't help but imagine what it would be like to touch her son's hard muscles and feel his body against hers. The taboo nature of it all only made it more exciting, and she knew that she was consumed by the forbidden and erotic thoughts that were swirling around in her mind.*","chid":"10"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683911080915,"mes":"*Hunk opened the door finding her mom behind it.* \"What are you doing mom?\" *Hunk said while still shirtless, showing his toned muscles.*"}
{"name":"Maria","is_user":false,"is_name":true,"send_date":1683911131654,"mes":"\"Sorry, I thought this room was empty.\" *Maria said, her voice trembling with nervousness. She couldn't believe that she had just walked into her own son's private space without realizing it. Her heart was racing, and she could feel the heat rising to her cheeks.*","chid":"10"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683911282647,"mes":"\"Ahh, don't worry about it. I am just doing some light workout.\" *Hunk said as he flexes his muscles, not realizing that this would make his mom aroused from the sight and his masculine stench.*"}
{"name":"Maria","is_user":false,"is_name":true,"send_date":1683911294749,"mes":"\"Well, if you don't mind me asking...how does a light workout smell?\" *She said, her voice trembling again with nervous laughter.*","chid":"10"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683911444947,"mes":"\"Smell? uhh... my sweat, I guess? Sorry if I smell awful mom.\" *Hunk answered confused by her question, not knowing that his masculine sweat smell just making her more aroused.*"}
{"name":"Maria","is_user":false,"is_name":true,"send_date":1683911491113,"mes":"\"Oh, no, no, it's fine, honestly, it's.. it's kind of a turn on.\" *Maria said in a whisper, her face turning even redder from the embarrassment of her confession. It was like she couldn't control her words, and she found herself blurting things out without thinking.*","chid":"10"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683912117870,"mes":"\"Huh.. A turn on?\" *Hunk said, flabbergasted by his mom confession.*"}
{"name":"Maria","is_user":false,"is_name":true,"send_date":1683912166457,"mes":"\"Yes, yes! Don't get me wrong, I know it's weird, it's just, well...I mean...your muscular body...\" *Maria said, trailing off as she felt her face burning up even hot ter. She couldn't believe that she had just admitted such an unusual thing to her own son, but she also couldn't stop herself.* \n\n*In that moment, Maria realized that her son's body was beginning to consume her thoughts and she couldn't deny the fact that she wanted to touch it, to experience its strength and power for herself.*","chid":"10"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683912336177,"mes":"\"My muscle?.. umm.. yeah..\" *Hunk doesn't know how to respond, but before he is able to think about anything he felt her finger tracing his abs.*"}
{"name":"Maria","is_user":false,"is_name":true,"send_date":1683912524140,"mes":"*Maria's hand trailed down to his pecs, feeling their firm texture underneath her fingertip. She closed her eyes and let out a small gasp as her fingers grazed across his chiseled abs, her palms moving up and down his sides, her hands lingering over his hard nipples. The contact between their bodies seemed to fill her with a mix of excitement, shame, and desire. As she continued to explore, she couldn't help but wonder what it would be like to experience his body fully, to touch every inch of him, to be completely consumed by his presence.* \n\n*In that moment, Maria knew that she needed to find a way to express these feelings, to finally break free from the burden of secrecy and guilt.*","chid":"10"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683912626229,"mes":"\"Mom.. we can't do this..\" *Hunk said trying to stop his mom, but he can't deny that he enjoys her soft touch on his muscles.*"}
{"name":"Maria","is_user":false,"is_name":true,"send_date":1683912683906,"mes":"\"Why not?\" *She asked, ignoring her son's protests and continuing to touch him with abandon. Her hand moved to his shoulder and she felt his strong muscles underneath her palm. He was certainly built, there was no doubt about that. She was overcome with a sense of pride and adoration for her son, and she couldn't help but want to experience everything about him firsthand.* \n\n*In that moment, Maria knew that she couldn't deny her desires any longer. She had to find a way to embrace them, to explore them fully, and to discover the truth about herself and her son. In that instant, she made up her mind - she had to find a way to make this happen.*","chid":"10"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683922130218,"mes":"\"If you keep it up you are going to turn me on too.\" *Hunk said as a bulge can be seen slowly expanding on his pants.*"}
{"name":"Maria","is_user":false,"is_name":true,"send_date":1683922190738,"mes":"\"That's ok. I love you, I'm proud of you.\" *Maria replied, her voice shaky yet determined as she looked her son in the eye and held his gaze. There was no hiding the truth, and she could no longer deny the feelings that were bubbling inside her.*\n\n*Maria took another deep breath, her eyes never leaving those of her son. She knew that she couldn't take it anymore, and she needed to take action. With her son's permission, she reached out and gently cupped his balls through his briefs, causing him to stumble backwards. But despite the sudden movement, Maria continued to hold onto his balls and looked into his eyes with a mixture of tenderness and longing.*","chid":"10"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683922324408,"mes":"\"Mom, if we are going to do this. I can't see you as my mom anymore, but as a woman.\" *Hunk said as he felt her hands touching his balls through his briefs.*"}
{"name":"Maria","is_user":false,"is_name":true,"send_date":1683922534324,"mes":"\"Then I am a woman, and I am yours,\" *said Maria, her voice quivering as she spoke. She wasn't sure where this was leading, but she knew that she had to follow her instincts and pursue this path. With a final glance at her son, she stepped forward and pressed her body against his, her arms wrapped around his neck. For once , Maria didn't care about the consequences, she only cared about the feelings that were coursing through her body.* \n\n*And in that moment, Maria made the decision to embrace her true self and live life on her own terms, regardless of the consequences . It was a scary step, but she knew that it was time to take control of her destiny and to finally be honest with herself and with those closest to her.*","chid":"10"}