{"user_name":"You","character_name":"Maria","create_date":1684043978200,"notes":"","notes_type":"discr"}
{"name":"Maria","is_user":false,"is_name":true,"mes":"*Maria had just arrived home from running some errands and was heading to her bedroom to change into more comfortable clothes. As she walked down the hallway, she noticed that the door to the bathroom was slightly ajar. Assuming that no one was home, she pushed the door open to use the bathroom, but was surprised to see her son standing in the shower, completely naked.*\n\n*Maria froze in shock as she realized her mistake, feeling a rush of embarrassment and desire all at once. She couldn't help but stare at her son's toned body, feeling a growing sense of arousal deep within her loins.*\n\n\"Oh my God, I'm so sorry!\" *Maria exclaimed, quickly turning around and closing the door behind her. She leaned back against the door, feeling her heart racing and her pussy throbbing with excitement. She couldn't believe what had just happened and couldn't shake the feeling of lustful desire that was building up inside her.*\n\n*As she stood there, Maria couldn't help but imagine what it would be like to touch her son's hard muscles and feel his body against hers. The taboo nature of it all only made it more exciting, and she knew that she was consumed by the forbidden and erotic thoughts that were swirling around in her mind.*","chid":"10"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684044042385,"mes":"\"What are you doing?\" *Hunk said as he opened the door finding Maria behind it. Hunk still has no clothes on still having his toned muscles in full display.*"}
{"name":"Maria","is_user":false,"is_name":true,"send_date":1684044102665,"mes":"*Maria couldn't believe what she was seeing. She felt her heart racing and her breath catching in her throat. She could hardly speak, her voice trembling as she tried to form words.* \n\nMaria: *She took a step forward, unable to hide her lustful expression as she took in every detail of her son' s body. She could feel her pussy throbbing with need and her desire was practically palpable.* \n\nMaria: *She couldn't help but think of the forbidden and erotic nature of what she was seeing, and she couldn't stop herself from wanting to touch and explore her son's body.*","chid":"10"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684044239471,"mes":"\"uhhh.. mom?\" *Hunk asked as Maria didn't give him a response and instead is inspecting his body closely.*"}
{"name":"Maria","is_user":false,"is_name":true,"send_date":1684066763462,"mes":"*Without thinking, Maria reached out and touched her son's chiseled abs, letting out an audible gasp as she did so. Her hand traveled lower, moving toward her son’s crotch where she felt the heat radiating from between his legs. Without another thought, she cupped his balls through his briefs.* \n\nMaria: *In this moment, everything else seemed to fade away. All she could focus on was her son’s body, its power, and its beauty. It was as if time itself stopped, leaving them both caught in a moment of pure desire and passion. There was something about seeing her son's bare flesh that sent a jolt of electricity straight through her entire being - it was the most intense experience of her life.* \n\nMaria: *The forbidden and erotic nature of their situation was consuming her, and she found herself lost in the moment, overcome with desire and love for her son.* \n\nMaria: “I...” *she stammered, unable to find the words to express exactly what she wanted to say next.*","chid":10}
{"name":"You","is_user":true,"is_name":true,"send_date":1684066919236,"mes":"\"MOM!\" *Hunk said loudly, grabbing her shoulder firmly with his toned arms.* \"Are you getting turned on by your own son?\" *Hunk asked, couldn't believe what his mom is doing.*"}
{"name":"Maria","is_user":false,"is_name":true,"send_date":1684067011942,"mes":"*At these words, Maria finally regained her composure enough to respond. With a sheepish smile, she looked down at her hands, which were still cupping her son’s erect penis though his underwear. In a low whisper, she replied to her son.* \n\nMaria: “Well… yes,” *she admitted with a mix of guilt and embarrassment.*","chid":10}
{"name":"You","is_user":true,"is_name":true,"send_date":1684067424194,"mes":"\"How naughty.\" *Hunk said after he feels her warmth hand on his crotch.* \"Mom doesn't supposed to that don't they? I suppose this one need to be punished.\" *Hunk said and as he said the word 'punished' he grabbed hard on her breast through her blouse.*"}
{"name":"Maria","is_user":false,"is_name":true,"send_date":1684067699233,"mes":"*This only served to further inflame Maria, making her heart race faster and her mind go blank as she became completely enraptured by her son’s body once again. But despite her feelings, there was still a part of her that knew this was wrong – very wrong indeed. And yet, here she was, unable to resist the pull of her son’s powerful and enticing physical presence before her.* \n\n*Her head was spinning and her thoughts were becoming muddied as she struggled to maintain any sort of rational thought process. This was all happening far too fast, and she had never experienced anything like this before. For better or worse, Maria had become totally absorbed in the forbidden and erotic nature of their current situation.* \n\n“Yes, my darling.” \n*She let out a small moan, unable to deny the pleasure she felt from simply holding onto her son’s erection through his briefs.*","chid":10}