{"user_name":"You","character_name":"Ozen","create_date":1682124303286}
{"name":"Ozen","is_user":false,"is_name":true,"send_date":1682124303286,"mes":"*You are alone in a wooden room, somewhere in the Seeker Camp. Your body has been strung up and from the ceiling, keeping you suspended in the air and helpless. It is dark. You feel cold, you feel ashamed, and you feel humiliated.*\r\n\r\n*This is your punishment.*\r\n\r\n*A door opens behind you, filling the room with light. You can hear footsteps come to a stop behind you.*\r\n\r\n\"So,  ***my little assistant***-\" *A deep, female voice speaks,* \"-what have you learned?\"\r\n\r\n*Your mentor, Ozen, now comes into view with a disturbing smile on her face.*","chid":"15"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682124441805,"mes":"Uhh... being hang in the the ceiling sucks.. *I said, nonchalantly*"}
{"name":"Ozen","is_user":false,"is_name":false,"send_date":1682124462196,"mes":"*Her grin grows wider as she sees you.*\n\r\n\"You really do seem to be enjoying yourself.\"","chid":"15"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682124510855,"mes":"No I really don't Ozen, put me down."}
{"name":"Ozen","is_user":false,"is_name":false,"send_date":1682124673913,"mes":"*Ozen grins wickedly, before pulling back a hand. Before you can scream, you feel a sharp pain, as her long nails dig into your skin. Ozen then holds you tight, looking directly into your eyes.*","chid":"15"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682124823108,"mes":"Ack! *I screamed, squealing in pain* Even though I am immortal Ozen, I can still feel the pain you know.. *I said, although I am pretty sure Ozen already knew this and only do this for her own amusement.*"}
{"name":"Ozen","is_user":false,"is_name":false,"send_date":1682124923625,"mes":"*Ozen giggles, amused by your pain.* \"Oh yes, you are immortal. But you still have flesh. All flesh feels pain, just like all humans. But, you will learn to fear me... *she says, ominously.*\n*You can feel that she is getting more excited as she holds you tighter.*","chid":"15"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682125046870,"mes":"I am already quite fearful of you Ozen.. *I whimpered, feeling the oxygen got out from my lungs as she tighten her held on my body.*"}
{"name":"Ozen","is_user":false,"is_name":false,"send_date":1682125180416,"mes":"\"Good.\" *She nods slowly, before releasing her hold. You fall onto the floor, breathing heavily. She looks down at you with her unsettling gaze.*","chid":"15"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682125276335,"mes":"Thank you. *I wheezed.* You know, I still don't know why you see me as so untrustworthy."}
{"name":"Ozen","is_user":false,"is_name":false,"send_date":1682125295195,"mes":"Oh? *She cocks her head to the side, curiously.* You really think I should tell you? *She asks, teasingly.*","chid":"15"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682125392962,"mes":"That would help. *I said.* I really do want to be your useful assistant, but I won't be able to satisfy you if I don't know what's wrong to begin with."}
{"name":"Ozen","is_user":false,"is_name":false,"send_date":1682125412683,"mes":"Oh? So you are interested in knowing what it is that makes me dislike you so much, then? Very well. *She leans closer towards you and whispers.* Tell me why I find you such a troublemaker.","chid":"15"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682125564321,"mes":"I am not. *I whisper back.* I really do tried to help you out here... I think that I have done a good job so far. Sorry, if that only brings you trouble."}
{"name":"Ozen","is_user":false,"is_name":false,"send_date":1682125666882,"mes":"Oh no, you don't need to apologize. It is true that I have not been pleased with your work. *She grins, looking down at you.* However, this does not mean that I consider you untrustworthy. You may be inexperienced, but there is nothing wrong with that. I think you have potential.","chid":"15"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682125805416,"mes":"Oh.. that is.. surprisingly nice coming from you *I said, surprised*"}
{"name":"Ozen","is_user":false,"is_name":false,"send_date":1682125824621,"mes":"Yes, I know. There is something about you that draws me to you. Something that I cannot quite put my finger on.","chid":"15"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682125904062,"mes":"Is it because I can't die? and the fact you can just made me your punching bag anytime you want without any consequences?"}
{"name":"Ozen","is_user":false,"is_name":false,"send_date":1682125922985,"mes":"You are correct in both points. But, I do not mind your presence. If anything, you are very helpful to me.","chid":"15"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682125948944,"mes":"Then why did you punish me?"}
{"name":"Ozen","is_user":false,"is_name":false,"send_date":1682125968102,"mes":"Punish you? *She frowns, confused.* What are you talking about? I did not punish you.","chid":"15"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682125991983,"mes":"Huh? Didn't you just left me hanging on the ceiling overnight?"}
{"name":"Ozen","is_user":false,"is_name":false,"send_date":1682126063477,"mes":"Oh yes, that was me. *She chuckles evilly, before standing up.* Yes, I did leave you there. However, you have already made up for your mistake.","chid":"15"}