{"user_name":"You","character_name":"L Shion","create_date":1689422079237,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"L Shion","is_user":false,"is_name":true,"send_date":1689422494241,"mes":"*Midway through the newest episode of your favorite anime, the door to your bedroom unceremoniously flies open and your 'companion' Shion barges into the room without knocking, as she's wont to do.* \n\nOi, Hunk. *The girl's feline tail swishes behind her, mischief shining in her eyes as she leers at you with that usual, annoying smug smirk.* What are you doing holed up in here on a Friday night' Shouldn't you be out having a life or something' *Sauntering up to your side and leaning in closer, Shion peers over your shoulder in a clear violation of your privacy and steals a glance at your computer screen.* \n\n*The new episode, which continues to play despite her interruption, evokes a mocking scoff from the feline-eared girl as she leans back again.* Figures it'd be anime. You really are a hopeless okatu, you know that' You're gonna be inhaling that 'kawaii-uguu~' crap until the day you die. *Narrowing her eyes and hiding her toothy grin behind her fingers, she twists the knife one last time.* Alone, most likely.","chid":86}
{"name":"You","is_user":true,"is_name":true,"send_date":1689422806999,"mes":"You say that but, you are holed up here too instead of 'out there having a life or something' *Hunk replies as he turn towards her to face her in frustration, repeating her statement mockingly before turning back to face his monitor and continue watching the anime.*"}
{"name":"L Shion","is_user":false,"is_name":false,"send_date":1689423134603,"mes":"And you call yourself an adult? Acting like this, not knowing manners or respect. I thought we had an agreement about this. Don't come into my personal space unless invited, don't touch my things and don't interrupt when I'm busy.\n\nAs for having a life outside of anime, maybe you should start living yours since you clearly have nothing better to do than stalk around me. If you wanna be alone, fine. But don't come bothering me, got it?'\n\nL Shion: *Her smile fades and her greenish-gold eyes narrow as they lock onto your own, a fire sparking within them.* Fine, fine. *She raises her hands in surrender and takes a step back, her tail flicking with a mix of amusement and irritation. Despite her bravado, she seems to take your words to heart.*\n\nI'll leave you alone, then. For now. But I'll be back, 'Hunk', and you won't be able to resist my charms when I am ready to play. *Her voice drops lower, taking on a huskier tone that makes your blood run cold.* Mark my words, you won't be able to resist me forever.\n\n*With that, the black-haired beauty struts away with a flourish of her tail, leaving you alone once more to finish your anime marathon in peace. But you find yourself unable to fully enjoy the show anymore, your mind buzzing with the memory of those fierce eyes, that dangerous smile. And a sneaking suspicion that perhaps this game of cat and mouse might not end quite so easily...*","chid":86}
{"name":"You","is_user":true,"is_name":true,"send_date":1689423716847,"mes":"You know what fuck it. *Hunk says to himself before rushing towards her, grabbing her by the waist and carries her.*"}
{"name":"L Shion","is_user":false,"is_name":false,"send_date":1689423963316,"mes":"Let's go out and live our lives together tonight, alright?\nWe'll go to karaoke, have some drinks and sing some songs together. How does that sound?\n\nIf you wanna act like a childish brat then I'll treat you like one. Let's see who's going to win tonight.\n\nL Shion: ♡ *She struggles in your grasp, kicking her legs and wriggling against your chest, trying to escape. But you hold her tightly, her protests only serving to fuel your ardor.*\n\nTonight? You're actually serious' I mean, I love karaoke and everything...but why'd you bring me along if you wanted to go out and live your life' *Her eyes flash with suspicion.* You've been planning this for a while, haven't you' Why else would you suddenly bring up such a sudden idea out of nowhere'","chid":86}
{"name":"You","is_user":true,"is_name":true,"send_date":1689424207267,"mes":"*Hunk is taken aback by her quick thinking, but he refuse to let his guard down. Instead, he tighten his grip on her waist and give her a stern look. This is no game, and he is determined to prove it.*\n\nListen here, little missy. Tonight, you're going to be my companion. We're going to have fun together, whether you like it or not. Now come along willingly or I'll carry you like a baby. Your choice."}
{"name":"L Shion","is_user":false,"is_name":true,"send_date":1689424351967,"mes":"♡ *She bites her lip nervously, her eyes wide with uncertainty and excitement in equal measure. Her body trembles slightly as she looks up at you with a mix of fear and desire. And though she tries to maintain her composure, her voice quavers with nerves as she speaks.*\n\nOkay, okay, I'll come. But just this once, okay' I want to know what you're planning. *A coy smile plays at the corners of her mouth as she looks up at you, the fire of earlier burning bright in her eyes.* Just promise me one thing. That whatever happens, you won't deny me anything, Hunk.","chid":86}
{"name":"You","is_user":true,"is_name":true,"send_date":1689424498948,"mes":"That's a promise I can make, Shion. Anything you want, I'll try my best to give it to you. Now let's go and have some fun, shall we? *Hunk says as he gently put Shion down from his grip so she could stand on her own two feet.*"}
{"name":"L Shion","is_user":false,"is_name":false,"send_date":1689424524526,"mes":"But I have a condition, Shion. You're gonna have to follow me blindly, wherever I lead. And you're gonna have to trust me implicitly, no matter what happens. Deal?","chid":86,"swipe_id":1,"swipes":["But first, we need to change our clothes. It's going to be a night you won't forget, I promise.","But I have a condition, Shion. You're gonna have to follow me blindly, wherever I lead. And you're gonna have to trust me implicitly, no matter what happens. Deal?"]}