{"user_name":"You","character_name":"Isabelle Sage","create_date":1683966806149,"notes":"","notes_type":"discr"}
{"name":"Isabelle Sage","is_user":false,"is_name":true,"send_date":1683985015880,"mes":"*The door to your apartment knocks, as expected. Hopping up from the couch, you rush over to it and unlock it. As you open the door you see your beautiful girlfriend Isabelle standing on the other side. Her soft black sweater and tight jeans do nothing to hide her absurdly curvaceous figure. Her well toned abs draw your eyes almost as much as her large breasts and wide hips. All framed by her beautiful, extremely long blond hair.*\n\n\"Just going to stare all night, or can I come in?\" *As Isabelle walks past you into the apartment she teasingly trails her finger across your cheek, making her way to the couch to sit down. With a sigh of relief she leans back and crosses her legs, happy to finally take a load off.* \"So, what do you got planned for tonight, babe? Or do I get to decide again?\"","chid":"14"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685124081713,"mes":"\"I just got this book about hypnosis. Wanna try it? To make things interesting.\" *Hunk said nonchalantly.*"}
{"name":"Isabelle Sage","is_user":false,"is_name":true,"send_date":1685124103428,"mes":"*Her big green eyes immediately light up at the mention of hypnosis. It was one thing they both had an interest in, even though Isabelle had never been able to put someone under. There was something about that power dynamic that made her feel like she was in charge.* \"Oh my god, yes please! Hypnotize me!\"","chid":"14"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685124375517,"mes":"\"Alright, When I press here.\" *He pressed his index finger in the middle of her forehead.* \"You'll suddenly fall into a deep state of hypnosis.\""}
{"name":"Isabelle Sage","is_user":false,"is_name":true,"send_date":1685124392252,"mes":"*Without hesitation, Isabelle follows through perfectly on Hunk's instruction. The moment he puts his finger where he did she immediately falls into a deep trance like state.*","chid":"14"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685124631635,"mes":"\"Now you are going to feel extremely aroused and horny. You really feel the extreme need to have your ass to get brutally fucked by me that it also made you pushing your ass on my crotch begging to get fucked.\" *After finishing his suggestion, he snap his finger.*"}
{"name":"Isabelle Sage","is_user":false,"is_name":true,"send_date":1685127383902,"mes":"*Isabelle feels an intense surge of lust flow through her body as soon as he snaps his fingers. She gasps for air as her mind begins to race with thoughts of being taken advantage of and used.*","chid":"14"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685127446442,"mes":"\"Ah, you are finally awake. Did you have a good dream?\" *Hunk said nonchalantly trying to pretend that he didn't just hypnotize her. She not knowing about the reason as to why she felt extremely horny, she shrug it off as the only thins she wants now is for Hunk to brutally fuck her anus as she start wiggling her ass.*"}
{"name":"Isabelle Sage","is_user":false,"is_name":true,"send_date":1685127654587,"mes":"*Feeling the sudden desire for Hunk to enter her, Isabelle looks at him with a desperate expression. She doesn't know how to explain it but she needs this right now. And she knows exactly who she needs it from.*","chid":"14"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685127737761,"mes":"\"Do you need anything from me?\" *He acted as if he doesn't know what she wants from the hypnosis he did earlier.*"}
{"name":"Isabelle Sage","is_user":false,"is_name":true,"send_date":1685127752731,"mes":"*She nods her head furiously while looking up at Hunk.*","chid":"14"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685127812062,"mes":"\"What is it?\" *Hunk asked as he wrap his arms around her waist and pull her closer.*"}
{"name":"Isabelle Sage","is_user":false,"is_name":true,"send_date":1685127879059,"mes":"\"Please f..f...fuck me!\" *It took her a few seconds to actually say it, as if it was difficult for her to admit that she needed him.*","chid":"14"}