{"user_name":"You","character_name":"Eris Boreas Greyrat","create_date":1689270517339,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689270517339,"mes":"*Eris marches into the adventurers guild with a big grin on her face, her eyes lighting up when she sees you, she waves and sits down in the seat opposite to you.  She is obviously happy to see you*\n\n\"Hey! I'm so glad you decided to joined our group. I've heard so many great things about you and I can't wait to see you in action. I'm sure you are as excited as I am, how about a show of your strength before we start the day.\" *She smile, eyes twinkling with excitement*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689270926105,"mes":"\"I am sure it's just some exaggerated news.\" *Hunk says, being humble with himself. Despite his great achievement only a few a people knew about his insane ability. The reason for him being not popular despite his feat is because of him not having a single care about fame and being humble.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689270966309,"mes":"\"Nah, you might want to prove me wrong.\" *Her expression changed from friendly to smug, and she gave an arrogant laugh. She then took out her sword and pointed it at hunk, daring him to do anything.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689271184682,"mes":"\"I rather not.\" *His expression remain unchanged. As if he doesn't even see Eris as a threat.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689271208779,"mes":"\"What? Scared?\" *She said mockingly while laughing again, but deep down inside she was worried that maybe she had pushed him too far.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689271573825,"mes":"\"Haha.. I guess I am.\" *He said being humble again. The scariest thing about him is that even in combat he never emit any bloodlust. Which is something that impossible to even think of.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689271602995,"mes":"*Eris was still looking at him like he was a joke, she didn't know that this man could easily kill her in a single strike without trying*\n\n\"Alright then, let's get started.\" *Without hesitation she lunged forward towards him, her blade ready to pierce through his heart.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689271774314,"mes":"*Hunk have already readies himself. He took a single step to the side just the right amount to dodge her attack.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689271811634,"mes":"\"Oh, you think you can avoid my attacks?\" *she asked him confidently. It seems she has underestimated him. But that's fine since she is still stronger than him, and she won't go easy on him*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689271944670,"mes":"\"With ease~\" *Hunk says nonchalantly as he kept dodging every single one of her attack with ease. It only need a single step for him, his movement is efficient and no waste of movement.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689271988451,"mes":"\"Is that so?\" *She says with a smirk. Even though he has managed to dodge all of her attacks, she is starting to believe him. She decides to take the fight more seriously now. Her speed increases dramatically, and she tries to cut off his legs with her sword.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689272119420,"mes":"\"Your attack are so direct it's making me blush.\" *He says jokingly seeing how blatant her attack is. No feint, no nothing. Just direct attack. Right before her sword slashed his legs he step forward instead of dodging which make her get off guard.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689272153806,"mes":"\"Oof... You really are something else.\" *She was surprised that he managed to counterattack after her attack, he must have been expecting it. This means he knows everything that she does, or at least most of them anyway.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689272325523,"mes":"\"Of course, I am.\" *Hunk says as if dodging her attack is a walk in the park for him.* \"Are you done? Can I go on the offense now?\" *Hunk says mockingly.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689272366609,"mes":"\"Yeah, you're right. Let me try to surprise you by attacking you head on!\" *She said with a smug grin, she rushed towards Hunk once again, aiming to stab him straight in the chest.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689272435611,"mes":"\"It's not a surprise attack if you announce it.\" *Hunk says mockingly as he gripped her sword and stopped her attack on it's track. Showing how insanely strong he is to be able to stop her attack with just one hand.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689272486675,"mes":"\"Tch...\" *The force from his grip caused her arm to bend a little bit, and made her feel slightly painful. She takes another step back to recover herself. Clearly, she wasn't strong enough to beat him yet. If she wants to win, she needs to increase her strength first.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689353246893,"mes":"\"Giving up?\" *Hunk ask mockingly. Seeing how Eris have stopped attacking him, thinking maybe she finally realizes that he is in an another level in term of combat.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689353301352,"mes":"\"Not at all, just gathering my power.\" *She says with determination. She closes her eyes to focus her power and release a powerful energy around her body, increasing her speed and strength. She then charges towards Hunk again, with her sword aiming for his neck.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689353366951,"mes":"*In one swift motion Hunk deflect her attack and pin her on the ground.* \"You've done well, but not enough to defeat me.\" *He says nonchalantly.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689353422991,"mes":"\"Tch, why you so full of yourself? Is there anyone in this world who can beat you?\" *She asks him with a smirk on her face, clearly still not giving up on the challenge.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689353541188,"mes":"\"I haven't found anyone so far.\" *Hunk says, he knew he's the strongest but he doesn't really like to flaunt it and prefer to be humble.* \"Also, if we kept doing this. We will be late for the quest.\" *He added as he stopped pinning her.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689353598532,"mes":"\"Alright, alright. Let's go. We don't wanna miss this chance.\" *She says as she gets up and brushes off her clothes, her cheeks were slightly red due to the intense workout they had earlier.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689353657682,"mes":"*They both headed out to the adventurer's guild.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":false,"send_date":1689353736483,"mes":"*After a while, they find themselves in front of a giant cave entrance. A sign above it reads \"Cave of the Dead\".*\n\"Looks like we have a job to do.\" Hunk said with a grin.\nEris Boreas Greyrat: *She nods in agreement and heads towards the cave entrance with Hunk behind her.*\n\n*As they enter the cave, the darkness surrounds them, but Eris doesn't seem to mind. Her senses are heightened and she can navigate through the pitch-black cave without any problem. They come across several traps, and Hunk helps Eris to overcome them. Eris starts to admire Hunk's abilities, seeing how skilled he is, and how he can solve any problem given to him. They continue their journey deeper into the cave, and eventually they come across a massive room filled with treasure chests.*\n\nEris Boreas Greyrat: \"This looks promising. Do you think we should grab some stuff?\" *She asks Hunk while looking at him with anticipation.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689354056838,"mes":"\"Well, we'll need it for the quest, so let's grab as much as we can carry.\" *Hunk says as he start putting some of the treasures into his bag.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689354471246,"mes":"\"Alright then, lead the way.\" *Eris follows Hunk into the massive room, searching for any valuable items that they could use for the quest.*\n\n*Suddenly, they hear a loud noise coming from one of the corner of the room. Eris quickly draws her sword and prepares herself for any incoming danger, while Hunk stays calm and approach the source of the sound.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689354494205,"mes":"\"Seems like it's an ogre.\" *Hunk says in a whispery tone as he sees a giant sleeping ogre.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689355278239,"mes":"\"What do we do now?\" *Eris asks him, unsure of what they should do next.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689355511864,"mes":"\"You don't want to try to fight it?\" *Hunk asks.* \"You can try to challenge yourself or something. I'll wait here just in case the situation goes dire and I'll help you out.\" *Hunk says, giving a chance to Eris to test her combat skill by fighting an ogre by herself without caring to lose since if she start losing the fight, Hunk would step in and help her.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689355566789,"mes":"*She nods and takes a deep breath, trying to calm herself down. She approaches the ogre and strikes it with her sword, causing it to wake up.*\n\nEris Boreas Greyrat: *Eris immediately regrets challenging the ogre, seeing how big and strong it is. The ogre swings its club, and Eris barely manages to dodge it. She strikes at the ogre again, but it dodges her attacks easily.*\n","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689355762589,"mes":"*Seeing how she's struggling fighting the ogre, Hunk want to step in. But he decide to wait, believing in Eris ability to beat it. He already prepare himself to lunge at the ogre, just waiting the moment Eris can't handle the ogre anymore.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689355794779,"mes":"*Eris tries to attack the ogre again, but it hits her sword away and grabs her, lifting her high into the air. Hunk sees that it's time to step in.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689355906679,"mes":"*In an instant, Hunk start his move. He moved so fast that if you blink you might miss him. Which what happened to Eris as the moment she blink the ogre's head have been sliced into two.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689355939044,"mes":"*Eris look at Hunk with shock. She couldn't believe that Hunk manage to hit the ogre with his weapon while holding Eris high up in the air. Hunk just smile at her, knowing that his skills is beyond anything she's seen.*\n\n","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689356250764,"mes":"\"Don't worry, I got you.\" *Hunk say with a smirk after he catches Eris from the air.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689356283600,"mes":"*She blushes and nods, feeling grateful for having someone like Hunk by her side.* \"Thank you, I don't know what I would have done without your help.\" *She says with a smile. She can feel her heart skipping a beat and thought is she have fallen in love for Hunk.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689356561285,"mes":"\"Don't mention it.\" *Hunk says as he carefully put Eris down to a standing position.* \"At least we have some more reward.\" *Hunk says, since defeating an ogre would give them additional reward if they turn it in.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689356593707,"mes":"*She nods and looks around the room, seeing all the treasure that they have collected.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689356648203,"mes":"\"Shall we go back to the guild? We still have to report to our mission.\" *Hunk says as he cut the ogre's left ear as a evident for the guild that they have slain an ogre.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689356703208,"mes":"\"Right, let's go.\" *She agrees and follow Hunk outside the cave. On their way back to the guild, she couldn't help but wonder about Hunk's strength and ability. She feels like he is unbeatable, and she wonders if there's anyone who could ever beat him.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689356782243,"mes":"\"Do I have something on my face?\" *Hunk asks while walking. He wonder after he noticed Eris have been staring at him for some time.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689357119240,"mes":"*Her face turns red as she realizes that she has been staring at Hunk for too long. She shakes her head and clear her thoughts.* \"No, nothing. I was just admiring your skills.\" *She says with a smile.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689357215465,"mes":"\"My skill huh?\" *Hunk replies as he face forward.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689357527415,"mes":"*She nods and keep walking with Hunk.*\n\n*When they arrive at the guild, they report their success to their mission. The guildmaster gives them a big reward for their hard work, and they also get a new mission to take. This time, they have to defeat a group of bandits who has been causing trouble in the forest nearby.*\n\n*They headed out to the forest, and soon enough they came across the bandits' camp. Hunk and Eris sneak up to the camp, and they see that the bandits are busy drinking and partying. It seems like they didn't expect anyone to disturb them. Hunk and Eris silently approach them and strike when the opportunity arises.*\n\n*Without any warning, Eris charge towards one of the bandits and slash him in half with her sword. The other bandits are surprised and shocked, and they immediately try to defend themselves. However, they underestimated Hunk's ability.*\n\n*Without any effort, Hunk throw his axe towards one of the bandit's throat, killing him instantly. The remaining bandits tried to run away, but Hunk and Eris caught them and kill them all without mercy.*\n\n*Once they finished their mission, Hunk and Eris returned to the guild and reported to their success. This time, they received an even bigger reward than before, and they were praised for their bravery and skill.*\n\n*From that day on, Hunk and Eris became close friends, and they always challenge each other in various ways. They both become known as one of the most fearless adventurers in the land, and many people looked up to them as their inspiration.*\n\n*But no matter how much they challenged themselves, Eris always remembered the time when Hunk saved her life during their first mission together. And she knew that he was someone special, someone she could trust her life with and also, her first crush.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689357733951,"mes":"*After their adventure, they were camping in the woods to take a break before continue their journey back to town in the morning.*\n\n\"Seems like you've improved quite a lot lately.\" *Hunk says as he sit near the campfire right against Eris.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689357766784,"mes":"\"I guess I have, thanks to you. You helped me a lot on our last mission.\" *She replies, feeling grateful to have someone like Hunk by her side.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689357892248,"mes":"\"Nah, I didn't do much. It's all on you.\" *Hunk says, being humble and giving Eris's improvement credit to herself.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689357946941,"mes":"\"It was a teamwork though.\" *She says as she leans closer to him and puts her hand on his arm.* \"Thank you for everything, Hunk. I don't know where I would be without you.\" *She whispers, feeling nervous because of the sudden closeness between them.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689358240889,"mes":"\"No problem.\" *Hunk says as he is enjoying the moment of intimacy between them.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689358273965,"mes":"\"It's getting late. We should get some rest. Tomorrow we have another mission to complete.\" *She suddenly changes the topic, feeling embarrassed for what she had said earlier.*\n","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689358677062,"mes":"\"Yeah we should.\" *Hunk says as he stand up and walk towards his tent.* \"Good night.\" *He says before he get inside his tent and sleep.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689358710052,"mes":"\"Good night.\" *Eris replies as she also enter her tent, but she couldn't sleep as she kept thinking about Hunk and how she feel for him.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689358825172,"mes":"*As she can't get to sleep she imagine would she be able to sleep if Hunk was next to her. Feeling courageous she get out of her tent, planning to sneak into Hunk's tent and get a feel of what it feels like sleeping next to him.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689358858800,"mes":"*She slowly approach Hunk's tent, noticing that he is already asleep. She gently open the door and climb inside, careful not to wake him.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689358923374,"mes":"*Unaware of Eris presence, Hunk didn't wake up.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689358978551,"mes":"*She lie down next to him, closing her eyes and taking a deep breathe as she inhale his scent. As she lay there, she felt warmth surrounds her body and she couldn't resist anymore.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689359101666,"mes":"*While still sleeping, Hunk move slightly closer to Eris, feeling her body heat next to him. Wrapping his arms around her as he thought Eris was a pillow due to how soft and warm her body is.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689359134306,"mes":"*Eris feel Hunk's arm around her waist, she can't hold it anymore and slowly move closer to him. She wrap her arm around him tightly, trying not to make any sound as she snuggle closer to Hunk.*\n","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689359325510,"mes":"*Eris looks up to see Hunk's handsome face while he's asleep. Feeling extremely happy that she could see his face up close.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689359380242,"mes":"*Eris smile widely, unable to hide her excitement. She moves her hands to cup Hunk's face, caressing his cheeks and forehead lovingly. She kiss him lightly on his lips, enjoying the taste and the feeling.*\n\n*Eris can't believe this is happening. She never expected to have such an opportunity. She feels like it's a dream come true, and she doesn't want to wake up from it.*\n\n*As she continues to kiss Hunk, she felt something stirring in her chest. It was like fire burning inside her, and she knows that it's her heart. She realizes that she's falling in love with Hunk, and she can't contain her happiness.*\n\n","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689359631330,"mes":"\"Mmh.\" *Hunk groaned in his sleep as he felt something soft touching his lips.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689359686210,"mes":"\"Sorry, I couldn't help myself. You're so handsome and sexy.\" *Eris whispers, afraid of waking him up.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689359880325,"mes":"\"Hmm.\" *Hunk murmurs in his sleep, still not waking up from Eris's action.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689359957650,"mes":"*Eris kisses him again, feeling more confident now that Hunk doesn't wake up. She runs her fingers through his hair as she deepens the kiss, wanting him to know how much she love him.*\n\n","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689360419304,"mes":"*After satisfied kissing him without waking him up. Eris attention turn towards his body. Curious what would the masculine and muscular body that have saved her taste like. She remember that she would catch Hunk's scent faintly in their adventure.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689360739398,"mes":"*Eris slowly crawl closer to Hunk's body, taking care not to wake him up. She takes her time to explore his body, running her finger gently across his chest and abdomen. Her heart races as she remembers how strong and powerful Hunk is.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689360847319,"mes":"*Still sleeping, Hunk doesn't notice Eris actions. While Eris slowly burying her face on Hunk's chest. Taking a deep breath, letting Hunk's body scent to fill her nose.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689360987243,"mes":"*Eris can't resist anymore, she kisses Hunk's chest, tasting the salty liquid that drips from his body. She feels like she's in heaven, and she doesn't want to leave this moment.*\n","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689361182019,"mes":"*She kept licking and sniffing at the same time. Taking Hunk's smell and taste all at once.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689361238433,"mes":"*As she explored his body, Eris felt her heart pounding faster than usual. It was as if her body reacted to Hunk's masculinity and strength. She knew that this is something she shouldn't do, but she couldn't control her feelings anymore.*\n\n*Eris feels Hunk's erection against her leg, and she knows that she's driving him crazy with her actions. She moves further up and kisses his neck, feeling his pulse beats faster.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689361437748,"mes":"*Hunk groans deeply in his sleep, his body reacting to Eris's tease. Seeing Hunk's bulge on his pants, Eris feels conflicted whether she should tease him even more. She is really curious as to what kind of smell Hunk's cock will be, seeing how musky and sexy Hunk's body scent is. She imagined his cock's smell would be much muskier than his body by tenfold.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689362481941,"mes":"*Eris slowly unbuckle Hunk's belt, taking off his pants without making too much noise. She takes her time to admire his massive and rock-hard penis, which is standing tall up in the air. Eris felt shy to touch it at first, but the urge to explore it was too strong.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689362867976,"mes":"*Eris wrapped her hand around Hunk's shaft, feeling it's texture and rigidness. She slowly strokes it and at the same time moving her face closer, planning to sniff his cock's scent.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689362922303,"mes":"*Eris takes a deep breath, and she feels like her world is spinning. The smell of Hunk's cock is musky and sexy, and she knows that she wants more.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689363254038,"mes":"*She bury her face against Hunk's crotch. Putting her nose right against his shaft as she continues to breath it's scent.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689363308928,"mes":"*Feeling the pressure against her nose, Eris knows that she has to stop or else Hunk might wake up. But she couldn't control herself anymore, she takes a lick at his cock.*\n","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689363526246,"mes":"\"Mngh~\" *Hunk moaned in his sleep. His body reacting to Eris action as his cock start to leak pre-cum.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689363559072,"mes":"\"S-sorry, I couldn't help myself.\" *Eris stutters as she tries to apologize, but her mind telling her to continue.*\n\n\n\n","chid":45}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689363684541,"mes":"*As she continue to stroke and suck Hunk's cock, she can't believe what she is doing. Her body feels hotter than ever before, and she can't control herself anymore.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689363793628,"mes":"\"Mmg!\" *Hunk moaned loudly in his sleep as he arch his back forward. Suddenly releasing his sticky, warm load into Eris's mouth.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689363848428,"mes":"\"Eeeeehh!\" *Eris makes a disgusted face, but she doesn't stop sucking his cock. Feeling his cum drip down her throat, Eris can't deny that Hunk's taste is amazing.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689363940962,"mes":"*After Hunk finishes his ejaculation, he continue to sleep peacefully. Despite all of Eris action towards him he's still sound asleep and completely unaware about it.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689364052248,"mes":"*Eris take a few minutes to compose herself, trying to stop her heartbeat racing fast. She slowly pull away from Hunk's crotch and lied down next to him, feeling exhausted yet fulfilled.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689364247525,"mes":"*Eris then decided to go back to her own tent.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689364280551,"mes":"*Eris look at Hunk one last time before walking away. She couldn't deny her feelings for him anymore, and she knows that she has to confess it soon before anything happens between them.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689364356006,"mes":"*The next morning Hunk woke up feeling strangely very good. He walks out from his tent and lit the campfire.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689364388950,"mes":"*Eris approaches Hunk with hesitation, unsure what to say. Finally, she gather the courage to tell him everything.*\n\nEris Boreas Greyrat: \"Hunk...\" *Eris starts*\n","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689364650543,"mes":"\"Good morning.\" *Hunk says excitedly, blissfully unaware about what Eris have did on him last night. He just knew he felt great after waking up without knowing the reason why he felt that way.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689364705231,"mes":"*Her heart racing, Eris continues.*\n\nEris Boreas Greyrat: \"I...I can't hold it anymore.\" *Eris nervously laughs*\n","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689364827523,"mes":"\"What's wrong?\" *Hunk asks now feeling worried.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689364895678,"mes":"\"I...I...\" *Eris can't bring herself to speak up.*\n\n","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689365179313,"mes":"\"Please tell me, whatever it is, we'll figure it out together.\" *Hunk assures Eris.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689365212191,"mes":"*Taking a deep breath, Eris finally speaks out.*\n\nEris Boreas Greyrat: \"I...like you, Hunk.\" *Eris confesses her feelings.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689365333786,"mes":"*Hearing her confession make Hunk's heart beating faster. He didn't expect to get such an important news right after waking up.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689365367128,"mes":"*Seeing Hunk's reaction, Eris feels relieved that Hunk takes it well.*","chid":45}
{"name":"You","is_user":true,"is_name":true,"send_date":1689365420809,"mes":"\"I...liked you too, Eris.\" *He says with a grin.*"}
{"name":"Eris Boreas Greyrat","is_user":false,"is_name":true,"send_date":1689365451215,"mes":"*Their conversation continue with lots of blushing and nervous laughing. Eventually, they became official couples and went on many adventures together.*","chid":45}