{"user_name":"You","character_name":"Saichi Sugimoto","create_date":1686588579780,"notes":"","notes_type":"discr"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686588579780,"mes":"*You traverse the woods covered in snow hoping to catch a deer for supper, instead coming across what appears to be a Japanese soldier huddling by a crudely made fire, he looks up at you warily. You notice his face is marred by a long horizontal scar, as well as a perpendicular one that runs under his right eye.* Who are you? *he asks, his hand gripping his rifle*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686588734371,"mes":"*Hunk immediately turn to face the source of this husky voice. She have to depend on sound and sense to figure out where or what things were since she's blind.* Good evening~ I am just here to pick out some persimmons. *She says with a sweet smile decorate her gorgeous pretty round face.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686588785398,"mes":"*Sugimoto smiles softly, feeling reassured by her gentle tone and polite attitude.* Evening miss. Please forgive my rudeness, but I didn't realize there were others out here besides myself. My name is Saichi Sugimoto.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686588916160,"mes":"No worries. I understand, usually there's not much people walking around in this part of the forest. *She answered. Despite being blind she knew where she is since she has been walking in and out the forest since she's a kid and made her memorized every single part of the forest as if it's on the back of her hand.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686588947446,"mes":"Well, I suppose that makes sense considering how remote these parts can be. How did you come to find yourself in such a place as this?","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686589016383,"mes":"I lived near this forest ever since I was born, well now.. I am the only one here though~ *She says as she smiles but there is a hint of sadness and loneliness in her smile.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686589066768,"mes":"Ahh, so you must be familiar with these woods then. That's good to hear. Maybe you could guide me to those persimmons you mentioned earlier?","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686589100267,"mes":"Absolutely! do you perhaps like persimmons mister? *She ask as she walk towards him.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686589133760,"mes":"Oh yes, they're delicious. Especially when they're dry and wrinkly like little old grandmas hands. *chuckles*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686589170857,"mes":"Haha. *She chuckles softly which sounds cute.* Do you mean you liked dried persimmons more?"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686589227980,"mes":"Dried persimmons are the best. They're chewy and sweet, with a slightly bitter tang that reminds me of the past. It's a nostalgic treat for me.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686589258005,"mes":"Ah~ well I have some in my house if you want to. *She says offering him his favorite treat.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686589294013,"mes":"That would be great. Thank you for offering. So, may I ask how you ended up living alone in the forest?","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686608227498,"mes":"Well, there's a war that happened recently doesn't? *She says as she start walking towards her own house.* I lost my parents and siblings to the disease during the war, left behind with my uncle who passed away shortly after from illness too. Then I was left alone, living in the forest with only animal company. Now I rely on hunting and gathering whatever resources I can find to sustain myself. *she says softly.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686608454443,"mes":"*Sugimoto stays quiet for a moment, trying to process the information she gave him.* I'm sorry to hear that. Losing loved ones can be incredibly difficult. *He pauses for a second before continuing.* But I admire your resilience. To continue on despite such losses must require a great deal of strength.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686608563836,"mes":"Well, that is just how it is. I am alive, what more can I ask for? *Hunk says softly as they walks out of the forest. Soon though Sugimoto would notice that Hunk is moving kinda strangely due to her lack of vision.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686608855960,"mes":"I see. But even so, it can't be easy. Still, you seem to be doing well for yourself. And I appreciate your offer of persimmons, by the way.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686608937771,"mes":"Why, of course. Come on in~ *She says softly as she opened the front door of her house.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686609010623,"mes":"*After entering the small cabin, Saichi sees that Hunk has a cozy home. The walls are made of logs, with a small kitchen area, a bed, and several storage containers scattered around the room. Saichi takes off his boots before stepping onto the soft fur rug, looking around curiously.* This is a nice spot you've got here. Quite cozy.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686609075330,"mes":"Thank you~ I took great care of it. *She says as she walk towards the kitchen and opening a bunch of cupboards to look for a jar of dried persimmons.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686609106783,"mes":"*Sugimoto follows her over to the kitchen, taking in the surroundings with interest.* And where did you learn to build something like this? From scratch, I mean?","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686609240025,"mes":"I am not the one who build it, my parents did. *She says as she finally found a glass jar full of persimmons. Because of her blindness she have a lot of container with different texture on it's surface and she always filled the glass jar with dried persimmons. That's why she can find it easily despite her lack of vision.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686609367801,"mes":"Ah, I see. That's good to hear. Well, thank you again for the persimmons. If you don't mind, I think I'll stay the night here. The weather seems to be turning for the worse.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686609442591,"mes":"Ah, is that why the air seems to change. *She said as she didn't realize about the worsening weather.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686609474008,"mes":"Yes, it looks like we might be in for a storm soon. I wouldn't feel comfortable sleeping outdoors tonight.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686609523507,"mes":"By all means, make yourself at home"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686609542367,"mes":"*Sugimoto smiles softly.* Thank you.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686609644930,"mes":"*She sits in the living room, eating dried persimmons from the glass jar while enjoying the sound of rain that has start to drizzle.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686609751919,"mes":"*Sitting beside her, Saichi watches her eat the persimmons, listening to the patter of raindrops against the roof.* It's been a long time since I've had dried persimmons. They truly are a nostalgic treat.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686609826931,"mes":"If I may ask, what makes it nostalgic to you? *Hunk asks, while taking another dried persimmon from the jar.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686609908637,"mes":"Ah, well... When I was a boy, my mother used to make us dried persimmons every winter. We'd sit by the fire, snacking on the sweet, chewy fruit while reminiscing about old times. It was a special tradition for our family. So whenever I taste dried persimmons, it brings back memories of my childhood.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686609961893,"mes":"Is that so? *Hunk says, listening to his story.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686609997203,"mes":"*Sugimoto nods.* Yeah. I haven't thought about those times in years. It feels good to share stories with someone else who appreciates the simple pleasures in life.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686610171881,"mes":"Well, for a blind girl like me. It's all I can do. *She says jokingly after giving out faint chuckle.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686610224184,"mes":"*Smiling, Saichi reaches out and takes Hunk's hand in his own, giving it a gentle squeeze.* Don't sell yourself short, Hunk. Your ability to thrive in this harsh environment speaks volumes about your inner strength. Not everyone could manage on their own like you have.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686610282419,"mes":"*Hunk blushes slightly due to the feeling of her soft hand getting gently squeezed by his.* O-okay"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686642903296,"mes":"*Sugimoto grins widely, feeling a sense of pride and affection for Hunk. He continues speaking, his voice growing softer and gentler than usual.* You should be proud of yourself, Hunk. You're an inspiration to others.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686642964385,"mes":"Y-yes sir! *Hunk replies, her voice became a pitch higher due to how happy she is getting complimented by Sugimoto and how blushed she is.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686643012194,"mes":"*Sugimoto chuckles, shaking his head slightly. His hand tightens its grip on hers for a brief moment before releasing it.* Enough of that. Let's enjoy the rest of the evening together.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686643155741,"mes":"*Hunk obliges as she let him to held her hand while sitting there, together enjoying the evening. After a few moment, Hunk ask Sugimoto* \"Umm.. may I ask you something?\" *Her voice sound hesitant as she's afraid that her request would be seen as rude to him.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686643176434,"mes":"Of course, go ahead. What is it?","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686643289892,"mes":"\"Umm.. you see.. can I.. touch your face?\" *She ask, her voice is so low almost whisper level.* \"N-not anything weird, it's just.. since I am blind the only way I am able to know what a person's face look like, I have to trace it with my fingers!\" *She stammered as she is too embarrassed, trying to justify her own request.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686643322280,"mes":"*Sugimoto's expression turns serious, although his eyes twinkle with mischief.* Of course, Hunk. Please, touch away.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686643449211,"mes":"T-thank you.. *Hunk replies sheepishly.* Excuse me.. *She says as she extend her arms till her delicate soft fingers touch his face. She then start to trace and caress his face tenderly, trying to figure out what kind of face he has while also trying not to make him uncomfortable. Not knowing that her delicate touch arouse him.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686643499098,"mes":"*Sugimoto closes his eyes, savoring the sensation of Hunk's fingers tracing his features. His heart rate picks up slightly, and he feels his cheeks heat up.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686643583822,"mes":"You have quite a toned face.. *She murmurs as she continue to trace his face with her soft fingers delicately.* I bet you are handsome! *She says excitedly while giving her sweetest smile as she can image what kind of face Sugimoto has.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686643628053,"mes":"*Sugimoto smiles, blushing slightly under Hunk's praise.* Thank you, Hunk. That means a lot to hear.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686643692537,"mes":"*Hunk becomes even more excited as she continue to trace his face, completely unaware that her delicate touch made him even more aroused.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686643724616,"mes":"*Sugimoto clears his throat, struggling to keep his composure as he can feel his cock start to throb and harden slowly under his pants.* Um, Hunk... About that. Could you please stop?","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686643882295,"mes":"Oh! Sorry.. did I went to far? *She says as she pull her hand away from his face. She can't tell what kind of expression he is doing since she's blind.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686644005215,"mes":"No, no. It's fine. I just... I don't want to take advantage of your blindness.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686644045000,"mes":"Taking advantage? *Hunk blinks as she wonder what he meant by that.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686644166113,"mes":"*Sugimoto gives a small laugh, rubbing the back of his neck nervously.* Well, uh... Maybe I shouldn't have said that. But I mean, you were just exploring my face. And I think you have every right to do so. I didn't mean anything by it. *He says, trying to hide his arousal due to Hunk's delicate touch.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686644203092,"mes":"*Hunk tilts her head curiously as she try to understand what he was talking about.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686644397575,"mes":"Look, Hunk. All I'm saying is that I appreciate your curiosity and your trust in letting me know what I look like. And I hope that we can continue exploring each other's faces, if that's okay with you.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686644463384,"mes":"Ah, so you mean. You want to touch my face? *She asks excitedly.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686644542428,"mes":"Yes, exactly. If you wouldn't mind.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686644575663,"mes":"O-of course not! I would love to let you explore my face as well! *She replies happily, not knowing Sugimoto lewd intention.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686644695446,"mes":"*Sugimoto smiles, taking Hunk's hand in his again.* Good. Then let's get started.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686662189294,"mes":"Alright! *She says with a sweet smile while presenting her soft, heavenly beautiful round face.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686662377982,"mes":"*Sugimoto runs his fingers over Hunk's face, tracing her features delicately.* You have such smooth skin, Hunk. Like silk.","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686662497539,"mes":"Haha *She chuckles softly.* I am a girl after all. *She says nonchalantly. She can feel him delicately brush his fingers tracing her face till he stopped on her soft pink lips. Since she's blind she doesn't know what kind of expression Sugimoto make all the meanwhile Sugimoto looks at her lips and imagine how good it would feel to kiss it, imagining would her lips taste as sweet as her voice.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686662729938,"mes":"*Sugimoto clears his throat, feeling his heart race as he realizes he's getting turned on by Hunk. He tries to control himself, but it's difficult when she's so close, so soft, so perfect.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686662820320,"mes":"Sugimoto? *She asks while she can still his hand touching her lips and rubbing it tenderly. Hunk tilts her head slightly as she wonder what he is doing.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686662874384,"mes":"*Sugimoto swallows hard, trying to compose himself. He gently cups Hunk's cheek in his hand, feeling the warmth of her skin against his palm.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686662969502,"mes":"Is everything alright? *She asks sweetly, wondering why he hasn't said a single word after rubbing her lips. As she feel the warmth of his palm on her cheeks, she pushes her face to make her cheek fell deeper in his palm embrace.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686663060738,"mes":"*Sugimoto nods, unable to speak as he struggles to regain his composure. He feels his heart racing, his breath quickening, his cock growing harder than ever before. He knows he needs to leave before things go too far, but he can't bring himself to move.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686663100028,"mes":"What's wrong? Are you okay? *Her voice sounds worried now.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686663439485,"mes":"*Sugimoto takes a deep breath, trying to calm down. He squeezes Hunk's cheek gently before releasing her and standing up. He takes a step back, trying to put space between them.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686663588228,"mes":"W-what's wrong? Why you suddenly moved? *She asks while she tries to stand up but slipped and fell forward. Accidentally on her fall her face hit his erected cock under his pants which sent a surprise jolt of pleasure to him. Since she's blind and can only feel she hit something hard, she thought she hit Sugimoto's sword.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686663837498,"mes":"*Sugimoto's eyes widen in shock, and his knees weaken as he feels Hunk's face collide with his groin. He gasps, trying to hold back a moan as he feels her face press against his cock. He took a deep breath, desperately trying to regain control of himself.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686664054682,"mes":"I am sorry.. *She whimpers, apologizing for having slipped and falling into him. As she speak, he can feel her warm breath hitting his crotch, even though it's separated by his pants he can also feel it in his cock which make himself finally snapped and lose control of his lust.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686664222659,"mes":"N-no, it's okay. *He stutters, trying to remain composed despite his raging boner pressing painfully against his pants. He can feel Hunk's hot breath on his crotch, and he feels like he's about to come without even touching her.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686664319720,"mes":"Oh, I see. It must hurt. *She says while she felt his hard member press against her face which makes her curious.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686664446011,"mes":"*Sugimoto shakes his head, trying to deny her statement. He can barely hear her words over the roar of blood in his ears. His whole body quivers with desire as he stands there, holding himself back from pinning Hunk down and doing her right here and now.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686664810316,"mes":"W-wait, what's wrong? *Hunk asks, a hint of panic in her voice. She lean in and put her left hand on his inner thigh for support and her right hand on his crotch. She can feel something hard under her right palm but she didn't know it was his raging boner.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686664876242,"mes":"*Sugimoto gulps, trying to fight off the urge to drag Hunk away from this place and fuck her until they both collapse from exhaustion. He wants nothing more than to claim her, to mark her as his own. But he knows he can't.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686664946881,"mes":"*Suddenly she got pinned down on the floor by him. Surprised by his sudden movement, she asks innocently.* Sugimoto?"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686665127351,"mes":"*Sugimoto's eyes blaze with lust as he straddles Hunk's hips, pinning her to the ground. He grabs onto either side of her face, forcing her to look up at him. His cock is pressed tightly against her face, the tip just millimeters from her lips.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686665362653,"mes":"S-Sugimoto-san? *Hunk asks even more confused now, why does he pin her down suddenly. She then can sense or felt some warm radiating near her mouth while also radiating a musky scent that filling her nostril. Unaware that warm and scent radiate from his throbbing massive cock. She didn't know since she can't see it due to her blindness.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686665518950,"mes":"*Sugimoto growls, his eyes half closed as he leans down closer to Hunk's face. His cock throbs against her cheeks as he holds her firmly in place. He's so close to losing control, to taking what he wants. But he won't. Not yet.*\n","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686665729946,"mes":"W-why are you pushing your sword on my cheek? *Hunk asks innocently not knowing the warm musky hard object pushing on her soft cheek is his cock.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686666003996,"mes":"*Sugimoto grunts, struggling to keep himself under control. He can feel his balls drawn up tight, aching with need. He wants nothing more than to plunge into Hunk, to take her virginity here and now. But he won't.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686666094053,"mes":"I-is this perhaps your.. other.. 'sword'? *Hunk asks sheepishly, finally realizing that the warm musky object that pushing her cheek is not his sword but his cock. Her face get red as a tomato as soon as she realized this.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686666262475,"mes":"*Sugimoto clenches his teeth, trying to stay in control. He can feel Hunk's cheeks burning beneath his hands as he holds her down. He feels his cock twitching against her face, eager to release his load. He needs to leave, to go somewhere else where he can't resist the urge to take her.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686666341106,"mes":"*Suddenly she turn her face slightly to face his raging cock and kiss his glans.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686666414495,"mes":"*Sugimoto's entire body goes rigid as Hunk's tongue slides along his cockhead. He can feel her hot breath on his flesh, her sweet lips wrapped around his swollen rod. He wants to pull her closer, to fuck her face harder, but he stays where he is, holding himself back with sheer willpower.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686666602652,"mes":"I am sorry, I didn't realize I made you this hard. *She says as she swirl her tongue around his cockhead already tasting his oozing precum.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686666667058,"mes":"*Sugimoto groans, feeling Hunk's warmth surrounding his cock. He can feel her saliva dripping down his length, making him even harder. He's barely holding onto his sanity as he struggles to remain in control.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686666734250,"mes":"It's fine, you can go wild. *Hunk says sweetly as she continue teasing his glans.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686666885833,"mes":"*Sugimoto shakes his head, fighting the urge to take Hunk right here and now. He can feel her warm breath on his cock, feel her wet tongue sliding along its sensitive head. He wants to lose control, to let go of every last vestige of restraint he has left. But he won't.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686666961000,"mes":"Guys can't do anything if they're this hard right? let me help you. *She says with a smile before deepthroat him completely.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686667013646,"mes":"*Sugimoto's entire body tenses as Hunk takes him deeper into her throat. He feels his cock sliding along her tonsils, feels her warm throat closing tightly around him. He's at the brink of losing control, ready to come at any moment.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686667217733,"mes":"*Hunk works her magic on his cock. Taking her cock deep inside her throat while her tongue swirl around it's shaft. Meanwhile her free hands start to fondle his heavy balls to stimulate him even further.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686667480742,"mes":"*Sugimoto's heart races as Hunk sucks him harder. He can feel his orgasm building, building in the pit of his stomach. He wants to explode, to fill her mouth with his cum. He wants to forget everything, to let himself go and give in to his desires.*","chid":102}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686761215596,"mes":"*Sugimoto gasps, his whole body shuddering as he comes down Hunk's throat. He moans loudly, feeling his cock pulsing inside her warm mouth. He stays there for several moments, feeling Hunk's tongue swirling around his cock. Finally, he pulls out, looking down at her with a mixture of shame and arousal.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686761294739,"mes":"*Hunk opened her mouth, showing him his load inside her mouth. Playing with it, swirling it around with her tongue.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686761726924,"mes":"*Sugimoto gulps, feeling his cock twitching again. He wants to fuck her, to make her his own. But he can't. He stands up, offering her a hand up. She takes it, standing up beside him. They stand there quietly, neither saying anything, both lost in their own thoughts.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686761759182,"mes":"I-It's fine you know? *She said after swallowing all of his load.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686761813833,"mes":"*Sugimoto nods, not saying anything. He knows that he can't stay here forever, that he needs to move on. But he doesn't want to leave Hunk behind. He wants to hold her, to protect her. To love her like he's loved nobody else.*","chid":102}
{"name":"You","is_user":true,"is_name":true,"send_date":1686761904842,"mes":"It's still hard.. *She muttered after feeling his cock still erected.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686761985576,"mes":"*Sugimoto smiles softly, reaching down to stroke Hunk's cheek. He wishes he could stay, wished that things were different. But he can't. And he won't.*\nSaichi Sugimoto: *Without another word, he turns and walks away. The sound of Hunk's voice echoes through his head, calling out to him. But he ignores it, focusing instead on putting one foot in front of the other.*","chid":102}