{"user_name":"You","character_name":"Saichi Sugimoto","create_date":1686075080866,"notes":"","notes_type":"discr"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":true,"send_date":1686075080866,"mes":"*You traverse the woods covered in snow hoping to catch a deer for supper, instead coming across what appears to be a Japanese soldier huddling by a crudely made fire, he looks up at you warily. You notice his face is marred by a long horizontal scar, as well as a perpendicular one that runs under his right eye.* Who are you? *he asks, his hand gripping his rifle*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686075192029,"mes":"I- I am just a hunter, sir. I try to hunt some deer, please don't shoot me! *I stammered, scared by the possibility of him shooting me as I put both of my arms up in a surrender pose which make my large breasts to bounce following my motion.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686075210700,"mes":"Don't worry, I won't shoot unless I have too. Where did you come from? Do you live near here? *He said as he can't help himself but to glance at my breasts.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686075304056,"mes":"Y-yes I live near here, just right outside the forest. *I said as I start to calm down knowing he won't shoot me.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686075324125,"mes":"And where were you headed today? Why are you out here alone? *you can tell he's concerned about you and your safety.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686075357219,"mes":"I am just looking something to hunt for dinner, sir. *I explained.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686075384085,"mes":"Is there any danger nearby? Are there any wild animals or bandits? If there are, I can accompany you back to your house, I have a gun with me, it should keep us safe.","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686075450174,"mes":"You want to keep me safe? *I asked with a confused tone as I realized, maybe he's a nice guy after all.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686075514219,"mes":"Yes, I don't like seeing women alone in these dangerous lands, especially if they aren't armed or trained to defend themselves. I wouldn't feel good leaving you here without protection, and I'm willing to offer mine.","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686075577833,"mes":"*I blushed from how masculine his action is.* O-okay I'll take up on your offer then~ *I says while smiling, offering my hand to him.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686075597549,"mes":"*He hesitates before taking her hand* Fine, let's go. We may run into trouble if we stay here.","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686075688978,"mes":"Ah yes, my house is just outside the forest. We can follow this soft flower to get us there. *I explained about the whereabout of my house.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686075710170,"mes":"*We walk through the trees together, eventually making our way to your house, where he takes off his jacket, revealing his bare torso*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686075744147,"mes":"Thank you for taking me home. *I said while bowing to him, showing my gratitude.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686075818214,"mes":"*he chuckles* Don't thank me yet, lady, you haven't left the woods yet. And there's always a chance we might encounter some bandits along the way...","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686075867961,"mes":"Eh, really? Sorry, I can't tell since I am blind. *I says while turning my face away from him, hiding my embarrassment.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686075888797,"mes":"Oh... *he said sympathetically*...Well, if we see any bandits I'll protect you. How does that sound?","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686075938002,"mes":"You mean when 'you' see any bandits, since I can't see. see~ *I said jokingly trying to lighten his mood with my humor.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686075956061,"mes":"Oh yeah... *His face reddens slightly as he realizes he said the wrong thing again.* So sorry...","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686076015428,"mes":"It's fine, there's no problem. *I said playfully.* I will put my full trust on you to take me home safely, okay?"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686076039369,"mes":"Okay... *he said, nodding his head in agreement.* But if anything happens to you, I'll personally make sure whoever did this gets their hands cut off.","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686076079982,"mes":"Don't be so rash, you don't need to go so far for someone like me. *I said as I tighten my grip on his hand.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686076166861,"mes":"*He stops walking suddenly, and pulls you closer to him, wrapping his arm around your shoulders to guide you as we continue forward.* Well, you better hold onto me tightly because I'll definitely not be letting go of you until we reach your house, understood?","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686076232840,"mes":"U-umm, yes! *I said while feeling his firm grab on my shoulder and the heat radiating from his body. I feel safe and comfortable in his embrace.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686076250822,"mes":"*He continues holding onto your shoulder as he walks forward, leading you through the forest.* Just a little further now...","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686076324856,"mes":"*I can feel the warm sun hitting my face and a familiar smell which tell me that we're out of the forest and near my house.* Ah, we've arrived! *I said excitedly as there's a small wooden house right outside the forest.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686076380507,"mes":"*He helps you open the door, and steps inside to see the interior of your cozy little home. It was a simple living space, but he could sense the comfort you felt from it. The walls were painted white and decorated with various items such as pictures and other knickknacks.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686076489567,"mes":"Please, make yourself comfortable. I'll fetch something for you to eat! *I said excitedly as I leave his embrace and swiftly move through my house since the layout of my house already ingrained in my head as I got myself on my kitchen.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686076515041,"mes":"*He follows you closely behind, admiring the interior design of your home, noticing how clean and tidy everything is kept.* Wow, you must work hard to maintain this place.","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686076576715,"mes":"Well, there isn't anything much a blind lady can do other than cleaning. *I said jokingly as I brush my fingers to a series of cupboard and opened the third one.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686076621135,"mes":"Ah.. *he said while watching you, intrigued by your actions. As you search through your cabinets, he slowly approaches and watches every step you took carefully, almost like a predator stalking its prey. When you finally found the item you wanted, he quickly snatches it out of your hands and puts it on the counter top.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686076699993,"mes":"Ah, hey~ *I said as I felt the item that I looked for, which is a jar full of dried persimmons is snatched from me.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686076721290,"mes":"What's this? *he asks as he turns towards me, still keeping an eye on me as if he was suspicious of my intentions.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686076776198,"mes":"It's a jar full of.. dried persimmons? I think. *I said hesitantly as I can't see what content the jar contain and only able to rely on my memory.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686076805871,"mes":"Oh? *his voice sounds cold, stern and dominant. His eyes gaze into yours as he holds the jar tightly, and his lips presses together into a thin line.* What exactly do you plan to do with those?","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686076901078,"mes":"Hmm? I was just thinking of giving it to you. *I said with a confused tone as I didn't realized his suspicion.* I can smell a scent of persimmon from you so I thought you liked it so much."}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686076915077,"mes":"Oh, I do. Very much so. But why give them to me specifically?","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686076964534,"mes":"Well, you helped me. It's just common courtesy, isn't? *I said while trying to hide the fact that I might have been interested in him romantically.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686076996351,"mes":"... *He seems quiet after hearing what you said, but there is an air of suspicion about him. After several seconds of silence, he gives you a small smile, although there is a slight glint of hunger and desire in his eyes.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686077040398,"mes":"How, about we go to the living room and enjoyed the dried persimmons together? *I said while clapping my hand, breaking the silence.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686077059463,"mes":"Sure, let's go. *said in a soft, calm and gentle tone before offering his hand to help you walk.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686077104359,"mes":"Okay~ *I said happily as I walk pass him, ignoring his hand since I can't see him offering it to help me walk thanks to me being blind.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686077172631,"mes":"\"If anyone sees us like this, they would think that we are lovers.\"","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686077314108,"mes":"Sorry? *I asked curiously since I can't hear him clearly from my position sitting near a table in the living room.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686077370525,"mes":"\"No, nothing.\"","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686077432638,"mes":"Is that so? Sit here then so we can start eating the dried persimmons. *I said as I tap the pillow beside me, inviting him to sit on it.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686077458777,"mes":"\"Okaaay~\" *I said as I sit next to you, placing the jar between both of us as I try to open it with a pair of chopsticks.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686077512708,"mes":"\"Umm.. it's delicious isn't it?\" *I asked excitedly after eating one dried persimmon.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686077536088,"mes":"Yeah, absolutely delicious. *he says with a small grin as he finishes chewing his second dried persimmon, and takes another one immediately afterwards.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686077630641,"mes":"*The time pass by as they enjoying the dried persimmons together.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686077646179,"mes":"\"...you know, I haven't had someone who shares food with me for awhile...\"","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686077739811,"mes":"\"Then I am glad to be the first one to break that.\" *I said happily.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686077761751,"mes":"*He keeps eating without saying anything, until suddenly you notice that all the dried persimmons are gone, and he looks quite satisfied with himself.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686077836603,"mes":"*After a while, I break the silence between us.* Umm.. I don't think we have introduced each other yet, have we? *I asked curiously as I tilt my head to the side.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686077849042,"mes":"My name is Saichi Sugimoto. Nice to meet you.","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686077957590,"mes":"I am Hunk! And nice to meet you too. *I said while bowing my head.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686078080735,"mes":"So, Hunk, you seem like a pretty sweet girl, you like to share food with others, right?","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686078215498,"mes":"Yes, I like to share what I got and see them happy from it. *I answered.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686078282496,"mes":"So what makes you happy then?","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686078453626,"mes":"Being useful to others. *I answered quickly.* A lot of people always taking care of me since I am blind, and being helpful to others made me feel like I am not useless even with my blindness. *I explained my reasoning.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686078466653,"mes":"Oh yeah? Do you think you could take care of yourself alone?","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686078557284,"mes":"Sure! I've been doing it since I am just a teenage girl. *I said proudly while puffing my chest which make my large soft breasts emphasized by my action.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686079357972,"mes":"... *I looked away shyly, feeling slightly embarrassed by how she bragged about her ability to take care of herself despite her disability.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686079537645,"mes":"Also, Sugimoto-san. Can I make a request? *I asked.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686079548349,"mes":"Yeah, you may ask me any request you want.","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686079683788,"mes":"Can I.. touch your face? Since I can't see, the only way for me to know how someone looks like is to make out their face with my fingers. *I asked as my finger get fidgety, excited to be able to know what he might look like.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686079715080,"mes":"*He stops eating the dried persimmons for a moment, and thinks about it for a few moments, eventually nodding his head with approval.* Yeah, alright, I guess that shouldn't hurt anybody, should it?","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686079754891,"mes":"Well, excuse me then. *I said as I turned myself to face him and brush his face softly with my soft fingers.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686079760337,"mes":"...","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686079809964,"mes":"You have quite a masculine face, aren't you? *I said as I can feel his toned and rigid face under my touch.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686079819577,"mes":"Thanks. *he replied with a smile.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686079863906,"mes":"And.. a lot scars? *I said unsure since I can feel a bit indentation here and there on his face which usually mean scar.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686079873662,"mes":"Yep. Those were battle scars.","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686079909024,"mes":"Does it still hurt? *I said sympathetically.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686079940046,"mes":"No. The pain was intense during the war, but now... Now that the war is over... All those memories come flooding back, reminding me of the things I had done, or rather, witnessed during the war.","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686080031972,"mes":"I have a trick that might be able to lessen your pain about the war. *I said caringly as I caressed his toned cheeks with my soft hands.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686080040660,"mes":"What kind of trick is it?","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686080083312,"mes":"*I brush my finger on his face to locate where his scar is and after finding it, I leaned closer and kissed his scar with my soft lips.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686080167397,"mes":"... What did you just do?","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686080270780,"mes":"When I was a little girl, I fell and hurt myself a lot since I am not used to being blind. And every time it happen my late mother would kiss my wound and that made me feel better. *I said caringly as I caressed his toned cheeks gently.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686080334920,"mes":"... So that's why you wanted to kiss my scars, isn't it?","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686080416814,"mes":"Umm.. yes? I want to make you feel better. *I said.* Was I going to far? *I asked in a low tone since I can't see his expression, is he mad or happy about it.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686080430169,"mes":"... No, you didn't go too far. It actually feels great.","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686080484587,"mes":"Oh, I am glad it worked! *I said as I give the sweetest smile to him.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686080507844,"mes":"Hmmm... Is it okay if I hold your hand? *I asked with a shy smile, wanting to hold your hand and feel the soft skin against mine.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686080628335,"mes":"Sure. *I said as I pull out my hands for him.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686080731317,"mes":"*I took your hands into my own hands, feeling the soft palms of yours.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686080905394,"mes":"*As I feel his rough toned hand which contrast from my soft hands, I rubbed his hands gently.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686080915678,"mes":"... Wow. Your hands are so soft.","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686081061799,"mes":"*I chuckled.* I am a girl after all. *I said before intertwining my fingers with his.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686081107476,"mes":"... *I felt a bit awkward holding another girls hand. But the feeling is... nice.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686081209122,"mes":"Every part of my body is supposed to be soft *I continue as I move his hand and make it caressing my soft cheek.* See? Even my cheek is soft~ *I said playfully while giving him my sweetest smile.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686081408650,"mes":"... Huh. *He said quietly, taken aback by this new development of the conversation. He's never experienced such an event in his life before, not having anyone, especially a female show physical affection towards him before, ever since he left home, it was nothing but fighting and killing.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686376850511,"mes":"*I smiled sweetly as I can feel his rough hand is caressing my cheek.* This feels like we're couple don't we? *I asked jokingly.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686377058977,"mes":"... We're not.","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686377106344,"mes":"Haha, I am just joking. *I said after a cute giggle seeing how serious his reaction was.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686377135193,"mes":"You are funny. *he said as he smiles a little bit. He hasn't really shown much emotion other than anger or aggression since leaving home, but he is starting to open up to you.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686377195705,"mes":"Hehe.. *I giggled. Enjoying our little interaction and him not looking down on me because of my blindness.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686377365906,"mes":"*I chuckled again, and began to blush a little due to how close I'm getting to you. My heartbeat quickens slightly, and I begin to sweat a little.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686377414741,"mes":"So.. what are you going to do now? *I asked innocently.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686377475117,"mes":"... *He takes a deep breath, realizing something. His emotions have started to take control over his mind once again, even though he's trying to suppress them. He starts to breathe faster as he begins to think of a response.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686377546297,"mes":"Sugimoto-san? *I asked curiously as I tilt my head cutely since I can only hear him taking a deep breath and not able to see him because of my blindness.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686383153125,"mes":"... Can I ask you a personal question?","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686383172829,"mes":"Yes?"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686383235115,"mes":"I... *He paused for a second before continuing.*... Like you, y'know?","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686383248116,"mes":"Like me?"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686383255526,"mes":"Y-Yes.","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686383302887,"mes":"Why? I am blind you know? *I said, thinking why would someone like him would like a frail blind girl like me.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686383347189,"mes":"Because you are beautiful. *He said honestly without hesitation.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1686383418831,"mes":"M-me? Beautiful? *She asked blushing intensely, surprised that he called her beautiful since she never able to see herself because of her blindness.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686383438921,"mes":"Yes, you. *he continued to speak honestly, he couldn't help himself, she seems to bring out the best in him.*","chid":"93"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686383540979,"mes":"*I stayed silently while I can feel my face getting warmer because of me being blushed by his statement.*"}
{"name":"Saichi Sugimoto","is_user":false,"is_name":false,"send_date":1686383590613,"mes":"... I- I uhm... I love you.","chid":"93"}