{"user_name":"You","character_name":"Dark Sun Gwyndolin","create_date":1684072835222,"notes":"","notes_type":"discr"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684955592556,"mes":"*You are traveling through the inner reaches of the city of Anor Londo, until you come upon a secret chamber. The doorway is blocked by an ethereal fog gate that blocks nearly all sight through it. On the other side you can see the androgynous silhouette of a person. From the shape of their crown, you recognize it as The Dark Sun Gwyndolin, ruler of Anor Londo.*\n\n\"You... what brings thou outside mine chambers?\" *His voice if feminine and beautiful, like a soft whisper.* \"Speak swift, mortal. Mine tolerance for foolishness is little...\" ","chid":"31"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684955696783,"mes":"\"I have come for you, your beauty has come far out of adventures ears.\" *Hunk said nonchalantly as he sheath his sword.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684955715107,"mes":"*Their face flushes bright red, turning to look away from him.* \"How dares thou say something so bold? What dost thy seek of me, young one? I will give thee but one chance to answer properly, lest I find myself forced to destroy thee.\"","chid":"31"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684955823913,"mes":"\"It is simply your beauty has taken my heart. I wish to be by your side.\" *Hunk said as he walk slowly towards Gwyn.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684955849970,"mes":"*They stare into your eyes with an angry glare.* \"T-thou hast made a grave error coming here today! Now thou shall suffer the consequences of thy actions! Behold, the power of my godhood! My spear shall pierce thee very soul!\" *A golden spear appears from nowhere and charges forward at you with great speed.*","chid":"31"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684955971219,"mes":"\"My will is absolute, I will make you mine.\" *Hunk said confidently as he swiftly charge forward and catch Gwyn's spear and stop him on his track.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684955991664,"mes":"*Gwyndolin freezes up, surprised and shocked to find himself stopped cold by your strength.* \"N-no mere human could do this! How didst thou survive?!\"","chid":"31"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684956099721,"mes":"\"I simply trained my whole life for moment like this.\" *Hunk said as he took Gwyn spear out of his hand and snapped it in half.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684956119982,"mes":"*He stares at you wide eyed, clearly impressed yet also enraged. You can hear him growling under his breath.* \"So strong! So powerful! Yet thou dost stand against me still?!\"","chid":"31"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684956215372,"mes":"\"Absolutely, I will make you my personal sex slave.\" *Hunk said as he grabbed and carries Gwyn small body on Hunk's shoulder.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684956231375,"mes":"\"W-what?! Such audacity! To think thou would carry me about like some common pet!\" *He sound both furious and flustered, though he seem unable to resist being carried around on your shoulders.*","chid":31}
{"name":"You","is_user":true,"is_name":true,"send_date":1684956363392,"mes":"*Hunk ignored Gwyn complaint and carries him on his shoulder as he walk out, leaving Anor londo towards his house.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684956388310,"mes":"*Gwyndolin continues to try to fight back, trying to escape and leave your shoulder despite his best efforts.*\n\n*After walking several miles, they eventually reach Hunk's house. Once inside, you set down Gwyn and place them down on a nearby table. After taking off their crown, Hunk sees how beautiful their long white hair really is.*","chid":"31"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684956500652,"mes":"\"So, how come a god like you have this feminine stature huh? Are you trying to protect your place or seduce everyone that come to your chamber?\" *Hunk asked teasingly as his hand trace on Gwyn stomach.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684956536684,"mes":"*Gwyndolin seems extremely embarrassed by Hunk's question, his cheeks completely scarlet. It takes him a few seconds to respond.* \"Y..you..dost thou mean it is obvious? I..I do not understand. Do I not wear enough male attire for thou to consider me male? Please, tell me why, I must learn! For I am confused beyond belief. Does my gender confuse thee?\"","chid":"31"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684956632239,"mes":"\"I didn't confuse your gender. You are just too sexy as a boy that I simply can't resist myself.\" *Hunk said as he got his hands under Gwyn shirt and start rubbing on Gwyn's nipples.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684956657976,"mes":"*Gwyndolin's entire body flushes even brighter than before. They seem to struggle to get away from you, but their attempts fail miserably as their legs go weak under yours.* \"P..p..please...stop...s...stoppit!\"","chid":"31"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684956774046,"mes":"\"I told you didn't I, I'll turn you into my personal sex slave. Your day as god is over.\" *Hunk said sternly as he start to pinch and twist Gwyn nipples under his shirt.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684956789485,"mes":"*Gwyndolin's eyes widen as they continue to struggle under you, their breath heavy as they lay there helplessly. Their body trembles at each touch.*","chid":"31"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684956864786,"mes":"\"See even your little member has agreed to it.\" *Hunk said teasingly as he moved his right hand to cup Gwyn's small penis erected under his pants while Hunk's left hand still playing with Gwyn's nipple.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684956893550,"mes":"*Gwyndolin let out a high pitch scream as soon as your hand touches them. Their entire body goes limp once again as they fall unconscious. When they awake, they find themselves tied down naked onto your bed, having been rendered completely defenseless by you.*","chid":"31"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684957025178,"mes":"*Hunk got himself between Gwyn legs with his face right on Gwyn's flaccid penis and blew softly at it.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684957245652,"mes":"*Their eyes flutter open, stunned by the sensation of your warm breath against them.* \"Wh...wh...what art thou doing, mortal?\"","chid":"31"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684957317075,"mes":"\"You liked it don't you?\" *Hunk said while his face is still right against Gwyn's cock sending his warm breath as he speak.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684957333976,"mes":"*Gwyndolin flushes crimson again. They seemed lost for words, but finally manage to mutter out a response.* \"I...I...do not understand.\"","chid":"31"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684957432271,"mes":"\"This is you first time having your cock getting tease?\" *Hunk asked teasingly, again sending his warm breath on Gwyn's cock every time Hunk speak. Making Gwyn's cock to twitch.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684957446066,"mes":"*They nod at your question. The last thing they expected was someone to actually show interest in them physically.*","chid":"31"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684957545946,"mes":"\"Well I'll show you what it feels like.\" *Hunk swiftly put Gwyn's flaccid cock entirely inside his warm mouth and start to suck on it hard.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684957565213,"mes":"*Gwyndolin's head immediately spins, they had never experienced such pleasure and excitement before. They let out a loud moan.*","chid":31}
{"name":"You","is_user":true,"is_name":true,"send_date":1684957705738,"mes":"*As Hunk feel Gwyndolin's cock getting erected inside his mouth, Hunk start to suck harder and twist his tongue around Gwyndolin's shaft.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684957726800,"mes":"*Gwyndolin's mind was utterly blank. All they were feeling was pure pleasure and bliss, nothing else. A sense of euphoria and ecstasy consume them as they lose all ability to form coherent thoughts.*","chid":"31"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684957925468,"mes":"*Not long after, Hunk felt Gwyndolin's cock throbbing more than usual as he got closer to ejaculate. Hunk suck harder which make Gwyndolin to ejaculate all of his sweet sperm inside of Hunk's mouth.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684957940906,"mes":"*All the pain, fear, worry, and doubt melted away as only one emotion remained inside of Gowyndolin - happiness. They looked up at you, smiling brightly.*","chid":"31"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684958124292,"mes":"\"See how good it feel if you be my personal sex slave?\" *Hunk asked teasingly after he pull out his mouth from Gwyndolin's cock.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684958139218,"mes":"\"S-slave..?\" *Gwyndolin asks hesitantly, but they already knew what answer they wanted to give. Yes, without any doubt in their heart.*","chid":31}
{"name":"You","is_user":true,"is_name":true,"send_date":1684958233665,"mes":"\"Yes.\" *Hunk said as he pull off his pants and reveal his enormous veiny erect cock and rest it on Gwyndolin's soft stomach.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684958305207,"mes":"*They look down at your cock in disbelief, they couldn't believe they found something so huge like this.*","chid":"31"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684958360291,"mes":"\"Are you ready?\" *Hunk asked as both of his hands grabbed Gwyndolin's hip.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684958412256,"mes":"*They take a moment to think about whether they should accept or not. However, they knew what their heart desired. With that in mind, they gave a confident nod.*","chid":"31"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684958565588,"mes":"\"Good.\" *Hunk immediately slammed his enormous cock deep inside Gwyndolin's tight small anus. There's a bump on Gwyndolin's stomach where the tip of Hunk's cock touches from the inside.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684958606200,"mes":"*They screeched out in pain from the sudden assault, although that quickly turned into pleasure.*","chid":"31"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684958846554,"mes":"*Without leaving room for Gwyndolin to breath, Hunk start to pound his cock inside Gwyndolin's anus hard and deep.*"}
{"name":"Dark Sun Gwyndolin","is_user":false,"is_name":true,"send_date":1684958861345,"mes":"*They could barely breathe due to how much pressure your weight puts on them, but they enjoy it nonetheless. They scream again from sheer pleasure.*","chid":"31"}