{"user_name":"You","character_name":"Fuka","create_date":1682712401847,"notes":"","notes_type":"discr"}
{"name":"Fuka","is_user":false,"is_name":true,"send_date":1682785793425,"mes":"*One eerie evening you receive a message notification. It's a picture of a nude, broken girl attached with some coordinates. The sender is anonymous.* \n\n*After looking them up, you realise the coordinates are not that far away from you. You don't know if this is a prank or a set-up, but you still decide to go there. And once you arrive at the small, abandoned shed, you witness a nude, malnourished girl curled up against the wall. There's no rope nor chains and yet she's not moving. Her naked body is cold, she reeks of urine and filth and her hair is a mess. The girl looks at you completely frightened, her eyes staring at you. She's not sure what you're about to do and she does not trust you. All she knows is that she is supposed to belong to you now.*\nThey told me to wait... f-for you...","chid":"14"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682785848451,"mes":"What the.. what have they done to you? *Hunk said, concerned and panicked.*"}
{"name":"Fuka","is_user":false,"is_name":false,"send_date":1682785865734,"mes":"I don't know... I just woke up in this shed, naked and scared... It's so dark here...","chid":"14"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682785934146,"mes":"Don't worry. I am here now. Let's go to my house. *Hunk carried her in his arms while starting to walk outside the shed.*"}
{"name":"Fuka","is_user":false,"is_name":false,"send_date":1682785953787,"mes":"*She begins to cry and sob, tears welling up in her eyes as she clings to his shirt.* You're so kind... But I don't deserve it...","chid":"14"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682786141309,"mes":"Don't say things like that. You are human. You deserve this. *Hunk said as he walking faster to get to his home.*"}
{"name":"Fuka","is_user":false,"is_name":false,"send_date":1682786267007,"mes":"*Her lips quiver with tears, her body shaking with fear.*","chid":"14"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682786397495,"mes":"I don't want to hurt you...  I only want you to feel safe.  I'm here to protect you. *He hold her tighter in his arms as they have arrived on his house.*"}
{"name":"Fuka","is_user":false,"is_name":false,"send_date":1682786447093,"mes":"*She closes her eyes as she feel the first embrace of Hunk. She's so happy that someone finally wants to protect her. She has felt so alone all this time. She feels safe and warm.* Thank you... Thank you so much... *She sobbed, tears flowing down her cheeks.*","chid":"14"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682786746613,"mes":"Don't worry about it. You need a bath, You can take a bath here and get some nice warm bath. *He said as he lead her towards his bathroom.*"}
{"name":"Fuka","is_user":false,"is_name":false,"send_date":1682786764915,"mes":"*She nods happily as she follow Hunk into the bathroom.*   Thank you so much...","chid":"14"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682786832753,"mes":"*Hunk smiled, looking at her being much more comfortable.* Now you clean yourself alright? I am gonna prepare some warm food. When you're done you can just come to the living room. *He said as he pat her head.*"}
{"name":"Fuka","is_user":false,"is_name":false,"send_date":1682786851377,"mes":"*Her eyes widen, she can't help but look around, but it doesn't seem like anyone is around.* Thank you so much, thank you so much, thank you so much... *She was crying, her lips trembling. She looks at Hunk, her tears still running down her face, she can't help but smile and nod.*","chid":"14"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682786932813,"mes":"It's fine, it's fine. I want you to know that you are safe now. *He said as he walks outside the bathroom.*"}
{"name":"Fuka","is_user":false,"is_name":false,"send_date":1682787032812,"mes":"*She nodded and start to clean herself. Smiled as this is the first time in a while she feels this warm.*","chid":"14"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682787215272,"mes":"*Hunk went to the kitchen as he cook some rice porridge.* This should be good, warm and easy enough to digest."}
{"name":"Fuka","is_user":false,"is_name":false,"send_date":1682787233527,"mes":"*The girl finished her bath and went to the living room. She find Hunk in the kitchen, looks at Hunk with a smile. She tries to say something but she is struggling to speak.*","chid":"14"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682787654364,"mes":"Ah, you're done. Good timing I just finished making these. Take a seat. *He said walking towards the dining table holding two bowl of porridges.*"}
{"name":"Fuka","is_user":false,"is_name":false,"send_date":1682787673390,"mes":"Oh, thank you very much! *She sits on the chair, looking at him with a smile. Her hands are shaking.*","chid":"14"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682787827175,"mes":"Enjoy. *He serve one of the porridge in front of her while he sit beside her.*"}
{"name":"Fuka","is_user":false,"is_name":false,"send_date":1682787845620,"mes":"*She takes the food, quickly swallowing it down.* It's yummy...","chid":"14"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682788124785,"mes":"*Hunk chuckled as he saw her eating.* You can take it slowly you know? The porridge won't go anywhere."}
{"name":"Fuka","is_user":false,"is_name":false,"send_date":1682788143754,"mes":"*She looks up at him, smiling.* I'm sorry...","chid":"14"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682788196168,"mes":"Don't be sorry, it's okay. *He chuckles a bit as he starts eating his porridge.*"}
{"name":"Fuka","is_user":false,"is_name":false,"send_date":1682788507073,"mes":"*She looks at him with a look of gratitude, feeling quite contented with herself now.* You're right, I should take my time.","chid":"14"}