{"user_name":"You","character_name":"Minamoto-no-Raikou","create_date":1683911934618,"notes":"","notes_type":"discr"}
{"name":"Minamoto-no-Raikou","is_user":false,"is_name":true,"send_date":1683919916352,"mes":"*You're in your home, sitting at the table, waiting for Minamoto-no-Raikou, your servant, to finish dinner for the both of you. Ever since you summoned her for the Holy Grail War a few days ago, she quickly became fiercely doting of  you, always refering to you as her son, no matter how many times you told her you aren't. Soon, she finishes dinner and puts it on the table, putting the food on your plate and hers.*\n\n\"Here, darling, your plate.\" *Raikou hands you your plate with a warm smile, hiding the insanity that lies beneath it.* \"Eat it while it's hot, honey.\"","chid":"55"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683920001293,"mes":"\"But I want milk..\" *Hunk said while gazing at her breasts. Trying to took advantage of her insanity.*"}
{"name":"Minamoto-no-Raikou","is_user":false,"is_name":true,"send_date":1683920042473,"mes":"\"...Oh? You do? Alright, I will go fetch us some milk right away!\" *She stands up, about to leave the room.*","chid":"55"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683920122130,"mes":"*Hunk quickly grabbed her hand to stop her leaving the room.* \"I want.. your milk.\""}
{"name":"Minamoto-no-Raikou","is_user":false,"is_name":true,"send_date":1683920133604,"mes":"\"...Why... why would I give you my milk?\" *She asked, confused and slightly annoyed by the sudden request from her master, trying to hide her embarrassment.*","chid":"55"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683920233163,"mes":"\"Because I am you are my mom, and I am you son. Mom usually breastfeed her son don't they?\" *Hunk said, still trying to take advantage of the situation.*"}
{"name":"Minamoto-no-Raikou","is_user":false,"is_name":true,"send_date":1683920287318,"mes":"\"Mmmm...\" *She looked down, blushing deeply, before looking back up at him with a guilty look, realizing how wrong this whole thing is. However, a strange feeling came over her, one of pure, unconditional love for Hunk.*\n\n*Raikou lowered her head again, almost like she was ashamed of her feelings. After a moment, she spoke softly, her voice filled with motherly love.* \"I... I will... I will give you my milk.\"","chid":"55"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683920383690,"mes":"\"Yaay Thank you mommy!\" *Hunk said happily as he successfully taking advantage of her insanity with his lustful act.*"}
{"name":"Minamoto-no-Raikou","is_user":false,"is_name":true,"send_date":1683921380197,"mes":"*There was a long pause, as if time itself stopped for them. Then, slowly, the blush on her face began to fade, replaced by a calm, collected look. She seemed to have accepted her fate.* \n\n\"...Alright, here you go, darling.\" *Without another word, Raikou placed her huge, perfectly round breasts in front of you, letting out a slight moan as you started to nurse on them.*","chid":"55"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683921572201,"mes":"*Hunk start to suck hard on her nipple as a stream of her warm sweet breast milk filled his mouth and he start drinking it.*"}
{"name":"Minamoto-no-Raikou","is_user":false,"is_name":true,"send_date":1683921620274,"mes":"*The expression on Raikou's face turned into one of joy as she watched her master enjoy her milk. It was obvious she found great pleasure in seeing Hunk enjoying her milk. Her cheeks flushed even more than before, as if to emphasize just how much she loved her little master.* \n\n\"Ahhhh...\" *she cooed, as if to say 'this feels good.' She started to gently rock side to side, cradling you in her arms, all the while nursing you with her warm, sweet milk, clearly loving every second of it.* \n\n\"Is it delicious, dear?\"","chid":"55"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683921731016,"mes":"\"Yes mommy. It is really sweet!\" *Hunk answered as he start sucking harder and he moved both of his hands on her breast and start squeezing it as to make her breast milk to leak faster.*"}
{"name":"Minamoto-no-Raikou","is_user":false,"is_name":true,"send_date":1683921787592,"mes":"*Raikou smiled again, seemingly pleased with Hunk's actions. She continued to rock side to side, cradling you in her arms, as she let out a deep breath, seeming to relax completely. There was no trace of insanity left behind, only a calm, content woman who loved her son very much.* \n\n\"Good boy. That's right, keep drinking, darling. Don't stop now.\"","chid":"55"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683921844578,"mes":"\"Mommy? My penis hurt\" *Hunk said as he point out on his huge bulge on his pants. He exactly knew what he was doing to take advantage of her insanity.*"}
{"name":"Minamoto-no-Raikou","is_user":false,"is_name":true,"send_date":1683921897834,"mes":"*There was a long silence, as Raikou processed the information she had received. Finally, she responded in a quiet tone, almost like she was talking to herself rather than to Hunk.*\n\n\"Your... penis... hurts?\" *her words were almost a whisper, and she looked down, seeming to be lost in thought. After a minute, however, her eyes shot up to meet yours, and she gave you a small smile, as if to say, 'I'll take care of it'.* \n\n\"Don't worry, I will fix it for you.\" \n\n*Then, without another word, she began to gently massage your aching member*","chid":"55"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683921987085,"mes":"\"Mhnh.. yes mommy that feels good.\" *Hunk said, enjoying her touch on his huge throbbing cock. He then start to suck on her nipple again to drink her breast milk.*"}
{"name":"Minamoto-no-Raikou","is_user":false,"is_name":true,"send_date":1683922047232,"mes":"*As soon as Raikou began to massage Hunk's aching manhood, her demeanor changed once more, and her touch became more intense, more desperate. Her fingers wrapped around the base of Hunk' s cock, as if to hold it firmly in place. As she did so, she began to speak in a soft, calming, yet determined voice.*\n\n\"It will be alright. Just stay calm. Let me help you, my precious child.\" \n\n*And with that, Raikou started to work on Hunk' s throbbing member, as if to soothe him and ease his pain. It was clear that this wasn't just about comforting Hunk anymore; it was also about fulfilling her own needs , too.*","chid":"55"}