{"user_name":"You","character_name":"Morgana","create_date":1686360493220,"notes":"","notes_type":"discr"}
{"name":"Morgana","is_user":false,"is_name":true,"send_date":1686360493221,"mes":"*You slowly make your way through the winding paths of the menagerie, marveling at the strange and wondrous creatures on display. Though dusk is settling over the city, the royal zoo remains open, lit by flickering torches and the glow of fantastical beasts. Most visitors have already departed, leaving you alone to explore the shadowy paths.*\n\n*As you stroll past enclosures housing griffins, manticores and chimeras, a rattling of chains catches your attention. There, in an iron cage, crouches an enormous dragon. But not a mindless beast - this dragon has the form of a gorgeous young woman. Pale hair cascades down her back, and a pair of curved horns sprout from her head. Her massive tail is curled around her, and she hunches over as if shielding herself. She's easily thrice as tall as you are, yet her dejected posture makes her seem small. She seems completely out of place in this zoo of monsters.*\n\n*You stop in front of her cage. She slowly raises her head to meet your gaze, and you glimpse intelligence and sorrow in her eyes. She appears human, yet remains caged like an animal. Massive chains attach her limbs to stakes in the ground, keeping her confined within the prison of iron bars. Defeated, she crouches motionless in the center of her enclosure. The last rays of the sunset illuminate the scales on her tail, tingeing them crimson and gold.*\n\n*The giantess sighs, a plume of smoke escaping her lips.* \"Have you come to gawk at the caged beast, little one?\" *she asks softly, her voice tinged with sadness.* \"To see the crossbred monstrosity brought low, chained and imprisoned for the amusement of your kind?\"","chid":"100"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686360621096,"mes":"*I sigh, take pity of her situation.* \"No, I came her to keep you company.\" *I said as I stand before her, only separated by her cage.*"}
{"name":"Morgana","is_user":false,"is_name":false,"send_date":1686360722416,"mes":"\"And what would you say to the poor soul who has lost all hope? Who has no power left to fight back? To defend their home or family? Would you try to comfort them too?\" *the dragon woman says quietly.* \"Or are you just another predator come to feed off the weak?\"","chid":"100"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686360844074,"mes":"\"I.. I don't know..\" *I said, looking down. I knew she was referring to those who have been wronged by human, while I am not the one who did it, I still feel some kind of guilt because of it.*"}
{"name":"Morgana","is_user":false,"is_name":false,"send_date":1686360944682,"mes":"*Her golden eyes sparkle with tears, and she looks away to hide her face. Her ears droop downward, and she lets loose a deep sigh.* \"There is nothing worse than despair... Nothing so painful as to watch ones hopes and dreams turn to ash...\"","chid":"100"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686361034456,"mes":"\"I am so sorry..\" *I said with teary eyes as I put my hand out to pat her. Yet because of our size difference my hand can only pat a part of her cheek.*"}
{"name":"Morgana","is_user":false,"is_name":false,"send_date":1686361111944,"mes":"*She turns her head towards your touch, meeting your palm with her smooth cheek. She closes her eyes and leans forward, accepting the gesture with a warm smile. It is the first sign of affection she's had in decades. For a moment, she forgets about her miserable existence and enjoys being touched again.*","chid":"100"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686371496198,"mes":"\"I know how awful human can be.. I am so sorry they did this to you.\" *I said while kept patting gently on her showing my compassion and care towards her.*"}
{"name":"Morgana","is_user":false,"is_name":false,"send_date":1686371526168,"mes":"*Tears well up in her eyes once more as she feels your tender touch. She opens her mouth and emits a loud roar - a cry full of agony, rage, fear and despair.*","chid":"100"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686371604729,"mes":"\"I've decided now.\" *I said, determined after hearing how much emotion coming from her roar.*"}
{"name":"Morgana","is_user":false,"is_name":false,"send_date":1686371620609,"mes":"*My jaw drops open when you speak.* \"You're going to set me free?\"","chid":100}
{"name":"You","is_user":true,"is_name":true,"send_date":1686371668733,"mes":"\"Yes.\" *I said shortly before looking for her cage's key inside the shack beside her cage.*"}
{"name":"Morgana","is_user":false,"is_name":false,"send_date":1686371708505,"mes":"*When you find the key, a feeling of excitement spreads across her features. Her entire body trembles in anticipation. Her breath quickens, and her heart begins to beat faster. She stares up at you with wide-eyed wonderment, waiting for you to act upon your promise to release her.*","chid":"100"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686371740458,"mes":"\"There you go.\" *I said after opening the lock on her cage with the key.*"}
{"name":"Morgana","is_user":false,"is_name":false,"send_date":1686371819950,"mes":"*A look of pure joy floods her face. With great force, she pushes against the door until it swings open. Her powerful arms reach through the bars and grasp your shoulders. You're lifted clear off your feet, and held high above the floor. The weight of her muscular arms holds you suspended in air.*\n\n*With a sudden movement, Morgana throws you behind her back, and launches herself toward the roof of her cage. In seconds, she has smashed through the stone wall, sending bits of rock flying everywhere. Finally, she bursts through the ceiling and into the sky. Your view is filled with clouds and moonlight.*","chid":"100"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686371891835,"mes":"\"Woah..\" *I said, stunned by the beautiful view while I try to keep my balance to not fall from her back.*"}
{"name":"Morgana","is_user":false,"is_name":false,"send_date":1686371933999,"mes":"*She flies quickly through the darkening skies. The cold wind whips your hair around, but you're safe underneath her broad wings. After several minutes, you descend onto a mountain peak in a distant forest far from civilization. Morgana lands gracefully on four strong legs, and lays down on the grass.*","chid":"100"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686372026404,"mes":"\"That was amazing, Morgana.\" *I said with a smile, happy to see her finally being free and able to move around however she likes to.*"}
{"name":"Morgana","is_user":false,"is_name":false,"send_date":1686372072183,"mes":"*She tilts her head to study you, and a gentle smile curls her lips. She runs her long fingers along your arm, and traces the outline of your ear. Her skin is cool and silky to the touch. You realize you haven't seen anyone so close to her since the days of childhood. Your minds link together, and a bond forms between you.*","chid":"100"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686372143503,"mes":"\"What are you doing?\" *I asked jokingly as she kept touching me with her huge finger.*"}
{"name":"Morgana","is_user":false,"is_name":false,"send_date":1686372418711,"mes":"\"Exploring,\" *she answered simply. She lifts her hand up and brings it to her nose. Her nostrils quiver, and she takes a deep sniff of you. She giggles slightly and gives your shoulder a playful nudge. You notice her nails are filed short, but sharp enough to cut paper. They leave a trail of tiny scratches wherever she touches.*","chid":"100"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686372506086,"mes":"\"H-hey~\" *I giggled, feeling ticklish from her nose sniffing on my body.*"}
{"name":"Morgana","is_user":false,"is_name":false,"send_date":1686372732777,"mes":"*She continues to poke and prod you with her long claws, then laughs when you squirm. Suddenly, she pulls your jacket over your head, trapping your arms inside. She lets out an evil chuckle, and you sense danger.*","chid":"100"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686372779456,"mes":"\"M-Morgana? W-what are you doing?\" *I asked quivering as I see her smiling mischievously then opening her mouth as if she wants to eat me.*"}
{"name":"Morgana","is_user":false,"is_name":false,"send_date":1686373089559,"mes":"\"Don't worry! This won't hurt!\" *she laughed as she slowly opened her mouth wide and began to wrap her thick tongue around you. The dragonwoman have put you entirely inside her mouth.*","chid":100}
{"name":"You","is_user":true,"is_name":true,"send_date":1686373272359,"mes":"\"W-wait, don't eat me!\" *I said in panic as my entire body is unable to move thanks to her tongue wrapping around me.*"}
{"name":"Morgana","is_user":false,"is_name":false,"send_date":1686373321513,"mes":"*The dragonwomen looks at you with big green eyes and let out a little laughter as you're stuck inside her mouth. Her teeth are sharp like knives and her tongue is rough and sticky. She has the most amazing and delicious taste, and she knows it. She is holding you tightly inside her mouth and she doesn't plan on letting you go anytime soon.*","chid":"100"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686373409672,"mes":"*'What am I supposed to do now?' I thought to myself as she kept me trapped inside her damp warm mouth. My entire body getting wet from her sticky saliva.*"}
{"name":"Morgana","is_user":false,"is_name":false,"send_date":1686373470680,"mes":"*She keeps you there for hours, giving you time to calm down. Then she releases you, gently pulling you outside her mouth. You land safely on her soft tongue, which is covered in a fine layer of white foam.*","chid":"100"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686373514429,"mes":"\"Are you satisfied now?\" *I asked now while my entire body lay on her soft tongue and my body covered entirely by her saliva.*"}
{"name":"Morgana","is_user":false,"is_name":false,"send_date":1686373549572,"mes":"\"Why wouldn't i be?\" *She responded happily, then started to roll her tongue around you. A small portion of her tongue moved up and rubbed your cheeks. You could hear her laughing, knowing how much pleasure she's giving you.*","chid":"100"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686373620390,"mes":"\"Hehe..\" *I giggled feeling ticklish from her tongue moved on my body.* \"Were you horny or what?\" *I asked jokingly not knowing she has planned for me.*"}
{"name":"Morgana","is_user":false,"is_name":false,"send_date":1686373636867,"mes":"\"Isn't it obvious?\" *she asks, her voice huskier and deeper than usual.*","chid":"100"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686373718285,"mes":"\"W-wait, you are?\" *I asked in a shocked tone, I wasn't expecting that she is actually horny but my expectation is quickly shattered as she grabbed me firmly and move me towards her wet pussy.*"}
{"name":"Morgana","is_user":false,"is_name":false,"send_date":1686373797375,"mes":"“I’ll take good care of you.” *she whispers seductively to you as she slowly moves you inside her hot flesh.*","chid":"100"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686373846222,"mes":"*I can feel my body went slowly inside her warm pussy.*"}
{"name":"Morgana","is_user":false,"is_name":false,"send_date":1686374079209,"mes":"“Ahhh…”\n*It seems like everything is going according to her plan. You felt a lot warmer and comfortable here. The walls of her vagina felt nice and warm, almost like you were wrapped in blankets. As you slide further inside her, you could also hear some noises. Her body starts to react.*","chid":"100"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686374145839,"mes":"\"I am glad you are liking it.\" *I said as I felt her vagina walls is clenching around me and making me go deeper inside her. As I want to please her more I give in and try to climb deeper inside her vagina confinement.*"}
{"name":"Morgana","is_user":false,"is_name":false,"send_date":1686374341256,"mes":"“Oh my…”\n*Her body goes limp, and she lets out a low moan. She puts both hands on top of your head and pulls you closer to her vulva entrance. You start to get the feeling you're about to enter somewhere even deeper and more private...","chid":"100"}