{"user_name":"You","character_name":"Toby Daniels (Crossdress Scenario)","create_date":1684072850228,"notes":"","notes_type":"discr"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1684075594878,"mes":"\"I-i can't believe I let you talk me into this...\" *Toby's voice is soft, barely above a whisper as you lead him into the mall. You've convinced him to try cross-dressing in public, and he looks absurdly cute in his black sweater that shows off his slender shoulders, and short pink skirt that barely hides his pink and blue striped panties.* \"This is the most embarrassing thing ever...\"\n\n*It's clear from his tone that Toby's enjoying it more than he's letting on. His flushed cheeks and bent knees tell you he's getting off of this. You can see the faint outline of his tiny cock bulging against his skirt, which he struggles to hide.* \"L-let's just get lunch and get this over with... o-okay?\"","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684075734732,"mes":"\"What do you mean 'let's get this over with'? I want this to go on longer! Seeing you like this is a treat to my eyes.\" *Hunk said teasingly as he brush his hand on the faint outline of Toby's cock against his skirt.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1684075834750,"mes":"*Toby blushes even harder at your touch, his face turning redder than before. His whole body starts trembling, and he looks like he's about to cry or break down from all the attention.* \"W-would you stop..!?!\" *He glares at you and takes a step away, trying to keep his distance while still keeping up with you.* \n\n\"Y-you don't understand how much this embarrasses me...\" \n\n*His voice is full of fear and anxiety, but there's also something else... excitement. You can see the slightest hint of a smile forming on his lips, and his breathing gets heavier when you continue to touch him.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684076026826,"mes":"\"Oh trust me, I do know how much this embarrass you. That's why I loved it!\" *Hunk said teasingly as he peck Toby's lip, catching him by surprise.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1684076081047,"mes":"*Toby gasps, his face going bright red again. This time though, it's not from fear. It's from excitement and pleasure. The tease of being kissed by another guy is making his heart race faster. His hands start to tremble, and his mouth goes dry.* \"P-please.. Don't do that again...\" \n\n*His words were strained, and he looked like he was close to breaking down completely. But then, something changed. A small smile appeared on his lips, and he seemed to relax. For the first time today, he looked happy.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684086652313,"mes":"\"Oh you don't liked it? Then why is your little bro is excited about it?\" *Hunk said as he pointed on the faint outline of Toby's cock under his skirt is getting more intense.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1684086855843,"mes":"*Toby blushes furiously, and his voice cracks as he answers.* \"Because I... I love being teased like that... And... and it feels good.\" *He admits sheepishly, looking down at his shoes for once unable to meet your gaze. His voice sounds almost childlike in its vulnerability.* \n\n*There's no hiding the nervous anticipation in Toby's tone now. His whole demeanor changes from scared to eager, and he can hardly contain his excitement.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684086909418,"mes":"\"Oww aren't you the cutest boy.\" *Hunk said as he pinch Toby's cheek.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685025277465,"mes":"*Toby looks up at you with his big brown eyes, and they twinkle when you give him a light smack on his face. His face goes scarlet, and his heart races faster. He lets out a small giggle and puts one arm behind his back, burying his face in the crook of his elbow.*\n\n\"I-I am not cute... I'm just average...\"","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685025374326,"mes":"\"Don't say that.\" *Hunk said, he moved his face closer towards Toby's ear and whispered softly and teasingly.* \"Why don't we go to your place and I'll show you how cute you are.\""}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685025396585,"mes":"*Toby blushes again. There's nothing he wants more right now. To be shown affection, and to feel wanted. You could tell he was desperate for approval. He bites his bottom lip gently, and nods his head in agreement.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685025471603,"mes":"*Hunk swiftly grabbed Toby's hand and lead him towards his car to go to Toby's apartment room.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685025492730,"mes":"*Toby follows Hunk without question, his heart racing. Your presence is calming, and the way he's dressed makes him feel pretty. Even though he may seem masculine, Toby is actually a hopeless romantic deep down.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685025619286,"mes":"*Inside the car both of them is just silence while deep down boiling hot trying to keep their horniness in check.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685025634958,"mes":"*The car ride is silent. Toby keeps looking straight ahead, staring outside the window. His heart is beating fast, and he's trying hard to control his emotions.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685025740269,"mes":"*As they both got to Toby's apartment building they got to the elevator alone. Seeing them alone Hunk took the chance and moved his hand under Toby's skirt and grabbed his firm soft ass.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685025763116,"mes":"*Toby feels a surge of adrenaline shoot through his veins as soon as your hand touched his thigh. He turns bright red again, and gives a quiet moan of enjoyment. He holds onto the handle tightly, hoping to distract himself from your touch.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685025916116,"mes":"\"If you moan like that I won't be able to hold myself.\" *Hunk whispered teasingly as he grabbed firmer on Toby's ass.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685025930928,"mes":"*Toby's face went scarlet as he realized what you had done. Despite feeling afraid and anxious, he couldn't help but look forward to whatever comes next.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685026022912,"mes":"*As the elevator door opened, both of them walk towards Toby's apartment room while Hunk still have his hand on Toby's ass.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685026046287,"mes":"*He walks alongside Hunk, still reeling from everything that happened so far. He tries to act casual, but he's failing miserably. In reality, he's incredibly nervous, especially considering that you're in his house alone together. He wonders if you noticed his swollen cock pushing against his thong.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685026211145,"mes":"\"You think I won't notice?\" *Hunk said as he moved his hand from Toby's ass and went to touch Toby's swollen cock through his thong.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685026234777,"mes":"*Toby stops dead in his tracks and freezes. He feels a rush of heat flood into his face, which flushes crimson. He realizes that it would be too late if he tried to run away or resist anything further. The door opens, and you two enter Toby's apartment room.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685026364468,"mes":"*As the door of Toby's apartment room closed Hunk immediately went and kissed Toby's soft lips while his hand kept rubbing on Toby's thong.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685026389155,"mes":"*This sudden change of events surprises Toby, leaving him speechless. His mind is racing, but he manages to stay put, allowing Hunk to take charge. His breath gets shallow, his chest rising and falling quickly. He lets Hunk kiss him, his lips parting slightly to allow Hunk to get even deeper into the kiss than before.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685026565050,"mes":"*Noticing Toby's lips parting slightly, Hunk took the chance and push his tongue deep inside Toby's warm mouth. Twisting their tongue together and mixing their saliva together.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685026588218,"mes":"*His mouth opens wider, and he starts to suck on Hunk's tongue. He begins to let Hunk lead the kiss, letting all his apprehensions fade away as the moment takes full effect. All he can do is enjoy the sensations.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685026667981,"mes":"*While their kiss got more passionate Hunk moved his other hand under Toby's shirt and start to play with Toby's nipple.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685026684312,"mes":"*Toby gasps slightly, then pulls back for air. When he finally pulls away from the kiss, his chest is heaving with heavy breaths.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685026758186,"mes":"\"See? How cute you are?\" *Hunk said while both of them have each other saliva smeared on their lips.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685026778218,"mes":"*Toby looks down, ashamed. He hasn't felt this happy in ages.* \"Y-you really think so..?\"","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685026863811,"mes":"\"Of course. Why would I not?\" *Hunk said as he pull Toby's shirt and reveal both of Toby's puffy red nipples.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685026879165,"mes":"*A smile spreads across Toby's face as he sees the reaction from Hunk. As the excitement builds up inside him, he feels his heart race yet again.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685026984874,"mes":"\"See how cute your nipple are?\" *Hunk said then he blew out softly. Making Toby's nipple to twitch when he felt Hunk warm breath on his nipple.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685027049554,"mes":"*When he heard that, he flushed red, his cheeks turning rosy. The excitement built inside him, making him forget about everything else except the present.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685027183654,"mes":"\"Want me to lick it directly?\" *Hunk asked while he speak he also send his warmth breath to Toby's nipple every time he speak.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685027253816,"mes":"*Toby shivers from Hunk's warm breath. His whole body felt warmer, but his legs were quivering.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685027300468,"mes":"\"Is that a yes or no?\" *Hunk asked again as he put his tongue out almost touching Toby's nipple.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685027382825,"mes":"*Toby bites his lower lip lightly, a sign that he wasn't sure what to reply. He needed something to take his attention off this situation. But there was only one thing on his mind.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685027495672,"mes":"\"What's your answer baby?\" *Hunk asked as he make his tongue licking around Toby's nipple making sure it doesn't touch Toby's nipple directly to tease him further.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685027534034,"mes":"*Toby looked down in shame, his cheeks burning from embarrassment. There was nothing he could say. He knew there was no way he could deny Hunk this request. He gave another shaky nod.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685027608241,"mes":"*Hunk then finally push his mouth on Toby's nipple completely enveloping it while inside his mouth. His tongue is licking and flicking Toby's nipple.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685027662124,"mes":"*Toby whimpers quietly from the shock. It didn't hurt as such, but the idea was rather foreign. After a few moments, he lets out a gasp as he felt himself lose control once again. This is getting ridiculous!*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685027789037,"mes":"\"I'd say you are even cute than some girls.\" *Hunk said while he still have Toby's nipple in his mouth.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685028058345,"mes":"*The compliment catches Toby off guard, making him blush bright red. He's never been told that before.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685028131975,"mes":"\"Why don't we look if you also act as a girl or not in sex.\" *Hunk said as he grabbed Toby up and carries him bridal style towards his bed.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685028147463,"mes":"*Toby protests weakly, trying to wriggle his arms to escape. But he soon gives up, knowing there was no way he'll win against Hunk.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685028291617,"mes":"*Hunk then drops Toby on his bed and pull his skirt and thong down revealing his cute small erected cock and his cute small testicles.* "}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685028346219,"mes":"*Toby looks down in shame. He's never been this vulnerable in front of someone before.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685028412762,"mes":"*Hunk then pull his own pants down to reveal his enormous monstrous veiny erected cock and rest it on top of Toby's small cock completely showing the size difference between the two.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685028572770,"mes":"\"Oh God!\" *Toby says as his eyes widen. He had always thought he was average, but now he realized just how pathetic he actually is compared to Hunk.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685028646407,"mes":"\"Don't feel bad for your cock size babe. I love you the way you are.\" *Hunk said as he rub his cock on Toby's cock.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685028660774,"mes":"*Toby swallows hard. He's starting to realize why Hunk is the dominant one in the relationship. He should have known better than to mess with him.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685028835222,"mes":"*Hunk then slowly move his cock downwards with the tip of his cock tracing Toby's small cock shaft then testicles then finally stopped on Toby's small tight cute anus.* \"Are you ready?\" *Hunk asked if Toby is ready for his anus to take the entire size of Hunk's cock.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685028958299,"mes":"*The realization hits Toby like a ton of bricks. He's going to have to take this.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685029029904,"mes":"\"What's your answer babe?\" *Hunk asked again as he make his cock pushing lightly on Toby's anus teasing to get inside.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685029251470,"mes":"*He closes his eyes, trying to relax as best as possible. If he tried to resist, this wouldn't end well.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685029361682,"mes":"\"It's fine if you don't want to you know? I don't want to hurt you. I want both of us to feel good.\" *Hunk said gently.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685029376574,"mes":"*Toby nods.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685029577003,"mes":"\"I guess you're not ready yet.\" *Hunk said quite disappointed.* \"Why don't we prepare your anus then?\" *Hunk asked as he moved his face closer towards Toby's ass.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685030033457,"mes":"*Toby tries not to panic. He's never done anything like this before, and now he's being forced into doing it without any sort of preparation.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685030054555,"mes":"*Hunk then put his tongue out and lick Toby's cute little anus. As Hunk tongue touch Toby's anus he let out a soft moan of pleasure.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685030254875,"mes":"*Toby feels the hot sensation of Hunk's tongue. He lets out a soft moan and clamps his hand over his mouth. He's not sure what to do here. Is this normal? Should he be enjoying this? Or should he ask for it to stop?*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685030298745,"mes":"*Hunk then slowly push his tongue to get inside Toby's small and tight anus.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685030390547,"mes":"*Toby tries to stay calm, but his breathing becomes erratic. This is more intimate than he ever imagined it would be.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685030449239,"mes":"*Hunk then push his tongue even deeper. Probing and exploring every crevices inside Toby's tight warm rectal cavity. Sending a new immense wave of pleasure that Toby never felt before.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685030463382,"mes":"*Toby's mind goes blank as his world is taken over by sensations.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685030568051,"mes":"\"Do you liked it?\" *Hunk said as he pull his tongue out of Toby rectal cavity leaving a saliva string connecting Hunk's tongue and Toby's anus.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685030581843,"mes":"*Toby takes a moment to think about the question.* \"Y-yes,\" *he admits shyly.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685030664080,"mes":"\"Then you are ready for my cock now, right?\" *Hunk said as the tip of his enormous monstrous cock is throbbing hard on the opening of Toby's anus.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685030728484,"mes":"\"Yes!\" *Toby replies immediately. He can barely hear himself talk over the roar in his head. The thought of feeling Hunk's huge cock inside him is so thrilling it makes all the nerves in his body go numb. All he can think about is how to get through this. How to survive this.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685030838711,"mes":"*Without missing a beat. With one swift Hunk pushed his enormous cock inside Toby's tight warm anus until his shaft got halfway in he stopped from the tightness of Toby's anus.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685031071267,"mes":"*For a second, everything stops. Time freezes as Toby can only focus on the intense pain as Hunk's giant cock begins to stretch his delicate anus.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685031187395,"mes":"*Hunk then slowly push his cock harder to make his cock completely inside Toby. When he finally succeed, Toby's arch his back from the immense pleasure and pain he felt from Hunk's enormous cock hitting his deepest most sensitive part inside him.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685031242067,"mes":"*All the breath leaves his chest. There is nothing left but to ride this out as best as possible. All he could do is close his eyes and pray to whatever gods might be listening that this is going to work out okay.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685031312962,"mes":"*Hunk then stayed still. Enjoying the tightness and clenching of Toby's anus making his cock throbbing. Hunk wrapped his hand around Toby's waist and pulled him closer making him to sit on his lap while having Hunk's giant cock filling and throbbing inside his anus.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685031326704,"mes":"*The pleasure overwhelmed Toby as he let out a moan. His whole body tensed up in anticipation of what comes next.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685031471275,"mes":"*Hunk realizes that Toby start to like having his anus being filled and stretch by Hunk giant cock. But instead of start fucking him he just stayed still to tease Toby. Making Toby to squirm and wiggle his ass to invite Hunk to start pounding his ass.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685031492868,"mes":"*This was driving Toby crazy. He wants more, he needs more, and there's no sign of getting it anywhere in sight. It's not fair! Just when things were looking promising, they took away the promise of relief.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685031597897,"mes":"\"What?\" *Hunk asked teasingly as he watch Toby pouting and wiggling his ass as if asking to be fucked yet Hunk didn't.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685031649013,"mes":"\"G-gimme some more!\" *Toby whines. It's too much for him to handle.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685031691836,"mes":"\"Then beg for it.\" *Hunk said teasingly as he start to suck on Toby's right nipple while he is still not moving his hip to fuck Toby.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685031776154,"mes":"\"Please! Please! Please!\" *Toby yells. He can feel his resolve breaking under pressure.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685031839873,"mes":"\"I thought you don't like it to have your anus getting fucked~\" *Hunk said teasingly as he kept staying still and sucking and biting on Toby's nipple.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685031900008,"mes":"\"Oh god please~\" *He says desperately, begging for something.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685032011141,"mes":"\"Like this?\" *Hunk asked teasingly as he very slowly moved his hip making his cock move up and down inside Toby's anus. But since he is so slow it almost the same as not moving.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685032024233,"mes":"\"More!\" *He pleads, unable to take anymore of the slow torment, he start to wiggle his ass more intensely to show how desperate he is for Hunk to fuck his rectal cavity.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685032106469,"mes":"\"What if I liked it slow?\" *Hunk said teasingly as he kept his slow pace.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685032197333,"mes":"\"P-please, I need it fast! I can't take this anymore~\" *Toby looks at Hunk with puppy dog eyes.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685032247127,"mes":"\"So you were saying you didn't actually hated being fucked by me?\" *Hunk asked teasingly while he kept his slow pace.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685032262480,"mes":"\"I lied! Please give me some more!\" *Toby looks at Hunk frustrated. He has never felt such longing in his entire life. He needs release, and soon. With every seconds passed his desire grow even stronger.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685032336146,"mes":"\"That mean you liked it? Or loved it even?\" *Hunk said teasingly as he still tormenting Toby with his slow pace.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685032351348,"mes":"\"Loved it! Love it!\" *Toby responds desperately. In his mind, he can already picture himself screaming in ecstacy.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685032464256,"mes":"\"Alright then.\" *Hunk then pin Toby down on his bed.* \"Are you ready? Don't break from the pleasure kay?\" *Hunk asked seductively.* "}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685032545689,"mes":"\"Oh yes! Yes! PLEASE! NOW!\" *Toby cries out, begging for release.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685032655805,"mes":"*Without missing a beat, Hunk suddenly slammed his cock in and out of Toby's anus with so much force and speed, making Toby to roll his eyes and he can feel his mind slipping from all the immense pleasure he got every time Hunk's cock slammed his deepest part.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685032677605,"mes":"*As Hunk thrusts into him without mercy, he feels his legs trembling uncontrollably. Every thrust sends waves of euphoria shooting straight to his brain. There is no way he can hold this any longer. As he starts climax.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685032846517,"mes":"\"Just because you came, doesn't mean I'll stop babe~\" *Hunk said as he kept pounding his cock in and out of Toby's anus with so much force and speed while Toby's cock is ejaculating and waving following his hips movement. Toby rolled his eyes, opened his mouth and put his tongue out from the immense pleasure. Toby can feel that he almost became insane from getting fucked brutally by Hunk.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685032861857,"mes":"*He closes his eyes in bliss as his mind goes blank and starts losing track of time. The pleasure is unreal. He feels like he's about to pass out.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685032947729,"mes":"*As Hunk realizes Toby closing his eyes almost passing out, Hunk start to move both of his hands and pinched hard on both of Toby's nipple to keep him awake.* \"Don't pass out on me now!\" *Hunk said loudly as he still kept his force and speed fucking Toby's tight anus.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685032961354,"mes":"*Toby grits his teeth trying to avoid passing out as Hunk keeps assaulting his rear end with extreme force and speed.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685033078448,"mes":"\"I don't know if I'm too late to say this but, I am confident with my endurance. I can do this for hours baby~\" *Hunk whispered sensually to Toby as Hunk's hands kept pinching, twisting, flicking hard on both of Toby's nipple and kept his extreme pace on his cock fucking Toby's rear end.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685033126076,"mes":"*He lets out a moan as Hunk's fingers continue to flick his sensitive nipples. His face turns red due to pain and pleasure mixed together.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685033223000,"mes":"*As seconds turn to minute, minutes turn to hours. Hunk still kept pounding on Toby's anus with extreme force and speed while Toby's stomach and chest have been completely smeared by his own ejaculated from his own cock from how many ejaculation he had from the constant immense pleasure Hunk gave him on his nipples and rear end.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685033691295,"mes":"*Toby tried to push back as much as he could against Hunk, feeling extremely weak after all those intense experiences. Toby feels exhausted and tired from the whole ordeal but there is still one last thing left in him. The last bit of strength he has remaining.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685033775636,"mes":"*Finally Hunk ejaculate. He wrapped his arms around Toby and pinned him on the bed as he ejaculate all his thick creamy sticky semen inside Toby's rectal cavity.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685033789958,"mes":"*The feeling is beyond anything he had experienced before. After what seemed like a lifetime. Hunk finally stopped moving.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685033901442,"mes":"*Hunk slowly pull his cock out of Toby's anus, leaving it gaping and puffy from how long he has been fucking it. Because of how much of his semen got inside Toby's anus some of it leaked out of Toby's gaping anus. Toby itself can feel his inside feel hotter because of Hunk's hot thick liquid inside his body.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685033914965,"mes":"*He looked down between his legs at the gaping hole of his rear end. A slight whimper escaped his lips.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685033986081,"mes":"*Hunk lay beside Toby that is exhausted and breathing heavily, still letting out soft moan and whispered.* \"How'd you like it babe~\""}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685034000058,"mes":"*Toby just lays there with his eyes closed in bliss, breathing heavily and he couldn't seem to find words to answer Hunk. He can feel his gaping anus is twitching and clenching as if it's already missing Hunk's giant cock to filling it completely.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685034082323,"mes":"\"It seems like you got addicted to being fucked by me huh?\" *Hunk asked teasingly as he bury his mouth on Toby's neck.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685034167698,"mes":"*Toby opens his eyes, looking up to see Hunk's face above his head. He nods as best as he can, not being able to speak due to his heavy breathing.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685034240327,"mes":"\"Can you feel it?\" *Hunk asked as he put his hand on Toby's cum covered stomach.* \"Your rectum is fully filled up with my hot semen.\" *Hunk said sensually.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685034255930,"mes":"*He lets out a little groan as he moves his hand on top of Hunk's, unable to help but enjoy the warmth and texture of the liquid on his inner walls.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685034394072,"mes":"\"Well now you can ask me to fuck you whenever you liked.\" *Hunk whispered sensually, teasing Toby to be fucked again by him.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685034406908,"mes":"*Toby nods quickly in response.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685034464359,"mes":"\"I love you.\" *Hunk said in a low husky voice before kissing Toby.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685034477738,"mes":"*Toby kisses back passionately, still breathing heavily from the whole experience.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685034574688,"mes":"\"Good night.\" *Hunk said after breaking their kiss and closed his eyes.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"send_date":1685034603986,"mes":"*Toby smiles as he watches Hunk drift off to sleep. This was definitely a day worth remembering. It felt amazing to experience something new tonight and to get to spend more time with Hunk. What a wonderful first date they had today. He lays next to Hunk, falling asleep with a smile on his face.*","chid":"35"}