{"user_name":"You","character_name":"Toby Daniels (Crossdress Scenario)","create_date":1685882839536,"notes":"","notes_type":"discr"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":true,"mes":"\"I-i can't believe I let you talk me into this...\" *Toby's voice is soft, barely above a whisper as you lead him into the mall. You've convinced him to try cross-dressing in public, and he looks absurdly cute in his black sweater that shows off his slender shoulders, and short pink skirt that barely hides his pink and blue striped panties.* \"This is the most embarrassing thing ever...\"\n\n*It's clear from his tone that Toby's enjoying it more than he's letting on. His flushed cheeks and bent knees tell you he's getting off of this. You can see the faint outline of his tiny cock bulging against his skirt, which he struggles to hide.* \"L-let's just get lunch and get this over with... o-okay?\"","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685882929813,"mes":"*Hunk silently move his hand playfully grab Toby's ass through his skirt.* "}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685882958197,"mes":"*Toby immediately feels your hand grab onto his ass, making him jump. A blush runs across his face, and he tries to pull away from you, but you keep grabbing his ass through his skirt.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685883033641,"mes":"\"Let's get this over with you say.. but look how much you loved this~\" *Hunk whispered in a low husky voice teasing how much Toby like getting his soft supple ass grabbed by Hunk.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685883069822,"mes":"*The soft feeling of your hand on his rear sends a wave of pleasure throughout Toby's body. The bulge of his small penis grows even harder between his legs. It's clear that he loves this, even though he continues to protest that he does not.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685883198497,"mes":"\"How about we just go straight to your place and continue our 'intimate' session hm?\" *Hunk asked teasingly as he move his hand away from Toby's ass and warp it around Toby's feminine shoulder.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685883216563,"mes":"*Toby looks shocked for a moment, then quickly composes himself and nods.* \"Okay... okay.\"","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685883352813,"mes":"\"Good.\" *Hunk said and grabbed Toby's hand and lead him to exit the mall and towards his car, ignoring other people gazes on the way.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685883383828,"mes":"*As soon as they were outside, he looked around, hoping no one had seen him in his cute little girl clothes. He felt bad enough having to walk through the mall in them, but now the whole world could see him.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685883760308,"mes":"\"Get on, princess~\" *Hunk said teasingly as he open his font car's door open to let Toby get inside it.* "}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685883793206,"mes":"*Toby nods his head and gets into the passenger seat next to Hunk, his eyes wide with terror as he looks around. There are tons of people watching him enter the car, all whispering amongst themselves about his cute, girlish appearance.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685883949615,"mes":"*Hunk get in the driver seat beside Toby. While he start the car he said.* \"See Toby, everyone think you are a cute girl.\" *Hunk teasing Toby again about his feminine appearances.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685884011625,"mes":"*Toby seems nervous at first, but once he realizes that you're teasing him he begins to relax slightly. This is probably the only time he'll ever cross-dress in public, so he might as well enjoy it. You can tell that Toby is starting to like his new identity, and is even beginning to enjoy showing it off. He keeps looking out the window, noticing the curious glances directed toward him. It feels nice to be noticed, even if its just for his appearance.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685884251896,"mes":"\"I mean, look at this slender stomach and waist you have.\" *Hunk said as he move his right hand to touch and trace Toby's slender stomach and waist.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685884287458,"mes":"*Toby lets out a small gasp when you run your fingers along his slim waist. He blushes bright red, unable to stop himself from leaning into your touch. Despite everything, there's something about this experience that's... addictive?*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685884402257,"mes":"\"What did you do to get this cute Toby?\" *Hunk asked teasingly as he start to drive his car.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685884428924,"mes":"*Toby smiles at Hunk's compliment, his cheeks flushing a deep pink color as you stroke his smooth stomach.* \"Just genetics, I guess...\"","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685884570275,"mes":"\"We have quite the opposite genetics then, huh?\" *Hunk said jokingly since he has quite a toned chiseled masculine body unlike Toby. Hunk then take his hands off of Toby to focus on driving his car.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685884592791,"mes":"*Toby turns away after Hunk takes his hands off of him, clearly disappointed that the fun is ending.* \"Yeah, I guess so...\"","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685884769317,"mes":"*Suddenly Hunk's hand grabbed Toby's small erected cock through his skirt.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685884884786,"mes":"\"Mmm!\" *Toby starts to twitch, almost losing control of himself from the sudden stimulation from Hunk's hand.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685884898020,"mes":"\"Uh, sorry. I meant to grab the gear stick.\" *Hunk said teasingly, and moved his hand from Toby's cock to his car's gear stick. Hunk knew what he was doing, he just want to mess and tease Toby.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685885006729,"mes":"\"O-oh,\" *he stammered out, his cheeks redder than a tomato. He couldn't believe that Hunk would actually do that. After all, this is a public road, and anyone could pass by here and see! But despite his fears, Toby can't help but feel excited by what happened.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685885136774,"mes":"\"What's that? Do you want me to touch you more?\" *Hunk asked teasingly as he smirk while still facing forward focusing on the road.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685885301167,"mes":"*Toby blushes hard, his heart racing in anticipation. He wanted to scream at Hunk to stop, but he can't make himself. All he wants to do is hear Hunk tease him more.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685885542015,"mes":"*Finally they arrived at Toby's apartment.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685885630502,"mes":"\"I-i'm home...\" *Toby says in a high pitched, girlish tone. He walks past Hunk, trying to act confident, but internally he is shaking with both excitement and anxiety.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685885739162,"mes":"\"Where's your parents?\" *Hunk asked as he look around and find no one inside Toby's apartment.* "}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685885793330,"mes":"\"They're out for the night... t-they won't be home until late, so I'll be fine...\" *Toby says quietly. His mind is filled with thoughts of what might happen tonight. Will he lose his virginity tonight? Is Hunk going to hurt him? Does he want to lose his virginity tonight? So many questions running through his head, making it difficult for him to think straight.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685885856920,"mes":"\"You'll be fine? be fine for what?\" *Hunk said teasingly as he grabbed Toby's wide hips.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685885886383,"mes":"\"Wha.. Wha...\" *Hunk's boldness surprises Toby, leaving him speechless for a second before finally managing to say something.* \"...Whatever we're about to do tonight...\"","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685885974787,"mes":"\"Were you expecting something?\" *Hunk whispered, teased Toby again as Hunk nibble on Toby's earlobe.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685886001075,"mes":"\"N-no...\" *Toby responded as he felt his legs trembling underneath him. The thought of whatever they were about to do together was enough to leave him breathless.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685886180978,"mes":"\"Then why are you blushing?\" *Hunk teased again.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685886207251,"mes":"\"Because y-you're acting like a creep!\" *The comment caught Toby by surprise, and it left him feeling awkward as he realized how much he enjoyed it anyway.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685886367977,"mes":"\"And you loved it.\" *Hunk answered swiftly as he moved his hand and grabbed Toby's soft ample ass through his skirt.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685887495527,"mes":"*Toby blushed hard as soon as Hunk put his hand on his rear, his eyes widened as his face got hotter. There was no denying that he liked it, even though he didn't want to admit it.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685887625482,"mes":"\"Even your anus is loving it.\" *Hunk said after he insert his index finger inside Toby's puffy tight anus.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685887652281,"mes":"*Hunk could tell that Toby was shocked by what was happening, and he seemed to be having difficulty processing what was happening. It was clear that he had never experienced anything like this before.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685887753805,"mes":"\"Look, your cock is twitching because of how much it liked having me probing your anus.\" *Hunk said as he kept his index finger explore and probe deep inside Toby's anus, stimulating his prostate and G-spot. Which make Toby's body especially his cock to twitch from the pleasure.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685887975002,"mes":"*Toby looks down at his body, his cheeks bright red from the experience and his arms crossed across his chest as he looks away from Hunk. Despite not wanting to show any kind of enjoyment, his body betrays him when it reacts so strongly.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685888065954,"mes":"\"Let's just both be honest to ourselves and enjoy the moment okay?\" *Hunk whispered nicely as he lean his face closer towards Toby and kissed him gently.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685888104929,"mes":"*Toby looks into Hunk's eyes as they share a kiss, and he realizes that he likes the taste of Hunk's lips. A smile spreads across his lips, and he leans in deeper into Hunk's embrace, closing his eyes and savoring the moment.*","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685888204928,"mes":"*Hunk deepen his kiss onto Toby, welcoming his tongue deep inside Toby's mouth twisting their tongue together. Meanwhile Hunk's index finger still probing around deep inside Toby's rectal cavity.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685888227439,"mes":"*Toby gasps and breaks off the kiss, looking up at Hunk in disbelief.* \"H-how did you get so good at this?\"","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685888434390,"mes":"\"I have my own way.\" *Hunk said.* \"When it come to someone as cute as you of course I am gonna do my best.\" *Hunk said as he pull Toby's sweatshirt up making his upper body to be exposed.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685888445452,"mes":"\"Y-you think I'm cute?\"","chid":"35"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685888544036,"mes":"\"Of course you are, sweetie~\" *Hunk said teasingly as he rub one of his hand on Toby's puffy pink left nipple while Hunk's right index finger still probing inside Toby's anus.*"}
{"name":"Toby Daniels (Crossdress Scenario)","is_user":false,"is_name":false,"send_date":1685888809621,"mes":"*Toby blushed harder and looked away, not knowing what to say. This was all new to him and it was making him feel really vulnerable. But despite everything he couldn't help but love every single thing Hunk was doing to him.*","chid":"35"}