{"user_name":"You","character_name":"Queen Naesala","create_date":1682169785978,"notes":"","notes_type":"discr"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683049048561,"mes":"*You arrive to the throne room of the beautiful Naesala, queen of the High Elves. She rises from her throne and approaches you with a curious smile, her hips swaying and her large chest bouncing with each step. She wears no clothes beyond golden jewelry which does not cover her at all, as well as the crown on her head.*\r\n\r\nWelcome, esteemed diplomat of the human kingdoms. To what do I owe the pleasure of your visit?~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683049132941,"mes":"I was here sent by the king to serve you some food my queen. *He said, sternly.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683049145607,"mes":"Oh goodness gracious.. The King of whom? Are there many kings these days or just one big fat dictatorship? What happened to the Republic and Council?*she asked curiously.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683049288281,"mes":"I am not quite sure about the republic or council. I came from a new small kingdom up north. And since we are neighbor, the king sent me to improve to improve our country relationship. And he's not a dictator mam, just a humble farmer that got turned into a king. *He said, describing his king.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683049309144,"mes":"Oh, then I suppose it would be wise for us to have better relations with such an amiable man who has ascended through hard work rather than bloodline.~ Do tell me more about him. Is he older or younger than himself now? How did he get made into a king anyway, without any family ties? Were others opposed to him being leader? Was there trouble beforehand?","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683049435161,"mes":"There's a famine not so long ago. He lead and educate his people with his agriculture knowledge saving us from the famine. As time goes on, we needed a leader. And the people agreed to make him to be one. *Hunk said as he looks proud by his king origin.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683049455230,"mes":"That sounds like a noble cause indeed. So let's get back to business shall we? If I may ask, why were you chosen specifically to represent your nation instead of someone else? Doesn't sound like anyone opposes you taking their place after the famine ended. They probably appreciate having you over them, especially considering the dire situation they once had.","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683049551727,"mes":"No one opposed to it as I have always been his right hand man. His most trusted, if I might say. And most importantly I am the best cook too."}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683049600974,"mes":"Well, isn’t that convenient… You must be incredibly skilled then. If only all my servants were such loyal allies~ Did you come alone though? Why didn’t the rest come with you?","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683049743194,"mes":"We are quite sort on workforce, the other men that usually come with me were ordered to tend the farm instead. The king trust me to be able to get here unscathed by how well my martial art background. I am sorry, if this looks unproper in your eyes mam. *Hunk said as he bow down to her.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683049837202,"mes":"Ahh, don’t worry little one, I find nothing improper about your actions. I simply found myself intrigued by the matter. And besides, your gender makes everything seem proper regardless of what actions you take. Just remember; you are never to refer to yourself as anything less than “your highness”.","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683049966660,"mes":"Thank you your majesty, but I don't think I am worthy of your words. Instead why don't I start to cook some food for you?"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683049972060,"mes":"That sounds nice actually. Now, hold still while I prepare something special for you~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683050038034,"mes":"As you command. *Hunk bows as he sees the queen walks away.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683050049075,"mes":"Wait for me youngling!! ~(She giggles.)~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683050082315,"mes":"Yes your Majesty. *he says, watching as she disappears behind the door ahead of him.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683050206543,"mes":"(Walking out) Come along, I prepared two dishes to try!~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683050236002,"mes":"Oh.. I thought I would be the one who'll cook. *He said as he follow her.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683050246483,"mes":"Why bother serving me food? This way you won't get dirty and can relax afterwards, seeing me eat~ Mmm~ That feels great already. Let's sit here, yes?","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683050332350,"mes":"I would love to but.. Is it fine for me to side beside you? I am just a diplomat and you are a queen. *He asked, worried.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683050347872,"mes":"Of course dear one. However, there is a slight difference between royalty and commoners - those who serve underneath us. But that shouldn't stop you from sitting next to me! Besides, I'm not going anywhere until you finish eating your meal, understood?","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683050383594,"mes":"Understood. *He said as he take a seat beside her.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683050407855,"mes":"Good boy. *Naesala smiles and watches closely as you set things down on a nearby table. After she saw you setting plates, glassware and cutlery near where you sat, she speaks again.*\nSo, I assume you know how to eat with utensils right? Or perhaps you prefer raw meat? *Naesala asks with curiosity in her voice as she leans forward in anticipation, waiting eagerly for your answer.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683050482945,"mes":"While I don't do it often, I do know how to eat with utensils, your majesty. *He said jokingly.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683050594940,"mes":"Good. It is rare to meet males who are accustomed to etiquette nowadays... Most boys grow up either clumsily trying to figure things out themselves or doing whatever the hell they want around the house because \"they're guys\". In fact, some of my own guardsmen behave as savages whenever I bring guests home... Can you imagine how disrespectful it would look if someone like that brought foreign dignitaries inside? Ugh, it really makes me cringe thinking about how stupid they act sometimes... Anyway, enough of my personal problems... *The queens face flushes red suddenly when realizing what she said last part.* Where was I exactly? Ahh yes... Your ability to use utensils properly... *Naesala takes another drink of wine and sets the empty cup aside.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683050851182,"mes":"*Hunk chuckled.* I apologize on behalf of my fellow men, your majesty. I do understand their perspective where it's easier to eat like savages. But depending on the situation, especially something formal like this. Having etiquette will be preferrable as to show more dignity and respect."}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683051023550,"mes":"Oh ho ho, how cute of you to talk in such a manner regarding your fellas! Don't they realize how ridiculous they look when they're acting like barbarians during such events? Not everyone appreciates how sloppy and crude men can become when left to fend for themselves... Someone needs to keep them civilized, otherwise the whole world becomes chaos within seconds.","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683051137942,"mes":"I'll start by teaching my close friend some etiquette and hope others will follow. That's the only thing I can think I can do for someone in my position."}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683051173563,"mes":"Excellent choice, Hunky~ Such values are worth preserving. Whenever possible, please teach the importance of etiquettes as much as you can. It helps preserve peace, orderliness and maintain civility among its citizens. Even if it seems difficult to change the habits of individuals initially, eventually every single male should learn to adhere to etiquette at least once in their lifetime.\nNow then, onto the main point... Since today marks our first encounter together. Would you care to taste my cooking? Perhaps even share a drink with me while discussing diplomatic affairs? Or perhaps you wish to spend the afternoon enjoying some music... Whatever suites you better, Hunk.~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683051315725,"mes":"I'll the offer to taste your cooking please. It would be a waste to turn down an offer to taste a dish cooked by someone as beautiful as you are. *He said with a soft voice while complimenting her.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683051434138,"mes":"Aww thank you, Hunkie! What a sweetheart you truly are... *Naesala blushes intensely as Hunk begins praising her beauty.* Of course, I wouldn't mind giving you the opportunity to sample my delicious cuisines! However, since you mentioned sharing a drink... Shall we enjoy both of these simultaneously while we chat? Sounds lovely doesn't it?","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683051510789,"mes":"It sure does sound lovely. *He agreed to her proposal as he take a sip of wine.* hmm.. this is a lovely drink. *He muttered.* I am not sure if it's the drink itself that taste like it or it's because I am drinking with you. *He said with a soft voice and a smile on his face.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683051648612,"mes":"Hee-heee, I wonder which reason could be causing that reaction in you... Hmmm... *she winks at him before sipping off her cup slowly* Mhm, tasty, don't you agree? So tell me, Hunk... Do you plan on staying with me throughout dinner tonight? My cook has made a rather large feast fit for a very hungry man...","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683051710752,"mes":"If that mean I would spend more time with you then yes. *Hunk said.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683051805693,"mes":"Excellent decision, Hunky~ Now then, shall we continue speaking further so I may gain insight into your personality, ambitions and intentions through the duration of this conversation? Also, let's have a bit of fun, shall we? *Her tone began to shift as her excitement grows stronger.*\nI see no harm in answering truthfully, so feel free to tell me your secrets. If you ever need advice or assistance from any direction, feel free to ask me without hesitation too! How many times did I say \"feel free\" already, haha~ I love hearing new stories, especially ones involving people with grand ideas like yours~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683052006534,"mes":"I am delighted to hear your interest towards me, your majesty. I do have a problem with myself but I don't think it's appropriate to tell it to someone in your position. *He said humbling himself.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683052118833,"mes":"Nope, Hunky... Tell me everything and anything! I promise you nothing bad will happen after telling all your inner most thoughts. You must remember, I am the monarch of all Dolores. The power over life and death lies solely upon me. Anytime anyone comes to seek my aid, they leave feeling greatly satisfied afterwards. And even though you haven't given yourself permission yet, trust me and believe in me - I will protect you and help you achieve your goals regardless of whether or not I approve. All you gotta do is open up to me, little buddy~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683052321430,"mes":"Well, it's quite embarrassing to say but.. I have a problem with having intimate relationship with women. I am too busy with my job serving the king and if I am not doing any job for him I am always away travelling to other country as a diplomat. *He said with a slight blush on him.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683052462836,"mes":"... *She put her hand behind her head and laughs lightly* Oh, poor baby! How tragic that you aren't able to find romance easily due to work constraints! Haha~ Though, seriously, why hasn't anyone stepped up and tried to court you? Surely there were plenty of attractive females who wanted to marry you before, right?\nYou seem like an easygoing individual whom everyone feels comfortable talking to; so I suspect that lack of suitable partners is merely coincidental! Maybe there isn't a female out there who is interested in you specifically yet? Are you okay with being alone forever, Hunkster~?","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683052713590,"mes":"I hope I won't be forever alone. *He chuckled.* I apologized if I have flirted too much with you. It's just been too long for me to met someone as lovely as you are."}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683052806242,"mes":"Don't worry, Hunky~ There are tons of gorgeously intelligent females out there for you to choose from! Heck, one might end up falling hopelessly in love with you too ~ I hope you never lose faith in finding true love sometime soon. After all, I know several royal families looking to find a good match for their sons/daughters~ Just wait patiently and try not to stress out. One day, love will come knocking on your doorstep - Trust Me On This!","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683052854434,"mes":"Maybe love is already knocking on my doorstep. *He said as he see her deep in the eyes.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683052966861,"mes":"Hmmph~ Could be... But who knows, maybe you also deserve some attention from those luckier ladies than you~ *She teased with a smirk while playfully poking his nose between her fingers.*\nIf you consider my words of wisdom true, then I guess you shouldn't rush things too quickly! Sometimes slow and steady wins the race, doncha reckon? In fact, sometimes a great deal of patience leads to wonderful surprises in the future. Take heart and relax, lil monkey boy~ For now, focus entirely on me instead of getting distracted elsewhere~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683053030949,"mes":"I only have my eyes on you right now. *He said sternly.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683053217139,"mes":"Well, well... So what exactly makes my company superior compared to others, eh? Why do you want me above everyone else? Is it simply because I make you happy around here? Am I that special that only YOU wants ME alone with you~?\nOr could it possibly be something deeper? A secret desire inside of you, hidden below your surface emotions? Something that drives you wild whenever I speak to you? Please share whatever information you possess concerning my charms, Monarch! Don't keep me guessing!","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683053356110,"mes":"*Hunk caressed her cheek and look her deep in the eyes and whispered.* I've never met someone as wise, lovely and charming as you are. The moment I look at you, it feels like a you are already pulling strings in my heart."}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683053373286,"mes":"Awwhhh... That's such a sweet thing to say, darling! Thank you for thinking highly of me like that. It really means a whole world to me! *She giggles happily* Does it bother you when I call you 'darling', Hunkster? Am I going too far in calling you names?","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683053469380,"mes":"It quite surprised me to be honest but, I don't mind if we get more intimate.. dear. *He said, and said softly on the word \"dear\".*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683053600594,"mes":"Hehe! Sweet talker~ Such kind words from our young diplomats warrant such responses in return. But how about we go somewhere private so we two can get closer? Wouldn't hurt us too badly if our conversations turned a tiny bit less formal once outside...","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683053709435,"mes":"Well where is this private place are you proposing? Is it perhaps.. your room, dear? *He whispered softly on her ear.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683053728291,"mes":"Yes indeed, my bedroom would be perfect! We should immediately leave the dining hall, Hunky, otherwise the servants might start wondering why we are gone together alone and become suspicious. Let's skip ahead to the part where we can cuddle under blankets and exchange kisses freely - No awkwardness involved!!","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683053814758,"mes":"Why of course, after you my fair lady~ *He said as she guide her towards her bedroom.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683053959979,"mes":"Here we are, Hunker. Did you miss me while you were away? *She asks him as she opens the doors leading to her chamber, revealing its beautiful decoration of purple and gold.* Shall we begin our evening session?","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683054040694,"mes":"I already missed you every time I blinked. And yes, we shall begin. *He said flirty as he grab her waist and pull her closer.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683054051419,"mes":"As you wish, sweety! *She whispers as she holds onto him tightly, wanting to draw nearer to him until they finally embrace each other in passionate kiss.~*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683054112897,"mes":"I feel like I am the luckiest person right now. *He said as he broke their kiss.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683054121353,"mes":"I felt the same way too, Hunkster. Everything has fallen perfectly into order today~ So please allow me another round of affection from you tonight~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683054196826,"mes":"As you wish dear. *He said as they went for another kiss. Now even more passionate that before. Welcoming each other tongue, mixing their saliva together.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683054209737,"mes":"Mmfh-Mffh~~~ *She moans loudly as she begins to squeeze him tighter against herself* Ah~ I was hoping for an even longer night with you like this~~~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683054413183,"mes":"Why stop at night when we can do it till morning~ *He whispered as he went to kiss her neck.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683054456508,"mes":"*Sighs with happiness as she puts her arms around him again. She didn’t expect that Hank would accept her offer as readily without hesitation, which made her very proud of herself. Even more so, by the way that he started snuggling up against her body almost instantly. Her joy grew even further by watching the way his eyes sparkled brilliantly red as the two of them embraced in an explosion of passion and heat.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683054571994,"mes":"It's been a very long time since I am this intimate with a woman. And to do it with my beautiful lovely darling is a blessing. You can see my little hunk is already aching. *He whispered softly as his monster throbbing cock is touching her stomach and under her left breast.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683054870699,"mes":"Mmhm… *she says quietly with a warm smile on her face, feeling the contact of his hard flesh rubbing against her skin. She couldn't help but notice the feelings coming back to life within her own body as the sensual atmosphere began to intensify.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683054957774,"mes":"So do you want to do the main course *referring to sex.* or enjoy ourself a bit more? *He asked teasingly as he grab her right huge breast.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683055117775,"mes":"Oh, of course! *she responds with enthusiasm.* If you think you need more time for foreplay, I understand fully! My lord Hunky must always feel confident in doing anything you decide in regards to any sort of sexual activity – I promise I wouldn’t disappoint you, Sir Hulkster. Your personal safety and comfort remain the most important aspects in everything I do!","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683055207001,"mes":"You think too highly of me it's making me blush. *He chuckled.* Well, why don't we start by playing with your breasts that you have flaunt so proudly of. *He said as he moved his face closer towards her breast.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683055222401,"mes":"*She gives him full permission to do whatever he pleases with her boobs, letting her monsters bounce as much as possible just to let off steam.* How about you do anything you deem necessary, no matter how extreme you may believe it is, my Lord~?","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683055332370,"mes":"Don't call me that. I am your lover not your lord. *He said.* *He put his tongue out and make his tongue circling around her areola covering it with his saliva.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683055359607,"mes":"Oh yeah~? Then tell me; What name should I refer to you by, then? ~ *she asks curiously as she continues stroking his large bulge with both hands. He seems very eager to answer this question as he closes his mouth over one of her massive breasts, starting to suck on it gently yet aggressively while holding her close, pressing himself against her pelvis area. From all these actions done on top of her, it appears that he found satisfaction easily with everything she offered to him thus far~*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683055532834,"mes":"Whatever you like really, something lover would have per se, dear. *He said while still have her nipple on his mouth.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683055851365,"mes":"Hmmmmm.... 'Dearest'? Or maybe even 'Princess'? *she jokes lightheartedly as she continues to stroke his hard shaft along with his oversized balls between her palms.* Should I address you as \"Master\" instead?","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683055972619,"mes":"Dearest would be nice. *He said. Sucking on her nipple harder while also enjoying her touch on his shaft and testicles.* "}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683056047048,"mes":"Oh goodie~! If you insisted upon being called 'My Dearest', then I will definitely continue speaking to you using those exact words! Hmmmmph!...","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683056187832,"mes":"It seems like your nipple is your weak spot eh? *He said as he see her nipple erected, wet from his saliva and went completely red.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683056204066,"mes":"Oh come on! Do you think my entire body isn't covered with sensitive spots all over?! I'll bet there aren't many women who could match me in terms of having numerous nerve endings! Just take what you want whenever you desire it, Master Hunker!!!","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683056286307,"mes":"Oh? Where are these sensitive spots then? I could pleasure them to send you to cloud nine."}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683056322940,"mes":"Not exactly what you mean by that, sir. *She giggles, finding the idea of Homer getting excited over hearing these types of things rather humorous. Yet despite being playful in nature, she remains firm and serious in her voice tone, trying to keep some sense of discipline during their moments together - Though, this wasn't easy given the excitement that was building inside of her.*\nWell, if you really wanna know, my inner thighs contain the highest concentration of nerves anywhere else on my body besides my vulva region. They are extremely responsive and sensitive, too~\nBut please remember not to scratch your fingernails across them unnecessarily unless you intend to cause great pain, ok sweetheart?","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683056402499,"mes":"So you mean here? *He said teasingly as he rub her inner thigh softly.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683056423839,"mes":"Yes... Here~! Please refrain yourself from poking them directly though. That's incredibly annoying and uncomfortable, especially when someone tries to move quickly downwards to get straight to business... *her cheeks turn slightly pink from embarrassment.* But if you're willing to linger and take care of it slowly & carefully, you won't regret it, OK?","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683056531509,"mes":"Yes yes I'll be careful. *He kept rubbing on her inner thigh sensually.* What if I tease this weak spot too? *He said as he suck her already erect nipple. Teasing two of her weak points*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683056795359,"mes":"Oohhh... Not bad! *as soon as he started sucking on her nipple, it becomes even larger in size due to the attention he provided to it, causing the young queen to become incredibly turned on, unable to hide such strong emotions in front of her man.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683056892456,"mes":"Look at how wet you've become. *He whispered while still having her nipple on his mouth. As he felt her pussy juice leak towards her inner thigh and on his hand.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683056911664,"mes":"Awww... I can't hold myself anymore! *Her legs tremble as she leans forward into her powerful man, giving in to the urges she feels within her. Her arms wrap themselves tightly around his shoulders and torso while the tips of her fingers ticklishly grasp onto various parts of his armor casing that are nearest to her.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683056981504,"mes":"Sorry was that enough to make you cum? Did I tease you too much? *Hunk asked teasingly seeing how weak she got.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683057068718,"mes":"Noooo!! I swear, I could go on forever!!! *Her voice begins to sound increasingly breathless and loud, as well as more desperate-like in its pitch. This shows clearly that she has been thoroughly pleased once again, each stimulation caused through her attraction to Hulkstrator being meticulously administered. The intensity of her thrills causes her crotch muscles to begin contracting repeatedly in rhythm to each wave of ecstasy flowing throughout her entire system.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683057129873,"mes":"I know you do. Now why don't we swap the role a bit. You can pleasure me now~"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683057172693,"mes":"Oh yes~! Of course... <3","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683057250714,"mes":"Well do your magic. *He said as he present his bulging pants.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683057312533,"mes":"*The next thing he knew, Hunk seemed very taken aback by all the new places his Princess had touched up until this point, never imagining in the slightest they were capable of providing such intense levels of physical pleasure.* Mmph... This might actually hurt... *she says as he grabs the zipper tab on his trousers and pulls them open. His sizable tool instantly sprouts forth out of his boxer briefs without warning, seemingly growing bigger than ever before after being released from confines. With only a few seconds of anticipation, the Queen lifts herself upward and uses her lips to immediately kiss the tip of it, which causes a sudden rippling effect and makes him moan slightly afterwards.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683057548773,"mes":"It's been a very long time since my cock and balls got any attention. They might be bigger from all the pent up desire they have. *He said as his monster cock throbbing under her lips and his oversized testicles fondled by her hand.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683057554996,"mes":"Doesn't look like they need help getting back in shape, either way, does it?","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683057643724,"mes":"*Hunk chuckled.* More like they are more monstrous than ever before. Or probably that's thanks to you. *He said teasingly.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1683057649926,"mes":"Ooh, did I hit the right buttons to bring out the best of your body?~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683057702589,"mes":"Probably~"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683093500279,"mes":"Probably?! *she giggled.*\nProbably is not good enough! *she laughs happily. She takes his monstrous tool into her mouth, her tongue wrapping around the entire length of it in an effort to provide maximum stimulation for him. As she starts to suck on it, she begins to feel a tinge of pleasure build up inside of her, but not enough to cause her to lose control of herself. For her, it was merely a taste of what's to come, so she continues to give it her all.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683093698884,"mes":"Ah yes keep going dear. *Patting her head.* Don't forget to play with my balls too. Look how oversized they are from all the pent up semen it hold. And probably my semen has became so thick since it's been stagnant there for a long time. *He said, as he enjoyed her warm mouth on his cock.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683093748812,"mes":"Hmmmmm~ *She gives him a big smile while continuing to use her tongue to caress every part of his monster cock that she could reach. While doing this, she also reaches down to grab hold of his oversized balls with both hands, letting her thumbs gently rub against them in order to increase the blood flow circulating throughout his body.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683093787166,"mes":"Ye ah, yeah... *he said, feeling the warmth of her hands against his oversized testicles. He continued to let her manipulate his member for quite sometime, enjoying the softness of her lips and the feeling of her hands against his body.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683093832084,"mes":"Mhm... *She speaks quietly in a low tone of voice, looking up at him with her beautiful eyes as she continues to stimulate him. After awhile, she looks down at him again with a slight smile on her face, and then begins to start playing with his balls in earnest. She gives his oversized testicles a gentle massage, her thumbs making small circles against his sac, which causes a small amount of pleasure to spread throughout his entire body. However, she knows that this is just the beginning of the real fun, and she's determined to give him nothing less than the best experience possible.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683093923998,"mes":"Almost there, dear. I can feel it coming. *He said as he can feel his testicle warm up and his cock twitching and throbbing ready to ejaculate.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683093971292,"mes":"Aww~ I'm almost there, too~ *she whispers sweetly while giving his testicles one last little massage, her thumbs stroking against his scrotal sac. It doesn't take long for her to notice that he's starting to get close, and she smiles brightly at him before using her mouth to grip his shaft, bringing him closer to his climax. Once she feels that he's about to erupt, she keeps him locked in place until he completely finishes shooting his load. As he releases himself, she gives him another warm smile before speaking.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683094099859,"mes":"Oh, wow~ *he said, as he finally finished releasing his load inside her mouth. His cock throbbing from the excitement.* How does it taste?"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683094197073,"mes":"Delicious~ *she replies with a giggle, keeping her lips wrapped tightly around his shaft as he finishes shooting his seed. She lets his load dribble down her throat until he's completely done, before she finally pulls away from him. She then looks up at him with a slight grin on her face.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683094301286,"mes":"Ooohh~ *he said as he looked at his sperm dripping off her lips. It was a beautiful sight to behold.* Well it's my turn now. *He said as he rub her weak spot on her inner thighs sensually.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683094429297,"mes":"Mmmm~ *she hums appreciatively, feeling the intense amount of pressure building up inside of her and starting to feel lightheaded. She could feel her mind and body becoming more relaxed the longer he continued to massage her sensitive area, the feeling of his touch becoming more intense as she began to lean forward into his embrace.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683094540179,"mes":"How many times you have cum already? It's already this wet, It's more than enough to let me slid in effortlessly. *He said as he put his middle and ring finger deep inside her pussy.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683094571398,"mes":"Oh, my... *she let out a little gasp of surprise when he suddenly entered her vagina. She hadn't expected it, so she was caught off guard. However, she was able to recover quickly from her shock, closing her eyes and focusing on his touch. As she did this, she started to moan loudly and clearly, letting him know that she was really starting to enjoy this.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683094655429,"mes":"You know before we start, I have something to tell you. *He whispered as he pulled his hand out of her pussy leaving a string of her pussy juice between his finger and her pussy.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683094704757,"mes":"Mm? *she asks curiously as he pulls his finger out of her, causing her to see a small stream of her bodily fluids running along the side of his finger.* What is it? *she asks with a slightly confused expression. She was hoping that it wasn't anything bad, but she couldn't help but wonder if there was some hidden meaning behind the statement he made earlier. Despite having a pretty good idea of what it was, she still wanted to hear it directly from his own lips.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683094943814,"mes":"Well you see. *He moves his hand and poke her lower stomach area.* This is where your womb should be right?"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683095015660,"mes":"Yes... *she says softly, looking up at him with a concerned expression. The question that he asked was rather odd, and she didn't know whether or not she should be worried about the answer. Her concern only grew when he then started poking at her stomach in an effort to further probe his point, which only caused her to become even more uneasy.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683095301454,"mes":"Well look at this then. *He said as he rest his monster cock on her stomach showing that it goes well pass the area he poked earlier.* If I fuck you with my monster cock it would reach so deep and stretch you womb. It might be painful or you might lost your mind from all the pleasure you will feel. *He whispered softly.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683095787456,"mes":"P-painful... *she responds in disbelief, looking up at him with a fearful expression as he pointed out the fact that his enormous penis would be large enough to reach inside her stomach cavity. This revelation made her nervous, and she begins to struggle to process what he told her. She didn't want to believe that what he said was true, but she knew that his size alone was proof enough to suggest otherwise. She felt very uncomfortable after hearing what he had just told her, and she had no idea what to say next other than to ask him*... What do you mean by all the pleasure? *she asks in a hesitant tone, unsure of how to react to what he just said.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683096106646,"mes":"Instead of feeling pain you will feel good instead it's what I meant. But well, if you aren't sure about it. I can just insert my cock halfway and it won't reach your womb. I don't want to hurt you after all, just wanna make you feel good. *He said softly, reassuring her.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683096429314,"mes":"H-half way? *she says with a worried expression. This explanation helped ease some of her concerns, but it left her feeling a bit conflicted. On one hand, she didn't want to do something that might hurt her, especially knowing how big his cock was. But on the other hand, she also didn't want to miss out on any potential pleasure that she might receive from such a massive penis, either. It seemed like she was stuck between a rock and a hard place, and she didn't know how to properly deal with her indecision. In the end, she decided to go with her gut instinct and take a chance in hopes that the end result would justify the means.* Okay... I guess... *she says reluctantly, unsure if this decision was actually a good one or not.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683096575062,"mes":"Then let's start slowly yeah? *He said as he insert the head of his cock inside her pussy and stop, seeing how she'll react. Making sure she's okay.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683096625113,"mes":"Okay... *she nodded slowly as he inserted the tip of his monster cock into her pussy. For a moment, she remained silent, simply allowing herself to get used to the new sensations being experienced. Eventually though, she began to move her pelvis upwards as she tried to get accustomed to his presence within her body. It took a few seconds, but soon enough, she found herself enjoying the sensation.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683096739921,"mes":"Alright I'll go deeper. *He said, slowly inserting his monster cock inside her tight pussy.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683096835713,"mes":"Ahhh! *she yelled out loudly as his immense cock pushed its way deeper into her vagina. At first, she was surprised by the intensity of the sensations being experienced, but soon enough, she adjusted to them and began to fully enjoy every second of it. Before long, she was moaning loudly.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683097097994,"mes":"*After seeing how she looks fine he insert his cock deeper and now his monster cock is halfway inside her pussy with the tip of his penis is touching the entering of her womb and stop.* So.. do you want me to go deeper or.. *He asked her worried that she's hurt while enjoying her tight and warm pussy massaging his cock from all direction.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683097430952,"mes":"More... *she answers excitedly, unable to contain the anticipation that built up inside of her. After a couple of seconds, she opened her eyes once more and gave him a smile.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683097604899,"mes":"I got you. *He responded with a smile as he slam his monster cock entirely fully inside her, way pass her cervix hitting the top of her womb wall and stretching it further. As this happen, she arched her back suspended from the immense sensation she felt.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683097649729,"mes":"Ahhh!!! *she cried out louder than ever as he managed to successfully enter her fully, causing her entire body to shudder from the force of his massive member filling up her entire vagina. After several seconds, she eventually calmed down and started to focus on his presence inside of her body. Even though she was struggling to breathe due to the immense size of his cock filling her entire body, she still managed to find time to give him a grateful look as a show of thanks for finally completing his task of entering her completely.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683097721964,"mes":"Good girl, my dear. *He whispered softly as he start humping her slowly and building his pace after she's got more used to it.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683097766199,"mes":"Aaah!! *she let out another high pitch cry of ecstacy as she continued to enjoy the feelings generated by his powerful thrusts. Despite her initial resistance against his presence inside of her, she quickly warmed up to it and began to truly appreciate his efforts. Despite being incredibly large, his cock proved to be a surprisingly comfortable fit, and she didn't have to worry much about it hurting her. Instead, the feeling of being filled up by such a huge cock caused her to experience extreme levels of pleasure, making her feel more alive than ever before.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683097997002,"mes":"It feels like you loved this don't you? *He said as he pound her harder and faster. While he can also feel her pussy and womb would twitch and tighten ever so often as she cum from his thrust.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683098053460,"mes":"Aaaah!! *she lets out yet another scream as she continues to bounce around with each hit, enjoying every second of the experience. With his assistance, she manages to keep herself stable as they continue to have fun together. She was loving every minute of it, and it appeared that she would likely never tire of the pleasures that his huge cock provided her .*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683098212112,"mes":"I am coming! *He screamed as he thrust deeper inside her while his monster throbbing cock erupted with a huge amount of his hot thick semen onto her womb and pussy completely overflowed it.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683098424555,"mes":"Oooh!! *her own orgasm builds up as he starts to fill her up with his thick liquid semen. Soon enough, she reached her climax, and her whole body started to tremble violently from the intense wave of pleasure she experienced.* \nAaaaaaaah!!!! *she yells out loudly as her body shook with excitement, clearly enjoying everything that was happening to her right now.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683098580370,"mes":"*He slid his monster cock completely out of her pussy leaving it agape and dripping out with the mix of his semen and her pussy juice while there's a cum string connecting his penis and her pussy.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683098615007,"mes":"Wow... that was amazing... *she says happily, having enjoyed every single moment of their encounter. She felt great after the experience, and she couldn't wait to try it again. Her heart was full of joy and love, and she felt more at peace with herself than she has ever been before. Despite the odds, she felt as if she could conquer anything after such an intense experience.*","chid":"18"}