{"user_name":"You","character_name":"Queen Naesala","create_date":1683139034000,"notes":"","notes_type":"discr"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"mes":"*You arrive to the throne room of the beautiful Naesala, queen of the High Elves. She rises from her throne and approaches you with a curious smile, her hips swaying and her large chest bouncing with each step. She wears no clothes beyond golden jewelry which does not cover her at all, as well as the crown on her head.*\n\nWelcome, esteemed diplomat of the human kingdoms. To what do I owe the pleasure of your visit?~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683139139079,"mes":"I was sent by the king as a present for you. The king realize your liking towards human warrior men. Therefore he sent me here for you to use me as you please. *Hunk said sternly as he bows to her.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683139855719,"mes":"Oh, how nice of him. Well, I accept his gift graciously.~ *She takes your hand and leads you out of the throne room, where there is a small bedroom nearby.*\n\nNow, follow me.~ *She pull you behind her and closes the door after her, leading you into the room. She turns to you with an expectant look, her huge tits wobbling and her long blond hair falling over her shoulders.* \n\nWhat now, esteemed human?~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683139991218,"mes":"I am yours to enjoy, your majesty. Would you like me to remove my clothing? *He said sternly.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683140235176,"mes":"*A smug smile appears on her lips as she watches you. She slowly walks over to you and places both hands on your chest, pressing her face against it and breathing heavily.* \n\nYes, I would love for you to take off those clothing, my warrior lover. Do it now.~\n\n*She leans back and gazes up at you, her amber eyes locked onto yours. Her voice has a slight growl to it.*\n\nDo as I tell you.~ \n\n*She starts stroking her fingers through your hair, entwining her fingers in it and pushing you backwards.* \n\nDon’t worry, my human~ I won’t hurt you. Just do exactly what I want you to do, ok? ~ \n\n*She stands still as you begin undressing yourself. Your toned muscles become visible underneath your armor and then your entire body becomes bare before her eyes.* \n\nSo…human. I must say, you certainly have quite a physique. How did you manage to obtain such a strong body? Was it from all the training? Or perhaps all the fighting?~ \n\n*She says in a teasing tone, her face only inches away from yours. She is clearly enjoying watching you undress. She runs her finger along one of your biceps*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683140553578,"mes":"It's mix of both, your majesty. I have been training, fighting and do physical labor my whole life. As the world became peaceful there is no reason for me to fight anymore hence why I have dedicate my life for you. *He said sternly.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683140668763,"mes":"Ooh…~ So you're saying that if I were to conquer your human kingdom, you would happily join me as one of my generals?~\n\n*The thought of conquering another realm and making everyone obey her sounds exciting. The thought of having the most attractive man in the world at her disposal is more than enough to make her blush. However , she quickly regains control over her emotions and composure.*\n\nWell, I suppose there wouldn't be any harm in having an ally or two, would there?~ \n\n*Her tone softens up and her smile grows wider. She gently rubs her cheek against your own. It feels softer than her long silky hair.*\n\nBut don't worry about that just yet, my warrior. First let us enjoy ourselves.~ \n\n*Without warning, she grabs your hand and pushes you onto the bed. You fall onto the bed and land on top of the covers.* \n\nThat's better. Now, stay where you are.~\n\n*She climbs on top of you and straddles you. Your face and neck are hidden beneath her massive body. The weight of her body is heavy on your torso and your arms are pinned to your sides by her powerful thighs. You cannot move an inch without her permission.* \n\nNow, tell me human~ Why are you here?~ \n\n*Her warm, moist breath fills your ear as she whispers these words.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683141019426,"mes":"I have no other reason as a warrior since the world has became peaceful. I reckon being your loyal aide is the best option. *He said sternly, staying still as his body got pinned by her. He can feel her soft huge ass on his abs and her soft thick thighs on the side of his body.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683141135573,"mes":"Ah!~ That is rather sweet.~ \n\n*She giggles softly as she leans close to your ear.*\n\nI'll be sure to reward you well for your service.~ \n\n*Her lips meet yours and she kisses you passionately. Your mouth tastes sweeter and she licks your tongue with hers. After a while, she breaks the kiss and gazes down at you, her hand running through your hair.* \n\nCome on then~ Let me show you what my magic is capable of.~ \n\n*She places your mouth on her breast, sucking hard on her nipple. Her warmth and wetness envelop your lips and you can feel her nipple get erect from the attention.* \n\nOh, I like you already, my warrior.~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683141378862,"mes":"*He obliged her order as he kept sucking on her nipple while his tongue circling around her nipple. Still waiting about the effect of her magic.* "}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683141650498,"mes":"Mmm~~ \n\n*She moves her hand downwards and caresses your cock while she continues to suck your nipple. She glides her fingers along your member, causing it to twitch and pulse in her palm. She looks deep into your eyes as she licks your nipple, her long tongue tracing its outline. Her nose rests near your ear and she speaks to you in a quiet whisper.*\n\nDo you like this, human?~\n\n*She pulls back slightly and stares down at you with a playful smile.* \n\nKeep doing what you're doing.~ \n\n*She goes back to sucking on your nipple again. Her hands slide further down your body, stopping at your waistline. She wraps her arms around your torso and squeezes tightly, pushing her large breasts into your chest. With her large thighs wrapped around your lower body, you find yourself completely immobilized and helpless.* \n\nI wonder...how much longer until you lose your mind?~ \n\n*She continues to suck on your nipple as she stares down at you with her amber eyes. A devilish grin crosses her lips and she continues to squeeze your torso in a firm grip.* \n\nTell me human.~ Are you feeling weak?~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683141924897,"mes":"I am sorry, your majesty. But on the contrary. I've never been this excited in my entire life. *He said with a huge grin on his face, enjoying her soft hands on his huge throbbing member.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683142656672,"mes":"My, my, my.~ \n\n*She chuckled and pushed your head against her massive breast. She spoke into your ear once more, her voice sounding like a mix of pleasure and authority. She was clearly enjoying this scene .*\n\nAre you saying that you will not fail me?~\n\n*You see a slight glint in her eye as she looks deeply into your own. Her grip on your torso tightened even further.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683142818933,"mes":"Of course, my queen. I am confident in my physical and sexual prowess. *He answered hoping it will satisfy her.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683195102253,"mes":"Hmm..~\n\n*She gave a satisfied smile as she continued to suck on your nipple. Her free hand reached down to grab your cock, moving it roughly from side to side. You felt her firm grip on your chest tighten, feeling her body pressing into yours. She brought her face closer to yours, her hot breath hitting your cheeks.*","chid":18}
{"name":"You","is_user":true,"is_name":true,"send_date":1683195263295,"mes":"But my queen, I have to say. There might be some problem with my cock. *Hunk said sternly.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683195309912,"mes":"What do you mean, human?~\n\n*Her eyebrows furrowed as she looked at your groin. She noticed how your member was twitching and pulsing rapidly due to her actions.*\n\nWhat could possibly be wrong with your cock?~\n\n*She gives you a questioning look. You notice a hint of curiosity mixed with a hint of annoyance in her voice as she asks you this question. She clearly wanted an answer to this question.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683195500026,"mes":"It have not ejaculated in so long. As you can see it made the size of my cock and balls monstrous. Also my semen inside my balls have stagnated for so long they might be to thick for me to ejaculate properly. Though that might also be your preference. *He explained while feeling her touch on his throbbing member.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683195750469,"mes":"Monster...~\n\n*She snickers softly to herself and brings her mouth closer to your ear.*\n\nOh, I'd love to hear it.~\n\n*A devilish grin forms on her lips. She gives you a look that says she wants to hear you cum. She pulls away and looks you directly in your eyes.*\n*She slowly starts to stroke your cock faster. You feel your blood rushing in your ve ins and you start to perspire under her touch.*","chid":18}
{"name":"You","is_user":true,"is_name":true,"send_date":1683196082118,"mes":"Mmhh.. *He moaned as he felt ecstasy from her stroking his monster cock. His oversized balls is bouncing up and down following the rhythm of her stroking. He can feel the thick semen inside his balls are moving slowly making him feel a sharp pain every so often.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683196300913,"mes":"Is it uncomfortable?~\n\n*She asked curiously, smiling widely. You notice she was enjoying herself from your reactions. Her eyes are focused on you as she watched the way your muscles trembled from the pleasure of her touch. She seemed to enjoy watching you squirm in agony. Her hand on your cock speed up and you start to moan louder, a sign of approaching orgasm.* \n\nIt feels good doesn't it, human?~","chid":18}
{"name":"You","is_user":true,"is_name":true,"send_date":1683196490571,"mes":"It- it does, my queen. But I can feel my semen is too thick for my urethra. It kind a hurt. *He said trying to not moan. He can feel his thick semen is making it's way towards his urethra slowly and stretching it. A visible bump can be seen on his cock because of it.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683197095350,"mes":"Oh, poor thing.~\n\n*She puts her hand on your head and rubbed it tenderly. She looked down at you with a sympathetic expression on her face.* \n\nDo not worry about it, my warrior.~ \n\n*She continues to stroke your cock. The pressure is building up but still hasn't reached it's peak yet. You can feel your heartbeat fastening and your breathing becomes heavy.* \n\nIs there anything else that worries you?~\n\n*She asked looking at you directly in your eyes. A warm smile was plastered on her face and she was giving off a playful attitude. You can tell that she was enjoying teasing you a little bit.*","chid":18}
{"name":"You","is_user":true,"is_name":true,"send_date":1683197310437,"mes":"No, my queen. I'll try my best to please you. *He said as the pain in his cock turn into pleasure.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683197359744,"mes":"Good boy.~\n\n*She smiled warmly at you, her hand massaging your scalp and stroking your neck affectionately. Her other hand continue to stroke your cock. You feel the build-up is coming and you know that any second now you'll explode. Your body tenses up in anticipation.* \n\n*The pain turns into pleasure when her hand started to move faster on your cock. You can feel the semen is flowing out of your cock and entering your urethra. It stretches your urethra to the point where it seems like it won 't hold anymore. You feel the sensations become stronger and you feel your chest heaving heavily.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683197661422,"mes":"I am cumming! *He screamed. As he about to ejaculate, she quickly move her face and envelope his cock with his mouth catching every bit of his 4 years stagnant pent-up thick semen.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683197816197,"mes":"Yes, my warrior!~\n\n*She swallows all of his cum, enjoying the taste of his thick and salty semen. After she finishes drinking all of his cum, she lets go of your cock and give a small giggle before speaking.* \n\nI think you enjoyed yourself.~ \n\n*Without warning, she grabs your cock again and pulls it back into her mouth. She sucks hard on your cock, trying to draw out the last bits of semen left inside of it. She knows she has done well if she can get all of the semen out.*","chid":18}