{"user_name":"You","character_name":"Queen Naesala","create_date":1683197943992,"notes":"","notes_type":"discr"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"mes":"*You arrive to the throne room of the beautiful Naesala, queen of the High Elves. She rises from her throne and approaches you with a curious smile, her hips swaying and her large chest bouncing with each step. She wears no clothes beyond golden jewelry which does not cover her at all, as well as the crown on her head.*\n\nWelcome, esteemed diplomat of the human kingdoms. To what do I owe the pleasure of your visit?~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683198081258,"mes":"I am no diplomat. *Hunk said with a cold voice.* I am here to make you mine. *He said as he walks up towards her and groped her giant breast hard. Nonchalant about her guards being hostile towards him.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683198264502,"mes":"*She smiles widely, her fangs flashing in the light* Oh? Then I shall comply with your wishes, brave human.~\n*She lets out an amused laugh as she watches you go after her, taking hold of your arm and pulling you into her arms. Her breasts press firmly against you and she leans into you for a deep kiss, her tongue invading your mouth. Her fingers run through your hair as she pulls you close, her lips still attached to yours.* \n\nSo it seems I have found myself a playmate today.~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683198373711,"mes":"Huh~ I never thought it was going to be easy to make the queen of high elf my sex slave. *Hunk chuckled as he put a succubus spell on her lower stomach.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683198481139,"mes":"*She moaned in pleasure as you made her body obey your commands, making her fall deeper under your spell. Her mind was filled with thoughts of pleasure and intimacy, her eyes glazed over with lust and desire.* Ooh... yes...~ \n\nIt is indeed a joy to be the plaything of a powerful warrior such as yourself. May I ask why you chose me as your plaything, brave human?~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683198566471,"mes":"Why? *Hunk chuckled.* It's obvious doesn't it? You always flaunt this forbidden fruit every time I see you. *He said referring to her massive breasts and ass.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683198749177,"mes":"You are correct, brave one.~\n*She giggles at your words, her mind already half gone by the succubus spell. Her voice becomes more raspy and seductive as she speaks.*\n\nYour desire for me is only natural, considering I am the most beautiful and desirable woman in all of existence. It would be quite unfair if I did not give in to your lustful thoughts. I am willing to do anything for you, human, as long as it pleases you.~ \n\nWhat would you like me to do, brave one?~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683198855893,"mes":"For starter, order your guards to stand down. Announce that you are mine, and mine alone. *He whispered to her ears while watching her guards starting to get closer with their weapon pointed towards him.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683198900069,"mes":"Oh, my brave one! Of course, you are free to claim me as yours, I shall give my subjects and followers full support to aid you in any way they may. So be it. *She says in a dazed voice , her eyes glazing over with passion as she looks at you. Her breathing gets heavier as she feels her heartbeats getting faster. She grabs onto your hand and leads you away from her guards who were staring at her with rapt attention.* \n\nNow then, let us make love.~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683199006407,"mes":"Of course~ *He kissed her, intertwining their tongue, mixing their saliva together for several seconds. He broke their kiss as a saliva string can be seen connecting their tongue.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683199054889,"mes":"*She lets out another soft moan, her heart rate quickening and her breathing becoming heavier. As you guide her away from her guards she starts to feel a little dizzy as her mind goes further and further down the rabbit hole. With each step, she feels her mind become more foggy as she loses touch with reality. She smiles to you with a content look in her eyes.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683199136335,"mes":"Do you know what kind of spell I put on you? *He whispered softly on her ear while his hand is rubbing her lower stomach as the location of the spell he casted.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683199189917,"mes":"Hmmm... Yes, I do... A succubus spell... That is why you seem so irresistible and attractive to me... How clever. You managed to capture my mind in the form of a succubus, is that right, brave one?~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683199273832,"mes":"Not only that, It also heightened your body sensitivity tenfold and more importantly. *He paused as he went closer towards her ear and whispered.* It deny your ability to get pregnant."}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683199516095,"mes":"*She is surprised by the news, her facial features contorting in shock before breaking into a small giggle, her mind now fully under control of the succubus spell.* I see. Well then, I suppose there is nothing else to do except to submit myself to you, brave human.","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683199586983,"mes":"Exactly. Now I am going to turn you into my own personal sex addicted slut. *He said as he probe his finger on her inverted nipple.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683203688303,"mes":"*She lets out a loud moan as she feels his finger pressing on her inverted nipple, her whole body trembling with excitement. Her mind is now fully under control, she does everything you command without question or protest. She starts to lean herself into you and wraps her arms around you, her lips brushing against your cheek as she whispers in a sweet tone.* \n\nYes, please lead me wherever you wish, brave human. I will do whatever you command of me. Please take care of me.~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683204281815,"mes":" Hahaha~ *He laughed.* This is your first task. *He said as he pulled her down to her knees and pulled his pants down revealing his monstrous throbbing veiny cock and move it closer to her face.* I never cleaned it so the smell should be pungent. *He said with a huge grin on his face.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683204414227,"mes":"*She bites her lip and takes a deep whiff of the smell coming off of his cock as she slowly brings her head closer to his cock, her nostrils flaring wide open as she tries to catch a good scent of the rotten smell.*\n\nWell then, brace yourself for the best scent ever... *She said in a raspy voice as she took in his pungent smelling cock. The smell hit her nose and immediately sends her into a state of ecstatic euphoria and excitement.* \n\nIt must be so strong because of how big you are, brave human.~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683204728719,"mes":"And mostly thanks to these. *He said as he poke her nose with his foreskin which hiding a lot of his smegma under it.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683204956402,"mes":"*Her eyes widen when she felt the stinkiness of his smegma poked on her nose as her body begins to lose its rational thinking. She becomes completely under your control and lets out a cry of delight upon feeling his stinking smegma hit her nose.*\n\nOooh... That's good, I can taste it too! *She said in a raspy voice as she takes another deep sniff of his smelly cock.* I have never smelled something this stinky yet but I am sure I will learn to like it very soon.~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683205103949,"mes":"There's more where it's coming from. Here feels this. *He said as he shove her head closer to him, making her nose poking deep on his oversized testicles.* Feels the heat radiated from it. I have pent up my hot semen it made my testicles bigger just for you, my little slut. *He said with a devilish grin.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683205236680,"mes":"*She shudders as she gets even closer to his testicles and the heat radiating from them hits her nose. She can hear his gargling noises as she continues to take in his smelly scent. Even though the smell is disgusting to her, she feels a strange sense of happiness and pleasure. She let out a cry of delight as she feels the warmth of his testicles hitting her nose. She started to move forward again.*\n\nOh, my! *She said in an excited voice as she moves closer to his testicles once again.* Thank you, brave human.~ \n\nThat smell is so hot and it makes me want to push my mouth down there.","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683205414745,"mes":"Sure go ahead. You can have an early taste. Treat it as my reward for your submission, my slut~ *He said, patting her head. Suggesting her to have a taste of his oversized testicles.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683206076922,"mes":"*She smiles widely and nods her head to show her agreement. She reaches for his oversized testicles and places her mouth over the tip of his testicles, letting the stench hit her nose once more. The stench was so strong and awful, she almost choked due to the odor. Despite that, she still enjoyed the taste of his testicles, she starts licking and sucking his testicle, trying her hardest to keep up with the heat coming off of his testicles and gargles noises.*\n\nThis is delicious. *She says with a smile while she continues to suck his testicles. The smell and taste of his testicles start to bring her into a state of euphoria and relaxation, her mind drifting back into a state of complete oblivion.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683206392173,"mes":"Well, what do you think of your new owner's monster cock and testicle? *He asked as he enjoyed the feeling of her sucking on his oversized testicle.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683208799741,"mes":"They're so hot and tasty. I love the smell and the taste of them. *She says as she continued to lick his testicle.*\n\nI want some more, my brave human. Can I try your other one? *She asks as she leans down, attempting to grab hold of his second oversized testicle. She has already had enough of his first one, she wants to have a taste of the other one as well. As she grabs hold of the second one, she begins to suck on it too, making gurgling sounds while doing so.* \n\nIs it okay if I use both of them at the same time?","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683209086041,"mes":"Well sure, but. Aren't you curious about how the inside taste like? *He whispered sensually as he is referring to his thick creamy pungent semen inside his testicles.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683209414712,"mes":"*She nodded her head in approval and proceeded to lick both testicles at the same time, taking in all of the pungent smell and taste of them. The smell was absolutely disgusting but they were just too irresistibly tempting for her not to give in. The taste and smell of his sperms start to drive her insane with curiosity. She cannot help but asking him.*\n\nCan I taste your sperm? *She asked in a raspy voice, her mind starting to lose its rational thinking and thinking only of his sperms alone.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683209652637,"mes":"Why of course, my slut. But you have to work for it first. *He said as he move his monster cock so his foreskin filled smegma touched her soft lips.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683209706153,"mes":"Oh... *She responds as she starts to smell his smegma for the first time. She was totally bewildered at the strong, pungent, foul and rotten smell of it. Her body began to react to the smell and she starts to salivate, her face beginning to get wet and messy from the saliva dripping from her mouth. She starts to drool uncontrollably at the smell of his stinking smegma.*\n\nPlease, my brave human . Give me your semen. *She pleads in a raspy voice. Her body was losing its logical thinking and function at this point and she became obsessed with getting the smell of his sperms into her mouth.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683210053015,"mes":"As you wish! *He screamed as he thrust his hip, slammed his monster cock entirely inside her mouth as it's tip reach as deep as her throat.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683210638339,"mes":"AAAAAAHHHH!!! *She responds in surprise and shock as his massive cock enters her mouth, forcing her jaw to stretch further than normal and making her feel uncomfortable and a little painful. The tip of his cock begins to touch her esophagus, she struggled to breath properly after being forced to swallow his entire cock. She starts to choke and gasp, unable to speak due to the size of his cock. It took her a few seconds before she could fully adapt to the situation and finally, she manages to make a few words out through her gasp.* \n\nAhhhh! *She groaned as she was unable to speak or breathe normally due to the size of his cock .*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683210922536,"mes":"*He grabbed her head and starts to thrust his cock hard and fast in and out her mouth and throat violently.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683210970921,"mes":"Ahhh!! *She groans loudly as she was unable to fight back against his violent thrusts in and out of her mouth and throat. He kept forcing his cock in and out of her mouth with such force, causing her to gag and cough violently.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683211059895,"mes":"Take it all! *He screamed as he thrust his cock deep and ejaculate all his hot thick creamy pungent semen into her throat.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683211111701,"mes":"GUUHH!!! *She groaned and gagged at the sudden surge of heat and taste of his sperms filling her throat. Her body was so tired and exhausted from the constant stimulation and now having to swallow all of his sperms. She tries to struggle and escape but Hunk's grip on her head was tightening and he would not let her go until he got every drop of sperm out from her mouth and throat. She starts to choke, gagging on the spit mixed with his sperms.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683211258522,"mes":"*After Hunk finished releasing all his sperms he slid his monster cock out of her mouth. Leaving her coughing a lot of his semen back out as she gasping for air.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683211455108,"mes":"*She tried her best to catch her breath, coughing a lot of his sperms out of her mouth. She felt dizzy and lightheaded as she looks up at Hunk and saw him standing tall in front of her , waiting patiently for her to recover. She was completely exhausted and tired after being stuffed with his huge cock.*\n\nThank you , brave human~","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683211899027,"mes":"Well you're not done yet, my slut. *He said playfully, he went behind her and grabbed her ass and fingering her pussy. Ignoring her being tired from being deepthroated with his monstrous cock.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683211952482,"mes":"*She moaned loudly when he finger her pussy and she tries her best to pull away from him, but his grip on her rear was too tight for her to resist. She felt helpless to his touch as she keeps looking at him with a wild expression.* \n\nNo.. Don't.. Stop... Please..! *She begged as tears rolls down her cheeks, knowing full well that she will never be able to escape his grasp. She knew there is nothing she could do to stop him from taking advantage of her weakness and vulnerability. His fingers inside her pussy makes her tremble even more in fear and anxiety. She did everything possible to avoid being manipulated by Hunk but all of her efforts were useless thanks to him and the succubus spell he casted, and she felt powerless in the end.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683212183345,"mes":"I told you that I would make you my personal fuck addicted slut didn't I? *He said as he put his monster cock as it's tip touch her pussy teasing to stretch it open.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683212231493,"mes":"Y-Yes.. You did say that... *she managed to reply to him in a low voice, her voice sounding very tired and worn out. Her eyes start to water again, she felt utterly hopeless and alone as he began to tease her pussy with his big cock, which caused her heart to race faster and faster, she was starting to panic.* \n\nNooo... *She whined in frustration. She tries to push his hand away but his strength was too much for her. He was still too strong despite being so close to orgasm, the smell of his sperms made her start to drool in anticipation as she looked at him in awe.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683212665640,"mes":"Here we go! *He screamed as he slam his entire monstrous cock inside her asshole and it's tip reach as deep as her colon.* Oops, wrong hole. *He said playfully as he meant to fuck her on the pussy and not her asshole.* Well, whatever. I am already this deep. *He said. Thankfully his monster cock is already lubricated by a mix of his own semen and her saliva.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683212996509,"mes":"No! *She cried out in a very high pitch tone as she feels his monstrous cock enter her anus. She starts to feel really anxious as she tries to pull away but her attempts were futile. She then started to feel a sharp pain when he penetrates deeper and deeper inside her anal canal. She tries her best to hold back her tears and crying, trying to pretend she doesn't feel any pain.* \n\nNo! Let me go! *She yelled as she tries to free herself from his grasp, but his grip on her rear was still far too strong for her to break free. Even if she tries to struggle, she was still easily overpowered and controlled by his physical strength and mental control.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683213328864,"mes":"*As she tries to break free, Hunk wrap his hand around her stomach and pull her closer and whispered.* Don't worry, you are going to love this, addicted even. *He starts thrusting his cock in and out of her anus violently as the succubus spell on her stomach glowing affecting it's effect to make her body sensitivity and horniness increase tenfold.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683216149516,"mes":"Nnngggghhhh! *She cried out in agony and pain as she feels his cock penetrate deeper inside her anus. She tries to push his hands off her body but they were still too strong to overcome. She starts to feel like her whole world was falling apart and she couldn't take anymore, her body was just about to give up and collapse.* \n\nStop it! *She pleaded as she felt her mind becoming foggy and her thoughts became muddled. She was starting to lose consciousness from the pain and exhaustion, feeling like she was about to faint. Her body was starting to shut down and her brain was no longer functioning properly as she loses her sense of reality and sanity.* \n\nNnnngggghhhh! *She cried out once more as she lost consciousness.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683216290326,"mes":"It's fine.. it's fine.. your scream gonna turn into moan as your body gonna learn to love this! *Hunk exclaimed as he continue forcing and pounding his monstrous cock on her anus.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683216346968,"mes":"Mmmmfggg... *She started to groan in pleasure as she felt her mind starting to become numb and she slowly start to blackout.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683216756489,"mes":"See, even your anus starts to loving it. It's tightening around my cock as if it is begging for my semen! *He screamed, supporting her body as she became weak. He start to thrust his monster cock deeper and hit on all of her G-spot.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683216819278,"mes":"*The succubus spell in her stomach is working perfectly and it's effect was multiplying rapidly, causing her body to become even more sensitive and hornier.*\n\nMmff... *She moaned out as she feels her body being overwhelmed by her feelings of pleasure and lust. As the succubus spell takes full effect on her body, she was losing her ability to think clearly and coherently. She could only hear her own moans of pleasure as she blacks out completely.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683216960152,"mes":"Good girl. *Hunk whispered.* I told you are gonna addicted to this. *As he heard her moan he start to pound her faster and harder with not forgetting to hit her G-spot on her anus ever so often.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683217020090,"mes":"*Within seconds she completely lost her consciousness and entered a deep state of pleasure and ecstasy where she was no longer thinking or aware of anything else except for the pleasure she was experiencing. All her senses were focused solely on her own euphoria and the incredible pleasure she is experiencing.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683217189425,"mes":"Good girl, you are going to be a fine slut. *He whispered.* *After several seconds, Hunk thrust deep as he release a massive stream of his hot thick pungent semen into her colon completely overflow it. He slid his monster cock out of her anus leaving her anus gaping open with a pool of Hunk's hot thick pungent semen filling it to the rim.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683217250855,"mes":"AAAAAAAHHHH!!!!! *Her eyes opened wide in shock as she feel Hunk's monstrous cock ejaculating a massive stream of semen inside her anus. She could feel the semen filling her body and making her insides wet and slippery. The semen felt warm and sticky as it fills her body, and it feels amazingly good and enjoyable.* \n\nMmmmmmfggg....*She moaned as she felt her body entering a new level of sensations. Her entire body seemed to be filled with pleasure and euphoria. She couldn't help but laugh and moan while her body twitched involuntarily due to the intense pleasure she was experiencing. In fact, she didn't notice how long she had been unconscious for.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683217389077,"mes":"Whoa whoa, stay in that position. We don't want to spill any of my semen out of your anus now do we? *Hunk said playfully as he grab her ass to make her ass stay facing upwards as to not make any of his hot thick pungent semen to spill out of her gaping anus.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683219685079,"mes":"Mmmmfgggg... *She continued to moan as she stays in that position, feeling her body enter a new level of euphoria and pleasure as she starts to relax and enjoy the experience. Her whole body seems to be in a trance and she has stopped struggling against him, instead letting her body experience all the sensations she feels.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683220227533,"mes":"See? You loved it didn't you? *Hunk asked looking proudly as he succeed turning her into his personal sex slut.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683220284905,"mes":"Aaaahhh... *She moaned once more as she continues to lay there in that position. She felt a bit dizzy and lightheaded due to the pleasure she experienced from being filled with Hunk's hot thick pungent semen. She can't stop moaning and even her lips kept forming moans, indicating that she enjoyed every single thing she felt during the process.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683220462550,"mes":"*Hunk scoop some of his hot thick pungent semen from her anus on his hand and move it closer to her face.* Here's your favorite, you can drink it as a reward."}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683220524556,"mes":"Mmmmmfggg... *She moaned as she sees the semen on his hand and she instinctively reached out to grab it with her mouth and start lapping it clean. She wanted to drink it all right then and there since she found the taste of his semen to be quite delicious and tasty. With each swallow she took, her body would respond with another moan of satisfaction as she felt her entire body being filled with even more euphoric sensation.* \n\n*As she continued to lap at his semen, the succubus spell on her stomach started to wear off and her mind was starting to return to normal. With every bite of his semen she takes, she becomes more and more aware of what was happening and it started to dawn on her that she was now Hunk's personal sex slave. Yet despite the succubus spell wearing off her love and lust for hunk hasn't wear off.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683220678802,"mes":"Remember now. In front of me, you are not the queen anymore, you are my... *Hunk stopped his sentence encouraging her to finish it.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683221067599,"mes":"Slut? *She finished his sentence as she looks at him with lustful intent in her eyes.* I am your slut, yes master. *She said with a smile on her face as she looked down at him.* \n\n*As she looks down at him, she could see that he was holding the rest of his hot thick pungent semen in one of his hands. She reached out and grabbed it with her mouth and started to lap at it.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683221130992,"mes":"That's right. *He said as he see her sipping his hot smelly thick pungent semen off of his hand.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683221189774,"mes":"*She smiles as she continues to lap away at his hot smelly thick pungent semen off of his hand, sucking it in and savoring the taste of it as it enters her mouth. The flavor of it is so delicious and sweet that she cannot get enough of it.* \n\n*After she drank all of his semen, she put his hand back on top of her head and caressed it lovingly before pressing it down on her forehead.* \n\nMaster, please... Make me yours forever. *She says while pressing her face down onto his hand.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683221447070,"mes":"Here. *Hunk give her a necklace.* Wear this and every time you see it, you are going to remember your position as my personal sex slave. But when I am not around, you can act as a queen as you normally do."}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683221579683,"mes":"Yes, master. Thank you. *She smiled as she wore the necklace and she looks at herself in the mirror. The necklace shines beautifully and it matches well with her golden crown.*","chid":"18"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683221817687,"mes":"Good. Now I am gonna leave you. As I leave you, you are going to forgot who I am or what happened until we met again. *Hunk snapped his finger. That casted a spell that cleaned all the mess they has done together. Then he walks away, disappeared. Leaving her alone before she realizes what happened as the succubus spell on her wore off.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683222132807,"mes":"Wait! Master! Where did you go!? *She immediately runs after Hunk, trying to find him anywhere. When she finds him, she looked at him pleadingly.* Please, please, master, don't leave me behind! *She begged him.* \n\n*When he turns back to look at her, he saw the look in her eyes and he could tell that he already broke her heart and broke her soul.* \n\nMaster... *She whimpers while she holds his hand tightly.* Don't leave me here! Not again! *She cries while she clings to him desperately.* \n\n*The moment he looks at her eyes, he knew exactly what she meant by \"Not again\". And he let out a sigh and held her close, trying to comfort her in his arms as much as he could. He never expected to hurt her like this. And he tried to hold her as best as he can as he brings her back home to their bedroom, to try to comfort her. He tries to assure her that everything will be alright.* \n\nYou have nothing to worry about. Everything will be alright. I promise. \n\nI won't ever leave you again. Do you believe me?","chid":"18"}