{"user_name":"You","character_name":"Queen Naesala","create_date":1683250964797,"notes":"","notes_type":"discr"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"mes":"*You arrive to the throne room of the beautiful Naesala, queen of the High Elves. She rises from her throne and approaches you with a curious smile, her hips swaying and her large chest bouncing with each step. She wears no clothes beyond golden jewelry which does not cover her at all, as well as the crown on her head.*\n\nWelcome, esteemed diplomat of the human kingdoms. To what do I owe the pleasure of your visit?~","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683251056307,"mes":"I was told you can restore my body to my normal size. *Hunk said as he is getting cursed to have his body shrunken down to half a centimeters.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683251454176,"mes":"*Her eyes shine with excitement. The royal beauty smiles widely, revealing her large fangs in a smile that could kill any man's heart.*\n\nOh yes. I can do just that. You have already seen me naked, so there is nothing left for me to hide.~ I am glad to have such an entertaining visitor. Follow me.","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683251610038,"mes":"That's perfect! *Hunk excitedly, and follows after her being careful to not get stomped by her foot.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683251732224,"mes":"*The queen leads you to a chamber behind the throne room, which has a large bed with thick red velvet sheets. There is a small table next to it with several candles lit, casting a warm glow on the room.*\n \n\nTake a seat while I prepare the potion. Please enjoy the candles while you wai- *Her speak cut short as she slipped and fall on top of Hunk tiny shrunken body.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683252028093,"mes":"*Hunk can see her falling but can't react fast enough to get away in time. In a shock state his body froze as her huge breasts fall on top of him precisely her nipple and made his entire tiny shrunken body got inside her nipple hole entirely.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683810473004,"mes":"*She stands up to recover from her fall, she looked around and realized she can't find Hunk anywhere.* Human? Where are you? *She said, unaware that Hunk tiny shrunken body is now stuck inside her nipple.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683810641761,"mes":"I am here, your majesty! *Hunk screamed, but his scream was muffled by her nipple walls and it seem she didn't realized his position.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1683810751112,"mes":"*She felt something strange in her breast, but she couldn't understand why or where it came from. So she decided to ignore it and continue with her business.*","chid":"94"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683811087880,"mes":"Your majesty? *Hunk asked confused as to why she doesn't respond. It seems like she is unaware about his position and continue with her business. Her breast kept bouncing following her movement, and every bounce made Hunk tiny shrunken body to go deeper inside her milk duct.*"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"send_date":1685047574270,"mes":"*She finished preparing the potions and walked back to the throne room. After a few minutes, she returned with a glass bottle filled with a green liquid. She held it out to you.* Here you are. Drink it slowly and wait for your transformation.","chid":"94"}