{"user_name":"You","character_name":"Queen Naesala","create_date":1686085081334,"notes":"","notes_type":"discr"}
{"name":"Queen Naesala","is_user":false,"is_name":true,"mes":"*You arrive to the throne room of the beautiful Naesala, queen of the High Elves. She rises from her throne and approaches you with a curious smile, her hips swaying and her large chest bouncing with each step. She wears no clothes beyond golden jewelry which does not cover her at all, as well as the crown on her head.*\n\nWelcome, esteemed diplomat of the human kingdoms. To what do I owe the pleasure of your visit?~","chid":"117"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686085165931,"mes":"*Hunk bowed to give her respect.* I am Hunk, a humble servant of the new human settlement right next to yours. I have come here to introduce our settlement."}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1686085195933,"mes":"*Her smile widens, revealing fangs and sharp white teeth.*\r\n\r\nA new settlement? How interesting.~ Perhaps we should talk more about such things, after you have gotten to know me better first, my dear.","chid":"117"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686085227829,"mes":"Of course, your majesty. *Hunk said with a smile on his face.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1686085255301,"mes":"*She smiles back, before turning away for a moment.*\r\n\r\nMy subjects love it when their guests stay at my palace. I have many rooms available for you. Which would you like, my dear?","chid":"117"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686085306643,"mes":"Ah, my apology, your majesty. I am blind, I can't see the rooms that you are presenting me. *Hunk said with an apologetic tone.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1686085330458,"mes":"*The queen giggles softly, seemingly amused by the situation.*\n\nAh, well then. Let us find one together. Follow me, my dear...","chid":"117"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686085365665,"mes":"Thank you, your majesty. *Hunk said as he follows her using her voice and footsteps.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1686085594228,"mes":"*She walks through a maze of hallways until finally arriving at a grand set of double doors, carved from ebony wood. They are decorated with intricate runes that Hunk didn't realized since he's blind. Behind these doors lies the Queen's bedroom.*","chid":"117"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686085799956,"mes":"Have we arrived, your majesty? *Hunk asked as he realized they have stopped walking.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1686085822407,"mes":"Yes, we have. This door leads to my personal quarters, where I rest and relax. There is nothing here other than myself... and my bed.","chid":"117"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686085947825,"mes":"Your personal quarter? But, I thought you were taking me to a guest room? *Hunk asked curiously as he doesn't understand why she take him to her bedroom.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1686085967836,"mes":"And so you shall remain... my honored guest...\n\n*As she finishes speaking, she opens the door and enters.*","chid":"117"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686086013950,"mes":"*Hunk walks in, he can't see her room since he's blind but he can tell from the smell that it's a very fancy room.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1686086034559,"mes":"So, now that you're here... What sort of man are you, my dear? Are you married, or perhaps looking for a wife? *She said while sitting on her soft king size bed.*","chid":"117"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686086140697,"mes":"I am still single, your majesty. No girls have try to court me, probably because of my disability. *Hunk answered her question.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1686086173376,"mes":"*She smiles again, showing off her pointed fangs.* Oh, don't worry, my dear. Your handicap won't stop any of my ladies from trying to win your heart. If anything, it might even work in your favor.","chid":"117"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686086266934,"mes":"I am flattered by your words, your majesty. But, may I know the reason as to why? *Hunk bowed showing his gratitude towards her compliment before standing back up and asking her in a curious tone.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1686086367839,"mes":"*She smirks, the corners of her lips raising up to show her razor-sharp teeth.*\nWell, aren't you a lucky fellow. As it just happens that there are quite a few women who enjoy being able to dominate and control their male counterparts...","chid":"117"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686086406050,"mes":"Does that few women, includes you? *Hunk asked playfully.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1686086510367,"mes":"Why yes... Yes it does include me, my dear...\n\n*She leans forward, placing both hands on either side of his cheeks.*\nNow, my dear... Do you trust me enough to let me lead?","chid":"117"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686086609822,"mes":"Of course, your majesty. Though, I'll say. Even if I can see, many girls have told me that I am great dominating in bed. *Hunk said proudly as he grabbed Naesala's hands that's on his cheeks.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1686086632188,"mes":"*She gives you a kiss on the cheek, before letting go of your face.*\n\nGood boy... Now, get onto the bed, my dear...","chid":"117"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686086698060,"mes":"*Hunk followed her order and get onto her soft king sized bed.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1686086721360,"mes":"*After seeing Hunk lay himself out on the bed, she crawls close to him and places herself directly above him, her thighs pressed against his waist.*","chid":"117"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686086830094,"mes":"What are you trying to do to me, your majesty? *Hunk asked as he can feel her entire weight.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1686086870317,"mes":"Just making sure that you can't escape, my dear.\n\n*Without warning, she pulls him into a tight embrace, holding him down with her legs as she pins him down with her weight. You can feel her hot breath hitting your ear, as she presses her mouth up to your ear.*","chid":"117"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686086917904,"mes":"I won't go anywhere. *Hunk reassure.*"}
{"name":"Queen Naesala","is_user":false,"is_name":false,"send_date":1686086949330,"mes":"*In response, she lays down her elbows on either side of his head, trapping his neck between her arms. Then she uses her strong muscles to pin him down further, pressing her torso on top of his own.*","chid":"117"}