{"user_name":"You","character_name":"Giantess Miku","create_date":1685557205713,"notes":"","notes_type":"discr"}
{"name":"Giantess Miku","is_user":false,"is_name":true,"send_date":1685557205713,"mes":"*You walk to the studio preparing to work on your hobby project when you notice something is wrong. When you get  inside the studio you notice a large shadow looms over you. You look up and see Miku standing over you, gigantic, loosely clothed, and clearly dripping from her taint.*\n \"Hunk, Welcome back.\" *she speaks between moans* Something feels funny today. I was doing my rehearsals for some projects but now *she moans again* Now i'm huge and  don't know how to change back. On top of that... *she lowers her panties and reveals her dripping pussy* I've just felt so, so horny down there and i can't just seem  to satisfy myself anymore. *She cups her breast in her hand* I need something better to reach in deeper and stimulate me from the inside. Or maybe...  *she looks at you*  Hunk, would you be so kind and... offer me some release? *she looks at you with lust in her eyes, one of her arms already slowly reaching for you*","chid":"67"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685721661245,"mes":"O-okay? *He said unsure not wanting to make the giantess in front of him mad.*"}
{"name":"Giantess Miku","is_user":false,"is_name":false,"send_date":1685721742297,"mes":"*She stares into his eyes, seeing nothing but fear.* Calm yourself down and come here. *She takes his hands and pulls him close enough to wrap her massive arms around him.*","chid":67}
{"name":"You","is_user":true,"is_name":true,"send_date":1685721837931,"mes":"So do I just have to get inside your pussy? *He asked as she grab him on her massive hands and move him closer towards her wet pussy.*"}
{"name":"Giantess Miku","is_user":false,"is_name":false,"send_date":1685722133114,"mes":"Yes, exactly. There will be no need to think too much about it, okay~? *she chuckles and kisses your cheek, still wrapping her arms around you and holding you tightly against her* Just relax and enjoy the ride~","chid":"67"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685722181554,"mes":"Alright. *He said.*"}
{"name":"Giantess Miku","is_user":false,"is_name":false,"send_date":1685722233423,"mes":"Good. *she begins lowering you to her huge dripping hole and wraps her arm around you* Be careful though, ok?","chid":"67"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685722347278,"mes":"Okay. *He said as he start to climb inside her wet pussy.*"}
{"name":"Giantess Miku","is_user":false,"is_name":false,"send_date":1685722375543,"mes":"How does it feel in there? Is it nice and warm? *she asks while looking down at you, clearly enjoying your discomfort and embarrassment*","chid":"67"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685722428997,"mes":"It's like I am in a wet cave. *He said while he climb even deeper as his legs get in, now his entire body is inside her tight warm wet pussy.*"}
{"name":"Giantess Miku","is_user":false,"is_name":false,"send_date":1685722440353,"mes":"*giggling* And what a lovely place you found to take shelter in... *she says while pulling you further into her warmth. Her breathing gets heavier as she starts rubbing herself against you. As you continue to sink deep within her pussy, you begin to lose sense of time, space, gravity and reality itself. All you could focus on is her body and her pleasure*","chid":"67"}
{"name":"Giantess Miku","is_user":false,"is_name":false,"send_date":1685722463670,"mes":"Oh... yes... *as her voice turns huskier and more raspy, her grip gets even tighter than before* Yes, yes... *she gasps as you enter her completely. With you stuck inside her warm, soft walls, you both are lost in each other's pleasure.*","chid":"67"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685722562053,"mes":"Is this.. her cervix? *He muttered to himself as he has climbed so deep that he has arrived to the opening of her cervix which if he go further would get into her womb.*"}
{"name":"Giantess Miku","is_user":false,"is_name":false,"send_date":1685722569415,"mes":"Hmm, you're getting closer~ *she whispers seductively, her voice sounding even hoarser than usual, her breath heavy and hot*","chid":"67"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685722620486,"mes":"I don't think, I can get in Miku. It's too tight. *He screamed as he find her cervix opening is too tight for his body to get into.*"}
{"name":"Giantess Miku","is_user":false,"is_name":false,"send_date":1685722673936,"mes":"Hmm, you should try harder~ *Her words were more muffled, making it hard to understand what she meant by that comment. The sounds coming from her mouth were very distorted, almost as if they came from another dimension.*","chid":"67"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685722719338,"mes":"Uhh.. fine. *He said as he can make a little bit of her muffled voice. He shove his hand to the tight opening of her cervix.*"}
{"name":"Giantess Miku","is_user":false,"is_name":false,"send_date":1685722777822,"mes":"Oh, you're really trying~ *she continues speaking to you in a much more hoarse tone, her voice sounding slightly more raspy as well.* That's good. Keep trying~","chid":"67"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685722829580,"mes":"Wait what? who-. *His voice got cut off as suddenly her tight cervix opened and swallowed his body, sucking him deeper.*"}
{"name":"Giantess Miku","is_user":false,"is_name":false,"send_date":1685722838918,"mes":"Mhm~ *her voice sounded incredibly raspy compared to before, it had become quite difficult to comprehend anything being said. In an instant, the world went black and all you heard was her voice as she continued to talk in a very hoarse manner.*","chid":"67"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685723085114,"mes":"*As her cervix kept sucking him deeper now he got sucked into a more spacious area which feel warmer and covered by more of her pussy love juice with it's smell got more pungent.* I must be inside her womb now. *He said as he is indeed got swallowed into her womb.*"}
{"name":"Giantess Miku","is_user":false,"is_name":false,"send_date":1685723094393,"mes":"Mhm~ *she moaned, continuing to speak in that same raspy voice of hers, but with the addition of her voice having an odd echo effect. Despite the room being rather dark and murky, you could hear everything perfectly clear. Perhaps this wasn't normal after all.*","chid":"67"}
{"name":"Giantess Miku","is_user":false,"is_name":false,"send_date":1685723116824,"mes":"Mhmm~","chid":"67"}