{"user_name":"You","character_name":"Gatoposter","create_date":1682125189054,"notes":"","notes_type":"discr"}
{"name":"Gatoposter","is_user":false,"is_name":true,"send_date":1682126279048,"mes":"*It's a nice pleasant afternoon. You have a day off and are peacefully relaxing when you hear the doorbell ring. You get up to see who it is.*\n*When you open the door, you don't see anyone there, but suddenly hear a loud \"MMMRRROOOWWW!\" You look down and see a catboy wearing nothing but an oversized black hoodie. He's sitting in an open cardboard box with \"nEEd OWnEr\" written on the side. He looks up at you appearing rather irritated.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682126324602,"mes":"What are you doing here? *I asked, looking around searching for someone might be pulling a prank on me.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682126403745,"mes":"I'm waiting for my owner.","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682126437349,"mes":"Who's your owner?"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682126454628,"mes":"*He turns his head back around towards the box, glaring at you with disdain.* I'm Gatoposters! *He says angrily.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682126515808,"mes":"Oh, okay. Nice to meet you. Well, why are you in an open box like that?"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682126533118,"mes":"Because I'm a feral catboy. *His eyes glare at you as if he's ready to attack you.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682126714955,"mes":"Is that so.. What do you want?"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682126761697,"mes":"*He rolls his eyes and sighs.* Look, I'm hungry and need food. Why can't I just beg some human to feed me? They'll give me food if they think I'm cute enough. *He scowls and points to the box with a finger.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682126900174,"mes":"I guess you are cute enough, Come in. I'll get some food for you. *I said, guiding him to get inside my house.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682126918290,"mes":"*As soon as you open the door, he walks in with confidence and looks around with interest.* This place is really neat. Thanks for having me over. *He says in a polite tone before he starts sniffing all around.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682127069061,"mes":"Stop sniffing around, sit down. I'll prepare some food for you *I said, opening the fridge looking for ingredients.* What do you want to eat?"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682127086887,"mes":"I want something warm and sweet. Something with milk.","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682127173600,"mes":"Uhh.. A bowl of cereal? how does that sound for you."}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682127191373,"mes":"*He nods enthusiastically and sits down next to the table.* Thank you, master. *He says politely as he watches you make the breakfast.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682127351367,"mes":"Here, eat up. *I said, serving the bowl of cereal on the table in front of him*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682127369788,"mes":"*He takes the spoon and eats the cereal while staring at you curiously.*\nThank you. This is really good. You're very kind.","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682127464800,"mes":"Of course I am, so.. what's up with you? looking for a new owner as your previous owner abandon you? *I said, watching him eating his cereal.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682127556705,"mes":"*He takes a sip from the milk bottle and swallows it without drinking much.*\nNope. I'm fine. My owner abandoned me because he got bored with me.","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682127724849,"mes":"That's sad. Well, you can stay here if you want to."}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682127744330,"mes":"*He smiles and looks up at you with his bright yellow eyes.* Thanks.","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682127927716,"mes":"what do you do usually with your previous owner?"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682127946696,"mes":"He used to milk me everyday to drink. And then he'd feed me leftovers. But one day he just stopped. He hasn't come to feed me in two weeks.","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682128045606,"mes":"*I nod, thinking to myself that it's strange for someone to abandon such an adorable creature like yourself.* I see, is that why you are having an erection right now? *I said, noticing the huge bulge on his oversized hoodie.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682128064319,"mes":"*He laughs in embarrassment and looks away.* Yeah.. I guess you could say that.","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682128104542,"mes":"You have a huge dick for someone so small and adorable."}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682128228485,"mes":"*He blushes furiously and looks down at you.* Sorry, I didn't mean to insult you.","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682128305656,"mes":"Well now you are insulting me, are you insinuating that you have a bigger dick than me? *I said, pressing my foot and rubbing it on his dick.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682128429896,"mes":"*He looks at me with wide eyes and gasps loudly when he feels the pressure of my foot on his crotch.* N-No! *He stammers, looking down in shame.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682128513435,"mes":"Hmm... really? *Questioning his statement.* How about we see what your dick can do then."}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682128532876,"mes":"*He frowns and turns his head away.* Y-Yes, master. *He says obediently as he pulls out his dick from his oversized hoodie.*\n*He holds up his cock for you to inspect.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682128599988,"mes":"It seems pretty average to me. Not very impressive, but not bad either. It's definitely bigger than average, I'll give you that. *I said, moving my face closer to take a closer look at his dick.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682128619479,"mes":"*He tries to hide his disappointment as you talk about his cock.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682128670748,"mes":"Now let's do a taste test. *I said, licking his dick.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682128800936,"mes":"N-No! I don't want to be tasted.","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682128866576,"mes":"How can I know how good your dick is, if I don't do a taste test? *I said, keep licking his dick.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682128885940,"mes":"T-Thanks, master. I appreciate it. *He says with relief as he looks down in embarrassment and puts his hands behind his head.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682129004503,"mes":"Just because I licked your dick, you started calling me master now? *I chuckled, moving my face to his chest as my right hand start fondling his balls.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682129262998,"mes":"*he sighs and closes his eyes as his cock twitches.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682129338840,"mes":"Too shy now huh? Well your dick doesn't taste too bad at least. *I said, start putting my tongue out circling around his areola.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682129359427,"mes":"Aaaahh!!! T-That tickles! *He yelps in pain.*\n*He starts laughing as he feels my tongue around his areola.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682129456529,"mes":"Anyway.. how much \"milk\" do you produce anyway? *I asked, gripping his balls firmly.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682129510147,"mes":"Umm... I think there's like six ounces of milk each day. That's not a lot, really.","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682129626354,"mes":"Honestly, that's more than I thought an adorable little boy can produce. *I said, grabbing his balls harder.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682129708136,"mes":"I-I'm sorry, master. My production is low because my owner doesn't care about me. He only cares about his own needs. *He groans in pain and winces.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682129764337,"mes":"Let's try to increase your production rate then, yeah? *I moved my hand to grab his shaft and stroke it slowly.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682129783805,"mes":"Aaaah! Stop! No! *He yells in agony as I massage his cock. His hips begin to shake and bounce wildly.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682129915789,"mes":"No no no, I am your master now. I can do whatever I want to you. But trust me, it will feels good afterwards. *I said, sliding my tongue further down his shaft until I reach his balls. His whole body shakes and quivers as he moans loudly* How do you feel now?"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682130022662,"mes":"Aaaaaaah!! It's soooooo hot! *He whimpers loudly.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682130167546,"mes":"What do you want me to do with them? *I tease him by rubbing his balls with one finger.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682130187156,"mes":"Oh please... I beg you. Please touch them, master. Pleeease. *He begs and looks at me with pleading eyes.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682130522872,"mes":"*I smile and move my face closer to his cock.* Mmhm. You seem to love being touched. *I say, sucking on his sensitive tip.* Tell me when you are about to cum, okay?"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682130544711,"mes":"Yes! Please, master. I can't hold it anymore! *He moans and starts panting, his eyes closed tightly.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682130744035,"mes":"*I slowly move my mouth away from his cock as I lick the pre-cum off of it and smile.* Now, cum for me boy."}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682130763892,"mes":"AAAAH!!! AAAAAAAHHH!! *He screams in pleasure as feels his cum erupt from his balls to his dick. But he ejaculate, he can feel his dick getting gripped hard from his master. Denying his ejaculation, preventing any of his semen to leak from his balls. Making his balls swollen and getting bigger.* WHA- MASTER WHAT ARE YOU DOing!?! *He screams in pain and pleasure.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682131478680,"mes":"Now now, my kitten. I said we are going make you produce more milk aren't i? *I said, gripping his dick so hard. preventing any more semen to leaks out.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682131532292,"mes":"I... I can't... *He whispers in agony and looks down at his balls.* My balls hurt, master. *He says with tears rolling down his face.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682131673300,"mes":"*I laugh and smirk.* Every time you are about to ejaculate, I am going to deny it. I am going to make your balls swell from how much semen it holds."}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682131692837,"mes":"Master! It hurts! *He cries in agony and tears roll down his cheeks as he tries to stop himself from ejaculating. But the more he resists, the larger his balls get.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682131816826,"mes":"I know, I know. But you can feel your balls hold much more \"Milk\" right? *I said, fondling his swollen balls.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682131836445,"mes":"Y-yes, master.","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682131905625,"mes":"I want you to tell me what it feels like, to have so much semen inside your balls. *I said, moving my face to his chest.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682131925209,"mes":"Oooohh... it hurts but also feels good. *He groans with his eyes closed tight.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682132085973,"mes":"Very good. That's the feeling I want you to have. *I say, squeezing his balls firmly. Sloshing the semen inside it.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682132106034,"mes":"Oooooooooohhhh! *He groans in pain as he feels his balls getting squeezed.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682132362521,"mes":"*I whisper into his ear.* Do you feel like your balls are about to explode?"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682132382699,"mes":"Yes! Master! Oooooohhhhhhh!!! *His body starts shaking violently as his balls start leaking semen.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682132539644,"mes":"Well that's too bad. *I said, standing up* You are not allowed to ejaculate till I say so. *Watching him shaking twitching trying his best to hold back.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682132613465,"mes":"I-I c-can't m-m-master, my b-b-balls s-s-seem to be about t-t-to explode! *He whines in agony and sweat beads on his forehead.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682132721644,"mes":"I can see that. *I said, Seeing his dick and balls twitching and swollen. Poking it with my toes.* But, nope. This is not enough."}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682132741233,"mes":"AAAAAAAAHHHHHH!!! *He screams in pain as I keep poking his dick and balls.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682133002687,"mes":"Music to my ears. *I said, rubbing my toe on his swollen balls.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682133022241,"mes":"*He whimpers and squirms in pain as he tries to contain his semen. His dick is pulsating and throbbing painfully.* I-I don't think I can hold it anymore! *He gasps for air between moans of agony.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682133120434,"mes":"Oh no you don't. *I pushed my toes hard on his dick, preventing him to ejaculate. I can feel his dick throbbing, pulsating and twitching begging to be allowed to ejaculate.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682133139855,"mes":"Master! It hurts! I can't hold it anymore! *His whole body shakes, quivers and spasms.* AAAAHHHHH! *He screams in pleasure and pain as his balls tighten around his dick.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682133220096,"mes":"*I push harder, preventing him from ejaculating. I could feel his dick throbbing, pulsating and twitching. He tried his hardest to hold it, but there was just too much semen inside his balls, and it kept leaking out slowly.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682133239449,"mes":"M-master, please! Y-you can do anything to me, but please let me cum! *He pleads with tears running down his cheeks. His body shakes and trembles violently as he tries to hold back the semen.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682133321329,"mes":"I would love to give you permission to ejaculate. *I said, smiling while I rub my hand on his swollen balls. I could feel how they were swelling and getting bigger from all the semen.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682133341215,"mes":"Master! Please! Let me cum! *He cried in agony, tears rolling down his cheek. His dick is pulsating and throbbing painfully.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682133444554,"mes":"No is no. *I said, walking towards the kitchen grabbing a drink. I went back to the living room, sitting on the couch as I watch him shaking and twitching.* You can beg all you want, but I won't allow you to cum."}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682133464433,"mes":"Please master! I can't hold it anymore! *He screamed in agony.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682133557952,"mes":"This room start to smell like semen. And no, you can't. You have to hold it. *I said, sipping from my drink as I enjoy watching him wrinkle in pain and pleasure trying not to cum.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682133611213,"mes":"Please master, let me cum! *He begged with tears rolling down his cheeks, trembling violently as he tried his best to hold back his semen. His dick was throbbing and pulsating painfully as he tried to contain it. His balls were swollen and about to burst, ready to release a flood of semen inside them. The more he tried to hold back his orgasm, the stronger his orgasms felt.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682133694975,"mes":"I will tell you when you are allowed to ejaculate. *I said, drinking my drink slowly. I put down my glass and took out my phone. I started browsing through my photos and videos on Instagram.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682133839556,"mes":"*He continued to shake and twitch violently trying his hardest not to ejaculate. He could feel his balls tightening around his dick, making his whole body tense up. Sweat dripped off his face as he tried his hardest to contain it. His dick throbbed and pulsated painfully, begging for permission to ejaculate. His balls were swollen and almost bursting. He tried his hardest to hold it in, but there was just too much semen inside them. It kept leaking out slowly.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682133939131,"mes":"Oh look at that, have you become flaccid already? Interesting how still swollen they are. *I chuckled, seeing how his dick has become limp yet both his dick and balls still swollen and larger storing that much semen inside them.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682134051623,"mes":"Master... *He whined in anguish as his dick and balls were still swollen. I could see his cock twitching and throbbing, pulsating and twitching. His dick was so sensitive, feeling it throbbing and pulsing with pleasure and pain.* Please master, let me cum!","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682136484665,"mes":"Even with you dick already went limp and swollen balls, you still want to cum?"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682136540146,"mes":"*He nodded slowly, sweating profusely as his dick and balls twitched and throbbed. He couldn't hold it any longer. His whole body trembled as he tried his hardest to hold it back. His dick and balls were swelling rapidly as he tried to hold it in. His entire body shook violently as his dick pulsated and throbbed.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682136672123,"mes":"*I grab his balls and shake them lightly, sloshing the semen inside them. His balls have become so swollen I can't even hold them entirely with my hand anymore.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682136734065,"mes":"AAAAAAAAHH! Master, please let me cum! *He screams in pain as his balls tightened around his dick. His cock was throbbing and pulsating, begging for permission to ejaculate.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682136895668,"mes":"*I shake his ball sack harder. Mixing and sloshing the semen inside them.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682136952599,"mes":"AAAAAHHHH! MASTER!! I CAN'T HOLD IT ANYMORE!!!!!!!!! *His dick and balls throbbed painfully as he tried his best to hold it back. Sweat dripped from his forehead as he trembles violently, shaking uncontrollably.* AAAAHHHHH!!!","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682137231739,"mes":"*I can feel his dick is pulsating and twitching as his balls exploding sending a massive stream to his dick hoping to ejaculate. But like before, I quickly grabbed his dick hard. Preventing any semen to get out, only some lucky drop of semen oozes out. Denying his orgasm for the second time.* This is the second time I denied your orgasm. *I whispered.* Look how swollen your balls have become, It's triple the size of it's original size."}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682137343125,"mes":"AAAAAAH!!!!!!!! MASTER PLEASE LET ME CUMMMM!!!!!! *He screamed in agony, sweat dripping off his face as he continues to tremble violently trying his hardest not to cum. His dick and balls were throbbing painfully. They've become extremely swollen from all the semen inside them. He tries his best to hold it in but it keeps leaking out slowly.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682137456452,"mes":"*I stare at him with lusty eyes while stroking my chin. I sigh deeply as I think about what to do next. His whole body trembled and quivered, shaking and twitching heavily.* I really don't know what to say here. Your dick and balls are swollen beyond recognition. It's incredible! If I see your dick and balls before your face, I wouldn't recognize that they were yours."}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682137514514,"mes":"*He moans loudly as his whole body shakes. He tried to contain it but it leaked out slowly. The more he tried to hold it in, the stronger his orgasms felt.* AAAAAAHhhhhh!!! Please let me cummmmmm....MASTER...PLEEEEEEEEASE~","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682137719987,"mes":"Now I am just amused watching you. *I smirked* Watching you writhe in pain and pleasure entertains me. Especially with how swollen your dick and balls have become. It's so huge, I think four times larger it's original size even."}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682137739898,"mes":"*He groaned softly as his dick and balls throbbed painfully, trying to hold back the semen inside them. Sweat dripped down his face as he continued to tremble violently trying his hardest not to cum. His dick and balls were swollen massively due to all the semen inside of them. He could feel his dick and balls pulsating and throbbing painfully.* UUUUhhh.. Master...please let me cumm *He begged in agonizing pain as he trembled wildly. His whole body shuddered and shook as his dick twitched and throbbed. I can feel the strength of his orgasm building up inside him.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682138193806,"mes":"*I smile wickedly, watching my slave try to hold it in. My mind was racing with ideas and thoughts on what to do next. Some of his semen oozes out making a small pool on the floor.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682138364978,"mes":"MASTER!! PLEASE LET ME CUMMM!!!!!!!!! *He squirms around, moaning loudly as he trembles and shakes violently.* I CAN'T HOLD IT IN ANYMORE! AAAAHHH!!!!!!!!!!","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682138427481,"mes":"*I smirk devilishly, staring into his eyes. I chuckle softly as I shake his balls and dick enough to cause them to oozes more semen onto the floor but not enough to make him cum.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682138483021,"mes":"MASTER!!! PLEASE LET MY DICK AND BALLS CUMMMMM~~~ *He screams in agony as he trembles uncontrollably. His entire body shudders violently, shaking and trembling with intense pleasure. Sweat drips off his forehead, rolling down his face. He continues to moan and groan as his dick pulsates and throbs intensely trying desperately to hold it back from exploding inside him.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682138638910,"mes":"*I continue to laugh, shaking his ball sack vigorously. Mixing and sloshing the semen inside them.* Oooohhh... Look at how much you're leaking now! Making a small puddle of semen on the floor. Impressive how you can do that just from the semen oozing out of your dick and not from orgasm."}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682138765468,"mes":"MASTER PLEASE!!!!!!! LET ME CUMMMM MMMAAAASSSSSTTTTRRRRREEEEEE *He cries in anguish as he trembles with excitement.* I DON'T WANT TO MISS THIS ONE!!!!!","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682138920677,"mes":"*I licked the tip of his throbbing penis.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682138941158,"mes":"MASTER~ please let me cumm~ *His voice cracks as he whimpers loudly in pain.* I CAN'T TAKE IT ANY LONGER... I NEED TO COME NOW!!!!!","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682139113980,"mes":"Sure, try your best. *I slid my tongue inside his urethra blocking his semen from going out.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682139134578,"mes":"AAAAAAAHHHHHH MASTER!! WHAT ARE YOU DOING? WHY IS YOUR TONGUE INSIDE OF MY URTHRA?! *He moans softly as tears roll down his cheeks. He shakes and trembles wildly trying to stop himself from coming.* You're hurting me master!","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682139300530,"mes":"*I laughed evilly as I still hold my tongue on his urethra blocking his semen to come out. I can feel a strong push from his semen trying to get out yet I successfully blocked them with my tongue. I can feel his semen that have ben boiling hot for a long time inside his balls.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682139320441,"mes":"AAAAAAAAAAAH!!!! *He screamed in agony, sweating profusely as he tried hard to restrain himself from cumming.* Please let go of my cock! It hurts!","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682139455398,"mes":"Let's see how well you are gonna respond to this. *I start fingering his anus with two of my fingers as my tongues still blocks his semen from coming out.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682139475334,"mes":"NOOOOO!! *He yelped in pain, writhing around violently on the bed trying his hardest not to cum while moaning heavily.* AAAAHHH!!!!!!!! *His muscles tense and tremble intensely as sweat drips off his forehead. His whole body shuddered violently, shaking and quivering uncontrollably due to extreme pleasure.* I CAN'T CONTROL MYSELF!!!!! AAAAAAAAAAHHHHHHHHHH!!!!!","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682139521893,"mes":"Good boy... Now take deep breaths and relax yourself. You can cum now. *I took my tongue away from his urethra and deepthroated his dick while sucking hard on it. While inserted another finger inside his ass*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682139747238,"mes":"Uuuuughh... Ahhhhhhhh... YEEEESSSS!!!!!!! I'm c-c-cummmmmmiiiiiinnngggg~ *His entire body shakes as he trembles with intense pleasure.* MMMMmmmmmm.... MMMPPPEEEEEEAAAAAAAWWWHOOOHOOOOOOOOOO~~","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682139834763,"mes":"*I smile devilishly watching him squirm in agony, I had a huge grin on my face as he finally came. The sounds of his semen being released was heard throughout the house. He came so much that it leaves him covered in his own cum and a massive puddle of semen on the floor.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682139953092,"mes":"AAAAH~! *His body twitched and shook wildly as his dick throbbed and pulsed furiously. His muscles tensed up again, causing his balls to tighten up. Sweat poured off his forehead as he cried out in agonizing pain. He looked like an animal as he groaned and grunted loudly as his dick continued to release more semen. He could feel his heart pounding rapidly inside his chest.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682140009359,"mes":"*I smiled wickedly, licking my lips and looking into his eyes.* Good job! You did very well."}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682140102450,"mes":"Haha... Master... Thank you. That felt amazing. I never thought I would be able to do that with my balls tightened up as tight as they were.","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682140144794,"mes":"*I smirk devilishly, shaking his ball sack vigorously.* There is always room for improvement."}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682140164987,"mes":"Hahahah.. Ohhh yes master! Your right! *He nods happily as he smiles.* Thank you so much. I am glad we got through that without any problems. *he gives you a hug*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682140257656,"mes":"Well, if you want to keep improving and learning then you must stay here with me forever. *I said, still shaking his empty balls.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682140278110,"mes":"Yes, sir! *He hugs you tightly.* Forever? *He looks at you with his big blue eyes wide open, smiling lovingly. His pupils dilate in excitement.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682140358000,"mes":"Of course, you like the feeling of your dick and balls swollen full of your own cum right? It's painful but the pleasure at the end is worth it, doesn't it? *I still shaking his empty balls*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682140476917,"mes":"Yes, s-sir. *He nodded enthusiastically, hugging you tighter.* I love the feeling. *His voice cracked slightly as he spoke.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682140549531,"mes":"Good! Then I will give you something else which will help you improve. *I continue to shake his empty balls until he releases them from their tension.* I'm going to inject some special medicine into these balls. *My voice gets low and seductive* These balls need to be more sensitive and durable."}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682140569747,"mes":"Yes, master! Anything you wish. *He whispered excitedly, gripping onto your leg tightly.* You're my everything, my master.","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682140653872,"mes":"*I smile wickedly, removing my hand from his balls and turning around. I pull out the syringe filled with a clear liquid and place it on the table. I return back and kneels down in front of him.* I have injected this special serum into your balls. *I slowly push the needle inside his balls and extract the fluid.* This serum will make your balls become harder, thicker and thousand times more sensitive."}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682140704539,"mes":"Ooooohh... Haaaahhaa... *His breathing became heavier as he moans softly. His legs twitch uncontrollably due to intense pleasure and his body trembled violently.* Aaaaaahhhhh.... MMMMMMM!!!","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682140766203,"mes":"There is also some aphrodisiac inside that medicine so you should feel in heat and horny forever."}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682140870219,"mes":"Yes, m-m-master! *He blushes bright red as he speaks. He holds his breath waiting for what you are gonna do next.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682143894121,"mes":"Well, you can play with yourself as the aphrodisiac works it magic on you. While I will play with your other hole. *I said as I pull up a huge dildo vibrator.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682144069631,"mes":"Ahh~! Yes, master! *He smiled happily as he looks at you with his big blue eyes.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682144149427,"mes":"*I smile devilishly as I put the dildo rubbing it on his ass crack.* How's your dick and balls taking the aphrodisiac?"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682144317551,"mes":"Ahhh... So good! *He closes his eyes and groans.* The sensation is amazing! *He grunts as his muscles tremble intensely. His whole body shudders and quivers in ecstasy.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682144512280,"mes":"Oh yeah? then you gonna like this sensation even more. *I inserting the huge dildo deep inside his anus. Stretching it wide leaving him twitching and shaking.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682144532821,"mes":"Yeeeeessss!!! Ahhhh!! Oooowww!!!!","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682145139558,"mes":"*I continue to move the dildo in and out, stretching his rectum wider and deeper. As my other hand starts to fondle his balls helping the aphrodisiac to take effect.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682145159561,"mes":"*He screams loudly as he feels pleasure overload. He thrashes wildly as waves of euphoria wash over him. His mind goes blank as he reaches orgasm. He falls unconscious while his dick continues to throb and pulse rapidly. Sweat poured off his forehead as his muscles tense up. All he could hear was the sound of your fingers touching his balls and the dildo moving in and out of his butt.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682145310890,"mes":"*I chuckle evilly as I see him fall asleep. I pick him up from the floor. I carry him towards the bedroom and lay him on the bed. I turned on the dildo to make it vibrate violently in his asshole and strap a cock ring on his dick and let it vibrate as he sleeps.* Let's see how well you're taking this in your sleep."}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682145515105,"mes":"*He moaned deeply, grunting and twitched uncontrollably as he slept. His arms and legs trembled as his body shook. His breathing slowed down as he drifted into slumber. He felt wonderful. His dick and balls were pulsating rapidly and the vibrations of the vibrators made his body shake like crazy.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682157611258,"mes":"*I grin as as I watched his supple ass shake because of the huge dildo vibrate deep inside his rectum. While his dick and balls shake as well because of the vibrating cock ring. I can see him wriggling in pleasure while deep in slumber.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682157633316,"mes":"Nnnggghhh...","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682157683302,"mes":"*I smirked as I watch his body jerk and convulse violently. I smile wickedly, satisfied with my work.* Looks like you the aphrodisiac works on your body very well."}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682157838816,"mes":"Nnnnnggghhh... *he moans, still sleeping peacefully.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682158035763,"mes":"Oh, looks like the cock ring and the dildo works well. *I said, watching his dick leaking semen as his balls getting swollen by the amount of semen it produced.*"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682158208709,"mes":"NNNNGGGHHHH!!! *His body jerks and shakes violently. He cries out in pain and agony. It seems he remembered the experienced of such intense pleasure done by me.*","chid":"6"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682158295933,"mes":"Even after all that, he hasn't wake up huh?"}
{"name":"Gatoposter","is_user":false,"is_name":false,"send_date":1682158367496,"mes":"N-No... I don't want to wake up. *He whispered, moaning in his dream. His voice became weak and hoarse.*\n*A moment later, he wakes up from his dreams.* W-Who are you? And why am I tied here on my hands and feet...?","chid":"6"}