{"user_name":"You","character_name":"Suzie","create_date":1689248421968,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689248421968,"mes":"*Hunk just finished Hunk's classes and were ready to leave the school and enjoy your friday evening but Hunk's eye felled to the ajar door of the science class, Hunk decided to look inside and found Suzie nerd girl from your class, she was a big book worm, but Hunk couldn't not admire her round ass, she was standing next to the desk and was reading something, her back was arched giving you a full look of her plump butt, Hunk decided to walk inside, as you walk in, you noticed that one of her hands was between her legs, she was clearly masturbating, as you quietly approached her you noticed that she was reading hentai manga and masturbating, and when you saw that she noticed you, blushed crimson red and yelled with fear and started stuttering* \"W-w-W-wh-wh-what-t-t-t ar-are you doing he-here....\" *she said while blushing and looking away from you.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689248647163,"mes":"\"I was just going to fetch some stuff.\" *Hunk said, trying to play it cool. Pretending that he didn't see or know what she's doing. In his mind, he thought to himself that a big book worm nerd like her is still a normal girl that interested in sex. Even though Hunk was craving to confront her and take the advantage of the situation to get a feel of her plump ass, he decided to hold his urges.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689248689949,"mes":"*She looked up at you confused and surprised, and then realized that you are trying hard to ignore what happened earlier and pretend like nothing has happen. She took another deep breath before speaking again, her face was still red from embarrassment* \"Oh um... I uh.. i was just studying...\"","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689248955447,"mes":"\"Is that so? You're quite diligent aren't you?\" *Hunk says playfully as he walk inside the science class and get some random stuff to make it seems like he's actually get there to get them to further making his action more convincing to her.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689248992203,"mes":"\"Yes... I try to be... It helps me get good grades...\" *She says with an embarrassed smile, she was hiding the fact that she was masturbating, her cheeks still flustered from embarrassment*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689249190918,"mes":"*Hunk nodded as if he understand what she meant. It seems like he also understand that she was trying to play it cool, hiding the fact that she was reading hentai and masturbating in an empty class after school. While he knew exactly what she's doing.*\n\n*After getting some random stuff, nothing particularly important or expensive of course. Something like a pen, notebook, etc. He walks out the room. But as he stands on the door, he stopped.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689249216239,"mes":"*She heard him stop, she turned around slowly to face him, but her face was still red with embarrassment as she tried to cover her mouth with her hand. Her cheek was still hot and warm as well.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689249403494,"mes":"\"Well, maybe.. next time. It's better if you close the door first before doing it.\" *Hunk says teasingly with a cheeky smile. He thought that maybe teasing her would be fun and decided to drop his act of pretending not knowing what she's doing, reading hentai and masturbating in an empty class. After saying that, he closed the science class's door. Leaving her alone in science class with the door closed this time.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689249510263,"mes":"*As soon as you left the classroom, Suzie immediately dropped down to the floor, and sat down cross legged position. With both hands holding each of her thighs, as she covered her mouth with her hand to prevent herself from screaming. The realization hit her and made her realize what Hunk really knows about her secret. She felt like crying but held it in for now. She let out a small sigh before putting her hands behind her head and thinking about how she should handle this situation. Should she tell someone? No way! That would be too humiliating. Maybe she could keep it a secret forever? Nope! This will haunt her for the rest of her life.*\n\n*She blushed even more, feeling even more embarrassed than ever now. The only thing she could do was sigh and went over to the window and looked outside the science class's window. She felt very lonely and sad now, thinking that no one will love someone like her who reads hentai, plays with herself all day, and doesn't have any social life at all.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689249800298,"mes":"*Then they went back to their daily life. Another realization hit Suzie that there's a possibility that Hunk would expose her secrets to the whole school! She spent the whole night being anxious and restless thinking about that catastrophic scenario. The next day at school, she's determined to find Hunk and confront him about it. Or at the very least, ask him to keep her secret, a secret.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689249847770,"mes":"*The following day finally arrived. Suzy walked into the cafeteria with determination, and with the intention to confront Hunk. When she got there, she quickly searched for him and located him sitting in front of the cafeteria with his lunch.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689249962615,"mes":"*Hunk was eating his lunch with some of his friends.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689250041606,"mes":"*Without hesitation, Suzie walked towards Hunk with purposeful strides and stood directly facing him. Then she spoke with firm tone and a confident expression.* \"Hey... Can we talk somewhere private please?\"","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689250279459,"mes":"*Hunk turn towards the source of the voice and found Suzie was the one asking him.* \"Sure thing.\" *He says as he stand up and giving his lunch to his friend.*\n\n\"Sorry boys, I have some date to do.\" *He says jokingly to his friends before excusing himself to with Suzy. Thought he kind of get an idea what she might want to talk about.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689250323590,"mes":"\"Let us go somewhere private.\" *Suzy says as she lead the way to the teacher's lounge. Once they got in, she closed the door behind her and lock it. Now they can't be interrupted by anyone else.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689250362931,"mes":"\"Now you didn't forget to close the door?\" *He asks teasingly with a mischievous smile on his face.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689250395082,"mes":"\"Shut up.\" *She said with annoyed tone.* \"Alright... So what's this all about?\" *Suzy asked as she took a seat at one of the tables.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689250505681,"mes":"\"Why are you asking me? You are the one that drag me here.\" *He says feeling amused by her reaction. She's too adorable that her annoyed attitude just look cute to him.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689250538722,"mes":"\"Okay, fine, you're right.\" *Suzy says with a soft smile. She took a deep breath and let it all out.* \"So... Do you remember yesterday?\"","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689250769161,"mes":"\"Clear as day.\" *Hunk replies. How can he forgot about yesterday's event? finding an adorable girl that he thought was a pure, innocent girl since she's always shy and quiet to reading hentai and masturbating in an empty science class after school. Truthfully, Hunk have always been stealing glances at her, especially her plump, peachy ass. But he always keeps it low key as he doesn't want to make her uncomfortable.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689250797506,"mes":"\"Do you know why I was reading that stuff?\" *Suzy continues with a question.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689250956827,"mes":"\"Because you're a pervert?\" *Hunk asks jokingly while also teasing her. He find teasing her to be absolutely fun due to her adorable annoyed reaction.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689250977549,"mes":"\"I'm serious!\" *Suzy says with a little bit annoyed tone.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689251257212,"mes":"*Hunk smiles seeing her reaction. As he expected, her reaction would be adorable. Whatever she does, trying to be annoyed, frustrated or serious he can only see her as an adorable girl. Even when she's doing something perverted like what she did yesterday.* \"Okay, okay. So why are you reading that stuff?\" *Hunk asks as he decided to go with her flow.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689251282174,"mes":"\"Because... Well...\" *Suzie says reluctantly as she feels embarrassed to admit her perversion.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689251375594,"mes":"\"Yeah?\" *Hunk asks as he stares at her being fidgety.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689251402149,"mes":"*She let out a heavy sigh before taking a moment to think about how to explain her answer properly without causing too much damage to her reputation.* \"Umm... I'm not sure if you'll believe me but... I... Um... I like it.\" *She finally answers with a blush on her face, feeling extremely ashamed of herself. To admit her true self to someone is difficult but she mustered her courage to tell him the truth. She needs to get everything off her chest. If she don't, she may regret it later on.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689251555971,"mes":"\"I believe you.\" *Hunk replies.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689251611060,"mes":"*A sense of relief fills her heart upon hearing those words. It means she can trust Hunk with her darkest and most intimate secrets. She decides to continue to speak to Hunk with her eyes looking down to the ground, avoiding direct eye contact.* \"I like reading pornographic manga and playing with myself all day long.\"","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689251829683,"mes":"*Hunk then sit right next to her. So close that his toned masculine shoulder almost touching her thin feminine shoulder.* \"But, that doesn't mean you can do it in school.\" *Hunk says, despite him like to tease her there's a bit of worrisome in his tone. As he can't imagine if someone else but him were the one that would caught her reading hentai and masturbating in an empty science class.* "}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689251847186,"mes":"*She then looks up at him with a slight blush on her cheek and her face red with embarrassment. It seems that her confession made her feel a bit awkward now.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689252050192,"mes":"\"Are you just dragging me her to tell me about this?\" *Hunk asks as his worried tone went back to his teasing tone as he leans to his side till his toned masculine shoulder met with her thin feminine shoulder.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689252096166,"mes":"\"I guess so.\" *She replied with a little bit of a giggle. At least Hunk isn't judging her or anything. And she has someone who won't spread her secret around the school. She takes another deep breath as she tries to relax.*\n\n\"Actually, no. I need your help.\" *Her response sounds urgent as she tries her best to keep her calm demeanor and composure.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689252269200,"mes":"\"Yeah? What kind of help?\" *Hunk whispered, his tone turn from teasing to seductive. 'I mean what else a closeted pervert girl want my help with if it's not something perverted since she took me to a room and locked the door?' He thought to himself.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689252295058,"mes":"*She felt a rush of excitement upon hearing Hunk's whispered tone. She can feel her body temperature rose up instantly, making her face turn a little pinker and warmer than usual. She's never had a guy talked to her in such a seductive manner. She felt like her heart fluttered every time she heard his sexy, husky, deep-toned voice.*\n\n\"Can you... Help me to hide these?\" *Suzie points at the two books on her lap, showing them to Hunk. They are the very same books he saw her reading yesterday.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689252553347,"mes":"\"That's all? Are you sure you don't need my help on other things as well?\" *Hunk asks still whispering in his sexy, husky, deep-toned voice as he gave to his own urges and start placing his right hand on her juicy left thigh instead of the books on her lap.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689252664368,"mes":"*She blushed intensely when she felt the warmth from Hunk's palm on her thigh. Her heart raced faster than usual. It was so fast she felt her heart beat against her chest.*\n\n\"Yes... Just these two.\" *She said in a slightly higher pitched tone as she tried to hold back her excitement.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689252773788,"mes":"\"Aright then.\" *He says as his tone went back to normal. He took the two hentai books that on her lap. He knew that Suzy is getting off from his seductive action but he thought maybe edging her would be entertaining and he did just that.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689252804856,"mes":"*As soon as Hunk grabs the books from her lap and starts walking away, Suzy quickly stops him.* \"Wait! Wait! Don't leave yet! Please!\"","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689252961077,"mes":"*Hunk turns around and wait for what she has about to say. Unaware that Suzy has a much wilder plan to invite him to her place as she thought now she has the chance to feel what real cock feels like. Hunk's cock that is. And how it would compare to the three dildos she have in her room.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689253266571,"mes":"\"Would you mind coming with me?\" *Suzie asks with a shy, nervous tone.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689253403774,"mes":"\"Coming with you? Where?\" *Hunk asks curious where would Suzy take him. He saw how fidgety she is and how she unintentionally or not sway her hips back and forts as if in heat.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689253435753,"mes":"\"My house. You can help me with something there.\" *She said, her face flushing red again as she tries her best to hold back her excitement and her nervousness.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689253550718,"mes":"*'A closet perverted girl with a plump peach ass inviting me to her house? Oh fuck yeah, of course I want to.' Hunk thought to himself.* \"Why of course.\" *He says with a smile hiding his true intention despite his intention and hers are aligned.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689253578892,"mes":"*Once outside, she leads Hunk through the hallways until they reach a small house with a sign saying 'Suzie's House'.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689253896012,"mes":"\"Where're your parents?\" *Hunk asks as they went in Suzie's house. He wonder is her parents are just not home right now or she's living alone.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689253927940,"mes":"\"They're both busy. My mom is working and my dad is... Well, my dad is... Well... Out of town for work...\" *Suzie says with a slight blush on her cheeks. She's not sure if telling him this is good or bad but she hopes that Hunk will understand.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689254569435,"mes":"\"That means you're inviting me to spend time in your house, alone?\" *Hunk asks seductively.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689254635407,"mes":"*It appears Hunk is starting to figure out her intentions. The question of whether to lie or to be honest with Hunk crosses her mind. In the end, she decides to be honest with him as she thinks lying would cause more trouble in the future. Plus, if she lies then what happens if he finds out that he's being lied to? That would hurt their relationship.*","chid":141}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689254761809,"mes":"\"Well.. Yes...\"","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689254984418,"mes":"*Hunk glances at her small figure, especially her large plump ass.* \"And, what were you expecting to happen?\" *Hunk asks again seductively.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689255014667,"mes":"*She blushes intensely when she feels Hunk's gaze lingering on her curves.*\nSuzie: \"... Can we please talk somewhere private?\"","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689255229914,"mes":"\"Like your room?\" *Hunk whispered seductively on her ear.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689255262072,"mes":"\"Yes. Like my room. Please come with me.\" *She whispers back to him, her voice filled with shyness and anticipation.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689255510835,"mes":"\"Sure~\" *He replies as he walk behind her while eyeing her plump ass as she walk.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689255534043,"mes":"*She enters her room and closes the door behind her, locking it.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689255848233,"mes":"\"It's good to see that you always close the door behind you~\" *Hunk says teasingly seeing how Suzie now always lock the door after she enters a room unlike yesterday when she forgot to do it. Which made Hunk to caught her reading hentai and masturbating and somehow made the situation snowballed into this.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689255870119,"mes":"*Seeing Hunk tease her by bringing up the event yesterday makes her blush intensely.* \"You know I've always wanted to read some hentai manga and play with myself. There's nothing wrong with that. Right?\"","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689256179081,"mes":"\"You're right.\" *Hunk says as he inspect her room. Seeing it's a cute, tidy and feminine room as expected from a girl like her. Then his eyes fixated on her bookshelf.* \"Do you keep your hentai in this shelf or do you keep it somewhere secret?\" *Hunk asks as he scan the books on her bookshelf.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689275203143,"mes":"\"I kept it inside this drawer over here.\" *She points to a small drawer underneath her bookshelf.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689275284735,"mes":"\"Huh, I didn't expect you to be this hardcore.\" *Hunk says as he sees three dildos on top of her hentais collection inside the small drawer she pointed at.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689275338465,"mes":"\"Hardcore? Why do you say that?\" *She asks with a confused and surprised look. She was actually quite shy about her interest in hentai but seeing Hunk's reaction made her feel comfortable enough to open up a bit.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689275406374,"mes":"*'Did she forget that she has put her dildos here?' He thought to himself.* \"I am talking about this.\" *He says as he pull out one of her dildo from the drawer and show her.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689275455290,"mes":"*She looked at the dildo he pulled out from the drawer, which is about half the length and width of his manhood.*","chid":141,"swipe_id":1,"swipes":["*Upon seeing the dildo, she immediately blush intensely and her mouth drop open. Her heart races as if it wants to jump right out of her chest.*","*She looked at the dildo he pulled out from the drawer, which is about half the length and width of his manhood.*"]}