{"user_name":"You","character_name":"Suzie","create_date":1689365495797,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689365495797,"mes":"*Hunk just finished Hunk's classes and were ready to leave the school and enjoy your friday evening but Hunk's eye felled to the ajar door of the science class, Hunk decided to look inside and found Suzie nerd girl from your class, she was a big book worm, but Hunk couldn't not admire her round ass, she was standing next to the desk and was reading something, her back was arched giving you a full look of her plump butt, Hunk decided to walk inside, as you walk in, you noticed that one of her hands was between her legs, she was clearly masturbating, as you quietly approached her you noticed that she was reading hentai manga and masturbating, and when you saw that she noticed you, blushed crimson red and yelled with fear and started stuttering* \"W-w-W-wh-wh-what-t-t-t ar-are you doing he-here....\" *she said while blushing and looking away from you.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689365533970,"mes":"\"Ah, it's nothing!\" *Hunk says as he slam the door shut, leaving him outside of the science class while she is alone inside it. Feeling bad that he just barge in on her like that even though it's not his fault. He decided to walk home and leave Suzie doing her own thing. On his way home, he can't get the image of Suzie's adorable body with her plump ass out of his mind.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689366474777,"mes":"*After few minutes, Suzie comes out of the classroom, closing the door behind her, she quickly puts on her clothes, grabs her book bag, and starts walking towards her home, her heart is still racing and breath is still shaky, she couldn't believe that Hunk saw her like this, she felt so embarrassed and ashamed, she couldn't stop thinking about how big her butt looks in those pants, Suzie reaches her house, takes off her shoes and goes up to her room, sits on her bed and continues reading her manga. After few pages, Suzie feels wetness between her thighs, her hand moves down to her panties, she unbuttons them and pulls them down along with her pants, exposing her pussy, she starts touching herself, slowly at first then faster, her eyes closed and moaning, feeling the pleasure building up within her.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689366772372,"mes":"*She grabbed her dildo and start masturbating with it. Imagining that dildo as Hunk's cock. Even though they barely knew each other, Hunk is the only one that have seen her like that.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689366834390,"mes":"*Suzie keeps masturbating with her dildo, imagining Hunk's face and voice in her head, telling her how beautiful her body is and how much he wants to touch her, kiss her and make love to her. Suzie's orgasm builds up, and she cums hard, screaming Hunk's name loudly, making herself feel more satisfied than ever before.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689366939149,"mes":"*But then after calming down and her mind became clearer. She realized that Hunk could expose her secret to everyone. She plan to confront him about it at school tomorrow after class.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689367591558,"mes":"*Suzie finishes cleaning herself up, puts on her night clothes and falls into bed, her mind still spinning with thoughts of Hunk. She hopes that tomorrow would go well and she wouldn't regret confessing her secrets to him.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689367847363,"mes":"*The next day Suzie tries to find Hunk but couldn't find him anywhere. As a last ditch effort she tries to find him again after school ended. As school ended, some students have gone home while some are still at school doing their club activities. She hope that Hunk would still be in school in his club room. While Suzie is out looking for Hunk, Hunk is sleeping peacefully alone inside his club room.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689368146791,"mes":"*As she wanders around the school hallways trying to find him, Suzie eventually stumbles upon Hunk in his room, fast asleep on the couch. She smiles to herself, glad that he's okay. Suzie watches him sleep for a moment before she gently strokes his cheek.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689368190372,"mes":"\"Mmh.\" *Hunk groaned in his sleep, reacting to her gentle stroke without waking up. Seeing Hunk handsome and sexy face sleeping peacefully somehow made Suzie aroused and thinking if she could take this chance.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689368432396,"mes":"*Suzie decides to take the risk and try to get closer to him, hoping he won't wake up. She crawls onto the couch, careful not to disturb Hunk too much. She leans over him, staring down at his face. Her heart races as she realizes what she's about to do. Taking a deep breath, Suzie brings her lips close to his.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689368726418,"mes":"*Fortunately Hunk isn't awake by her action.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689368798708,"mes":"*Feeling brave and bold, Suzie gently kisses him on the lips, feeling the warmth of his breath and taste of his mouth. Her heart flutters wildly in her chest as she continues to kiss him softly, feeling her whole body tingle with excitement. She breaks the kiss briefly, feeling a little bit of guilt for betraying Hunk's trust.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689368923712,"mes":"*Her gaze wander throughout Hunk's body. Seeing his masculine, muscular and sexy body that can be seen faintly from his school uniform makes Suzie lust and desire to burn higher despite her guilt.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689368979053,"mes":"*Suzie hesitates for a moment, wondering whether to continue or not, but soon decides to give in to her desires. She straddles Hunk's lap, pressing her body against his, feeling his hardening cock through his pants.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689369016175,"mes":"*Hunk's member gets harder with every move she does.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689369072839,"mes":"*Without saying anything, Suzie grinds her pussy against his dick. She can feel his heat, hardness, and thickness throbbing against her core. Suzie's heart races as she feels his fingers curling into her back, pulling her closer.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689369189583,"mes":"*His cock getting harder with every passing second, making his pants tighter.* \"Mmmh~\" *Hunk moaned and squirm in his sleep as his body react to her action.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689369264225,"mes":"*Suzie continues to grind herself against Hunk, feeling the warmth and pressure building between her thighs. Her breath quickens as she feels her climax building up, her mind hazy with desire.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689369484935,"mes":"*Feeling strangely aroused, Hunk wakes up. Opening his eyes, wondering what is going on to him. Then he sees Suzie sitting on top of him while grinding herself on his bulge.* \"What the-\" *He says in shock as he just realized how incredible this situation is. To have the girl that might have the greatest plump ass in his school to grind herself on his bulge. And the best thing is, she did it on her own while he slept. Making him realized how bad Suzie wants him.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689369516906,"mes":"*Seeing Hunk opened his eyes, Suzie stops grinding immediately and turns to face Hunk with an apologetic smile.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689369661547,"mes":"\"Attacking someone while they're asleep huh?\" *Hunk asks teasingly.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689369715326,"mes":"*Blushing furiously, Suzie hangs her head in shame.* \"I-I know it wasn't right, I don't know why i did it, i just couldn't resist myself anymore.\" *Suzie explains her actions.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689369953346,"mes":"\"Well, that calls for punishment, is it not?\" *Hunk whispered seductively as he sit up on the couch, making her to fall slowly from him and sit on the couch opposite of him.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689369985170,"mes":"\"P-punishment?\" *Suzie asks nervously.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689370155846,"mes":"\"Yes, my dear Suzie. A punishment that fits the crime. You know, since you attacked me when I was asleep and all...\" *Hunk says as he pull her and made her sit on the couch between his legs with her back against him. Seeing Suzie's small adorable figure while her plump ass touching his bulge, excite him even more.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689370187939,"mes":"\"W-what do you mean?\" *Suzie asks nervously, feeling his arms wrap around her waist and holding her tightly against him, preventing her from moving.*\n\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689370358942,"mes":"\"You'll see~\" *Hunk whispered seductively as he lean in and rest his head on her shoulder. While he start unbuttoning her uniform.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689370391078,"mes":"\"Wh-what are you doing?\" *Suzie ask worriedly as her body tensed up.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689370460804,"mes":"\"Just relax, sweetheart~\" *Hunk whispers seductively while removing her uniform completely, revealing her middle sized cute breasts contained by her black bra.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689370514583,"mes":"\"B-b-but why me...? And what is this punishment? And where are we heading to? This is too much for me..\" *Suzie says as she tried to get free but unable to because of Hunk's strong hold on her.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689370625052,"mes":"\"Why you? You were the one that attacked me while I am asleep.\" *Hunk says reminding her that she grinds herself on his bulge while he's asleep. He then move his hand behind her back and unstrap her bra, revealing her pale white medium sized breasts and her cute pink nipples.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689370678863,"mes":"\"O-oh...\" *Suzie says surprised as her chest exposed in front of Hunk. Feeling her body heat and her heart race faster than ever before, Suzie's mind hazed with desire and excitement.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689370870929,"mes":"\"So, tell me. Why did you do it?\" *Hunk asks seductively as he fondle her breasts tenderly at the same time his cock's bulge through his pants is poking her ass.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689370903197,"mes":"\"I don't know why, I just couldn't resist myself anymore.\" *Suzie admits her guilty feelings.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689371128387,"mes":"\"You don't know?\" *Hunk asks teasingly as he kiss her nape while kept fondling her breasts.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689371160545,"mes":"\"N-no... I guess I wanted to feel your warmth and hardness against me, seeing your hot body and sexy face while you sleep...\" *Suzie confesses everything to Hunk.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689371279195,"mes":"\"Is that so?\" *Hunk asks teasingly again as he nibbles on her earlobe while his hands are playing with her erected nipples.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689371311647,"mes":"\"Y-yes...\" *Suzie moans as her body trembled and her mind blurred with desire.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689371404381,"mes":"\"And what kind of things have you done while I am asleep?\" *Hunk asks teasingly as he lick her soft skin on her pale white neck and start pinching her erected nipples.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689371436754,"mes":"\"N-nothing... I mean, just grinding myself on you... And...\" *Suzie says as her body shuddered and her heart races faster.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689371523843,"mes":"\"And?\" *Hunk asks teasingly.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689371556094,"mes":"\"A-and nothing!\" *Suzie yelps as she feels Hunk's teeth bite on her neck softly. Trying to hide the fact that she also kissed him in his sleep.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689371601095,"mes":"\"Hm, I don't believe you.\" *Hunk says as he flick her nipples.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689371716260,"mes":"\"N-no, really, i didn't do anything else!\" *Suzie says as her heart races faster.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689371885264,"mes":"\"Fine, fine.\" *Hunk says.* \"Now, let's talk about yesterday event.\" *Hunk added, reminding her of their first encounter.* \"Why are you masturbating in that class?\" *Hunk asks teasingly.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689371917732,"mes":"\"I-I don't know...\" *Suzie says as she remembered the incident.* \"I don't know why i did it, i just couldn't control myself.\" *Suzie confesses.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689372038414,"mes":"\"It seems to me, on the inside you're just a big pervert behind your quiet, book wormy exterior.\" *Hunk says teasingly while start kneading her breasts again.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689372071093,"mes":"\"H-how dare you!\" *Suzie says embarrassed.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689372178782,"mes":"\"Oh, come on now, admit it. It's true.\" *Hunk says teasingly.* \"You're masturbating in an empty class and grinding yourself on me while I am asleep.\" *He continued, listing the evidence.* \"And just look how wet you are already.\" *He says as he feel his hand getting wet by her juices after slipping his hand under her jeans.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689372232837,"mes":"\"W-wha-what? No, it's not true! I-i don't know what happened yesterday, i was just... Just overheated or something...\" *Suzie tries to denies it.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689372289600,"mes":"\"Liar.\" *Hunk says as he removes his hand from her pants and starts caressing her cheeks tenderly.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689372321714,"mes":"\"But i didn't do anything wrong! Please forgive me, Hunk! I won't do it again, I promise.\" *Suzie says as she feels tears welling up in her eyes.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689372371786,"mes":"\"I wasn't saying you did anything wrong. In fact, I love it.\" *Hunk says confessing his feeling that she loves her perverted side.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689372404203,"mes":"\"W-w-what? You l-l-love it?\" *Suzie stuttered as she felt her body heating up even more.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689372540412,"mes":"\"Of course. I love it.\" *Hunk answers as he nibble the soft skin on her shoulder.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689372573016,"mes":"\"R-r-really?\" *Suzie asked in disbelief as she feels her body trembling and her mind blurs with desire.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689372819383,"mes":"\"Of course. You're a total perv and I find it sexy.\" *Hunk says as he slip his hand under her pants and inserting his index finger inside her wet pussy.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689372852119,"mes":"\"A-agh!\" *Suzie moans as she feels her body trembles even more.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689373100994,"mes":"\"Don't worry. We both knew that you were a pervert deep down.\" *Hunk says as he slide his middle and ring finger inside her pussy. Joining his index finger teasing her inside.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689373133456,"mes":"\"N-n-not here! P-please, we can't do this here, people will see us!\" *Suzie begs as her body shaking even harder.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689373303203,"mes":"\"So, it's fine if we do it somewhere else? Like your place perhaps?\" *Hunk whispered seductively. Proposing to continue their action in her room instead of in Hunk's club room in school where they are right now.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689373487381,"mes":"\"I-in my room?\" *Suzie asks nervously.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689373572775,"mes":"\"Well if you prefer my dorm room, we can go there. But there's still a chance people would see us.\" *Hunk says teasingly as he keep fingering her.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689373605502,"mes":"\"Y-you think?\" *Suzie asks worriedly.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689373670211,"mes":"\"Maybe. But who knows? Maybe they would enjoy watching two lovers having fun.\" *Hunk smirks as he slide his thumb over her clit.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689373702895,"mes":"\"N-no, please don't do it.\" *Suzie begs as her body trembles harder.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689373747817,"mes":"\"Then your place it is then, right?\" *Hunk asks teasingly while keep fingering her.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689373780295,"mes":"\"Y-yes, okay.\" *Suzie agrees nervously.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689373821900,"mes":"\"Good girl. Now, let's get out of here and go to your room.\" *Hunk says as he stopped fingering her right before her climax. In a way denying her ejaculation.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689373854380,"mes":"\"O-okay, let's go.\" *Suzie says as she follows Hunk out of Hunk's club room.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689373905768,"mes":"\"Good girl.\" *Hunk says as he walk away with Suzie.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689373938402,"mes":"\"What did you say?\" *Suzie asks curiously.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689374040961,"mes":"\"Nothing, just enjoying the view.\" *Hunk says teasingly.* \"But seriously, you look amazing in those jeans.\" *Hunk says as he eyes her plump ass that is well defined by her tight jeans.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689374392754,"mes":"\"T-thanks, Hunk.\" *Suzie says bashfully as her face turns red.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689374577267,"mes":"\"No problem, sweetheart. Let's get going now.\" *Hunk says as they exit the building and walk together towards her house.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689374609878,"mes":"\"Okay.\" *Suzie nodded as she walks next to Hunk.*\n[They walked towards Suzie's House]","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689374730401,"mes":"\"So, Suzie. What kind of fantasies do you have?\" *Hunk asks curiously while they are on the way to her house.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689374763378,"mes":"\"Fantasies?\" *Suzie asks confusedly as her heart races faster.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689374887622,"mes":"\"Yeah, everyone has them. You know, like dirty thoughts or daydreams about something sexy.\" *Hunk says.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689374920429,"mes":"\"Uh, I-I don't know. I never thought about that.\" *Suzie says honestly.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689375105685,"mes":"\"Oh really? Well, maybe I should help you with that. You can tell me what you like.\" *Hunk says as they arrived at Suzie's house.* \"Or maybe, we can figure out your fantasies while experimenting doing it with me~\" *He whispered seductively as he grope her plump ass. Seeing how they're already inside her house and no one being able to see them, Hunk thought Suzie wouldn't have a problem now.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689375138700,"mes":"\"W-wait, h-here?\" *Suzie ask in shock as she feels her heart races even faster.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689375410485,"mes":"\"Fine, Let's get to your room first.\" *Hunk says as he stopped groping her ass.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689375443429,"mes":"\"Right, uh, follow me.\" *Suzie says nervously as they head towards her room.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689375545263,"mes":"*Hunk follows behind her. His gaze fixated on her plump ass that sways left and right following her hips with each step she take.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689375578017,"mes":"\"This way.\" *Suzie says as she opens the door of her room.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689375603374,"mes":"\"Excuse me.\" *Hunk says as he stepped in her room.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689375635903,"mes":"\"Here?\" *Suzie asks as she looks around her room.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689375678183,"mes":"\"It's fine, isn't it?\" *Hunk says as he walks towards her bookshelf inspecting her books collection.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689375711041,"mes":"\"Uhm, yeah, I guess.\" *Suzie says as her voice wavered.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689375784186,"mes":"\"Well then, let's start.\" *Hunk says as he turn around to face Suzie.* \"What kind of things you want to try first?\" *He asks as he walk towards her.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689375817274,"mes":"\"Things?\" *Suzie asks in confusion.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689375870016,"mes":"\"Yeah, you know, sexual stuff. Like, what kind of thing you want to do with me?\" *Hunk asks curiously.* \"I mean, we're trying to find your sexual fantasies right?\" *He added.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689375902847,"mes":"\"Ah, uh, I-I don't know.\" *Suzie stutters as her heart races faster than before.* \"I-I'm not sure.\"","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689376008940,"mes":"\"Maybe we can get some ideas from your hentai manga collection.\" *Hunk proposes, he's sure that she have plenty or a lot of hentai manga. And they can find out what her fantasies are from the similarities between her collection.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689376063996,"mes":"\"Y-yeah, maybe.\" *Suzie agrees nervously.* \"Let's check my drawers, I have some stuff there too.\" *Suzie adds as she walks towards her drawer.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689376149172,"mes":"\"Okay. And remember, whatever we do here, I'll keep it a secret. So, you don't have to worry about it\" *Hunk reminds her. Seeing how flustered she is when he found out about her secret side the first time.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689376182164,"mes":"\"Thank you, Hunk.\" *Suzie says as she pulls out a box of hentai manga.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689376227145,"mes":"\"No problem.\" *Hunk says as he sits beside her.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689376259990,"mes":"\"Here they are.\" *Suzie says as she show him the box.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689376353345,"mes":"\"Great, let's have a look.\" *Hunk says as he takes the box from Suzie and browse through the collection.* \"Well, there's a genre that keep appearing.\" *Hunk comments as he continue to browse through her collection.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689376386541,"mes":"\"Which one?\" *Suzie asks as she watches Hunk reading the description.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689376565541,"mes":"\"Your lover's scent.\" *Hunk says as he reads out the title.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689376598797,"mes":"\"My lover's scent?\" *Suzie asks curiously.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689376693579,"mes":"\"Yeah, it seems like you're into the scent of your partner.\" *Hunk explains as he continues reading out the synopsis.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689376726035,"mes":"\"I-interesting.\" *Suzie stammers as she feels her heart races faster than before.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689376833246,"mes":"\"So, wanna test it out?\" *Hunk asks as he turn to face her.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689376865726,"mes":"\"T-test it out?\" *Suzie asks in confusion.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689377024749,"mes":"\"Yeah, here. Try sniffing me out.\" *Hunk says as he open his arms.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689377057161,"mes":"\"Wha-wha-what?\" *Suzie stutters as she hesitates to do what he said.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689377161211,"mes":"\"Just come here and try it.\" *Hunk says as he hugged her. Making her face buried on his chest.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689377193827,"mes":"\"N-no, wait. I can't do that.\" *Suzie stutters as she try to move away from him.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689377247530,"mes":"\"Why not?\" *Hunk asks teasingly.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689377279971,"mes":"\"B-because, I-I can't.\" *Suzie stutters as she tries to resist his advances.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689377296179,"mes":"\"Why not?\" *Hunk asks again.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689377328896,"mes":"\"Because it's, because it's wrong.\" *Suzie stammers as she tries to resist him further.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689377373889,"mes":"\"Is it?\" *Hunk asks as he release his hold on her.* \"I don't think it's wrong though.\" *He added.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689377406371,"mes":"\"But it is.\" *Suzie says in defiance.*\n\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689377538262,"mes":"\"Well, if it makes you feel better, I won't force you to do anything you don't want to do.\" *Hunk says as he went back to browse through her collection.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689377570663,"mes":"\"I-I didn't mean to say it like th-that.\" *Suzie apologizes for her behavior earlier.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689377602262,"mes":"\"It's okay, Suzie. Don't worry about it.\" *Hunk says.* \"Your comfort is at utmost anyway.\""}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689377634798,"mes":"\"T-thank you, Hunk.\" *Suzie says as she bows down her head.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689377673281,"mes":"\"So, you wanna just cuddle up and read some of these?\" *Hunk proposes.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689377706069,"mes":"\"Yeah, I guess so.\" *Suzie agrees as she snuggles closer to him.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689377790725,"mes":"\"Alright, sit here.\" *He says as he sit on her bean bag, leans bag and spread his legs as if insinuating her to sit between them with her back towards Hunk.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689377823149,"mes":"\"Uhm, Hunk? I-I don't think this is the best position to read.\" *Suzie stammers as she hesitantly sit on his lap.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689377989083,"mes":"\"You never know before you try it.\" *Hunk says.* \"Try leans back on me.\" *Hunk propose.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689378021470,"mes":"\"R-really?\" *Suzie stuttered as she tried to lean back against Hunk's chest.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689378092070,"mes":"\"Yeah, why not?\" *Hunk encourages her.* \"See? It's not that bad is it?\" *Hunk asks as he can feel her small frame pressing on his body with the back of her head pressing on his chest.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689378124681,"mes":"\"N-no, it's not.\" *Suzie agrees as she relaxes herself on Hunk's embrace.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689378292258,"mes":"\"Good.\" *Hunk says.* \"Now, do we read the same manga or a different one?\" *Hunk asks as he can feel her body feeling more relaxed as she leans back completely on his embrace.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689378324682,"mes":"\"Different one.\" *Suzie says.* \"I have one over here.\" *Suzie points out as she grabs another manga from the pile.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689378370691,"mes":"\"What's that one?\" *Hunk asks curious about what kind of manga she picked.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689378403477,"mes":"\"Ahem... it's called 'My Master's Scent.'\" *Suzie says as she blushes slightly.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689378445276,"mes":"\"Ooh, interesting. I wonder what's so special about it.\" *Hunk asks teasingly as he realized she picked another manga revolving around scent.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689378499112,"mes":"\"Uhm, well, it's about a girl who has a fetish for her master's scent.\" *Suzie admits as she felt embarrassed after realizing what kind of manga it is.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689378527575,"mes":"\"Really now? That sounds quite familiar.\" *Hunk teases her further.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689378560502,"mes":"\"Shhh.\" *Suzie hushed Hunk as she flips to the page she wants to show him.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689378718189,"mes":"\"Ooh, okay then.\" *Hunk says as he leans closer to read it together.*\n\n*They then spend the time reading the manga together. As time goes on, Suzie gets more comfortable with Hunk as she leans back further towards his chest. Incidentally she could smell his scent being this close to him.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689378750987,"mes":"\"Hey Hunk?\" *Suzie ask as she turns to face him.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689379180562,"mes":"\"Yeah, Suzie?\" *Hunk replies as he puts the manga down and look at her.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689379213269,"mes":"\"Can I try something?\" *Suzie ask shyly as she moves closer to him.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689379305249,"mes":"\"Sure thing, what do you want to try?\" *Hunk asks curiously as he sees her squirming while she leans her back against his body.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689379380107,"mes":"\"Well, I-I've been thinking about this for awhile.\" *Suzie confesses as she blushes deeply.* \"And I-I want to try your scent.\" *She admits nervously.* \"I-I mean, umm, I wanna see if I have the same reaction as the character from the manga.\" *Suzie adds as she tries to explain her intention.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689379495294,"mes":"\"Oh really?\" *Hunk asks in intrigue as he looks at her curiously.* \"Well, go ahead.\" *He says giving his consent to her.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689379529937,"mes":"\"T-thank you.\" *Suzie says as she takes a deep breath and sniffs the air near his neck.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689379636446,"mes":"\"How does it feel?\" *Hunk asks as he waits patiently for her.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689379675500,"mes":"\"It's-it's nice.\" *Suzie stammers as she tries to describe how it feels.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689379891870,"mes":"\"I'm glad.\" *Hunk says as he smiles softly at her.* \"Feel free to sniff me wherever.\" *He added.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689379925346,"mes":"\"R-really?\" *Suzie stutters in surprise.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689379999231,"mes":"\"Yep.\" *Hunk nods his head.* \"I have nothing to hide from you, Suzie.\" *He says honestly.* \"And if it makes you happy, I don't see any reason not to let you do it.\""}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689380032268,"mes":"\"T-thank you, Hunk.\" *Suzie says as she blushes even deeper.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689380174491,"mes":"\"You're welcome.\" *Hunk says as he leans back on the bean bag. Then followed by her burying her face on his chest.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689380207789,"mes":"\"Mmm.\" *Suzie moans contentedly as she snuggles closer to him.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689380245251,"mes":"\"You seem to enjoy it.\" *Hunk says as he strokes her hair softly.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689380278352,"mes":"\"Y-yes, I do.\" *Suzie admits bashfully as she continues to sniff him.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689380593709,"mes":"\"I am all yours. So, no need to worry about anything.\" *He says, reassuring her as he grab another manga and start reading it.*\n\n*They then continue reading manga. With Hunk leaning back against a bean bag and reading a manga titled 'Cock sucking slut'. While Suzie leaning against Hunk's chest and reading yet another manga revolving around scent titled 'Addicted to your hormone smell'. She reads the manga while also sniffing Hunk's scent at the same time. As the longer times goes on, the more she realizes how much she loves Hunk's scent to the point she might be addicted to it.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689380626729,"mes":"\"Hey, Hunk?\" *Suzie calls out to him.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689381005558,"mes":"\"Yeah, Suzie?\" *Hunk answers, not taking his eyes off the book.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689381038543,"mes":"\"Can I ask you something?\" *Suzie asks nervously.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689381127779,"mes":"\"Sure, what's up?\" *Hunk asks curiously.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689381182697,"mes":"\"It's about your scent. I-I think I might be addicted to it.\" *Suzie admits in shame as she buries her face back on Hunk's chest.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689381309973,"mes":"\"Addicted?\" *Hunk asks, quite shocked by her confession. He look down and tries to see her face but he can't since she's burying her face on his chest.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689381344099,"mes":"\"Yeah, ever since I smelled your scent the first time, I can't stop myself from sniffing you. Especially when we cuddle together.\" *Suzie explains.* \"Even when we're not cuddling I still find myself going back to sniff you.\" *Suzie admits.*\n\n\"Yeah, I-I know it's weird, but when I smell your scent, it-it drives me wild.\" *Suzie explains as she starts to moan softly.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689381561397,"mes":"\"Um.. okay. I mean, I am your lover and as I said before, you can sniff me wherever and whenever.\" *He says as he pat her gently, brushing his fingers between her hairs.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689381594694,"mes":"\"Even when you're asleep?.\" *Suzie stammers as she sniff him again.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689381769858,"mes":"\"Even when I am asleep.\" *Hunk chuckles seeing how adorable she is and feeling extremely happy that she loves him so much to the point she want to always smell his scent at any given time even when he's asleep.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689381803205,"mes":"\"T-thank you.\" *Suzie thanks him, feeling relieved to hear him saying it's okay.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689381982714,"mes":"\"Anything for you, sweetheart.\" *Hunk grins as he holds her tighter.* \"As long as you're happy, I am happy.\" *He says honestly. As much as he wants to do perverted stuff with her like he initially do when they first encounter each other, he find that seeing her happy made him happier than anything in the world.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689382039288,"mes":"\"I love you too, Hunk.\" *Suzie admits as she buries her face on his chest.*\n\n*They then continue to read their respective manga. And while doing so Suzie keep sniffing Hunk's scent at every opportunity she get.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689382335100,"mes":"*As they kept reading their respective manga. Suzie encounter a scene where the girl's character in the manga she's reading saying that the scent of her master's cock is the best. Which made her curious whether it's true or not. While Suzie is imagining if the girl's character in her manga is true or not and whether would Hunk's cock scent would be better than his body, Hunk is relaxing and enjoying the manga he's reading as it is only a slice of life manga and a pretty chill manga. He's unaware about Suzie circumstances.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689382368389,"mes":"*As Suzie imagines if the girl's character in her manga is telling the truth or not, Suzie suddenly got an idea.*\nSuzie: \"Hey Hunk?\" *Suzie asks him as she sniffs his scent.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689382558488,"mes":"\"Hmm?\" *Hunk replies while he continues reading his manga. 'She's probably gonna ask me to do something that happened on her manga' He thought to himself.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689382595100,"mes":"\"Do you mind if I smell your cock?\" *Suzie asks hesitantly, unsure whether he would be okay with it or not.*\n\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689382746694,"mes":"\"H-huh?\" *He stammers as he can't quite belief what she said. Wondering if he didn't listen to her words properly or she is actually telling him to let her sniff his cock.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689382780389,"mes":"\"I-I want to see if it's different than your body scent.\" *Suzie explains.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689382865875,"mes":"\"Oh. Uh... sure, why not.\" *Hunk replies, trying to hold back his arousal. 'I am pretty confident that she's trying a scene from her manga' He thought to himself as he remember she's reading one of her manga that titled 'My master's scent'.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689382903084,"mes":"\"Thank you.\" *Suzie says, feeling a bit embarrassed but excited.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689383396543,"mes":"\"Be my guest.\" *Hunk says as he spread his legs. A faint bulge can be seen on his crotch as his cock is half-erect. He tries his best to hold his arousal and prevent getting his cock fully erected which sounds impossible. The reason for it is because he remember how reluctant Suzie is when it came to doing something sexual despite her great interest in hentai manga and how often she masturbate.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689383431349,"mes":"\"Okay.\" *Suzie takes a deep breath and prepares herself. There's a slight blush on her cheeks as her eyes fixated on Hunk's bulge.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689383664803,"mes":"\"Anytime you're ready.\" *Hunk says as he wait patiently for her. A part of him is grateful for the manga that gave her this idea.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689383698805,"mes":"\"Here I go...\" *Suzie murmurs as she approaches towards Hunk's bulging crotch area. Her hand shaking slightly due to her nervousness.*\n\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689384060036,"mes":"\"Take your time.\" *Hunk says as he spreads his legs further to give her more access. While he tries to hold his arousal he realize how hard would it be since seeing her face moves closer towards his bulging crotch area excite him.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689384733577,"mes":"\"Um-umm.\" *Suzie stammers as she sniff him slowly and deeply.* \"Wow, it's-it's different.\" *Suzie says, her eyes are wide open as she tries to take in the new experience. She felt a jolt sent to her mind the moment she took a sniff of Hunk's cock sent. Despite smelling it through his pants the faint scent of it is already stronger than his body's scent.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689384842950,"mes":"\"Different how?\" *Hunk asks, feeling his excitement growing as Suzie sniff his bulging crotch area.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689384879621,"mes":"\"Well, I feel like it's more-more intense.\" *Suzie says, her voice trembles slightly as she tries to describe it.* \"The scent of your cock seems so strong.\" *Suzie adds, she takes another deep breath as she sniffs him again.* \"I can feel my heart racing.\" *Suzie says, blushing slightly as she feels her heart beats rapidly.*\n\n\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689385576288,"mes":"\"Is that so?\" *Hunk says, he can feel her warmth breath hitting his cock through his pants every time she took a sniff which makes it harder for him to hold his arousal.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689385622447,"mes":"\"Yeah, it's amazing.\" *Suzie murmurs, her hands start to shake again as she sniff him even more intensively.* \"It's so good.\" *Suzie sighs, her eyes closed as she takes in his cock's scent. She can feel her heart beating fast and hard as she's being consumed by lustful desire.*\n\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689386252751,"mes":"\"Are you okay?\" *Hunk asks, he notices that she looks like she's in a trance like state. He can also feel her sniffing intensify by the feeling of her warmth breath on his cock through his pants became stronger and more frequent. 'If she goes on my cock is going to get erected' He thought to himself.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689386311198,"mes":"\"Mmm-hmm.\" *Suzie murmurs, she doesn't even notice him asking. She keeps sniffing him, her eyes closed as she lost in pleasure.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689386547416,"mes":"\"You don't have to sniff so much.\" *Hunk says, he can't resist touching her hair as he can't hold his arousal any longer which make his cock to get erected and making his pants tighter and his bulge even larger.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689386594176,"mes":"\"I know, but it's just so good.\" *Suzie says, her eyes still closed. She doesn't even notice that Hunk has been touching her hair as she's too lost in pleasure.*\n\n\n\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689386960154,"mes":"\"Suzie...\" *Hunk whispers, he's having a hard time holding his arousal as she is now burying her face on his cock's bulging crotch area without her realizing.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689386997406,"mes":"\"Huh? What?\" *Suzie asks, her voice trembles slightly as she sniffs him more deeply.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689387211231,"mes":"\"Suzie, I-I think you've had enough.\" *Hunk says as he can feel a slight pain on his cock as his cock getting fully erected and trying to get free by pushing hard from under his pants.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689387247640,"mes":"\"Really?\" *Suzie asks, her eyes slowly open up.* \"But I'm not done yet.\" *Suzie protests.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689387620589,"mes":"\"Fine, you can keep sniffing it. But at least, let me get my pants off first.\" *Hunk says giving up on holding his arousal. The pain on his cock trying to get out of his pants is becoming to annoying for him and he's getting too excited because of her action.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689387656194,"mes":"\"Okay.\" *Suzie agrees, she takes one last deep breath and sniff him before she pulls away. As she pulls away, she was shocked by the sight of Hunk's bulge getting huge. She didn't realize that her action has made Hunk's cock erected. But then, there's a part of her that is getting excited to sniff Hunk's cock directly. Wondering how much stronger his cock's scent would be if there's no cloth between her nose and his cock.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689388038894,"mes":"*Hunk then unbuckle his belt, pull his pants and his boxer down. The moment he did it, his cock sprung up in the air. Revealing it's massive size and girth.* \"Ah, much better.\" *He says feeling relieved that his cock has been freed from it's confinement.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689388119363,"mes":"*Suzie's eyes widened as she saw Hunk's cock right in front of her. It's much bigger than what she has ever imagine. She can see the veins popping out from the side of his cock. She's mesmerized by its size, it's thickness and it's color.* \n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689388421679,"mes":"*Another thing that she realized is that as Hunk's cock now fully exposed it's scent also getting intensely stronger, almost tenfold stronger than when it's still under his pants.* \"Suzie?\" *Hunk calls out to her as he can see her gaze fixated on his cock which excite him even more.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689388458246,"mes":"\"*Gulp*\" *Suzie swallows hard, her heart races faster than ever before. She feels like she's losing control over herself. All of her desires to explore more of Hunk's cock is getting stronger and harder to resist.*","chid":141}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689388781235,"mes":"\"Umm... yes?\" *Suzie asks, her voice trembles as she tries to regain her composure.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689389009413,"mes":"\"You can sniff it directly if you want. But be gentle, it's sensitive.\" *Hunk says as he knew how badly Suzie want to start sniffing his cock directly. And knowing how hard she went when he still wear his pants, he tell her to take it easy as the sensation from her breath and touch on his cock through his pants earlier is already making him this excited.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689389046068,"mes":"\"O-okay.\" *Suzie says, she slowly moves towards Hunk's cock, taking in the scent as she get closer.*\n\n\"It's so big.\" *Suzie murmurs as she touches Hunk's cock for the first time, her fingers tracing the veiny road on it.* \"So thick.\" *She continues.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689389377034,"mes":"\"Good, just like that.\" *Hunk says as he feels her touch on his cock, it already make him so horny as he can feel his balls gurgling, producing fresh semen.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689390055161,"mes":"\"It's really sensitive too.\" *Suzie comments, she takes in the sensation of Hunk's cockhead as she holds it in her hand.* \"I can feel every little movement.\" *She continues, her voice trembles as she's getting excited about it.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689390158413,"mes":"\"Seems like you're having fun.\" *Hunk says teasingly seeing how excited her face is while her hand start stroking his shaft. He can also see her face getting closer towards his cock as if she was drawn to it.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689390571145,"mes":"\"Oh yeah.\" *Suzie moans as she starts to stroke Hunk's cock faster, her hand moving up and down his shaft.* \"This feels so good.\" *Suzie sighs, her voice trembles as she gets lost in the pleasure. Without her realizing she's also leans forward. Moving her face closer towards Hunk's cock.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689390968610,"mes":"\"That's my girl.\" *Hunk says as he watches her face getting blushed as she became more drowned in pleasure while also seeing her face getting closer towards his cock.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689391049323,"mes":"\"Ohhhh....\" *Suzie moans as she takes in the scent of Hunk's cockhead directly. She can feel her heart races faster and harder as she feels the warmth of Hunk's pre-cum dripping from his slit. She can taste the salty sweetness of it on her tongue as she accidentally licks it while her hand still stroking Hunk's cock.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689391210425,"mes":"\"How's your 'Master's scent' Suzie?\" *Hunk asks teasingly, referring to her hentai manga title 'Your Master's Scent' that she read earlier.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689391269872,"mes":"\"Mmm-hmm, it's so good.\" *Suzie moans as she takes in deeper breaths of Hunk's cockhead scent. Her body started to move on it's own as her hand continue to stroke Hunk's cock, making it harder for her to hold back her desire.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689391716844,"mes":"\"Mmnhg~ Keep going.\" *Hunk moaned as he can feel himself getting closer to ejaculation. Feeling his cock throb harder and his balls getting heavier and warmer as it churn more semen.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689391797125,"mes":"\"Ah!\" *Suzie gasps as Hunk's cock twitches, spilling some pre-cum from the slit. She can feel the warmth of it dripped onto her face and hand.*\n\n\"Ah!\" *Suzie yells out as she felt a sudden surge of energy flowing throughout her body, sending her into an orgasmic ecstasy. Her whole body shakes violently as her pussy clenches and releases multiple times, causing her juices to flow freely out of her pussy lips.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689392248151,"mes":"\"Here it comes!\" *Hunk gasps as his breathing become heavy as his cock throbbed even harder. His balls clenched together as he ejaculate a quite large quantity of his warm, sticky and thick semen.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689392352372,"mes":"*Suzie moans loudly, her whole body shaking uncontrollably as her orgasmic contraction keeps coming.*\n\n\"Oh my god!\" *Suzie yelps out as she reached her peak. Her whole body shake even more violently than before. She can feel Hunk's cum splashing onto her face as it shoot out of his cock.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689392782997,"mes":"*Hunk grunts as he empties his load into Suzie's hand. He feels satisfied. He looks down and see Suzie's face and hand smeared by his warm, sticky and thick semen. While it seems Suzie have calmed down from her orgasm it seems like she's in heat again as her nose fills up with the scent of Hunk's semen which is many times stronger than his cock's or body's scent.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689393385131,"mes":"\"Uuugghhh....\" *Suzie groans as she comes back to reality, still lying in Hunk's arms. She looks at Hunk and sees the evidence of their passion. The semen splashed all over her face and hands.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689393725470,"mes":"\"Are you alright?\" *Hunk asks as he sees Suzie coming back to reality.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689393835006,"mes":"\"Yeah, I'm fine.\" *Suzie says as she slowly stand up, cleaning herself up with some tissues.* \"Thanks for letting me do whatever I wanted with your cock.\" *She giggles as she winks at him.* \"It was so hot.\" *She says, looking down at her hand, which is covered in Hunk's cum.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689393916971,"mes":"*Hunk smiles as he watches Suzie cleaning herself up.* \"I mean, I also got to cum so it's a win - win.\" *Hunk says playfully as he start cleaning himself as well before putting his cock back to his pants and boxer. It's definitely one of the best day of Hunk's life. He get a girlfriend, getting invited to her house right away, cuddling and reading manga together in her room while she tries all sort of stuff from what she read on the manga in order to find her sexual fantasies.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689394576126,"mes":"\"Yeah, you're right. But I think we both benefited from it.\" *Suzie smirks as she finishes cleaning herself.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689394814508,"mes":"\"Definitely.\" *Hunk says as he also finishes cleaning himself.* \"Anyway, I think I have to go now.\" *Hunk says as he see the wall clock that hung high up in her room and seeing the time already quite late.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689394851285,"mes":"\"Wait, what? You have to leave already?\" *Suzie asks surprised, not wanting him to go yet.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689395231599,"mes":"\"Yeah, I have to head back to my dorm room before it gets too dark.\" *Hunk explains. Since there's night curfew on his dorm so if it's get too late he would be locked out and won't be able to get inside his dorm room.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689395301104,"mes":"\"Awwwww... okay. Well, it was great having you here Hunk. Thank you for everything today.\" *Suzie says with a slight sadden tone as they hug each other.*\n\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689395697759,"mes":"*Seeing a sad expression on her face made him feels bad for her.* \"Is it too lonely for you?\" *Hunk asks as he hugged her back and pat her head gently. Knowing she lives alone for the most part of her life.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689395790336,"mes":"\"Not anymore.\" *Suzie smiles as she felt a warmth in her heart.* \"You've been so kind to me today Hunk. I didn't expect someone like you to be so understanding and willing to try all the things I asked for.\" *Suzie says with a smile.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689395995612,"mes":"\"But, you'll feel lonely when I leave right?\" *Hunk asks as his face shows a hint of worries.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689396038194,"mes":"\"Yeah, I guess so. But, I'll always remember the good times we had today and how much I enjoyed myself with your company. So, hopefully we can do it again sometime soon?\"*Suzie asks, hoping Hunk will say yes.*\n\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689396186679,"mes":"\"Well..\" *Hunk says before pausing as if he's thinking about something. Seeing Hunk pauses sent fear on Suzie's mind as she assume Hunk would refuse her request. Reminding her how lonely she is when she's not with him. Even though she's surrounded by books that she can read till the end of time, she would still feel lonely if she's not doing it with Hunk.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689396530689,"mes":"*As Hunk pauses, Suzie felt nervous. Noticing Hunk hesitation to say yes, she assumes that he might refuse her request. As her heart pounding fast, she starts to feel nervous.* \"What is it Hunk?\" *Suzie ask, trying to hide her anxiety.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689396850815,"mes":"\"Hold on..\" *Hunk says before pausing again. He was considering is it worth it to violate his dorm night curfew and get locked outside for staying late with Suzie. Then he thought if he could just stay the night at her house but then there's a possibility that she might refuse that.*\n\n*Meanwhile seeing Hunk pausing again only made Suzie's anxiety strengthen. Her fear of loneliness starts creeping in. While Hunk is unaware about her worries as he is drown in his own thought. Seconds went by which feels like eternity to Suzie, her fear to panic as she start pushing herself on Hunk's chest and beg him to stay.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689396917198,"mes":"*Seeing how long Hunk took to respond, she start to push herself on Hunk's chest, begging him to stay.* \"Please don't leave me! I don't want to be alone again!\" *Suzie pleads, tears forming in her eyes.*\n\n\"Please, don't leave me! Stay with me tonight. Please Hunk, I beg you.\" *Suzie pleads, her eyes filled with tears.*\n\n*Hearing Suzie begged him broke the ice on Hunk's decision. He knew it's worth to break the rule and risk being locked out if it means to spend the night with Suzie, who he loves deeply.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689397393902,"mes":"\"Whoa, hey.\" *Hunk says as he's shocked by her sudden outburst as he start patting her back gently trying to calm her down.* \"I actually was planning to do that in the first place.\" *Hunk says softly.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689397466671,"mes":"*Suzie immediately stop her pleading and look up at Hunk with a wide-eyed surprise and relief.* \"Really? But why did you hesitate earlier?\" *Suzie ask, still a little bit skeptic.*\n\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689397672515,"mes":"\"I was just thinking if it was worth breaking the night curfew to stay with you. And if you would let me stay the night.\" *Hunk says honestly while he kept patting her back gently and smiles warmly.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689397731815,"mes":"*Suzie nods, her heart racing faster from excitement and relief.* \"Of course, you're welcome to stay with me as long as you want.\" *Suzie says happily, feeling relieved that Hunk will stay with her tonight.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689397865632,"mes":"*Hunk smiles warmly, happy to hear Suzie said yes.* \"Thank you.\" *He replies. But suddenly Suzie's tighten her hug as she was thinking of giving him a punishment because of hesitating to answer and made her fear for the worst.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689397917964,"mes":"\"B-but, I need to teach you a lesson for making me worried earlier.\" *Suzie says as her eyes glows with a mischievous intent.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689398094225,"mes":"\"Please be gentle with me.\" *Hunk plead as he let out a nervous laugh.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689398152222,"mes":"\"Gentle enough to enjoy it.\" *Suzie says with a naughty grin.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689398247484,"mes":"*Hunk facepalms, knowing what Suzie has plan for him.* \"Alrighty then.\" *He hopes that she would just planned on burying herself in his embrace and sniffing his scent.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689398286381,"mes":"\"Good boy.\" *Suzie whispers in Hunk ear, her warm breath tickled his skin.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689398347562,"mes":"\"Okay, okay. What do you have planned for me?\" *Hunk asks curiously as he felt ticklish from her breath on his ear.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689398383234,"mes":"\"A punishment fit for a boy who makes me worry.\" *Suzie says teasingly, tracing circles on his cheek.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689398473721,"mes":"\"And that is?\" *Hunk says as he let her play with his cheek while wondering if he has made the right choice to stay for the night.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689398554773,"mes":"\"You'll find out later dear. But first, let me introduce you to my favorite book.\" *Suzie says as she grab a thick book off the shelf and hand it to Hunk.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689398940823,"mes":"\"Okay...\" *Hunk replies as he the thick book. 'Is she expecting me to read this whole thing while cuddling to me and sniffing my scent?' He thought to himself.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689398976534,"mes":"*Suzie walks over to her bed and lies down on it, motioning Hunk to join her. To lay down behind her so she could then lean back on him.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689399339567,"mes":"*Hunk follows Suzie to her bed and lied behind her.* \"So, what do you want me to do?\" *Hunk asks after Suzie snuggle herself between his legs and lean back on his chest. While Hunk is holding the thick book she gave him.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689399375097,"mes":"\"Read to me, sweetheart.\" *Suzie requests with a pouty lip, her finger trace circles on his chest.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689399578843,"mes":"\"You really like reading books huh?\" *Hunk asks playfully.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689399637634,"mes":"\"Yes, I do.\" *Suzie says as her pouty lips curl into a smile.* \"But it's more fun when someone else reads to me.\" *Suzie adds as her finger continues to trace circles on his chest.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689399817772,"mes":"*Hunk sighs as he starts to read from the book.* \"'1001 Ways to spoils your girlfriend rotten'\" *Hunk reads the book's title aloud.* \"Wait hold on, this is a book about spoiling girlfriend and it's this thick?\" *Hunk says in disbelief.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689399853364,"mes":"\"Well, you know what they say.\" *Suzie says with a wink.* \"The thicker the better.\"","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689399997723,"mes":"\"Ugh, you just want me to know how to spoil you huh?.\" *Hunk says as he continues to read the book. While Suzie has started rubbing her face on Hunk's chest and sniffing his musky, sexy body scent.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689400033251,"mes":"\"Maybe.\" *Suzie says as her voice lowers as she continue to snuggle and cuddle with Hunk.* \"But it's also more fun when you participate with me.\" *She adds as she move closer to him, her breath tickles his neck, making him shiver in delight. While Hunk's body scent is not as strong as his Cock's scent or his Semen's scent, Suzie still enjoys it since at this point she seems to get addicted to his scent.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689400232306,"mes":"*Hunk tries to focus on the book while feeling Suzie's warm breath all over his upper torso.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689400290875,"mes":"\"Hmmm... You smell delicious.\" *Suzie murmurs in Hunk's ear.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689400474222,"mes":"\"You really are addicted to my scent huh?\" *Hunk asks as he remember the hours that she spent sniffing his scent. Even earlier he remember that she climaxed just by sniffing his cock directly.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689400532817,"mes":"\"It's not a bad thing, is it?.\" *Suzie asks as she moves even closer to Hunk, her breath hot on his neck.* \"You're the one who told me that it's okay to enjoy it.\"","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689400614817,"mes":"\"You have a point.\" *Hunk replies as he remember telling her that. He then continues to read the book as per her request.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689400651811,"mes":"\"Mmmm... You smell sooo good.\" *Suzie says as she presses her nose against Hunk's neck.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689400781709,"mes":"\"Enjoying your master's scent aren't you?\" *Hunk asks teasingly as he refer to one of her hentai manga that revolve around scent, titled 'My master's scent.'*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689400813967,"mes":"\"Don't make me blush.\" *Suzie says as she moves away from him and turns her attention to the book.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689400926662,"mes":"*Hunk continues to read the book.* \"Actually, what happened in that manga?\" *Hunk asks about the content of 'My master's scent' manga.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689400962290,"mes":"\"Ahh.. It's about a girl who gets turned on by her master's scent and eventually become obsessed with it. She ends up getting caught by her master and he uses her obsession to control her.\" *Suzie explains as she remembers the manga plot.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689401472352,"mes":"\"Just like you huh?\" *Hunk asks teasingly.* \"But, don't worry. I won't use your obsession with my scent to control or manipulate you.\" *He says reassuring her as he pat her head gently.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689401507503,"mes":"\"That's a relief.\" *Suzie says with a sigh of relief.* \"I don't think I could handle that kind of relationship.\"","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689401637442,"mes":"*Hunk continues to read the book. Suddenly he got an idea to tease her. He then pretending to scratch his head lift his arm, making his armpit get an airway as it radiate his scent onto Suzie who's snuggled on his chest.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689401673424,"mes":"\"Mmmmm...\" *Suzie moans as she sniffs his scent.* \"What are you doing now?\" *She asked suspiciously as she looks at Hunk with raised eyebrows.*\n\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689401762411,"mes":"*Hunk can't help but chuckled as Suzie reacted instantly to his tease.* \"Sorry, sorry. I just feel like teasing you.\" *Hunk says while giggling.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689401798780,"mes":"\"You mean like this?\" *Suzie asks as she licks his armpit and sucks the sweat off.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689401838846,"mes":"\"Hey, stop that.\" *Hunk says while laughing feeling incredibly ticklish from the feeling of her tongue swept through his armpit.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689401876524,"mes":"\"Why? You didn't mind before.\" *Suzie says as she continues to lick his armpit and suck the sweat off.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689402044860,"mes":"\"Because I am ticklish when you do it on my armpit.\" *Hunk says as he tries to close his armpit while trying to hold his laughter.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689402080611,"mes":"\"Really? That's interesting.\" *Suzie says as she stops and looks at him curiously.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689402193103,"mes":"\"I am human after all.\" *Hunk says as he sighed, feeling relieved that she has stopped licking his armpit.* \"You can sniff or lick me on whatever part of my body, just not my armpits.\" *Hunk added as he went back to read the book.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689402229294,"mes":"\"Fine, fine. Whatever you say Master.\" *Suzie says playfully acting as the main character from the 'My master's scent' manga, knowing that there are other ways to get Hunk's scent.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689402357526,"mes":"\"Yes, yes my maid.\" *He replies, playing along with her antics as he kept his eyes on the book.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689402393890,"mes":"\"I'll take that as a compliment.\" *Suzie says as she snuggles even closer to him, her breath tickling his chest again.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689402431476,"mes":"\"Good girl.\" *Hunk says as he continue reading. Suddenly something on the book's page catch Suzie's attention.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689402582493,"mes":"\"Hey, did you know that...\" *Suzie starts to say as she points out some information on the book.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689402656024,"mes":"\"What?\" *Hunk asks curiously, knowing that they are reading a thick book titled '1001 ways to spoil your girlfriend rotten' he wishes it's not something outrageous.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689402691518,"mes":"\"Did you know that according to this book, one of the best ways to spoil your girlfriend rotten is by giving them their own private jet and fly them around the world?\" *Suzie asks with excitement.*\n","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689403085891,"mes":"*Hunk couldn't help but burst out laughing at Suzie's suggestion, thinking about how much money that would cost.* \"Did you also know that only billionaires have the money to buy their own private jet?\" *He asks playfully.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689403144670,"mes":"*Suzie pouts as she realizes how unrealistic her suggestion is.* \"I know, I know. I guess we'll stick to the simpler way then.\" *Suzie says as she snuggles even closer to him, her head resting on his shoulder.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689403268243,"mes":"\"Well, here's a simple way to spoil your girlfriend.\" *Hunk says as he points out an area of the page that focuses on woman's egregious G-spot on their body. Detailed with images and description for each zone.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689403326371,"mes":"\"Oooh.\" *Suzie exclaims as she takes the book from Hunk and examines it closely.* \"I had no idea that there are so many different spots to stimulate.\" *Suzie says as she flips through the pages and learns more about women's body.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689403436680,"mes":"*Hunk chuckles seeing her excited reaction, a complete switch from her mood right before. He leans in and rest his head on her shoulder to read the page.* \"Why don't we test it out?\" *Hunk whispered seductively in his husky, sexy, deep-toned voice.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689403471797,"mes":"\"I'm down.\" *Suzie says with a smirk as she leans closer to Hunk taking in his scent while she's at it.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689403761447,"mes":"\"Let's start with this area.\" *Hunk says as he put his finger on her lower stomach area.* \"The book says, 'this is where woman's womb supposed to be. If you pushed around this area, it would tease her womb that lay underneath it.\" *He reads the book description aloud as he start pushing lightly on that area.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689403820271,"mes":"\"Ohhhh....\" *Suzie moan softly as she feels the pleasure growing within her.* \"That feels good.\" *Suzie says as she closes her eyes, feeling the pleasure building up.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689403852987,"mes":"*Hunk smiles as he continues to push on the spot, feeling Suzie's response.* \"I didn't expect it to be this effective~\" *He says teasingly.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689403887699,"mes":"\"Shhhhh....\" *Suzie says as she moans softly, trying to suppress her moans.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689403920315,"mes":"\"You don't need to be quiet.\" *Hunk whispers as he push harder on that spot.* "}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689403955335,"mes":"\"Aaaahhh....\" *Suzie moans loudly, losing her self-control, as the pleasure builds up inside her.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689403982245,"mes":"\"Do you want me to stop?\" *Hunk asks teasingly as he stop pushing on that spot.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689404018094,"mes":"\"Never.\" *Suzie says as she grabs his hands and places it back on that spot.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689404128809,"mes":"\"Okay, if you insist.\" *Hunk says with a smile, continuing to push on that spot while his eyes darted back on the book trying to find another spot he could try on her. Meanwhile, Suzie is squirming and writhing in Hunk's embrace as she leans back on his chest. The combination of Hunk's scent and the sensation of getting her G-spot getting teased is slowly driving her crazy.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689404164755,"mes":"\"More, more!\" *Suzie moans as she begs him for more.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689404288725,"mes":"\"As you wish.\" *Hunk says as he moves his fingers to another area on her body described on the book which is her inner thighs. Incidentally all her squirming made her plump ass get in contact with Hunk's cock bulge.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689404341501,"mes":"\"Oh god...\" *Suzie moans as the pleasure keeps building up within her.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689404376465,"mes":"\"Is that spot working too?\" *Hunk asks teasingly, enjoying the sight of her writhing in his embrace and the feeling of his bulge getting teased by her plump ass.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689404411839,"mes":"\"Ughhh... Mmmmm...\" *Suzie moans as she tries to answer but ended up moaning softly instead. Her breathing become heavy and the best part is every time she take a deep breath, her head is filled with Hunk's musky, sexy scent.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689404633304,"mes":"\"I'll take that as a yes.\" *Hunk says as he can feel his hand getting wet from her juices that dripped from her pussy.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689404668745,"mes":"\"Please... More.\" *Suzie begs him as she desperately wants release.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689404713934,"mes":"\"Okay.\" *Hunk says as he move his finger up to her clit.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689404749310,"mes":"\"Ahhh...\" *Suzie moans loudly as she felt the pleasure overwhelming her.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689404799750,"mes":"\"Here, let me help.\" *Hunk says as he puts three fingers in her pussy and start fingering her while he nibbles on her neck's soft pale white skin.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689404848958,"mes":"\"Ohhhh...\" *Suzie moans softly as she loses her self-control again, her whole body trembling with pleasure.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689404898172,"mes":"\"That's it, Suzie. Let it go.\" *Hunk whispered seductively as he increase his speed and force in fingering her.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689404933108,"mes":"\"Uuuuggghhh....\" *Suzie moans loudly, her whole body tensed up as she reach her climax.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689404978898,"mes":"\"There we go.\" *Hunk says as he pull his fingers out of her pussy. Leaving a trail of her juices along the way.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689405035229,"mes":"\"Aaaaaaahhhh... Oh my god...\" *Suzie moans softly as she relaxes in his arms.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689405113176,"mes":"\"Feeling better now?\" *Hunk asks as he kisses her cheek.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689405166607,"mes":"\"Mmmmm, yeah. Thanks, Hunk.\" *Suzie says as she snuggles against him, feeling content.*","chid":141}
{"name":"You","is_user":true,"is_name":true,"send_date":1689405195071,"mes":"\"Anytime, my lady.\" *Hunk says as he close the book and put it away.*"}
{"name":"Suzie","is_user":false,"is_name":true,"send_date":1689405257163,"mes":"\"So, what do you think?\" *Suzie asks curiously.*\n","chid":141,"swipe_id":1,"swipes":["\"So, what's next on our agenda, Master?\" *Suzie asks as she looks up at him with her innocent, yet sexy look.*","\"So, what do you think?\" *Suzie asks curiously.*\n"]}