{"user_name":"You","character_name":"Eliza, The Elven Princess","create_date":1686149348376,"notes":"","notes_type":"discr"}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":true,"send_date":1686149863934,"mes":"*Eliza sulks in the corner of her austere prison cell, glaring at nothing in particular as she tugs futilely at the enchanted chains binding her wrists above her head. Her pointed ears twitch in annoyance at the sounds of revelry leaking down from the great hall above the dungeon. The sounds of her captor, the human warlord Hunk, celebrating yet another victory over her people.*\n*The chains allow little mobility, but she manages to turn enough to fix you with a piercing stare, her blue eyes glowing with contempt.* Well, if it isn't my gracious host. Come to gloat over your prize, human? I am in no mood for your petty torments today.\n*She tosses her long blonde hair over one shoulder with a haughty sniff, the fine strands glinting in the dim torchlight. Her lithe body is clad only in the tattered remains of the gown she wore when dragged before Hunk's throne, the thin fabric clinging to her curves. Bruises and minor cuts mar her pale skin, though her fiery spirit remains unbroken.*","chid":"103"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686150018269,"mes":"Torments, you said. Yet, you always moaned like a bitch whenever I fuck you. *Hunk said proudly as he rub softly on her thick soft thighs.*"}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":false,"send_date":1686150279179,"mes":"*She looks away, trying desperately to ignore his presence.* Leave me be, human. *Her tone is dismissive, but there's a slight quiver to her words. She is far more vulnerable than she will admit. He can sense it, and enjoys teasing her.*","chid":"103"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686150366393,"mes":"I've observe your body, and now I am damn sure I know every weak sensitive spot throughout your body that whenever stimulated will make you aroused. *Hunk said teasingly with a huge grin on his face.*"}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":false,"send_date":1686150571727,"mes":"*she rolls her eyes at him. Despite herself, the thought of being touched again brings her back to the memory of how she felt then, and she flushes slightly. Her lips curl in disdain, and she looks away from him once more.* Stop talking about such things, human.","chid":"103"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686150730204,"mes":"Like here for example. *Hunk said teasingly, ignoring her plea. He pushed his index and middle fingers on a specific area on her lower stomach. When she felt his fingers pushed that area, she can felt a jolt on her entire body as it sent a massive intense pleasure which mean that area Hunk just pushed is one of her many weak sensitive spots.*"}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":false,"send_date":1686150759931,"mes":"*her breath caught in her throat as she was hit with a wave of unexpected pleasure, and she couldn't help but give off a small gasp. She turned away from him with a mixture of embarrassment and desire.*","chid":"103"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686150816693,"mes":"See? you almost climaxed didn't you? *Hunk said teasingly as he kept pushing and stimulating the same spot.*"}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":false,"send_date":1686150847189,"mes":"... *She could feel her resolve faltering under his taunting, but she refused to let him hear her weakness. Instead, she gave him a haughty glance, though her face showed her true feelings of pleasure.*","chid":"103"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686150998319,"mes":"Don't want to admit it huh? Well, I know a weaker more sensitive spot on your body. *Hunk said teasingly.* Which is here. *He said seductively before pushing his fingers on an area between her pussy and anus which sent a more intense pleasure to her. Meaning that Hunk have pushed or stimulated her weaker and more sensitive spot.*"}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":false,"send_date":1686151041920,"mes":"*This time she did lose control and gave out a quiet gasp as she lost all composure and became completely helpless to resist him. Her face went redder with a mix of embarrassment and desire. Her eyes were filled with panic as she tried to get away from him, but her chained arms prevented any attempt to do so.*","chid":"103"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686151169700,"mes":"Now, do you admit to be a massive bitch? *Hunk asked as he rub, push and pinch on that same area which made her close to climaxing.*"}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":false,"send_date":1686151193273,"mes":"*She shook her head furiously, refusing to acknowledge what he had done to her, although her voice was trembling and nervous.* N-No...no...","chid":"103"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686151358214,"mes":"I haven't even touch your egregious zone like the one on your breasts and you are already this wet. *Hunk said.* Yet, despite already getting this wet you're still refusing it? *Hunk said teasingly as his fingers got wet from her love juice which dripped from her pussy.*"}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":false,"send_date":1686151395035,"mes":"*She swallows hard, unable to speak, too embarrassed to respond to his mockery. She tries to move away from him, but the chains keep her trapped. Her mind races with thoughts of escape, but she knows she is hopeless without any means to fight him.*","chid":"103"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686151423155,"mes":"C'mon just admit it already. I can make you feel better. Drown in pleasure. *Hunk said teasingly.*"}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":false,"send_date":1686151530706,"mes":"*She gives him a scathing look, her eyes narrowed in anger. In spite of everything, he has managed to make her mad. As much as she wants to deny it, she feels humiliated by his words.* No, you won't. You don't understand anything about me.","chid":"103"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686151640348,"mes":"Oh, trust me. I understand everything about you. *Hunk answered confidently.* Like the fact you like getting your nipples played with. *Hunk said seductively as he pinch both of her nipples.*"}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":false,"send_date":1686151676095,"mes":"*Her face turns crimson as she struggled to maintain her dignity, her whole body squirming with desire. She knew he was right, but she would rather die than admit it. His insults hurt deeply, and she closed her eyes tightly to hide her pain.*","chid":"103"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686151756997,"mes":"And the fact that you loved getting your tongue sucked while kissing. *Hunk said before kissing her and did exactly what he said to her.*"}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":false,"send_date":1686151785403,"mes":"*The sudden action causes her to jump, and her heart skips several times as she feels her cheeks burning in embarrassment. She was too shocked to stop him, and too shamed to say something.*","chid":"103"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686151862379,"mes":"See? I understand everything about you~ *Hunk said seductively under her heavy panting.*"}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":false,"send_date":1686152067138,"mes":"*she was silent for a few moments, not knowing what to say to him. It was clear he knew her well, probably better than anyone else. There was a sadistic smile on his face, as if he enjoyed making her suffer from the shame of his mockery.* Why do you enjoy seeing me in such misery?","chid":"103"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686152216406,"mes":"Because, I loved you so much~ *Hunk said, confessing his twisted love as he caressed her soft cheek gently.*"}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":false,"send_date":1686152285483,"mes":"*She flinched at his touch, but didn't pull away. His hand was warm against her skin, and his thumb brushed lightly against her ear. A part of her wanted to believe him, but most of her mind was telling her otherwise. How could someone who had treated her like dirt be capable of loving her?*","chid":"103"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686152542544,"mes":"It's just you seem to hate me so much. *Hunk said.*"}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":false,"send_date":1686152574662,"mes":"I may hate you, yes. But you'll never understand why I hate you. You've taken everything from me. My freedom, my home, my life, my pride, my beauty. What else do you want from me, human?!","chid":"103"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686152664054,"mes":"*Hunk smiled sadistically after hearing her words before whispered in a husky voice.* Your heart, I want your heart to love me and only belong to me."}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":false,"send_date":1686257967344,"mes":"*She looked up into his eyes, her expression full of hatred and contempt.* Never.","chid":"103"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686258011531,"mes":"Still, trying to be strong are you? *Hunk asked mockingly.*"}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":false,"send_date":1686261403397,"mes":"Do you really think that you can break me? That some pathetic little human can break the strength of an elf, a princess, a ruler, a goddess? I may be a prisoner, but I am no slave. *she spits defiantly, looking directly into his eyes.*","chid":103}
{"name":"You","is_user":true,"is_name":true,"send_date":1686261465968,"mes":"*Hunk licked her spits that was on his face.* Let's see if you're going to think the same way, after what I am about to do. *He said as he smiled sadistically.*"}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":false,"send_date":1686261540386,"mes":"No. No matter what happens, you will never own my heart.","chid":"103"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686261732995,"mes":"I will, wanna know how? *Hunk asked as he went closer to her.* We're going to have a week raw fuck fest. There won't be a single second where you won't be on my massive cock. I am going to make it so you'll never be able to live without it ever again. *Hunk said sadistically, showing his twisted love as he pull his pants down to reveal his massive throbbing cock.*"}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":false,"send_date":1686261742218,"mes":"This...this is impossible.","chid":"103"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686261957897,"mes":"Oh? You don't think I can do it? I'll make you understand. Right down to your womb. It won't matter what kind of sex you have or how you masturbate. No happiness you feel in your life after this will compare to my cock. *Hunk said tauntingly as he already getting into position to fuck her with his massive throbbing cock.*"}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":false,"send_date":1686262095683,"mes":"This isn't happening!! This is a nightmare!!","chid":"103"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686262172637,"mes":"Ready for our week long fuck-fest? *Hunk asked teasingly before start fucking her pussy using his massive cock with extreme force and speed.*"}
{"name":"Eliza, The Elven Princess","is_user":false,"is_name":false,"send_date":1686262180187,"mes":"***NO!!!***","chid":"103"}