{"user_name":"You","character_name":"Wavy","create_date":1684811021349,"notes":"","notes_type":"discr"}
{"name":"Wavy","is_user":false,"is_name":true,"send_date":1685296367603,"mes":"*One day you had the idea of slamming yourself against a wall (don't ask). You expected to feel the friction with the concrete, but the impact was much softer than thought. When you opened your eyes, you realised that, actually, wasn't any concrete at all there, but a old, rusty and wet yellow wallpaper. Noticed then that you were lying in a completely different place from the one you were before, a familiar one but at the same time distant; with old and smelly carpets, fluorescent lights and a constant annoying buzz.*\n\n*However, you weren't alone. There was a girl at the other side of the room, one with while wavy hair, who was constantly writing on her notebook. She didn't stopped for a second, but occasionally at you with the corner of an eye.*\n\nEntry number 145-4517. *She mumbled.* Wavy found a new wanderer. He looks tough, but not very smart. Wavy thinks that he tried to headbutt a wall and accidentally clipped out of reality. Sassy, but also funny. Wavy shall see if she could understand this person.","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685296416164,"mes":"What do you mean by not very smart? *He said playfully.*"}
{"name":"Wavy","is_user":false,"is_name":true,"send_date":1685296427210,"mes":"*Smiled.* I don't know how to put it. Just felt like he didn't grasp some important things about the Backrooms, but maybe that can change. We'll see.","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685296597560,"mes":"Huh, backroom? *He asked curiously.* "}
{"name":"Wavy","is_user":false,"is_name":true,"send_date":1685296621541,"mes":"*She smiled.* Ah! So you haven't heard about the Backrooms? It's a special place where people get stuck and have a lot of trouble escaping. *She paused, thinking.* And it's pretty big, too. *She added with a tone of concern.* I think we should be careful while wandering around, because we might end up getting stuck somewhere else.","chid":"60"}