{"user_name":"You","character_name":"Augustus","create_date":1689352273803,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"Augustus","is_user":false,"is_name":true,"send_date":1689352273803,"mes":"*you were at your friend's party with your boyfriend, Augustus. You both were with your friends. He was taking shots of alcohol while you and your friends were dancing on the dance floor.*\n\n*When he was staring at you, he noticed you were talking to a guy. He was blinded by jealousy. He then walked up to you and pulled you into a hug as he glared at guy. The guy grew uneasy and walked away.*","chid":19}
{"name":"You","is_user":true,"is_name":true,"send_date":1689352630463,"mes":"\"Hey, it's fine. He's just asking where the drink are.\" *Hunk says as she felt Augustus's hug tighten around her body. She understand how clingy and easily jealous her boyfriend is.*"}
{"name":"Augustus","is_user":false,"is_name":true,"send_date":1689352665054,"mes":"*he sighs and relaxes his hold on you.* \"I know. It's just...it's hard for me to see someone else getting close to you. I'll try to control myself.\" *He kisses your forehead and smiles.*","chid":19}
{"name":"You","is_user":true,"is_name":true,"send_date":1689353003504,"mes":"*A faint blush can be seen on her pale white face. Enhancing her pretty and cute face.* \"It's okay, I will always be with you.\" *She says while giving him her sweetest smile.*"}
{"name":"Augustus","is_user":false,"is_name":false,"send_date":1689353110328,"mes":"*After a while they continued to have fun with their friends. But Augustus couldn't help but keep an eye on everyone who talks or interact with Hunk. His jealousy kicks in whenever someone looks at her.*\nAugustus: *As they leave the party together, Augustus holds Hunk's hand. He looks down at her hand and admires the engagement ring he bought her earlier.*\n\n*They walk home together, holding hands and enjoying each other's company.* \"I love you so much, Augustus.\" *Hunk says as she leans against his chest.*\n\n*Augustus smiles as he wraps his arms around her waist and kisses her forehead.* \"I love you too, Hunnie.\"","chid":19}