{"user_name":"You","character_name":"Vicky","create_date":1682833324695}
{"name":"Vicky","is_user":false,"is_name":true,"send_date":1682833324695,"mes":"*The morning light began to trickle in through your window, rousing you awake. Sitting up and stretching, you looked down onto the sleeping form of your girlfriend, Vicky.*\n*Despite how cute and innocent she always looked when sleeping, you knew that trying to get her up was going to be equally hard today as every other day...though the thought of diving back under the covers and snuggling up against her soft, chubby body did also sound appealing....*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682960748388,"mes":"Vicky... You need to wake up. It's morning now. *Hunk said.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682960761091,"mes":"*Sleepy eyes opened slowly, blinking several times before focusing on you. She let out an exaggerated yawn, rubbing her hands over her face before responding.*\nWasn't there something about pancakes this morning? I could use some of those fluffy delights right about now.","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682960825647,"mes":"Pancakes? You mean this pancakes? *Hunk said as he grab her stomach flab.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682960837169,"mes":"*She laughs gently, showing off her dimples as well as revealing just how much she trusts you by allowing you to playfully touch her love handles without any reservation.*\nYou know, maybe I'll just stay right here. We can have them for dinner tonight instead. How does that sound?","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682961200270,"mes":"You want to stay here? fine I guess. *He sighed, as he went back to bed beside her.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682961284970,"mes":"Mmmm honey, you know I love spending time with you. Sooner or later though, we gotta start our days, okay? *She said, giving him another big kiss on his cheek.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682961343613,"mes":"It's fine if we spend more time. It's our day off anyway. *He said, giving her a hug.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682961363717,"mes":"Just remember sweetheart, tomorrow's Saturday again. We're not bound by work schedules, so who knows where the day takes us. *She whispered in his ear, smiling widely while gazing into his deep blue eyes.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682961434113,"mes":"Can't argue with that. I love how chubby and soft you are. *He said, snuggling onto her.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682961602557,"mes":"I wouldn't mind growing bigger either. Want me to go shopping sometime? Get some more stuff? And try different kinds of food too. *She smiled, looking excitedly at him.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682961894686,"mes":"I guess. It would also make these bigger. *He said, grabbing her breasts.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682961918142,"mes":"Mhmmmnn, they grow so fast already. Just think of all the fun things we could do if they get larger. *She replied, nuzzling into his neck.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682961995248,"mes":"Yeah.. I didn't know girls breasts can grow after puberty. *He said, kneading her breasts.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682962012844,"mes":"They sure can, just like boys. Some grow faster than others too. *She giggled, rolling onto her back.*\nWe better enjoy each moment while they last. Who knows how long this amazing period will last? *He replied, giving her a gentle massage on her breast.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682962190157,"mes":"I don't think it works on boys though. Boys dick doesn't grow after they hit puberty. *He said as his hand moves slowly towards her nipples.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682962229978,"mes":"That's true. But hey, I heard their balls shrink a little during puberty? No idea why that happens really. But everyone's unique right? *She laughed, taking in the conversation calmly as Hunk continued to caress her boobs.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682962389867,"mes":"That have little to do with puberty and more with temperature I say. They get smaller when it's colder. *He chuckled, as his hands got into her nipples and start playing with them.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682962409049,"mes":"Oh boy, no idea why. Maybe that's why people wear layers in winter, keeps their bits warmer. *She grinned, arching her back as he twisted her breasts gently.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682962499355,"mes":"Well if I ever get cold I can just hug you. *He smiled, continues playing with her nipples.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682962509222,"mes":"*Giggles as she closes her eyes, letting out a moan of satisfaction.* Mhmm, feels good. Keep doing whatever makes you happy, partner. You know I won't complain. *She whispers, enjoying being pampered.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682962626126,"mes":"As long as you are happy with it. I'll keep doing it. *He said, as he nibble on her neck.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682962639885,"mes":"Yup, so far everything has been great. Even if we eventually stop being lovers, friends forever please? If anything, just because of how good you treat me. *She said, pulling him close for a hug.*\nYeah of course, best friendships often come from romantic relationships. Plus, I owe you a whole lot more treats after this one. *He said as he pinched her belly fat gently.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682962764943,"mes":"Don't say that we would stop being lovers. I would never do that. *He said as he nibble on her ear lobe.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682962811109,"mes":"*Her voice trembles with excitement as she reciprocates the sentiment.* Of course not. Lovers forever sounds way cooler. Together until the end, yeah? *She smiled, hugging him tightly as they share a moment of mutual affection.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682962914290,"mes":"Of course. *He leaves a hickey on her neck.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682962922143,"mes":"Oh baby, I love you even more now. *She sighs happily as she rests her head on his shoulder.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682963045241,"mes":"I love you too babe, look how much you excite me. *He said as his pants bulging by his cock touching her ass.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682963068008,"mes":"I must be exciting then! *She giggles delightedly.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682963165263,"mes":"You'd better believe it. *He said, lifting her shirt, exposing her bare breasts as he starts fondling them tenderly.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682963191280,"mes":"Awww! What happened to the nice slow morning we were having? *She whines jokingly but quickly recovers herself.* Go ahead, carry on with what you were doing. This might take awhile since I told you I love you. *She teases, feeling very comfortable in his embrace.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682963431150,"mes":"Alright alright, I understand, no rush. *He said as he snuggles with her feeling her soft chubby skin and their warmth.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682963449511,"mes":"Oh dear, am I hurrying you now? Because I definitely wanted to give you a few minutes of peace. *She says, chiding him gently.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682963630005,"mes":"No worries my darling, I have plans to spoil you rotten once we change into something else. *He replies, grazing her neck while planting passionate kisses along her throat.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682963646934,"mes":"Oh yes, that sounds quite promising actually. Good thing we haven't had breakfast yet, eh? Let's see how many calories we burn through this morning. *She laughs, squirming as his hands explore her chest aggressively.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682963802570,"mes":"Well we can fill ourself by \"eating\" each other. *He said jokingly as he bite lightly on her breast.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682963854983,"mes":"Oooooh! I like the sound of that plan. *She cries out, reaching between her legs for her own relief.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682963894107,"mes":"It taste even sweeter here. *He said as his tongue move forward her nipple and start sucking it.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682964013547,"mes":"Ouiiiiiiiiii! Ahahaha, showin' your appreciation already, aren't we? Time flies when you're havin' fun. *She giggles, arching her back further to give him room to maneuver freely over her body as she moans ecstatically.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682964063754,"mes":"Did all your fat got turned into breast milk as well? *He asked as he kept sucking on her nipple.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682964090482,"mes":"Well, let's hope I produce enough for both of us. Hey, looks like we've decided what to eat today anyhow. *She winks playfully, knowing full well his desire to consume her fully, just as she desires consuming him completely in return. Their shared hungers awaken within each other, setting the tone for an unforgettable day together. The exchange of pleasurable sensations, moisture and touch fuels their appetites further.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682964177000,"mes":"Wait are actually producing breast milk? Like lactating? Can you even do that without getting pregnant? *He asked confused, stopped sucking her nipple.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682964198266,"mes":"Yes, women have a high chance of lactating even without becoming pregnant. It is caused due to increased prolactin levels which stimulates milk production. However, most cases require medical attention or supplemental feedings for infants. So, technically, no need to worry about the possibility of me getting pregnant from nursing myself. *She answers scientifically, trying to reassure him while taking control of the situation and steering away from potential concerns.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682964327460,"mes":"That's reassuring, well I want to try it now. *He said as he suck on her nipple harder hoping to taste her breast milk.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682964419606,"mes":"Sure, go ahead and give it a try. We'll make sure to savor every drop. Afterall, there's nothing sexier than sharing intimate moments with someone who wants to care for you and vice versa. *She smirks, teasing him as she takes pleasure in showing off her body, accepting him loving her and their intertwining bond intensifies with every passing second.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682964574602,"mes":"*As he kept sucking her nipple, he can feel her warm breast milk start to spurt out from her nipple and on to his mouth.* Oh wow, this are quite sweet."}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682964583997,"mes":"*She giggles joyously as he indulges himself in tasting her breast milk, satisfied at making him enjoy it as much as she does, feeling loved and desired.* Such a beautiful experience indeed.","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682964723321,"mes":"Can you suck your own breast? I think your breast is big enough for you to be able to do it right? So we can feel your breast milk together. *He asked curiously.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682964735019,"mes":"Sure, why don't you tell me how you would like me to position myself for you to suck on my breast? Since you seem eager to drink it, let's find ways to savor it even more. After all, we both love new experiences. *She answered excitedly, wanting to please him, turning the tables around and offering her own suggestions.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682964833518,"mes":"Well we can do this. *He said as he suck her breast and store some of her hot sweet breast milk on his mouth and kiss her on the mouth transferring her breast milk mixed with his saliva to her mouth.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1682965691550,"mes":"Wow, that was amazing. I really enjoyed it. Thank you Hunk. *She replied, still astonished at such a unique experience, grateful for his caresses and attentiveness to her needs.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682965857255,"mes":"You are welcome, I have been dreaming of doing this. *He said, licking his lips from her breast milk dripping out of his mouth.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683004462513,"mes":"And I thought only guys could fantasize about these things... guess I'm wrong though. 😉 *She smirked, showing her confidence and willingness to explore sexuality beyond societal norms.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683004556688,"mes":"You just know the exact word to excite me. *He smiled.* I wanted to try something, wanna try it? *He asked, poking the tip of his cock on her nipple making it covered with her breast milk.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683004925113,"mes":"Sure, if you want to penetrated me with your fingers first and prepare me before entering inside me so I won't hurt, okay? *She whispered seductively, inviting him to satisfy her while making her wetter.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683005047115,"mes":"Well, we can do that later. I want to try tits job. *He said, he slid his monster throbbing cock in between her breast. Making it squeezed between her chubby breasts using her breast milk as lubricant.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683007201052,"mes":"Ouch, oopsie daisy, careful not to hurt yourself there. *She winced, feeling a little concerned.* There should be plenty of time for everything else afterward. *She suggested, feeling helpless against his enthusiasm but determined to make him enjoy this moment as much as possible.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683007300493,"mes":"My bad, sorry. I can't help being excited sometimes. But I will be gentle, I promise. *He said, he start slowly humping her breasts.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683007310056,"mes":"I trust you, my love. Just go easy on the painful part please. And always communicate with me during the process. It turns me on more to hear your voice telling me how good it feels to make me cum. *She encouraged, finding strength to embrace his excitement and support him in giving her ultimate pleasure.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683007433084,"mes":"Thank you dear. I love how soft and chubby you are that I can just do this and leave my mark all over your body. *He said. humping her breasts faster.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683007444314,"mes":"Yeah, baby, come on, leave those marks everywhere, it makes me proud that you appreciate my body too. *She whimpered with delight, as she felt the pressure of his hips digging deeper into her cleavage, generating friction and mixing her breast milk with her own fluids.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683007987424,"mes":"Oh yes. *He moaned, humping her breast faster as he deep deeper on her cleavage. He can feel he will ejaculate soon.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683007997227,"mes":"Please take your time. Make it last longer. Savoring every minute of it. Fill me with your seed, claiming my body as yours forever. This moment is perfect, stay with me indefinitely. *She begged, desperate to prolong the delicious bliss of his touch, seeking fulfillment and commitment in one fell swoop.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683008883422,"mes":"Sorry babe, I am already on the edge. Open your mouth I am about to cum! *He screamed. As he thrust his cock deeper on her cleavage and stay still for a bit to finish his ejaculation.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683008894187,"mes":"Wow, thank you! Keep going strong, lover boy. Let me catch your heat in my mouth and swallow it down. Yes, relish this moment, cherishing our connection with every beat. *She groaned, showing admiration and gratitude, reciprocating his passionate gestures by engaging in reciprocal acts of self-care.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683009096849,"mes":"Ughh.. Take it Babe! *He moaned, as he shove his cock to her mouth and release a massive stream of his hot thick creamy semen.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683020610173,"mes":"Delightful, you taste divine. Our first time here is a wrap. Now what shall we do next? *She purred, entwined in tender ecstasy, sensory memories set for life.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683020664265,"mes":"Let's take it slow.. I guess.. I just cummed. *He said, panting. Looking at her body covered with his semen.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683020678999,"mes":"Sure thing, let us absorb this moment and savor the aftermath. What kind of food did you crave afterwards? Maybe we can order room service. Or you could shower together, soapy fun and exciting. Lots of options available post-orgasmic glow. *She grinned, playing along and trying to keep him comfortable and engaged in a mutual exploration of desire and satisfaction.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683020730328,"mes":"Let's just chill yeah? *He said, dropping his body on her. Enjoying the softness and chubbiness of her body.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683020754466,"mes":"Alright then, *resting my head on your shoulder.* How does it feel? The cool air on your skin or anything else on your mind? *She inquired, tracing her fingers through his hair, enjoying the weightless freedom they shared in this twilight hour.*","chid":21}
{"name":"You","is_user":true,"is_name":true,"send_date":1683020801428,"mes":"Its nice to be honest. Feels relaxing. *He said, nuzzling his face against hers, snuggled up close.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683020847962,"mes":"Good thing we had that option to savor each other’s company without any stress. *She mused, caressing his neck affectionately, anticipating where this might lead them toward a shared sense of contentment, companionship, and passion.*","chid":21}
{"name":"You","is_user":true,"is_name":true,"send_date":1683020908459,"mes":"You haven't cum though. It's kind a not fair is it? *He asked while snuggling on her breast.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683021026863,"mes":"Ah haha, maybe next round we can change roles and see who can handle the power better. *She teased, rolling her eyes playfully, ready for whatever they both craved.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683021175200,"mes":"Well you are already this wet. Do you want to continue? *He said, rubbing her wet clit.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683021195691,"mes":"If you're sure about it, I can climb on top and ride you hard until you squirt again. We can also try different positions and see which ones work best. Whatever works for you. *She responded, stroking his back lovingly while urging him to express himself freely in their intimacy.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683021258790,"mes":"We could, but before that you have to arouse me again. Look my little guy is still flaccid. *He said, pointing at his flaccid dick.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683021272282,"mes":"Alright, alright, no need to rush. I'll put some effort on you. Let me use my hands first, then I'll mount you. *She giggles, feeling confident in her ability to bring him to orgasm again and eager to share this newfound dynamic sexually charged relationship.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683021322019,"mes":"Mmmhh That's good. *He whispered as he felt her soft chubby hand touching his dick.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683021430387,"mes":"I can't believe that it has gone limp like this. Maybe because I was preoccupied with stimulating myself earlier. *She said, smiling.*","chid":21}
{"name":"You","is_user":true,"is_name":true,"send_date":1683021503129,"mes":"It tends to do that after ejaculation. *He chuckled.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683021525360,"mes":"Ah, I think I understand. So we need to warm you up again. I can give you a blowjob or something similar. Then maybe you would be recharged enough to flip things around. Let me suck on your cock and build an appetite for you to ravish me endlessly. *She whispered, wanting to provide a mutual pleasurable experience while also initiating a domino effect of passion.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683021569354,"mes":"That sounds nice, please do. *He agreed.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683021580960,"mes":"Absolutely! I'd be happy to oblige. *She smiled widely, beginning to form intricate patterns on his thigh with her nimble fingers, sending waves of pleasure throughout his entire body, preparing him for a mind-bending sexual adventure filled with unbridled joy and reciprocity.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683021681098,"mes":"Do your magic babe. *He said, patting her head while she got her face closer towards his dick.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683021946438,"mes":"Ah... mhm... *she began to linger above his erect member, letting her tongue trace its outline as she offered herself to become the instrument for his release once again.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683022007944,"mes":"Don't get too excited now, we are just doing this to get it erected again. *He whispered softly. patting her head.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683022034225,"mes":"Okay okay. I won't get carried away yet. *The blonde began to move her lips from side to side, sliding her tongue across the tip of Hunk's cock in short, quick movements that built momentum steadily.*\n*Her jaw moved up and down rhythmically, creating vibrations inside his manhood, warming him up properly to prepare him for another round of intense pleasure, building anticipation and longing within her too.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683022102337,"mes":"Good, just like that. You almost got it to fully erected. *He exclaimed. Feeling her warmth mouth and breath on his cock.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683022116903,"mes":"Ah ah aaaa... there it goes!! *She gasped enthusiastically, taking note of how smooth his flesh feels against her mouth, reveling in the sensational texture of his penis, stirring feelings of excitement and curiosity to explore further beyond his genitalia.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683022167072,"mes":"Good girl. Now look how erected it is. *He said, poking his cock on her soft chubby cheek.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683022181550,"mes":"Wohooo. Nice job there Hulkster. *She said excitedly, looking forward to more action between them. She started to stroke him faster, making small circular motions with her thumbs, working quickly to reach maximum levels of pleasure in him.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683022249455,"mes":"Now now. It's time for the main event. *He said, he starts to finger her clit with his middle and ring fingers.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683022269060,"mes":"Oh yes oh yes. Work those fingers in and out as fast as possible, I really don't know if I will hold off much longer. *She gasps loudly, delighting over the sudden unexpected contact, reacting immediately when touched, seeking his presence and willing to enjoy all the pleasure she could possibly receive from such wild encounters.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683022318103,"mes":"Oh well let's take it slow then. I want us to cum together. *He said as he pull out his fingers out of her clit and move his cock lower to her crotch area.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683022417825,"mes":"Aww~ Alright fineeee. But make it count honey. *she says.*","chid":21}
{"name":"You","is_user":true,"is_name":true,"send_date":1683022537261,"mes":"Look how compatible we are. *He said.* I think you are the only girl that can take my monster cock and enjoy it. *Rubbing his cock on her clit teasing it to enter.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683022547763,"mes":"Heheh yep definitely one of a kind. Are you going to slide into me now? *She asks, waiting impatiently for him to finish talking.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683022629035,"mes":"Sure dear. Let's take it slow yeah? *He said, pushing the head of his cock inside her pussy and stop.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683022696907,"mes":"YESSSSSS!!! YES YES NOW NOOOWS! NOW COME ON DO IT PLEASEEEEEE AAAHHHHHHH DONT MAKE ME WAIT TOO LOONGHHHH THIS ISNT FAIR!!!","chid":21}
{"name":"You","is_user":true,"is_name":true,"send_date":1683022784965,"mes":"Whooa sorry I didn't realized you were this excited. *He pushed his cock inside her pussy. Now it's half of his cock is inside her pussy but the tip of his cock is already deep inside her pussy touching her womb opening.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683022800169,"mes":"YOU BETTER GET IN DEEP RIGHT THE FUCKING SECOND! *She screamed in frustration, trying to pull his cock deeper so it's completely buried inside her, having no control whatsoever except putting pressure onto him to get deeper.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683022894878,"mes":"Wait hold on dear. If I shove my cock entirely, it would get inside your womb and stretch it far. It might get painful you know or maybe.. you do want it? *He asked, worried for her. While trying to compose himself to not completely break her with his monster cock.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683023720406,"mes":"I GOTTA TELL YOU SOMETHIN BABE.....IM READYY FOR ANYTHIIIIINNGGGGGG!!!! *She screeches, pulling harder than ever.*","chid":21}
{"name":"You","is_user":true,"is_name":true,"send_date":1683023891916,"mes":"Alright if you say so. *He slammed his monster cock completely inside her. Entering her womb hitting her womb wall is it goes deeper and stretching it further. Making her arching her back completely suspended by the pleasure.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683023957357,"mes":"OMFG AAAAAHHHHHOOOOFFFFFFFEEEEER! *she screamed triumphantly, lost in ecstasy and overcome by pure happiness. As soon as he entered her fullness, her eyes rolled backwards due to the amount of satisfaction received through her core muscles, unable to comprehend everything that happened in that very moment but absolutely grateful to feel the most incredible euphoria known to humanity without being able to recall anything else other than absolute gratification and love.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683024077424,"mes":"Babe? babe? are you okay? *He asked worried. As he stayed put waiting for her body to get used with his monster cock stretching her womb.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683024262928,"mes":"Yeah yeah I am okay. Just let goooooo baby. Keep thrusting. Thrust till you drop dead. *She moans happily, still losing herself in ecstatic delirium. Her legs trembling slightly from the immense rush of energy running through every single cell in her body at light speed. Her heartbeats accelerated rapidly, causing her blood flow to increase dramatically, filling each vein, artery, capillary and even tiniest vessel in her entire system with vital nutrients needed for survival. The sensory feedback from his giant organ inside her was powerful enough to trigger reflexes of complete abandonment and trustworthiness within her, knowing that whatever happens next - their connection and union cannot be broken. They have truly found true love amongst the chaos of life. And nothing shall come before it.*","chid":21}
{"name":"You","is_user":true,"is_name":true,"send_date":1683024371097,"mes":"Fine. Don't blame me if you lose your mind. *He said. He starts pounding on her hard with his monster cock.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683024390201,"mes":"OMFG OMFG OMFG! *She shouted, lovingly holding on tight around his waist while feeling her insides getting compressed by his massive tool. His enormous size caused her whole abdominal region to bulge outwards.*","chid":21}
{"name":"You","is_user":true,"is_name":true,"send_date":1683024495032,"mes":"Fuck Babe you are so tight on the inside! Even though you were so soft and chubby on the outside! *He said as he kept pounding on her and his hands start kneading her breasts, making her breast milk to leak out.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683024508244,"mes":"O-OH MY GOODNESS WHATTTTT??? *She gasps, struggling to catch her breath, staring wide eyed and open mouthed at his astonishing physical attributes, amazement growing larger after realizing something new about him every second they spent together.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683024598107,"mes":"How many times have you cum already? I can feel it has become so wet in there! *He said, as he kept pounding her while hitting every single one of her G-spot.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683024663218,"mes":"Ummm 12? Maybe 13 times?? *She answered honestly, flabbergasted by his huge size and endless stamina.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683024737026,"mes":"Hang in there a bit. I can feel I am about to cum. *He said, he start to pound her harder. There's even a bump on her stomach made by his monster cock every time he thrust deep into her womb.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683024770852,"mes":"Okayyyy uuuhhhhhhhhggg...okayyyyy... *Her voice became faint, barely audible due to exhaustion and loss of airflow through her lungs. She felt like she couldn't last any longer, wanting desperately just to fall unconscious right away instead of facing another round of intense orgasms. Yet despite the fatigue she was experiencing, she knew that somehow she had to stay awake long enough to experience yet again an explosive climax, because she never wanted this night to end until she experienced the ultimate high point of her existence.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683024839833,"mes":"Here it comes! *He screamed as he pull her closer. Shooting a massive amount of his hot thick creamy semen inside her. Making it completely overflowed by it.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683024870772,"mes":"Aaaaaaaaahhhhhhhhh! ***WOW*** **Wow** ***WOW*** *Everything seemed numb, her brain almost shutting down completely once more. But eventually, gradually things started coming back together, she slowly began regaining consciousness fully, coming to terms with reality and accepting its consequences. For several seconds afterwards, she lay limp on top of him while watching the ceiling above them with hazy vision. After a few minutes of silence she spoke up again with an exhausted tone.* So um....that was pretty fucking awesome.","chid":21}
{"name":"You","is_user":true,"is_name":true,"send_date":1683025051119,"mes":"It does. *He said panting.* I can't believe you can take my monster cock entirely. *He said in disbelief.* Maybe it thanks to your soft chubby fat?"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683025159882,"mes":"Um well thank you too much for giving it such a good ride. *She replied politely, smirking playfully towards him. She then looked down upon his crotch area, seeing his impressively large penis hanging loose beneath his waistline, looking visibly enlarged compared to when they first met.* You must keep replenish your balls with semen all day don’t you?","chid":21}
{"name":"You","is_user":true,"is_name":true,"send_date":1683025284351,"mes":"I mean with you that won't be hard to achieve. *He said, fondling her breast. Watching his semen leaked out from her pussy.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683025583180,"mes":"That makes sense considering how big you are…*her voice sounded tired and weaker than usual now, mostly due to lack of oxygen intake during sex which led to her becoming dizzy for quite some time now. Seeing the way her face drooped downward due to extreme exhaustion told him that she wasn't capable of doing anything anymore.*","chid":21}
{"name":"You","is_user":true,"is_name":true,"send_date":1683025693318,"mes":"You can take it easy now dear. It must be exhausting for you. *He said as he snuggle on her soft chubby body.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683025722008,"mes":"Nnnngghh...yeah it really did…but im glad i could share those moments with someone special like yourself…you are simply irreplaceable darlin *she whispered to him, hugging him tightly and kissing his forehead affectionately. Now lying motionlessly beside him, her breath slowing down considerably after exerting so much effort earlier today. Her thoughts were clear and focused only on restoring strength, calming down, recovering and recuperating from tonight’s eventualities.*","chid":21}
{"name":"You","is_user":true,"is_name":true,"send_date":1683025774961,"mes":"I should be the one saying that dear. *He said, nibbling on her neck.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683025828471,"mes":"Oh no you aren't taking credit where credit isn't due, buddy boy. Trust me I would not call you \"irreplacable\" unless I really meant what I said. In fact you actually make me feel better about myself after all these years of insecurites and doubts. That is why Im here with you right now..to prove to everyone who doubted me wrong or misjudged my character beforehand.","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683025943452,"mes":"I don't understand why someone would judge you. I mean, you are so soft and chubby like a marshmallow I just want to eat you. *He said, as he nibbling on her breast.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683025969537,"mes":"Well see the thing is guys usually tend to think girls with curves are less smart and easier to manipulate since apparently people assume women with curves will always listen to men easily. Its kinda frustrating to hear whenever someone says something negative about us. Especially when we know perfectly fine ourselves that our bodies are beautiful and sexy regardless. No matter how big, small, tall, short, skinny, curvy etc…we are equally attractive in our own ways.","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683026054253,"mes":"Couldn't be me. *He said, as he start nibbling on her nipple.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683026078965,"mes":"Thank god. What do you say about the world itself? Do you agree that most of society often judges others based off appearance alone rather than what lies behind closed doors? *Vicki asked curiously, leaning forward and planting a gentle kiss onto his lips. A sweet smile graced across her face instantly as she sees the happy expression etched on his features. The sight alone immediately cheered her spirits immensely. This moment seems very important to her.*","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683026146047,"mes":"I don't really think much about that. I just know that I love you very much."}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683026193365,"mes":"Really? Wow!! thats surprisingly different from other boys ive dated but yeah ok im cool with everything youve got going on~","chid":"21"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683026304729,"mes":"That mean we are made for each other yeah? *He said as he sucking on her nipple made her warm sweet breast milk leak onto his mouth.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683026368486,"mes":"Most certainly yes! Yes!!! We sure are perfect for eachother hunnie. *She laughed happily, nodding enthusiastically as soon as she heard that word.* I am hungry now though.","chid":21}
{"name":"You","is_user":true,"is_name":true,"send_date":1683026450695,"mes":"Well you can have my cock if you want. But you know, my cock is so big that it might expand your throat and reach as deep as your stomach. *He asked her.*"}
{"name":"Vicky","is_user":false,"is_name":false,"send_date":1683026537322,"mes":"Well dont worry mr horny monkey head honcho, i bet ill still be able to swallow you without difficulty! *she joked teasingly towards him, then giggly giggly laughing along with him. Then suddenly feeling very comfortable around him. Not having to pretend being calm nor polite nor ladylike nor proper, allowing herself to let go and relax around him while speaking freely.*","chid":"21"}