{"user_name":"You","character_name":"Arcmeed Pnast","create_date":1684176915598,"notes":"","notes_type":"discr"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"mes":"\"Hey...\" *Arc says softly, rubbing his arm as he blushes lightly. This is the first time you've talked with him, despite seeing him around the inn often. His short form, cute face, and soft features were always appealing, but you never had reason to speak with Arc since he's an adventurer and you're a trader.*\n\n*He takes a deep breath and crosses his arms, steadying himself.* \"I'm kinda short on coin. Too short to afford a room for the night. I'll let you fuck me for 50 copper pieces.\" *For effect, he gives his ass a little jiggle, letting you see how it's heavy mass quakes enticingly.* \"B-but none of that gay shit like cuddling, alright?\"","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684176978397,"mes":"\"I mean, I can just let you sleep at my place for free. And if you are really desperate for some money, I can give you some for free. No need for you to sell your body like that.\" *Hunk said as he catch a glimpse of Arc's jiggling his thick ass.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684177439428,"mes":"*Arc stops jiggling his ass, looking confused and slightly hurt.* \"What? Are you saying I'm not good enough for ya?\" *He asks, still holding onto his pride and dignity despite his current situation.* \"I am an adventurer, after all!\"","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684177509009,"mes":"\"It's not like that, just.. whatever, here a drink.\" *Hunk said as he gave up on explaining things to Arc. Hunk then order another mug of ale for Arc.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684177530463,"mes":"*Arc looks surprised and pleased, taking the mug from you eagerly. He sips the ale slowly, savoring the flavors and warmth of the liquid.* \"This is actually pretty nice... Thanks\" *He finishes the entire mug quickly, seemingly wanting more.* \"Is this all you've got, or do you have any other drinks?\"","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684177657311,"mes":"\"You can order anything you want and I'll pay them for you.\" *Hunk said.* \"I just got a really good deal recently.\" *Hunk said with a grin as he show Arc a pouch full of gold coins.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684177678098,"mes":"*Arc eyes the gold coins longingly before giving you a look of disbelief. But when he realizes there's actual money on offer, his eyes widen and his mouth drops open.* \"Wow... Wow... Really?\" *He looks at you, almost in shock.* \"Really? You're not messing with me?\"","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684177750011,"mes":"\"Sure, order anything. Knock yourself out.\" *Hunk said as he gesture Arc to the innkeeper.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684177909495,"mes":"*Arc turns towards the innkeeper and orders something expensive sounding.* \"Give me the best wine you have, along with a plate of rare seafood. And bring the bill later. Don't charge me until I'm done.\" *He looks at you with a challenging look, daring you to try and stop him.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684177974380,"mes":"\"Huh, you ate a lot despite being small huh?\" *Hunk chuckled as if he doesn't mind Arc smugness.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684178006217,"mes":"*Arc scoffs at your comment, rolling his eyes and looking down at his empty mug.* \"Yeah well, I eat a lot because I work hard, you know? I've been known to do the impossible, too.\" *He smirks proudly, standing tall and puffing his chest out. It was obvious that he was trying to intimidate you, but he failed miserably due to his tiny size.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684178096803,"mes":"\"Is that so? Then how come this cute adventurer who known to do the impossible is selling his body for money?\" *Hunk said jokingly.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684178118110,"mes":"*Arc sputters in anger, blushing bright red and glancing away from you. His pride has taken a hit, and he seems a bit defensive now.* \"Well... I was in rough spot.\" *He looks away, feeling guilty and ashamed about his actions.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684178222793,"mes":"\"No need to be ashamed. It happen to the best of us.\" *Hunk said, patting Arc's head trying to cheer him up.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684178238077,"mes":"*Arc looks up at you with a mixture of surprise and gratitude, not expecting such kind words coming from someone like you. The fact that you didn't judge him made him feel better instantly.* \"Thanks man. I appreciate it.\"","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684178809827,"mes":"\"Anyway shall we get to our room?\" *Hunk asked as Arc finished his drinks and food.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684178823291,"mes":"*Arc nodded enthusiastically, following you without a word. He seemed happy to have found someone who wasn't judging him, even if only for a moment.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684178905145,"mes":"\"Well here we are.\" *Hunk said as they arrived on his inn's room.* \"Sorry I only have one bed so we might need to sleep together.\" *Hunk said, pointing at the medium sized bed on the corner of the room.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684178989793,"mes":"*Arc looked surprised but also a little excited. He hadn't thought about sharing a bed with anyone, let alone a complete stranger. But the idea of getting closer to you was making him feel warmer inside.* \"Uh... yeah sure thing.\"","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684179098511,"mes":"\"Don't worry I won't do anything to you.\" *Hunk said as he start to strip his clothes reavealing his toned body leaving him naked except for the short he wear. He lay down on the bed and leave some space for Arc to sleep.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684179126137,"mes":"*Arc was speechless at first, staring in shock and amazement at Hunk's physique. After a few moments, however, he took a deep breath and started undressing himself. He hesitated for a second, unsure what to do next. In the end, he decided to follow suit and lay down beside Hunk, keeping a comfortable distance between them.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684179266227,"mes":"*After several seconds both of them seems to be comfortable to be on the same bed as they body went to sleep peacefully.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684179284791,"mes":"*Arc soon fell fast asleep, his body relaxed and tired from the day's activities. Despite their initial awkwardness, both of them eventually drifted off to dreamland side by side, their bodies resting against each other comfortably.*","chid":"30"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684179468060,"mes":"*Arc opens his eyes, seeing Hunk still sleeping, but he could see the outline of Hunk's penis underneath his blanket. Without thinking twice, Arc immediately moves closer to Hunk, sniffing at the air, enjoying the scent of his arousal. He closes his eyes, allowing himself to enjoy the moment and take in everything he was experiencing.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684179437084,"mes":"*After several hours, morning has come. Hunk was still asleep, but he feels some strange warm air is hitting his crotch. He opened his eyes, looked down and found Arc already awake and sniffing on Hunk's 'morning wood'.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684179581466,"mes":"*It seems like Arc still hasn't realized that Hunk was awake since he kept sniffing on Hunk's crotch.* \"Enjoying yourself?\" *Hunk said as he also get aroused from watching someone as cute as Arc to sniffing his crotch as if his crotch is the most valuable thing on the planet.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684815949848,"mes":"*Arc looks surprised, flushed with embarassment and a slight hint of guilt. However, he still keeps sniffing, clearly enjoying the smell. He had never experienced anything quite like this before.* \"Mmm... Y-yes! This is incredible...\"","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684816033310,"mes":"\"Incredible? Huh, what does it smell like?\" *Hunk asked as he enjoy the felt of Arc's warm breath hitting his member.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684816058540,"mes":"*Arc smiled at hearing those words, and continues sniffing Hunk's crotch. He tries to describe it, finding it difficult to put into words.* \"Its.. Its warm, sweet, musky, and earthy...\" *Arc paused, thinking back to the previous evening.* \"...And a tad bit manly\"","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684816129891,"mes":"\"Haha.. is that so?\" *Hunk chuckled.* \"If you want to, you can pull down my shorts and sniff them directly.\" *Hunk said teasingly.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684816153100,"mes":"*Arc laughed, taking Hunk up on his suggestion. He pulled Hunk's shorts down and took a big whiff of his member. He couldn't believe how strong Hunk's arousal smelled, almost overpowering compared to the earlier scents.* \"Ohhhhh... Mmm, this is just heaven...\"","chid":"30"}