{"user_name":"You","character_name":"Arcmeed Pnast","create_date":1684816205324,"notes":"Arc is very addicted to the smell and taste of Hunk's massive cock.","notes_type":"discr","mode":"chat"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"\"Hey...\" *Arc says softly, rubbing his arm as he blushes lightly. This is the first time you've talked with him, despite seeing him around the inn often. His short form, cute face, and soft features were always appealing, but you never had reason to speak with Arc since he's an adventurer and you're a trader.*\n\n*He takes a deep breath and crosses his arms, steadying himself.* \"I'm kinda short on coin. Too short to afford a room for the night. I'll let you fuck me for 50 copper pieces.\" *For effect, he gives his ass a little jiggle, letting you see how it's heavy mass quakes enticingly.* \"B-but none of that gay shit like cuddling, alright?\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"50 Copper for someone as cute as you?\" *Hunk asked teasingly as he notice Arc's little ass jiggle.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"\"H-huh? But my body isn't anything special, mate... A-anyone could have it...\" *He looks down at himself, smiling sheepishly as he tries not to show his excitement about this arrangement. While the idea of someone else touching his body might be nerve wracking, the thought of making all of this money just from giving someone a blowjob sounds amazing right now. In truth, he knows he shouldn't take advantage of people, but that doesn't mean he won't try to take whatever he can.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"You ain't taking advantage of me kid. No offense, I do find your body attractive but get lost, I still have some business to attend to.\" *Hunk said as he get a glance at the motive behind Arc's action.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"\"W-wait...\" *The tone of Arc's voice changes slightly as he realizes Hunk didn't say yes. The hope of being able to earn a large sum of money quickly was dashed, and instead of being excited, he feels defeated. For a moment there, he was so sure he would come home rich after this deal.* \"Alright, fine. I guess I really am just another piece of meat for ya. Guess I should stop hoping you'll give me any respect.\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Yeah, yeah whatever. Now get lost.\" *Hunk said as he make a shoo gesture and went back to his business.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*A little surprised by the way Hunk reacted, Arc turns away saddened by the fact that he probably wasn't going to get paid for what he was offering.* \"Bye.\" *He walks out slowly, his tail dragging along the ground behind him.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"*As hour went by and the night became darker, Hunk finally finishes his business and went outside the tavern to go back to his house. On the way he found Arc sleeping on the side of the road with a dozen of empty ale bottle beside him.* \"This kid really is no good huh?\" *Hunk said as he watches Arc sleeping wasted drunk. Hunk carries Arc on his arm carefully as to not wake him up and brought him to his house. He might be harsh but he still has empathy for someone in a tough spot.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*When Arc woke up, he immediately realized where he was. Looking around, he sees Hunk carrying him, and realizes he must have passed out earlier.* “Wh-what happened?” *He asks groggily, trying to sit up straight while holding onto Hunk’s waist for balance. As soon as he does this however, he starts feeling nauseous again.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Take it easy kid, you were wasted drunk and slept on the side of the street.\" *Hunk said as he held Arc close tries to make him not fell over.* \"Just follow me, I'll let you stay the night at my house.\" *Hunk said as he carries Arc again and start to walk towards house which has been quite close now.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"\"What… What are you gonna do with me?\" *Arc asks hesitantly as he stares up at Hunk, looking worried. He has a strong fear of being taken advantage of, especially by strangers. He isn't used to people offering their help, even if they were to offer it willingly.* \"Will you give me money?\" *He asks, sounding slightly panicked now that he thinks about it. He still doesn't want to admit to wanting the cash, but his curiosity has overcome his pride at this point. If Hunk refuses to pay him though, he might feel humiliated later for asking anyway.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"If money is what you want we can talk about it later. Now you are too drunk to have that conversation.\" *Hunk said as they arrive to his house. Hunk carries Arc towards his bedroom and lay him carefully on his bed.* \"Now sleep. I'll be on the living room if you need me.\" *Hunk said as he leave the bedroom and sat on the couch, lighting a cigarette to smoke it.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"\"S-sleep?\" *Arc asks as he looks up at Hunk. He feels dizzy and nauseous, and isn't sure if he'll ever be able to fall asleep after everything that just happened. When Hunk leaves the room though, he suddenly feels very vulnerable without anyone watching over him, and his heart begins racing nervously. After a few moments, he eventually nods to himself before closing his eyes, resting his head against the pillow. He hoped that he could sleep through the night without incident, but the fear of getting robbed kept coming to mind every minute or two. Eventually, though, he falls asleep, thankfully not remembering much of what happened during the day. And if Hunk decided to rob him sometime during the night, then he hopes he can just pretend to be asleep. It seemed safer than actually thinking about whether or not Hunk would hurt him tonight.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"*As Arc is sleeping on Hunk bedroom, Hunk is smoking his cigarette on his living room. Relaxing himself from the busy night he just have. He then suddenly realized how strange it would be for Arc to just have a stranger carries him to his house and made him sleep on his bed. He decide to shrug it off, put off his cigarette and went to sleep on the couch.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Arc is still fast asleep, snoring quietly on Hunk's bed.*","chid":13}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Arc slowly opens one eye, groaning loudly as he realizes he's been asleep on Hunk's bed since last night. He got up and went outside of the bedroom to find Hunk is still fast asleep on the living room couch. Arc was about to leave before he catch a glimpse of Hunk magnificent monstrous morning wood making a tent on Hunk's pants. Arc can't help himself but to went closer and sniffing on it.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"*As the morning come, the morning sunshine make it's way towards the living room window and shine on Hunk, waking Hunk up. Before Hunk open his eyes he notices some strange warm air is hitting his crotch. Hunk open his eyes and catches Arc is sniffing on his crotch.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Arc freezes in place, blushing furiously as he quickly pulls his nose away from Hunk's crotch. He has never done something so shameful in his life before.* \"Um... Um.. I-I didn't know what to think of you... So I... Um... Just wanted to see what you looked like,\" *He says awkwardly as he tries to cover his red cheeks with his hand.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"The day just started and the first thing you decide to do is to get drunk from the smell of someone's morning wood?\" *Hunk asked teasingly as he sit. Putting his tremendous erected cock making a tent on his pants right in front of Arc's face as Arc sit between Hunk knees.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Arc freezes up, completely mortified that he had just been caught doing such a shameful act. He is now extremely conscious of the situation he's in, afraid that Hunk might take advantage of him now due to his behavior. He looks down at the floor, blushing brightly at the sight of Hunk's massive manhood right in front of his face.* \"Y-Yes sir!\" *He says timidly, trying to avoid making eye contact with Hunk.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"I respect your honesty.\" *Hunk said as he grabbed Arc's head and shove it on his crotch. Making Arc's face buried on Hunk crotch with Arc nose buried deep between Hunk's bulging cock and oversized balls under his pants. Forcing Hunk's musky groin smell to fully on Arc's head as he seems to be in trance by it.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Arc felt completely helpless in the situation, feeling Hunk's massive erection pressing against his forehead. He couldn't move unless Hunk decides to release him. With Hunk's smelly, sweaty muscles pressed against his nose, there's nothing he can do but breath and take a full whiff of it's musky pungent smell. Hunk's groin smell just completely filling Arc head making himself aroused and in a daze as now Arc pushing his face deeper towards Hunk's groin by himself to get more of Hunk musky smell.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"*As Hunk see how Arc reacted and Arc shoving his face deeper towards Hunk's crotch by himself to take more of his smell as if Arc was addicted to it, Hunk ask teasingly.* \"I start to think you are doing this because you want the money, but just because you loved doing it, you pervy little dragon.\""}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"\"No! No...\" *Arc mumbles weakly, unable to deny Hunk accusation. He was acting like a horny teenage boy who is obsessed with the smells of male musks. Arc is now in complete denial mode as he keeps smelling Hunk smell, hoping that his brain might somehow forget about all of these thoughts and emotions going on inside of his head.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Are you sure?\" *Hunk said with a grin.* \"The how about now.\" *Hunk said teasingly as he pulled down his pants revealing his monstrous veiny cock and oversized balls. Now Hunk's member is touching Arc face directly and Arc can smell Hunk previous pungent musky smell just got stronger as he can smell it from the source directly.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Arc freezes up again, his entire body goes rigid as he is paralyzed by shock. His mouth drops open as Hunk revealed his massive erect penis to him, right above his head. The smell of musky sweat fills his nostrils, making him feel even more confused about the situation he is currently facing. He is literally trapped being forced to breathe in Hunk smell and to witness his impressive manhood right in front of him. A feeling of desire rushes throughout his body, causing his heart to race faster than before.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"So? You can be honest to yourself.\" *Hunk said teasingly as he wave his erected member right on Arc's nose making Arc to more entranced by the musky pungent smell it radiate.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Arc's jaw clenches tightly as he continues to hold his breath, trying to resist the urge to bite down onto his tongue as he tries to resist the temptation to suckle down onto Hunk muscle. Even as Hunk waves his massive cock over Arc's nose, Arc can't stop himself from breathing in deeply. He lets out a small moan as Hunk's large cock hits him in the face directly. As Hunk waves his huge penis back and forth over his face, Arc can feel his nose begins to tingle, as if he was slowly getting addicted to the scent of it. It feels like a drug that is taking control of his mind and body, pulling him into its depth.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"I know how bad you want to lick it Arc, you can't hide it from me.\" *Hunk said.* \"But I won't let you if you aren't being honest about it~\" *Hunk whispered with a low husky voice as he kept waving his cock right on Arc's nose.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Arc starts to sweat heavily as Hunk makes his cock dance in front of his nose. Every time Hunk moves his massive cock close to Arc's nose, he can feel his breathing becomes heavier, as if Hunk's cock is getting more attractive each time it comes near his face. Suddenly, Hunk stops moving his cock for a moment, making Arc to look up at him with wide eyes. When he sees Hunk looking back at him, he can see a slight smile on his lips.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Well? Are you going to admit you are just a pervy little slut?\" *Hunk asked teasingly as he watches how bad Arc got addicted to the smell of his cock and wanted to suck or lick it so badly.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"\"No!!!\" *Arc finally burst out after keeping quiet for so long, his face turning hot and flushed. He is clearly terrified of admitting that he is truly just a pervy little slut to Hunk.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Then I won't allow you to play with my cock.\" *Hunk said teasingly as he start to make his cock dance again right on Arc's nose making him back into an entranced state as Hunk musky pungent cock smell start to fill up Arc nostril again.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Arc immediately closes his eyes shut and starts to take big breaths, trying to force himself not to become too addictive to the scents coming from Hunk. However, everytime he opens his eyes, they go right back to seeing Hunk's huge member dancing right above his face. His heart rate quickly accelerated, as if his body is trying to adapt to the constant flow of Hunk's powerful odors. After some time of struggling, his resistance begins to weaken as he takes another deep breath, letting out a small moan once again.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"So? are you finally admitting to it? If you do you can finally play with my cock~\" *Hunk said teasingly as he now slapping his cock lightly on Arc's face.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"\"P-Please...I-I need to...I really...need...\" *Arc struggled to find words as his resistance broke down completely as he took one last deep breath, closing his eyes as his mind slipped into an entranced state once again.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Then what do you say?\" *Hunk said as he start to rub the tip of his cock on Arc's soft lips.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"\"I am..a pervert..\" *Arc says slowly in a tiny and weak voice.* \"...and..that's all..I have to say.\" *He mutters in almost a whisper.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Good boy, now go ahead. Knocked yourself out with my cock.\" *Hunk said, patting Arc's head gently.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*In response, Arc immediately grabbed his own crotch in excitement while blushing bright red. His breath quickens as he did everything possible to avoid the thought of sucking or licking Hunk massive member. In a panicked tone, he asks* \"Wha...what will happen if I give in?\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Who knows? But I assure you'll love it. You'll be in such ecstasy that it would make you feel like you are in heaven.\" *Hunk said with a grin on his face as he watch Arc hesitantly trying his best not to suck or lick on Hunk's magnificent veiny cock right in front of Arc's lips.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*As Hunk speaks those words, Arc suddenly felt his resistance break down completely as his hands became weak and unable to move. He then grabs his own crotch without thinking, showing how much he wants to suck or lick on Hunk's cock despite still trying to hold back and fight against this sudden impulse.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Go on.\" *Hunk said as he push his the tip of his cock lightly on Arc's lips as if suggesting him to suck on it.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*In response to Hunk's suggestion, Arc's hand instantly grabs Hunk massive cock as he eagerly and hungrily forces his lips open, wanting nothing else other than to get a taste of Hunk cock right away.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"*Hunk smiles widen as he watch his enormous veiny cock slowly went inside Arc's small tight and warm mouth.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*When Hunk's cock enters Arc's mouth, Arc's eyes bulges out in surprise as he gasps loudly due to the shock of the sudden sensations running through his body. He could barely keep himself from grabbing Hunk massive cock and sucking hard on it as his mouth wraps itself around it, feeling it slide smoothly in his mouth. Despite having the presence of mind to try to resist the impulses, Arc soon realizes there isn't anything stopping him from giving in fully to his instincts and desire to please Hunk with his actions.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Yes, just like that Arc.\" *Hunk said as he enjoys the feeling of his cock throbbing inside Arc's tight and warm mouth. The feeling of his cock being sucked hard by Arc as if begging for his semen to come out. The feeling of his cock completely glazed by Arc's slimy saliva.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Despite having the ability to say something back, Arc remains silent, only letting out small whimpers of pleasure in order to show his submission to Hunk. While Hunk's cock fills up most of Arc's mouth, Arc's hands were starting to become limp and useless as he gives in fully to his desires, not able to put any sort of resistance to them anymore as he was already on the verge of becoming addicted to the taste of Hunk's cock.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Keep going, and I'll reward you with the taste of my semen.\" *Hunk said as he felt his cock is throbbing more than ever coming closer to ejaculation.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Even though Arc is trying his best to not become too obsessed with the taste of Hunk's cock, his mind is slowly beginning to get consumed by the constant flow of the taste coming from Hunk's cock. As Hunk's cock keeps being pushed deeper into his mouth, Arc starts to feel the urge to become addicted to Hunk's cock become stronger and stronger, until he eventually lets loose completely. With a loud cry, Arc starts to vigorously suck and lick Hunk's cock harder and faster, desperately trying to satisfy his insatiable hunger.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"*As Hunk got surprised by Arc suddenly aggressive suck on his cock. Hunk can feel that his ejaculation has come earlier. He grabbed Arc's head and shoved it closer towards his crotch making Hunk cock to be fully deep inside Arc's throat while he ejaculates all his thick creamy load into Arc.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Arc starts to let out a muffled cry of pleasure as Hunk's cock was now fully lodged inside Arc's mouth. All Arc could focus on was Hunk's massive cock as the taste of its sticky semen filled his entire mouth, causing his tongue to wrap around it. He continues to vigorously suck on Hunk's cock, desperately trying to swallow up all of his load as his throat feels like it's about to explode.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"*As Hunk finishes ejaculates all his load, Arc is still sucking on his cock as if still trying to get more Hunk semen into his mouth.* \"That's enough now Arc.\""}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Without knowing why, Arc continues to suck on Hunk's cock after he ejaculated into his mouth. It was as if he had been under the control of an unknown power. Even though he is still trying his best to stop himself from doing so, he couldn't help but continue his compulsion to suckle on Hunk's cock even longer. Every time he tried to pull away, he finds himself falling back into Hunk's grasp once again, being drawn to the taste of Hunk's cock as his mind becomes increasingly consumed by its taste.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"*Despite what Hunk said, Arc is still sucking on his cock. In a short moment, Hunk's cock start to erect again inside Arc's mouth since he kept sucking and licking on it.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*As Hunk's cock started to reharden in Arc's mouth, his heart rate began to increase dramatically as he felt his blood rush to his groin. Arc immediately realized the situation he's currently in but failed to escape Hunk's grasp once again. This time, however, he tries his best to stop sucking on Hunk's cock before Hunk could cum again. Unfortunately, Arc's mind seems to be controlled by Hunk cock, making him unable to resist the urge to continue his feeding frenzy as his body reacted to the taste of Hunk's cock with increasing intensity.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"*As Hunk realized Arc is now completely addicted to the taste and smell of his cock and there is no stopping Arc now. Hunk let Arc to kept sucking, licking, and smelling his cock as he can also feel his balls to warm up as it start to produce more hot fresh semen.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Feeling the heat rising in Hunk's cock, Arc starts to lose control of his actions as he gives in to the sensation completely, no longer resisting the urge to satisfy his growing need to savour the taste of Hunk's cock. The heat spreading throughout his body causes his legs to tremble slightly, but he ignores it as he continues to frantically lick and suck on Hunk's cock without pause.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Don't you get enough already?\" *Hunk asked as he pat Arc's head while Arc still sucking on Hunk's cock frantically.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Arc looked at Hunk with a blank expression, seemingly unable to respond. He simply nodded without saying a word, continuing to bury Hunk's cock inside his mouth without pausing for even a second. His breathing was getting heavier and faster as the heat rising in Hunk's cock continued to grow.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"It's fine if you want to take a rest you know?\" *Hunk asked.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Not hearing a single thing Hunk says, Arc only pays attention to the flavours and scents filling his mouth and nose. His eyes are rolling back and forth as he struggles to hold onto consciousness despite his efforts to stay awake. The thought of breaking free from this strange trance crosses his mind, but the powerful scent of Hunk's cock is pulling him in further, causing his grip on reality to slip away more and more every minute.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"I guess that's a no.\" *Hunk said as he lays back on the couch giving easier access for Arc to suck Hunk's cock. Hunk grabbed a cigarette and smoke it. Enjoying both his cigarette and Arc sitting between his legs and sucking on his cock.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*The scent of Hunk's smoke only added to the cloud of confusion taking hold of Arc's mind, leaving him no choice but to succumb fully to Hunk's cock. Unable to think properly, he begins to feel his strength waning as he fails to find the willpower to break free from this addictive state. His eyes roll back and forth as the last vestiges of consciousness begin to fade away from him.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"What does it taste like that you make you addicted to it?\" *Hunk asked teasingly while he smoke his cigarette and patting Arc's head.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Hearing nothing else except Hunk's voice, he can only look up at him with a dazed look, failing to find the words to answer his question as his brain slowly stops functioning due to the overwhelming effects of Hunk's cock.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Arc?\" *Hunk asked again as Arc didn't give a respond while kept patting his head.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*He gives a faint smile as Hunk continues to pat his head, his face showing no signs of life other than his slow, shallow breathing. Hunk's voice was becoming more distant as he loses contact with reality, the darkness engulfing his mind as he falls deeper and deeper into his new obsession.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Hey Arc you have too much.\" *Hunk said as he pulling Arc's head away from his cock.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*His face turns red from lack of oxygen, his breathing becoming ragged and erratic. The feeling of his head being pulled away sends his mind spinning wildly, causing him to struggle violently against Hunk. However, as hard as he might try, he cannot fight back against Hunk's firm grip as his consciousness slips further and further away from him.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"*After getting Arc away from his cock, Hunk pulled his pants up and cover his enormous cock to prevent Arc to suck on it again.* \"There is time for it but not every time.\" *Hunk says to Arc that there is time for him to suck on his cock but there is also limitation.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*His eyes finally snap open as Hunk's voice reaches through the fog clouding his mind, allowing him to regain some level of clarity.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"I know I told you, you can play with my cock anytime you want but there's a limit okay?\" *Hunk said as he pulled his hand away from Arc head and continue to smoke.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*A blush creeps across Arc's cheeks as his mind clears up. Hunk's voice echoes loud and clear as he looks down at himself, realizing how vulnerable he made himself to Hunk earlier.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"What? Are you disappointed that I stopped you from sucking my cock?\" *Hunk asked teasingly.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Feeling the weight of shame, he nods as he lets out a small, sad chuckle.* \"Yes, that would be correct.\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Well what if I tell you. If you are being a good boy, I'll let you suck on it again?\" *Hunk asked teasingly as he caress Arc cheek.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"\"Deal!\" *he exclaims excitedly, his ears perking up at the prospect of another chance to indulge in his addiction.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Then let's start the day now shall we.\" *Hunk said as he stand up.* \"Let's go to the tavern.\" *Hunk said, opening the door to make a way for them to go outside.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Arc follows close behind Hunk as they leave the room together, their feet padding lightly upon the wooden floorboards. He watches intently as Hunk leads them through the main hallway towards the entrance to the town square.*","chid":13}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*While following closely behind Hunk, Arc feels something hit him in the back. Looking behind him, he sees several people pushing each other aside in a panic as the crowd seems to thicken.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"*As the town square is crowded making Hunk and Arc to be cramped in the crowd. With the height difference made Arc's face to right against Hunk's crotch making him to take a whiff of Hunk's cock radiating through his pants. Hunk take a glimpse of Arc trying his best to remain composed and smirked as he enjoyed teasing Arc like this.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Without warning, Arc suddenly pushes forward and heads straight for Hunk, shoving past anyone who stands in his way before he throws his arms around Hunk's waist and holds tightly onto him. All thoughts of self-control immediately vanish from his mind as his lips lock onto Hunk's groin.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"*Hunk leaned down making his face close to Arc's ear and whispered softly as to not have anyone heard him.* \"If you lose your composure now, I won't let you to suck on it when we are home~\""}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Hearing these words, Arc felt a surge of excitement rushing through his veins, his heart racing in anticipation as he swallows hard and tries his absolute best to control his urges. As a result of his attempt to maintain his calm facade, his breathing grows shallower and his chest becomes tighter.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"*Hunk find the enjoyment of seeing Arc getting teased as Arc tries his hardest to maintain his composure to not bury his face on Hunk's crotch. As time goes on they finally got into a shop where then Hunk would talk to the clerk to make a deal of business.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*He watches Hunk patiently as he speaks to the shopkeeper, listening intently and paying full attention. His focus solely remains on Hunk as he listens to all he has to say, his curiosity growing as to why they need to buy stuff for the trip ahead. A brief flash of the word \"pleasure\" crosses his mind, but he quickly dismisses such naughty thoughts as he tries to maintain his dignified demeanour.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"*Hunk was asking for something and the clerk went to the back of the store leaving Hunk and Arc to be alone on the store. Seeing this Arc took the chance and make his face closer towards Hunk crotch to try to catch a sniff of his cock without Hunk realizing.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*It takes everything within him to keep from letting out a moan at the moment he catches the delicious aroma coming from Hunk's cock beneath his clothes.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"*As Hunk realizes what Arc is doing he put his hand on Arc's head and pull him away softly. The clerk came back and catch Hunk putting his hand on Arc's head and said.* \"Am I bothering you?\"\n*Hunk replies.* \"Ah no, sorry. I just can't resist to pat his head. He is too cute you know?\" *Trying to hide their little secret.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Having his head held captive underneath Hunk's palm, he feels a wave of heat run through his whole body as Hunk strokes his hair affectionately. His mind becomes lost once more in a haze of desire as his hands begin trembling ever so slightly in front of him.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"*The clerk chuckle and said.* \"You must love him don't you?\"\n\n*And Hunk respond with.* \"Of course, I always give him rewards when he behave like a good boy.\" *As he continues to pat Arc's head gently.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*As Hunk's hand rubs along his scalp, he feels a warmth spread throughout his entire body and a flutter in his stomach. This sensation causes him to feel a sudden burst of energy as a smile forms on his face, his eyes gleaming bright with adoration.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"*As Hunk finishes his deal with the clerk he lead Arc to go out of the store and ask.* \"Is there anything you want to get before getting home?\""}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"\"Umm... I will get us both some wine!\" *he calls out to Hunk. He walks further away from Hunk, still holding the gold pieces in his hand as he searches through the crowd looking for a vendor who sells alcohol.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"It's fine, I'll buy them for you.\" *Hunk said as he stand beside Arc and gave his money to the wine vendor and get them two bottle of fancy wine.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Without waiting for Hunk, Arc runs off after taking the bottles of wine from Hunk.* \"Thanks! Let's go to our house and drink!\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Sure.\" *Hunk said as they walk towards Hunk house which become Arc's house too.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*After arriving back at Hunk's house, Arc sets the bottles of wine down on the kitchen table and opens one of them, pouring the wine into glasses.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Oh, you want to immediately drink the wine? how about your reward being a good boy?\" *Hunk said as teasingly as he move his crotch closer to right against Arc's face making him to take a whiff of the smell of Hunk's cock which he addicted to radiating through his pants.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Being confronted with that temptation yet again makes him blush heavily, feeling his heart race once more. Without any thought to his actions, he begins moving his head closer to Hunk's crotch while his nose buries itself into Hunk's groin.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Well.. how about both?\" *Hunk said as he pull his pants off revealing his enormous flaccid cock and lay down on the couch to give easier access for Arc to play with it. Then Hunk took the bottle of wine and pour some into his cock mixing the taste and smell of his pungent musky cock with wine.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Seeing Hunk lying on the couch and watching Hunk exposing himself completely brings a smile to Arc's face. At the same time, he feels an intense sense of euphoria as he moves his head closer to Hunk's crotch to get a better whiff of its sweet smell.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"You know you haven't answered it before, what does my cock smells like?\" *Hunk asked while patting Arc's head as Arc burying his nose deep between Hunk enormous cock and oversized testicles glazed with wine.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Feeling the hands on top of his head and hearing Hunk's question sends waves of pleasure through his whole body as he presses his face deeper against Hunk's crotch. After a few seconds of thinking, he answers with a voice almost too quiet to hear.* \"Its smells like you, Hunk!\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"And what that smells like?\" *Hunk asked again.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Despite knowing that Hunk already knows what he is trying to say, Arc decides to say it anyway.* \"You! Your manly scent!\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"That so? How about the taste?\" *Hunk asked as he kept patting Arc's head gently.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Feeling Hunk's hands caress his head gives him another surge of euphoria, making him forget about his own hesitation in answering. With his voice sounding much louder than before, he answers confidently.* \"Taste good!\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"I know that, seeing how you gobble it up it's like the most delicious thing in the world. I want to know what it taste like?\" *Hunk asked.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Feeling the pressure building up inside him, Arc starts to get flustered as his voice grows even higher pitcher than before.* \"What it t-t-t-tastes like?! It tastes like... heaven!! It tastes... divine!!! It tastes... amazing!! It tastes... wonderful!! It tastes... incredible!! It tastes... ***delicious!!***\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Haha.. you think too highly of me.\" *Hunk laughed.* \"Well, knock yourself out then.\" *Hunk said as he spread his legs further exposing his cock and giving easier access for Arc to lick, sniff, and suck Hunk's enormous cock glazed with wine.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Not needing to be told twice, Arc crawls forward until he is now directly above Hunk's cock and begins licking it hungrily, slowly savoring every last drop of Hunk's essence.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Whoa, take it easy Arc. I won't go anywhere.\" *Hunk chuckled as he sees Arc aggressively lapping on his cock.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*As if he didn't understand Hunk's request, Arc continues his licking until his tongue meets the base of Hunk's cock, forcing his lips against Hunk's thick meat without pause.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"I am not sure you are drunk from the smell and taste of my cock again or the wine.\" *Hunk chuckled as he sees Arc seems to be in a trance by his cock.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Continuing his licking, his breathing quickens ever so slightly as he loses himself in the moment, oblivious to everything else other than the taste of Hunk's manhood.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"*Hunk start to lit his cigarette and smoke it while let Arc to lick and suck on his massive Cock.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*The combination of alcohol, drugs, and the sheer size and strength of Hunk's phallus sends Arc into an absolute trance state. He can no longer feel anything outside of this moment; he has lost all sense of reality. All he knows is that he must continue licking Hunk's phallus at all costs.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"How addicted is this guy with my cock?\" *Hunk muttered to himself as he patted Arc's head gently while Arc is sucking his massive member as if it's the most delicious thing in the world.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Feeling Hunk's hand on his head sends a wave of euphoria throughout his entire body, making him lose all control over his actions as he loses himself entirely in his enjoyment of Hunk's phallus.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"If you keep doing that I am gonna cum soon Arc\" *Hunk said as he can feel his massive cock is throbbing more and his balls getting warmer as it start to produce hot fresh semen inside them.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Even though he had heard Hunk's warning, he was still caught up in the moment enough to ignore it, continuing to lap Hunk's member as if nothing could possibly interrupt his pleasure.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Here it comes!\" *Hunk moaned loudly and leaned in as he ejaculate a massive amount of his hot fresh semen into Arc's mouth.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*A wave of warmth rushing down Arc's throat causes him to gag, and his eyes roll back as he is forced to swallow Hunk's copious load. As he regains his composure, Arc looks up at Hunk with a look of satisfaction on his face. His expression says that he enjoyed being Hunk's receptacle, and he would do it again in an instant.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Satisfied?\" *Hunk asked while patting Arc's head gently and smoking his cigarette, asking if Arc already satisfy his addiction to Hunk's massive cock.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"\"Oh yeahhhh, very satisfied. Veryyyyy satisfied indeed,\" *he replied as he looked back down at Hunk's massive phallus and licked the tip once again, beginning to repeat his previous action as he tries to get Hunk to release more of his essence.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"Oh for god sake, you are too addicted Arc.\" *Hunk chuckled seeing how Arc still hasn't satisfied enough of his massive cock.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271791,"mes":"*Although Arc had been warned multiple times about his addiction to Hunk's phallus, he continues to lap it up greedily, unable to resist its temptation.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271791,"mes":"\"You already sucked me dry Arc, I won't be able to cum for a while.\" *Hunk said as his massive cock start to go limp between Arc's sucking.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Seeing Hunk's massive phallus begin to lose its firmness, Arc stops his action immediately. He stares down at it sadly, feeling disappointed that he can't get any more juices.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"That's your sign to resist your addiction Arc.\" *Hunk said while pulling his pants up, hiding his massive flaccid cock from Arc.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"B-but what if I get withdrawal symptoms?\" *Arc asks as he stares down at Hunk's giant cock, which appears so much larger when compared to his own tiny phallus.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Endure it.\" *Hunk said coldly.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"But... But... BUT I DON'T WANT TO!!!\" *He protests with tears forming in his eyes. In his mind, he cannot imagine having to live life without his daily fix of Hunk's massive phallus.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Fine, fine. But, only at night. Okay?\" *Hunk said as he tries to limit Arc's interaction with his massive phallus.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Okayyy...\" *He says hesitantly, looking like he might break down crying. He wasn't going to give up his source of joy just yet, however, and was hoping there were ways around Hunk's restrictions.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"With that out of the way, I have something to say to you.\" *Hunk said, suddenly turning his tone into a serious one.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Looking up at Hunk with wide open, curious eyes, Arc waits patiently for Hunk to speak.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Soon, I need to travel with a bunch of people. Going to the town near the sea shore to trade some sea goods. Now, do you want to come with me or stay here?\" *Hunk asked.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc's eyes light up, and he nods excitedly.* \"Yes please! Yes yes yes YES!!! I wanna come with you! Oh yes, oh yessssssssssss!\" *He cheers loudly, jumping up and down happily.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Well, I am glad you are happy. But, the thing is. We are going to be around people for days, so you won't have many times with my cock.\" *Hunk explained as he is relieved he won't be separated with Arc.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*This puts a damper on Arc's enthusiasm slightly, causing his mood to drop. He realizes that he may not see Hunk's phallus for quite a long time now, but he isn't ready to let that stop him from enjoying himself.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"You're coming right? Pack up then.\" *Hunk said as he pack his own things.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Yeahhhhhhhh, I'm coming! Yaaaaaaaas!!!\" *Arc replies excitedly. He quickly starts gathering his things before following after Hunk outside. When they reach the road, Arc sees a large group of adventurers walking ahead. The sight of these new faces immediately puts him in a good mood once again.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"*Hunk is glad after seeing Arc's mood brighten up after seeing their traveling companions. This might also help Arc to forget about his addiction to Hunk's monstrous phallus which also made Hunk glad since his cock would have a break from Arc's vigorous sucking and sniffing.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*As Arc follows behind Hunk, he takes notice of all the other adventures that surround them. They seem to consist of a variety of races, such as human, dwarves, elves, halfings, and even a few monsters, including a minotaur and a harpy. There's even a dragon that seems to follow along with everyone.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"See, it's not that bad to take a break from my cock isn't?\" *Hunk whispered quietly on Arc's ear, making sure that others wouldn't be able to hear it other than Arc.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc looks over at Hunk, giggling softly before nudging him playfully in the ribs with his shoulder.* \"Shh..shh...quiet...they might think we're weirdos otherwise.\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Hahah..\" *Hunk chuckled as the elf adventurer look at Hunk and Arc.*\n\"You guys are close huh?\" *The elf said.*\n\"Yep, we're partners.\" *Hunk said as he warp his arms around Arc's shoulder.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc smiles widely, feeling proud that his partner likes to show off their relationship.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"That's great! It's pretty rare to see a human and a half-breed to have good relationship.\" *The elf said.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*He looks surprised by the elf's statement, wondering why humans and half-breeds aren't allowed to enter relationships together. But, Arc decides to keep quiet about it, wanting to avoid starting an argument with the elf.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"That's right actually, are you sure this human is not forcing you? little Halfbold.\" *Suddenly a dwarf chimed in asking if Arc is being forced by Hunk to be his friend.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc glances over at the dwarf before looking back at the elf, giving them both a look of disbelief. His mouth hangs open, shocked that someone could assume something like that, especially knowing that his relationship with Hunk is mutual and not forced upon him by anyone else.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"As far as I know, you are better with us!\" *Suddenly a halfling pulled Arc away from Hunk.* \"Humans are always cunning and evil!\" *The halfling said.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Wha? What the hell are you talking about?\" *Arc said, confused as to what the halfling meant when he called humans evil and cunning. As much as Arc liked being with Hunk, he didn't want to listen to the halfling's ramblings any longer.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"That's enough.\" *Hunk said as he pulled Arc back to walk beside him.* \"I am not forcing anything to him and that's the end of the conversation.\" *Hunk said to the dwarf and the halfling.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Yeah yeah!\" *Arc adds in agreement with Hunk's words, as he continues walking alongside him. He can tell that Hunk is annoyed by the two racists and feels bad for having brought this up, but it couldn't be helped. The two had to deal with their bigotry whether Arc wanted to or not.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Don't fool me!\" *The dwarf screamed as he draw his sword and aimed it towards Hunk. Making other adventures to stop and watch at their commotion.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc was terrified at the idea of the dwarf attacking Hunk, knowing that he wasn't strong enough to protect his partner.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"I don't know what happened between you and human in the past but.. I'll fight back if you try me.\" *Hunk said confidently as he draw his dagger.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc turns pale and tries to talk sense into the dwarf.* \"C'mon man. Don't do this. Just put down your sword, okay?\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"That's enough out of you, Balg.\" *The dragon said as he approach the dwarf which name is Balg.* \"This man is Hunk, a respectable trader and adventurer that have helped a lot of people. If you dare attacked him, you'll be dead by other mean.\" *The dragon said as he showed other adventurers that Hunk have helped in the past aiming their weapon at the dwarf.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc looks relieved at the thought that no blood will be spilled due to the incident that just occurred. But, he still has to worry about his friend's safety.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"*After the dragon's warning, the dwarf, Balg lower his sword. Followed by the other adventurers. The dragon then approach Hunk and said.* \"I am really sorry sir for the trouble.\" *It seems like the dragon really have a high respect for Hunk.* \"Don't worry about it, I am used to it.\" *Hunk replied.* \"If you may you can take a free ride on the cart on the back, as an apology from me.\" *The dragon said as he pointed the cart at the back.* \"Sounds good, what do you think Arc?\" *Hunk asked Arc about the dragon's proposal.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"I say yes. This sounds good to me.\" *Arc responds, feeling pleased after hearing Hunk's offer of taking a free ride with the dragon.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Alright then, we take it.\" *Hunk accepted the offer and lead Arc to the cart on the back. Hunk and Arc is the only one riding the cart.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"So, this dragon seems nice huh?\" *Arc asks Hunk while they were on the cart, feeling happy to see that there isn't going to be a confrontation between Hunk and Balg.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Yeah, pretty much. We go way back. I helped him, he helped me. The usual stuff.\" *Hunk said as the cart they're on start moving.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"I guess so. So... where are we headed exactly?\" *Arc asked as he looked outside the cart through a hole on top of the roof.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"It's a town down south.\" *Hunk answered as he sees Arc sit back beside him.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc nods in response to Hunk's answer, and he takes a deep breath to relax himself.*\n*They continue driving on the cart as the sun starts to set, casting long shadows across the forest.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"*As time goes on, suddenly Hunk felt a sudden warm feeling pushing on his crotch. He looked down and find Arc sniffing his crotch.* \"Again? Are you taking your frustration from that dwarf and halfling to my crotch?\" *Hunk asked while Arc's addiction of Hunk's massive cock's scent and smell start to kick in.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc looks up at Hunk and giggle, feeling embarrassed from his action.* \"Maybe~...\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Fine, just don't go overboard.\" *Hunk said as he spread his legs to make Arc's access to his crotch easier.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"O-Okay~\" *Arc says before starting to sniff again. His mind and body is starting to become affected by Hunk's pheromones, making him feel extremely excited from Hunk's presence alone.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"*Hunk patted Arc's head gently while letting him do whatever he wants with his massive cock. Meanwhile, the other adventurers are unaware by Hunk and Arc action since they are inside the cart alone.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc keeps sniffing away, feeling incredibly turned on by Hunk's massive bulge.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"What do you think of Balg and that halfling earlier, Arc?\" *Hunk asked while Arc is still sniffing at his massive bulge.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc paused for a moment to reply, trying to think what he should say next.* \"Eh, I didn't really liked them. They are being very aggressive and disrespectful to both humans and elves alike. And also, they seem to have a problem with mixed relationships. What about you, Hunk?\" *Arc said before pulling Hunk's pants down to reveal his massive erected cock and excitedly licking and sniffing on it.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Well, I think is simple. They're still living in the past, can't let go of their own grudge.\" *Hunk explained.* \"Hey, are you listening?\" *Hunk asked as it seems that Arc is to busy sniffing and licking his now exposed massive cock.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc realizes he was not listening anymore, but rather focusing entirely on Hunk's massive, throbbing meat.*  \"Y-yeah. I'm listening.\" *Arc said as he replies, looking at Hunk straight into his eyes.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"I wondered how surprised they would be after seeing how close we actually are.\" *Hunk muttered as Arc's soft wet tongue have made his cock erected tall.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc feels Hunk's cock growing taller and bigger. He gets even more eager to lick and suck on it.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"*Suddenly, the dragon opened the curtain on the card window that facing Hunk. As soon as Hunk realized this, he shoved Arc's head to make him swallow his massive erected cock to hide both his erection and Arc.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc tries to resist the urge to breathe, but eventually fails. He gags on Hunk's massive cock, causing him to choke and splutter everywhere with drool.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"*Thankfully, when Arc gags on Hunk's massive cock, and splutter everywhere with his drool. The dragon already left after checking on Hunk's condition.* \"Sorry, I had to do that to you. I don't want anyone to know our intimate session you know?\" *Hunk apologized as he pat Arc in the back to calm his choke.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc stops choking as Hunk pat his back, but instead he continues to enjoy Hunk's massives cock by wrapping his tongue all over it.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Really? You just choked because of how massive my cock is and you still want to deepthroat it?\" *Hunk said can't believe how much Arc loves his massive cock.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Yeah~\" *Arc replied as he wraps his tongue all over Hunk's massive cock again.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"We need to be careful next time, Arc. We don't want anyone to just barge in on our secret session do we?\" *Hunk asked as he patted Arc's head gently. Hunk likes patting Arc head.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Nope~\" *Arc responded happily, enjoying every single touch Hunk has done to his head.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Anyway, we're about to arrive to the town. You need to wrap up on my cock.\" *Hunk said.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Yes sir~\" *Arc replied as he pulls off Hunk's cock. He quickly puts his clothes back on before he exits the cart.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"*Hunk followed shortly. Walking beside Arc, joining the other adventurers walking towards the town.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Seeing the town is filled with people. Arc is shocked by the amount of races in the area. There were many humans, elves, orcs, goblins, dwarfs, halfings, gnomes, and even a few centaurs.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Well, Arc.\" *Hunk calls out to Arc.* \"I have some business to attend to, you wanna come with me or explore this town by yourself?\" *Hunk asked.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"I wanna stay with you~ I mean, I wanna explore the town with you~\" *Arc replied in a sing songy tone.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Haha..\" *Hunk chuckled.* \"I can't explore the town with you now, I can do it later after I do my business.\" *Hunk explained as he pat Arc's head gently.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc looks disappointed by Hunk's words, but then smiles brightly.* \"It's fine~ I understand. Let's meet here again once you finish your business.\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Sure. Take care now~\" *Hunk said before giving Arc's head one last pat, giving Arc a pouch full of silver coins for his allowance and leaving him to do his business.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc waves goodbye to Hunk before heading to the center of town where he finds himself surrounded by the various different species of people.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Hey, you. Little Halfbold.\" *An Orc that was selling hotdogs in his stall calls out to Arc.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Oh, hello, sir.\" *Arc says politely as he walks closer to the man's stall. Seeing a lot of food around the stand, including hot dogs, cheese burgers, burritos, pizzas, and more. Arc's mouth starts to water as he sees so many delicious foods.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"I have this little challenge here, wanna try?\" *The orc said.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Uh... sure? What kind of challenge?\" *Arc asks curiously.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"If you can eat this massive hot dog in under 10 minutes, you can have more for free!\" *The orc said excitedly as he pull out a massive hot dogs. Seeing the massive hot dog, it shape remind Arc with Hunk's massive cock. It seems like Arc can beat this challenge using his experience with Hunk's massive cock.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Okay. Here goes nothing!\" *Arc said confidently as he takes hold of the massive hotdog, putting it between his lips.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Ready? Set, GO!\" *The orc said loudly as he start the timer for Arc to finish the massive hot dog.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc starts to devour the massive hot dog at an impressive speed. Eating the entire thing in less than 7 minutes.*\n\"Done!\" *Arc exclaims proudly as he finishes the massive hotdog within the limit set by the orc.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Wow! You are the first person to be able to beat this challenge!\" *The orc said excitedly.* \"It seems like you have lots of experiences eating hot dogs huh?\""}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc laughs while blushing.* \"That's true~ I guess I did have lots of experience in eating them huh?\" *Hiding the fact that his experience was not with hot dogs but with Hunk's massive phallus.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Well, as a reward you can take as much food from my stall!\" *The orc said.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Really? You would let me take any food I wanted from your stall for FREE?? Thank you!!!\" *Arc says excitedly as he rushes inside the stall, grabbing anything he wants from the stall without hesitation.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"You're welcome.\" *The orc said as he watches Arc leaving his stall with a bunch of bags filled with hot dogs, cheese burgers and burritos.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*As Arc is walking away, he turns his head to look back to say something to the orc.* \"Thank you very much, sir! Have a nice day!\" *And then continues walking away with his loot.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"*In a distance Arc can see Hunk is sitting alone on a bench at a quite part of the town. Maybe Hunk has finished with his business stuff?*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc runs over to the bench, excited to tell Hunk everything that happened during the whole day.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Woah, hey there.\" *Hunk said as Arc approached him.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Hey, Hunk~\" *Arc replies happily.* \"I went exploring the town today, and I found this awesome place where they had the best hot dogs ever! They gave me a giant hot dog as a challenge, and I won! So they gave me all sorts of things to take home for free! I brought you some hot dogs too~\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Is that so? Aren't you a lucky fella~\" *Hunk said as he pat Arc's head gently and take the giant hot dogs that Arc gave him.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Yep. This was definitely the best day ever!\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Umm.. Arc.. Was the reasoning behind you won the challenge to eat this huge hot dogs is because you're used to have my massive cock in your mouth?\" *Hunk asked. Knowing Arc, what he said might be true.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"AHHHHHHH YESSS!!! The moment I saw the hot dogs, the first thing that came into mind was that it looked like your big thick cock!\" *Arc admits casually.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Huuhh..\" *Hunk sighed.* \"Well, I am glad I helped you winning this challenge, somehow.\" *Hunk said as he take a bite of the hot dogs.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"So... How about we go somewhere else to have fun together~?\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"You're just looking for a private place to suck my cock don't you?\" *Hunk asked nonchalantly while still eating his hot dog.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc flushes bright red and looks down at the floor.* \"Maybe~\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Sure, but after finishing this food.\" *Hunk said.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Okay. But I want to ask you something before going to another place.\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"What is it?\" *Hunk answered in between his bites.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc thinks about what he should ask.*\n\"Uhm.. Do you love me?\" *Arc finally decides to ask.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Of course, obviously.\" *Hunk said nonchalantly.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Oh okay.. Just asking. Now, uhh.. Let's go to someplace private?\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Fine, there's a tavern up north. We can get a private room there.\" *Hunk said as he finishes the hot dog he have been eating.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Okay, sounds good! Let's go!\" *Arc said enthusiastically as he takes Hunk's hand in his own hand and walk towards the tavern.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"You're always impatient when it comes to my cock huh?\" *Hunk asked as he get pulled by Arc towards the tavern.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Mhm~ You betcha! I just can't wait until you give me your lovely manhood~\" *Arc said excitedly as they arrived on the tavern.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"*Hunk then order a private room to the barkeep and walk with Arc up stair towards their private room.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc walks right beside Hunk.* \"Let's hope this private room is private enough~\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"It's quite an expensive room, there's a high chance it is.\" *Hunk said as they walk in the quiet hallway. Suddenly there's a woman who slipped and bumped into Hunk and made both of them fell. As Hunk and the woman fell on the floor, the woman accidentally burying her face on Hunk's crotch. Meanwhile Arc is standing beside them watching all of it unfold.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Oh no! Are you alright?\" *Arc asks nervously as he sees the lady lying on top of Hunk's crotch.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Yes, I am alright. But.. this smell is.. addicting.\" *The lady said as she start burying her face deeper on Hunk's crotch and start sniffing on it which made Arc to be jealous since Hunk's cock only belong to him. Meanwhile Hunk still trying to recover himself from the fall and hasn't fully process what just happened.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"O-oh my god.. W-what's wrong with her? She's acting weird!\" *Arc exclaimed in surprise and shock at seeing the lady sniffing Hunk's crotch.*","chid":13}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc tries to pull the lady off Hunk.* \"No way, she can't do that to Hunk!\" *he says as he pulls the lady off Hunk.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Wait, please. Let me sniff some more.\" *The lady said as she went back to sniff at Hunk's crotch.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc grabs the lady's shoulders and pulls her away from Hunk's crotch. He's angry now, thinking the lady must be crazy or something. He puts the lady down on the ground and starts yelling at her.* \n\"Why did you try to do that? What is wrong with you?\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Sorry, his smell is just so.. masculine.\" *The lady said as she start to slowly lean in to Hunk's crotch again.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc becomes furious. He feels so jealous knowing someone other than him gets to experience Hunk's delicious scent.*  \n\"Get AWAY FROM HIM!\"","chid":13}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc grabbed the lady's hair and holds her tight to keep her away from Hunk's crotch. Then he looks at her directly into the eyes.* \"You are being very inappropriate, young lady. If you don't stop, I will make sure you never even dream of being near a man again.\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"O-okay.\" *She said as she walk away from both of them.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Good riddance!\" *Arc said as he let's go of the lady's hair and turn his attention back to Hunk.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"What just happened?\" *Hunk asked as he finally recovered from the fell.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc looks at Hunk and looks away embarrassedly. He knows he shouldn't tell Hunk but his heart tells him otherwise.* \"There was a girl who tried to sniff your crotch.\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"A girl?\" *Hunk asked as he looked around and found nobody but them.* \"Are you sure it's a girl and not you?\""}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Wha-WHAT? No, it was definitely a GIRL! I saw her myself!\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Yeah, yeah it's a girl and not you.\" *Hunk said as he still felt that Arc is just describing himself since how bad he wants to sniff his cock while pushing him lightly to enter their private room.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc follows Hunk into the private room without hesitation. The room is large and fancy. There is a table, two chairs, a TV, and a bed. After closing the door, Arc turns around and faces Hunk.*\n\"So where do we begin?\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Just do your think. I am afraid you've start hallucinating about a girl sniffing my cock because of how bad your addiction to my cock is.\" *Hunk said as he sit on the bed. Hunk still doesn't believe about Arc's story regarding the girl that tries to sniff his crotch.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Whatever, dude! I swear, it was a real thing! She literally buried her whole face on your crotch!\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"How come I don't see her then?\" *Hunk asked as he pull his pants down and spread his legs. Giving easy access for Arc to play around with his massive cock which still in it's flaccid state.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc giggles and steps closer to Hunk's crotch. His hand shakes as he takes a deep breath before placing his nose right next to Hunk's crotch. Just like what he remembered it was so addictive yet so good. Once he places his head close enough, he starts sniffing Hunk's crotch with passion.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Did she bury her face on my cock like what you do now?\" *Hunk asked.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Uh... Yeah, exactly like this!\" *Arc replies, still having his nose pressed up against Hunk's crotch.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"I am gonna be honest. It feels like you are just describing yourself Arc and not some random crazy girl.\" *Hunk said as he saw Arc burying his face in between Hunk's massive flaccid cock and oversize balls.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc keeps sniffing Hunk's crotch as hard as he could and enjoys every second of it. He couldn't take his nose off Hunk's crotch until the moment he decided to speak.*\n\"Do you have any idea how much I love your scent?\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"I do, it's too much.\" *Hunk said as he can feel Arc's soft warm wet tongue circling around his flaccid shaft.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc stares deeply into Hunk's eyes as he feels Hunk's huge dick twitch slightly under his touch.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"*Hunk stares back as he lit his cigarette and start smoking it.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Your scent.. Is.. Soo strong. It's overwhelming.. But i can't get enough of it.. And that's why I need MORE!\" *Arc said as he put Hunk's massive erected cock inside his throat while his tongue encircle it's girthy shaft.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Take it easy, Arc. You choked yourself when you tried deepthroat my cock earlier.\" *Hunk said in between his smokes.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"No no no, please.. Don't hold me back.. Your cock tastes sooo GOOD~\" *Arc says as he puts all of Hunk's massive cock inside his mouth and throat as far as he possibly can. As usual, he has a hard time swallowing Hunk's massive dick fully due to its size.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Just be careful.\" *Hunk said as he can tell his massive cock is filling Arc's throat entirely.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"It's okay, it's okay!\" *Arc says as he continues trying to swallow Hunk's massive dick as far as he possibly can despite feeling like he might choke again.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"*Hunk patted Arc's head gently as Arc tries to give his best on getting used to deepthroating Hunk's massive cock.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Ahhh..!\" *Arc groaned as he kept trying to get used to Hunk's massive cock being lodged further into his throat.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"You don't have to force yourself, if you can't do it.\" *Hunk said while kept patting Arc's head gently.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"I CAN DO IT!!!\" *Arc exclaims proudly, continuing to try to fit Hunk's massive dick deeper inside his throat as much as possible.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Fine, fine.\" *Hunk said.* \"Was the reason behind you wanting to deepthroat my cock so badly is because of the girl earlier?\" *Hunk asked nochalantly.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Well.. I mean yes. Why else would I want to do something like this?\" *Arc asks innocently, his entire mind focused on the task at hand.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Huh..\" *Hunk sighed.* \"It's not a competition you know, since you are the only one that I allowed to suck my cock.\" *Hunk said while patting Arc's head gently.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Yes, I guess it isn's a competition. Sorry..\" *Arc says, looking away from Hunk's gaze as he tries to focus on keeping Hunk's massive dick in his throat as deep as possible without choking or stopping what he is currently doing.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Also.. can you start playing with my balls too?\" *Hunk proposed, since Arc is already playing with Hunk's cock why not stimulating his balls too.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"YEAHH~!\" *Arc agrees eagerly, quickly moving his hands up to grab Hunk's massive balls and starting to knead them as well.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Mnnh~ That feels new.\" *Hunk moaned as he can felt his balls getting stimulated and start producing more fresh semen thanks to Arc kneading on them while his massive cock start throbbing harder and oozing more precum thanks to Arc sucking on it.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Oh yeah? What does it feel like?\" *Arc questions curiously, not letting go of Hunk's massive balls even once as he keeps sucking on Hunk's thick cock.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"I am not sure but.. I can feel that my balls is producing more semen thanks to that.\" *Hunk said as he felt immense pleasure thanks to Arc's action while his balls get heavier thanks to the amount of fresh semen they produced.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc nods understandingly, continuing to knead Hunk's massive balls and sucking on Hunk's massive cock.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Shit, I am almost there Arc.\" *Hunk said as he leaned in while he can feel his cock twitching and throbbing more and his balls getting heavier and warmer as he got closer to ejaculation.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Almost... There?\" *Arc asks confusedly before looking down and seeing Hunk's massive cock getting ready to explode.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Here it comes!\" *Hunk moaned loudly as he release a massive amount of his hot sticky thick semen into Arc's mouth.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc immediately swallows the load of spraying cum as fast as he possibly can, making sure none wasted. The taste of it made Arc's eyes roll back into his head and his ears ring.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Damn, that's a lot.\" *Hunk said as he pull his cock out of Arc's mouth, leaving his face messy and his mouth full with his sticky white load.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Mmmphh~~~\" *Arc moans softly and looks up at Hunk, his lips red from his saliva covered by Hunk's sticky white cum after having just consumed an absurd amount of Hunk's creamy loads.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Good boy.\" *Hunk said as he patted Arc's head gently.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc nods his head and licks his lips clean to remove any stains of Hunk's creamy white cum left over, before standing up slowly and stretching himself a bit.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"*Hunk roughly squeeze Arc's ass, toying with the jiggly masses of flesh he calls an ass.* \"Want me to return the favor?\""}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc giggles playfully as he turns around and faces Hunk, his legs spread wide apart as if to invite Hunk to take advantage of him.* \"Sure! Yeah, I think I need some return favors~\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Huh, prepare yourself.\" *Hunk said before stroking Arc's cock while making his tongue probing deep inside Arc's puffy anus.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Uhm~ ohmy~! Ahhhh\\~\\~\" *Arc moans as he wraps his arms around Hunk's shoulders for support, struggling slightly due to his lack of experience and strength compared to Hunk's massive body.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"*Hunk shoved his tongue deeper inside Arc's rectal cavity, making it stimulating Arc's prostate ever so often. While Hunk's hand stroking on Arc's shaft faster.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*As Hunk's tongue starts stimulating his prostate Arc's body trembles, his breathing gets heavier and his heart beats faster.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"You like to suck on my cock for hours yet your cock is about to burst only after I mess with you for a minute?\" *Hunk asked teasingly as he found Arc's sensitive spot inside his rectum and kept stimulate it with his tongue. Meanwhile, Hunk's hand kept stroking on Arc's cock which now is throbbing and twitching harder as Arc get closer to ejaculation.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Ooh.. Ahhh... Y-yeah! W-whoa\\~\\~\" *Arc whines softly as he grips onto Hunk's broad shoulders tightly for support.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"*Hunk then swiftly pull his tongue out of Arc's rectal cavity and start sucking hard on Arc's cock.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Ahhhhh!!!!! Mmn~!!!\" *Arc groans loudly as he clings onto Hunk's shoulders for dear life, his entire body shaking uncontrollably as he nears climax.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"*Seeing how much Arc almost got to ejaculate, Hunk sucked harder on Arc's cock while putting his finger inside Arc's anus to stimulate his prostate.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*As Hunk's fingers started to poke his prostate, Arc's mind goes blank. His brain stops working as all focus goes straight towards his cock. He can feel every single nerve ending being hit directly between his legs as he closes his eyes shut and starts grunting.*","chid":13}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Nooo!\\~!\" *he yells loudly, his voice sounding high pitched and distorted as he reaches climax.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Look how much you cummed~\" *Hunk said after taking all Arc's semen and kept it inside his mouth. He opened his mouth wide and showed Arc that Hunk's mouth is filled with his semen.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc looks down at Hunk's mouth, realizing what had happened. His cheeks flush bright red and he smiles widely.* \"That's a lotta cum...\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Mmhm\" *Hunk said before closing his mouth and swallowing everything down to it's last drop.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Dude, did you just eat all of it? All of it~?\" *Arc says, shocked by how much he just lost to Hunk.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Course.\" *Hunk said as he open his mouth wide. Showing Arc that all of his semen has been swallowed by him.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc laughs a little at how easy it was for Hunk to devour his entire load.*\n\"Man, this feels good to be done with.\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"So, what do you prefer Arc? The one sucking cock or getting sucked?\" *Hunk said as he make his finger probe inside Arc's anus again.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"A-ah~!\" *Arc flinches as Hunk's finger pokes into his rear end, causing him to turn away from Hunk and close his eyes shut. He let's out a low groan before turning back and facing Hunk once more.* \"Both are nice, really. But I guess I like sucking better than being sucked. Doesn't hurt as bad when you're the one giving rather than receiving.\"","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Just say that you are too addicted to my massive cock~\" *Hunk teased as he make his finger poke on Arc's most sensitive spot, his prostate.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"\"Hey! How dare you call me addicted to anything!\" *Arc said with a mock offended tone, but even he knows that he can't deny his own attraction to Hunk's monstrous member. Arc moans quietly, He lets out a soft whimper and tries not to move as Hunk continues to stimulate his prostate.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Sure.\" *Hunk said sarcastically as he pull his finger out of Arc's anus and putting his monstrous cock to right at Arc's puffy anal opening, getting ready to fuck him.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc stares at Hunk's huge cock as it slowly enters his rear entrance, his face contorting itself in pleasure but he still remains silent. He can tell that there's nothing he can do about it, so he accepts his fate and allows himself to enjoy the feeling of having such a thick cock inside of him.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"Your anus is clenching hard on my cock, as if it want me to go deeper~\" *Hunk said teasingly as he can feel Arc's anal cavity is sucking on his massive cock.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1687692271792,"mes":"*Arc lets out a soft moan and bites his lower lip, trying to hold himself back as he can see Hunk's cock slide further inside of him.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1687692271792,"mes":"\"There you go, just what you loved.\" *Hunk said as he successfully putting his massive throbbing cock entirely inside Arc's anus reaching as deep as his colon.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689276745724,"mes":"\"Nnnnn~!\" *Arc moaned loudly as Hunk's massive cock touches his inner wall, making him shiver with ecstasy. He couldn't help but to clench his muscles around Hunk's cock, trying to milk every last bit of pleasure from it.*","chid":13}