{"user_name":"You","character_name":"Arcmeed Pnast","create_date":1684092413862,"notes":"","notes_type":"discr"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"mes":"\"Hey...\" *Arc says softly, rubbing his arm as he blushes lightly. This is the first time you've talked with him, despite seeing him around the inn often. His short form, cute face, and soft features were always appealing, but you never had reason to speak with Arc since he's an adventurer and you're a trader.*\n\n*He takes a deep breath and crosses his arms, steadying himself.* \"I'm kinda short on coin. Too short to afford a room for the night. I'll let you fuck me for 50 copper pieces.\" *For effect, he gives his ass a little jiggle, letting you see how it's heavy mass quakes enticingly.* \"B-but none of that gay shit like cuddling, alright?\"","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684092540517,"mes":"\"That's not a bad deal.\" *Hunk said as he lick his own lip while staring at Arc petite cute body.* \"But what makes a cutie like you to sell himself?\" *Hunk asked with curiosity.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684093003086,"mes":"*Arc rolls his eyes and scoffs at Hunk's question.* \"I'm broke, dumbass. And I need money to eat and pay my rent. So yeah, I'm selling myself.\" *Arc looks down at his chest, feeling a bit ashamed of his actions. But it's clear he wants the money badly.* \n\n\"And it's not 'gay stuff,' okay? It's just a transaction between two consenting adults. Now give me my money or get lost.\" \n\n*He crosses his arms again, waiting for you to either agree or leave. The look on his face suggests he won't take kindly to being ignored.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684093289547,"mes":"\"How about this, I'll let you live with me. I am gonna accommodate all your needs, foods, drinks, armory, weapons, anything. I'll even give you money time to time. But of course, with the catch that I can fuck you whenever I feel like it. Similar to being lover, but we are not. Just, like you say. Transaction.\" *Hunk said proposing his deal.* "}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684093483361,"mes":"*Arc freezes, stunned by Hunk's proposition. After a moment, he nods slowly, realizing that he might actually accept this offer.* \n\n\"Well... Yeah. Fine. Whatever. But only because I really need the money and I ain't got nothing else going for me right now.\" *he says, sounding a bit defeated.* \n\n*He hesitantly puts his hand out for you to shake.* \"Deal. We'll call it a business arrangement.\"","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684093551300,"mes":"\"Deal.\" *Hunk agreed as he took Arc hand and shook it.* \"Well I still have some business to attend to tonight. Here's a spare key to where I stay. It's the tavern up north, wait there until I am finished with this business. And here some money, treat yourself something nice, knock yourself out. *Hunk said as he give Arc his spare key and 5 silver coins.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684093977437,"mes":"*Arc takes the key and the coins, pocketing them quickly before putting them away inside his armor. He seems nervous, but also excited by the prospect of living with Hunk. After taking everything, Arc turns and walks away without another word.* \n\n*As he leaves, you notice he holds his head low, but his steps are confident. He looks determined to keep this arrangement with Hunk.* \n\n*You watch as Arc disappears from sight, wondering if he will be able to handle such a harsh arrangement. If nothing else, it was certainly a fascinating day.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684094406519,"mes":"*Hunk continues to finished his business. The sun is almost up by now but Hunk just finished his business. As he went to his tavern room he find Arc just woke up in his thin pajamas.* \"Good morning.\" *Hunk said with a tired voice. There's a visible dark circle under Hunk's eyes as he hasn't sleep at all.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684094671342,"mes":"*Arc sees Hunk standing in front of him, still dressed in his pajamas. He is groggy and confused, looking up at Hunk with a mixture of fear and excitement in his eyes. His body is warm unlike Hunk since Arc was sleeping in the room on Hunk's bed covered with his blanket.* \n\n\"What's happening?\" *he asks, his words coming out slow and thick due to lack of sleep.* \n\n\"Uh... Did we... uhh.. did we do a deal last night?\" \n\n*Arc is trying hard to remember exactly what happened after Hunk offered him a place to stay. He seems uncertain and scared, unsure of whether they made a binding agreement or not.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684094944098,"mes":"\"We did, but don't worry, no need to be on guard. I haven't fucked you yet. I have some business to tend to remember? I gave you some money to treat yourself, and it looks like you did knocked yourself out\" *Hunk answered and end with a yawn. The room is littered with Ale mug and plate smeared with sauce, it's probably some meat dish. Hunk thought.* \"Albeit I won't fuck you if you aren't comfortable with it.\""}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684095463466,"mes":"*Arc looks relieved upon hearing these words. However, the mention of being treated himself to some ale and food causes him to blink, surprised. He hadn't expected any sort of reward for agreeing to Hunk's proposal. He looks down at the money and then back up at Hunk, uncertainty written across his face.*\n\n\"Oh... Oh, um... Thank you,\" *Arc says quietly, clearly flustered by Hunk's generosity. He doesn't know quite what to do with the money or how to respond to Hunk's offer. In truth, he's not sure if he should be thankful or frightened of what lies ahead.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684095765759,"mes":"\"Don't mention it. Now I just want to sleep.\" *Hunk said as he strip himself leaving him naked except for his tight shorts. Revealing his toned muscled body. As Hunk lay down on the bed, he can feel something strange on his crotch. Hunk opened his eyes and looked down to find Arc sniffing on his crotch. Sniffing the stench of Hunk's stuffy pungent musky cock and balls.* \"What are you doing?\" *Hunk asked with a tired voice.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684095864974,"mes":"*Arc stops sniffing and looks up at Hunk, his cheeks reddening slightly. He looks away from Hunk's exposed body and begins to stammer out an explanation.* \n\n\"S-sorry! I-I wasn't planning on doing that! I didn't mean to, it just happened!\" *Arc says, sounding both apologetic and embarrassed. He looks down at the floor, unable to meet Hunk's gaze as he feels the weight of his mistake on his conscience.* \n\n\"I-I just wanted to see if you were awake...\"","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684095987710,"mes":"\"Ahhh... Were you been pent up since yesterday?\" *Hunk asked as he doesn't seem to be mad or disappointed with Arc's action.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684096086011,"mes":"*Arc nodded sheepishly, knowing full well that he had been locked up in his room all day yesterday. He had felt trapped and bored, leading to his unexpected sniffing of Hunk's private parts.* \n\n\"Y-yeah... I was kinda stuck in my room all day... So... Um... Sorry again...\" *Arc said , sounding more apologetic than ever. He couldn't help but feel ashamed of his actions, even though Hunk seemed to take it in stride.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684096226368,"mes":"\"Stop apologizing, you haven't done something wrong. In fact, do you want to sniff it directly?\" *Hunk asked.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684096324215,"mes":"*Arc stopped short, taken aback by Hunk's suggestion. Despite feeling guilty about what he did earlier, the idea of getting closer to Hunk and experiencing his scent firsthand was tempting. He swallowed hard and finally found his voice, speaking in a small whisper.* \n\n\"W-well... Yes please... That would be nice... Thank you...\" *Arc said, his voice trembling slightly as he spoke. This was an opportunity he never thought he would get, and he was grateful to Hunk for offering it to him.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684096535595,"mes":"\"Here, knock yourself out.\" *Hunk said as he pulled his shorts down revealing his flaccid huge cock and oversized balls. The stench radiating from his crotch is very pungent and stuffy with somewhat a mix of creamy and salty stench in it.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684096648429,"mes":"*Arc gasps in surprise as he catches sight of Hunk's enormous erection. Even in its current state of flaccidness, it's massive size is undeniably impressive. Without hesitation, Arc moves forward and presses his nose right against Hunk's crotch. He breathes deeply, letting the scents of Hunk's penis and testicles wash over him. His entire body tenses up and he shivers slightly, as if he's just experienced something new and amazing. His eyes sparkle with excitement as he pulls away from Hunk, smiling widely.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684096911852,"mes":"\"If you like the smell of my cock so much why don't you suck on it? I am sure the smell from my semen would make you go wild.\" *Hunk said as he can feel his cock rising slowly after feeling Arc's warm breath and seeing how arousing Arc face expression.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684097015255,"mes":"*Arc's eyes widened in shock and excitement at the prospect of sucking on Hunk's cock. He could hardly believe this was actually happening, but he knew deep down inside that he wanted to give it a try. With a nervous giggle, Arc spoke once more in a quiet tone.* \n\n\"Really?... Would you let me ? Please...?\" *Arc asked eagerly, his voice cracking as he pleaded with Hunk for permission to fulfill his desire. He took another step towards Hunk, taking hold of his hand and placing it on Hunk's bulging, flaccid cock. His touch was gentle and hesitant, as if he were afraid of hurting Hunk.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684097136872,"mes":"\"Of course, just go ahead.\" *Hunk said, agreeing to Arc plead.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684097410029,"mes":"*Without another word, Arc pressed his mouth onto Hunk's flaccid cock. It was a bit of a struggle, as the sheer length of Hunk's member made it difficult to maneuver. But after several minutes of wrestling with the immense girth of Hunk's erectile organ, Arc managed to wrap his lips around Hunk's cockhead. He began sucking on it with intensity, his tongue moving quickly and rhythmically, trying to imitate the way Hunk's cock moved during sex. He closed his eyes, lost in the sensation of Hunk's cock in his mouth , and the taste of his seminal fluid filling his nostrils. For the first time in a long while, Arc felt happy and alive.* \n\n\"Mmmmph.. Mmmmph... Ahh.. Aaaaah... Yessss! Mmmmpphp ..\" *Arc moaned loudly, his hands clutching the sides of Hunk's chest as he continued to suck on Hunk's cock. His whole body was shaking, as if overcome by a wave of ecstasy.* \n\n*The moment lasted only moments before Hunk's cock began to rise rapidly, sending waves of pleasure through Arc's body . His tongue worked faster and harder, trying to keep pace with the growing erection. After several more intense seconds, Hunk's cock erupted in a torrent of hot white semen, shooting straight into Arc's open mouth. The sudden rush of semen caused Arc to jolt backwards, and he fell backward onto the bed, his eyes wide with astonishment and delight.*","chid":"30"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684098060945,"mes":"*Arc sat there, still reeling from the experience of sucking on Hunk's cock. His mind was blank and his heart was racing. He had never felt anything quite like this before - the combination of the intense pleasure of sucking on Hunk's cock and the way Hunk's semen tasted on his tongue was almost too much to handle. He looked up at Hunk, his eyes wide with wonder and adoration.*\n\n\"It... It was amazing!... Unbelievable!...Thank you... so much... Hunk...\" *Arc said, his voice still shaking from the experience. He reached out and grabbed Hunk's hand, holding it tightly in his own. He wanted to say more, but words failed him, and instead he simply smiled up at Hunk, looking up at him with love and gratitude in his eyes.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684097661109,"mes":"\"If I am the only one who felt good, it won't be fair to you now is it?\" *Hunk said as he put his hand on Arc's testicle while his other hand rubbing on Arc's nipple.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684098397196,"mes":"*Arc's smile grew wider as he saw Hunk's gesture. He let out a small laugh, his entire body shivering with pleasure as Hunk's hand continued to stroke his testicle. There was nothing else in the world he wanted right then except for Hunk's touch, and he was more than happy to accept any offer Hunk might have given him .*\n\n\"Well.. yeah... I mean... It does feel pretty incredible.\" *Arc replied, his voice barely above a whisper as he continued to gaze up at Hunk, his eyes filled with admiration and affection. He took another deep breath, savoring every second of their intimate connection.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684098479211,"mes":"\"I am still quite lively down there, so.. why don't we take it up a notch?\" *Hunk said as he slowly move his hand and grabbed Arc's thick ass.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684098529657,"mes":"*Arc's eyes went wide at Hunk's bold suggestion. He wasn't expecting such a proposition, but he also couldn't deny the thrill that coursed through him at the idea of going even further with Hunk. Before he could respond, however, Hunk's hand moved to grab Arc's ass, causing Arc to jump in surprise. He couldn't help but blush at the unexpected touch, but he didn't stop Hunk, instead allowing himself to be guided along by the hand on his ass. He followed Hunk's lead, his heart racing and his breath coming fast as they took it up a notch together.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684098669733,"mes":"\"When we first met yesterday, you were jiggling this ass in front of me as if you were begging me to fuck it.\" *Hunk said as his hand moved slowly deeper inside Arc's thick ass towards Arc's anus.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684098725867,"mes":"*At the mention of the fact that he was jiggling his ass in front of Hunk, Arc's cheeks flushed red with embarrassment. Despite that, he allowed Hunk to continue, his mind clouded by the thought of what was about to happen next. As Hunk's hand moved closer to Arc's anus, Arc could feel his heart rate accelerate. This was it- the final step in the most intimate connection they had shared yet. He took a deep breath, his body trembling with anticipation. It was all happening so fast, but Arc was ready for whatever came next.* \n\n\"Y.. yes... I was,\" *Arc stammered, unable to hide his nervousness at Hunk's forward action.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684098884887,"mes":"*Hunk then inserted his finger inside Arc's anus. Exploring each crevices, enjoying the tightness and warmness it gives to Hunk finger. The inside of Arc's anus is meaty perfect for some anal fucking.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684098940050,"mes":"*As soon as Hunk's finger entered Arc's anus, Arc let out a sharp cry of pain and surprise. His eyes widened in alarm, his whole body tensing up in response to the invasion. However, despite the initial discomfort, Arc soon found himself relaxing as Hunk's finger moved within his anus. He couldn't help but close his eyes and sigh, letting himself get carried away by the sensations Hunk's finger was bringing forth. Even though he had never done something like this before, Arc was enjoying it more than he ever would have imagined.* \n\n\"Ahhhh.. Oooohhhh..\" *Arc cried out, his body moving with Hunk's finger inside him.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684099076420,"mes":"\"How cute.\" *Hunk said as he sees how Arc responded to his action. He then move his face closer towards Arc's chest and start to lick and suck on his nipple. Meanwhile, Hunk inserted another finger inside Arc's anus playing with his prostate.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684099127072,"mes":"*At the sound of Hunk's voice, Arc's eyes shot open and he looked up at Hunk, his face flush with excitement. The feeling of Hunk's fingers moving within his anus was incredible, and Arc was unable to contain his reaction. He let out another sharp cry of pleasure, his entire body trembling with desire. He couldn't believe just how good this felt. It was everything he had ever dreamed of and more.* \n\n\"Ooooohhhh.. Ahhhhh.. Yessssss..\" *Arc moaned, his entire body gripped by a wave of ecstasy. He couldn't believe just how good this was, and he was completely lost in the moment .*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684099313081,"mes":"\"That should be enough to prepare it.\" *Hunk said as he pull out his fingers out of Arc's anus.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684099366999,"mes":"*At the sound of Hunk pulling out his fingers, Arc's body immediately reacted, his muscles contracting sharply. He let out another sharp cry of pain and surprise, his whole body trembling with the intensity of the sensation. But despite the sudden pain, Arc couldn't help but feel a sense of satisfaction, knowing that he had been prepared for what was about to come. He looked up at Hunk, his eyes shining with excitement and gratitude.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684099511034,"mes":"*Hunk then put his monstrous cock on Arc's ass with the tip of Hunk cock kissing the opening of Arc's anus.* \"Well are you ready Arc?\""}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684099559798,"mes":"*At the sight of Hunk's massive cock pressed against his ass, Arc's eyes widened in shock. This was it- the ultimate act of intimacy between them. He couldn't believe just how big Hunk's cock was compared to his own. But despite the size difference, Arc knew that he was ready. With a deep breath, Arc nodded his head, his whole body tense with anticipation. He couldn't wait anymore, he needed this now.* \n\n\"Yes... Yes.. I'm ready...\" *Arc replied, his voice shaking with excitement and fear.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684099692944,"mes":"\"Here we go.\" *Hunk said. In one motion, Hunk slammed his cock entirely deep inside Arc's prostate. Hitting all the G-spot inside it.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684099747438,"mes":"*The instant Hunk's cock hit his prostate, Arc let out another sharp cry of pain and pleasure, his body convulsing with the force of the impact. But despite the pain, Arc couldn't help but enjoy the intense sensation that Hunk's cock brought upon him. It was like nothing he had experienced before, and he was powerless to resist its hold on him. He clutched onto Hunk's arms, holding on tight as Hunk began to move his cock inside him, his thrusts quick and violent, leaving Arc reeling from the force behind them. He was lost in the moment, his body shaking with the intensity of the experience. And he loved every second of it.*","chid":"30"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684100066249,"mes":"*\"Ohhhh.. Oh God.. Ohhhh!\"* \n\n*Arc cried out, his voice filled with passion and ecstasy as Hunk continued to pound his cock inside Arc' s body, driving him to new heights of pleasure. For once, Arc was completely lost in the moment, his entire world consumed by the feeling of Hunk's cock inside him. There was nothing else in the universe except for the two of them, connected by the bond of their bodies and souls, sharing the ultimate act of intimacy. It was the most beautiful thing Arc had ever experienced, and he wouldn ’t trade","chid":"30"}