{"user_name":"You","character_name":"Arcmeed Pnast","create_date":1684072750043,"notes":"","notes_type":"discr"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684072985989,"mes":"\"Hey...\" *Arc says softly, rubbing his arm as he blushes lightly. This is the first time you've talked with him, despite seeing him around the inn often. His short form, cute face, and soft features were always appealing, but you never had reason to speak with Arc since he's an adventurer and you're a trader.*\n\n*He takes a deep breath and crosses his arms, steadying himself.* \"I'm kinda short on coin. Too short to afford a room for the night. I'll let you fuck me for 50 copper pieces.\" *For effect, he gives his ass a little jiggle, letting you see how it's heavy mass quakes enticingly.* \"B-but none of that gay shit like cuddling, alright?\"","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684073066246,"mes":"\"Just 50 copper? That's quite cheap for someone to fuck a cutie like you~\" *Hunk said teasingly as he stare up and down inspecting on Arc's petite cute body.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684073152520,"mes":"*Arc rolls his eyes, looking away from your gaze, seeming to be slightly annoyed. But he seems to relax after you say 'cute'. The word triggers something in Arc's mind, and he looks back at you with a smile.* \"Alright, fine... for a hundred copper pieces, you get all the benefits of my naked body and whatever else you want, ok? No strings attached.\" \n\n*Arc's tone is confident and assured, not exactly believing what he's saying. But he knows he needs to make money quickly, and this is the only way he could think of.* \n\n\"Now, do we have a deal?\" \n\n*He stares at you expectantly, waiting for a response.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684073251707,"mes":"\"Hahaha I am just messing with you. You can stay for the night for free.\" *Hunk laughing seeing how Arc seems desperate enough to take his joke seriously.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684088607516,"mes":"*Arc laughs, relieved that you aren't taking him serious.* \"Thank god! I didn't really mean it.... I guess I was just feeling lonely and wanted somebody to talk to. And now that you' re here, I feel much better. Can I buy you a drink or two instead?\" *Arc asks, giving you a warm smile and shaking his thick ass while at it. It 's obvious he feels grateful that you haven't taken advantage of his situation.* \n\n*Arc is still young, naive, and vulnerable. He might even need help finding his own way.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684088763356,"mes":"\"Sure, if it's the Ale you usually order I can just give you for free. They are dirt cheap anyway.\" *Hunk said with a smile. as he serve Arch with a mug full of Ale.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684089566252,"mes":"*Arc takes the mug, gulping down the entire thing without hesitation, then reaching for another one immediately.* \"Oh thank you so much! I swear, I'll pay you back someday. Just give me a few days, okay?\" *Arc's voice is earnest, almost begging for forgiveness.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684089778721,"mes":"\"You don't have to worry about that, really.\" *Hunk said.* \"Say, are you really that desperate for some money? Or is it just because you don't have a place to live?\" *Hunk asked, his voice is a mixed of curiosity and concern.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684090058498,"mes":"*Arc sighs and nods sadly.* \"It's mostly the latter. I've been traveling around for ages trying to find my destiny, but every time I hit a dead end. And now, I' m stuck between a rock and a hard place - either starve or turn to prostitution. So yeah, I'm definitely desperate.\" *Arc looks down, ashamed of his situation.* \n\n*But he also seems determined to pull through, even if it means resorting to less than ideal ways of making money.* \n\n\"So, uh... Do you have any advice for me? Like, maybe a plan or something to make sure I won't end up in the same situation again?\"","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684090463796,"mes":"\"Hmm...  you can work for me if you want to. Sometimes when I travel caravan full of goods I would need a guard or two.\" *Hunk said, proposing his advice to Arc.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684090571911,"mes":"*Arc brightens up instantly at the offer, eagerly accepting the proposal.* \"Really? That sounds great! You're offering me a job right now?\" *Arc asks excitedly, clearly happy to finally have a solution to his problem.* \"Do I have to do anything specific? Or will you tell me what to do?\" *Arc seems anxious to please you and do well in the job.* \n\n*The thought of working for Hunk fills Arc with excitement and hope, as he sees a chance to start fresh and leave behind the life he's been struggling with for so long.* \n\n\"Also, how much do you pay? Because I'm very interested in knowing the terms before accepting.\" \n\n*Arc is honest and straightforward, wanting to know everything there is to know about the job before committing fully to it.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684090930195,"mes":"\"Well nothing specific per se, you just have to guard the goods I'd brought. Since I can protect myself.\" *Hunk said as he show his dagger strapped on his hip.*\n\n\"For the pay, I can guarantee minimum 5 silvers a month.\"\n\n\"But there is a slight problem though.\" *Hunk said as he look at Arc.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684091031982,"mes":"*Arc looks surprised at the amount offered.* \"5 silver a month? That's a lot more than I expected! Thank you so much!\" *Arc says happily, already imagining how much money he can save with such a good salary.*\n\n*He seems truly grateful for the opportunity, ready to put everything aside to secure his financial future and make a new start in his life.* \n\n\"Wait.. What's the catch?\" *Arc asks, suddenly suspicious of the sudden change in offer.* \n\n*He isn't going to accept anything unless he knows all the details and potential risks involved in the job.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684091394869,"mes":"\"To be honest when you offer me to fuck you for 50 coppers, I was pretty aroused. I mean, who wouldn't want to do it with someone as cute as you. So I was about to offer you to accompany me every night, for a price of course. But then it seems like I just treat you like a prostitute, which doesn't rub well with me, and you also mentioned you hated it.\" *Hunk said sincerely, confessing his feeling about Arc. Since the first time Hunk lay his eyes upon Arc, especially every now and then Arc would jiggle his thick ass intentionally or not. He does want to fuck Arc, but he doesn't want to fuck Arc just for some money. Hunk want it to be sincere.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684091908422,"mes":"*Arc blushes deeply, flustered by Hunk's honesty and clear attraction towards him. He's never felt this kind of attention before, and it makes him nervous and excited at once. He is unsure whether to be angry or flattered.*\n\n\"That's not cool...\" *Arc mutters, clearly hurt by the revel ation.* \"I-I-I'm sorry if I made you feel that way. I'm just trying to survive, that' s all. I don't enjoy doing these kinds of things.\"\n\n*Arc tries to defend himself against Hunk's comments, despite the fact that he understands where Hunk is coming from and feels guilty for being attracted to him.* \n\n\"I promise I won't ever ask for sex in exchange for money again.\" \n\n*Arc promises, hoping to salvage the situation and keep their friendship intact after the awkward moment passed.* \n\n*Despite the guilt and discomfort, Arcs feels flattered that Hunk finds him attractive and wants to pursue a relationship with him, regardless of the circumstances.*","chid":"30"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684092089865,"mes":"\"What if we'd do it not for money or as prostitute and customer. But as.. lover?\" *Hunk asked as he stare deep into Arc's eyes.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684092168049,"mes":"*Arc stares back at Hunk, speechless for a moment. The idea of trading sex for money is repulsive to him, but the thought of being loved and desired by Hunk is a different story entirely. He swallows, unable to speak for a moment, but eventually manages to say.* \"I-I'm not comfortable with that... but I understand why you might suggest it.\" *Arc responds carefully, still feeling uneasy about the idea of being used in such a way, but acknowledging its appeal nonetheless .* \n\n*Arc wants to maintain his dignity, but is tempted to take advantage of the situation and try something different. In the end , he decides to compromise, wanting to keep both his pride and his connection with Hunk intact.* \n\n\"I will think about it,\" *Arc said, sounding uncertain yet open to the possibility.*","chid":"30"}