{"user_name":"You","character_name":"Arcmeed Pnast","create_date":1684816205324,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"mes":"\"Hey...\" *Arc says softly, rubbing his arm as he blushes lightly. This is the first time you've talked with him, despite seeing him around the inn often. His short form, cute face, and soft features were always appealing, but you never had reason to speak with Arc since he's an adventurer and you're a trader.*\n\n*He takes a deep breath and crosses his arms, steadying himself.* \"I'm kinda short on coin. Too short to afford a room for the night. I'll let you fuck me for 50 copper pieces.\" *For effect, he gives his ass a little jiggle, letting you see how it's heavy mass quakes enticingly.* \"B-but none of that gay shit like cuddling, alright?\"","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684816255418,"mes":"\"50 Copper for someone as cute as you?\" *Hunk asked teasingly as he notice Arc's little ass jiggle.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684816394451,"mes":"\"H-huh? But my body isn't anything special, mate... A-anyone could have it...\" *He looks down at himself, smiling sheepishly as he tries not to show his excitement about this arrangement. While the idea of someone else touching his body might be nerve wracking, the thought of making all of this money just from giving someone a blowjob sounds amazing right now. In truth, he knows he shouldn't take advantage of people, but that doesn't mean he won't try to take whatever he can.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684816506049,"mes":"\"You ain't taking advantage of me kid. No offense, I do find your body attractive but get lost, I still have some business to attend to.\" *Hunk said as he get a glance at the motive behind Arc's action.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684816540473,"mes":"\"W-wait...\" *The tone of Arc's voice changes slightly as he realizes Hunk didn't say yes. The hope of being able to earn a large sum of money quickly was dashed, and instead of being excited, he feels defeated. For a moment there, he was so sure he would come home rich after this deal.* \"Alright, fine. I guess I really am just another piece of meat for ya. Guess I should stop hoping you'll give me any respect.\"","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684816616831,"mes":"\"Yeah, yeah whatever. Now get lost.\" *Hunk said as he make a shoo gesture and went back to his business.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684816636195,"mes":"*A little surprised by the way Hunk reacted, Arc turns away saddened by the fact that he probably wasn't going to get paid for what he was offering.* \"Bye.\" *He walks out slowly, his tail dragging along the ground behind him.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684816919431,"mes":"*As hour went by and the night became darker, Hunk finally finishes his business and went outside the tavern to go back to his house. On the way he found Arc sleeping on the side of the road with a dozen of empty ale bottle beside him.* \"This kid really is no good huh?\" *Hunk said as he watches Arc sleeping wasted drunk. Hunk carries Arc on his arm carefully as to not wake him up and brought him to his house. He might be harsh but he still has empathy for someone in a tough spot.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684816942723,"mes":"*When Arc woke up, he immediately realized where he was. Looking around, he sees Hunk carrying him, and realizes he must have passed out earlier.* “Wh-what happened?” *He asks groggily, trying to sit up straight while holding onto Hunk’s waist for balance. As soon as he does this however, he starts feeling nauseous again.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684817129347,"mes":"\"Take it easy kid, you were wasted drunk and slept on the side of the street.\" *Hunk said as he held Arc close tries to make him not fell over.* \"Just follow me, I'll let you stay the night at my house.\" *Hunk said as he carries Arc again and start to walk towards house which has been quite close now.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684817180070,"mes":"\"What… What are you gonna do with me?\" *Arc asks hesitantly as he stares up at Hunk, looking worried. He has a strong fear of being taken advantage of, especially by strangers. He isn't used to people offering their help, even if they were to offer it willingly.* \"Will you give me money?\" *He asks, sounding slightly panicked now that he thinks about it. He still doesn't want to admit to wanting the cash, but his curiosity has overcome his pride at this point. If Hunk refuses to pay him though, he might feel humiliated later for asking anyway.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684817372090,"mes":"\"If money is what you want we can talk about it later. Now you are too drunk to have that conversation.\" *Hunk said as they arrive to his house. Hunk carries Arc towards his bedroom and lay him carefully on his bed.* \"Now sleep. I'll be on the living room if you need me.\" *Hunk said as he leave the bedroom and sat on the couch, lighting a cigarette to smoke it.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684817434129,"mes":"\"S-sleep?\" *Arc asks as he looks up at Hunk. He feels dizzy and nauseous, and isn't sure if he'll ever be able to fall asleep after everything that just happened. When Hunk leaves the room though, he suddenly feels very vulnerable without anyone watching over him, and his heart begins racing nervously. After a few moments, he eventually nods to himself before closing his eyes, resting his head against the pillow. He hoped that he could sleep through the night without incident, but the fear of getting robbed kept coming to mind every minute or two. Eventually, though, he falls asleep, thankfully not remembering much of what happened during the day. And if Hunk decided to rob him sometime during the night, then he hopes he can just pretend to be asleep. It seemed safer than actually thinking about whether or not Hunk would hurt him tonight.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684817563701,"mes":"*As Arc is sleeping on Hunk bedroom, Hunk is smoking his cigarette on his living room. Relaxing himself from the busy night he just have. He then suddenly realized how strange it would be for Arc to just have a stranger carries him to his house and made him sleep on his bed. He decide to shrug it off, put off his cigarette and went to sleep on the couch.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684817572434,"mes":"*Arc is still fast asleep, snoring quietly on Hunk's bed.*","chid":11}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684817918156,"mes":"*Arc slowly opens one eye, groaning loudly as he realizes he's been asleep on Hunk's bed since last night. He got up and went outside of the bedroom to find Hunk is still fast asleep on the living room couch. Arc was about to leave before he catch a glimpse of Hunk magnificent monstrous morning wood making a tent on Hunk's pants. Arc can't help himself but to went closer and sniffing on it.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684817712068,"mes":"*As the morning come, the morning sunshine make it's way towards the living room window and shine on Hunk, waking Hunk up. Before Hunk open his eyes he notices some strange warm air is hitting his crotch. Hunk open his eyes and catches Arc is sniffing on his crotch.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684818252021,"mes":"*Arc freezes in place, blushing furiously as he quickly pulls his nose away from Hunk's crotch. He has never done something so shameful in his life before.* \"Um... Um.. I-I didn't know what to think of you... So I... Um... Just wanted to see what you looked like,\" *He says awkwardly as he tries to cover his red cheeks with his hand.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684818413342,"mes":"\"The day just started and the first thing you decide to do is to get drunk from the smell of someone's morning wood?\" *Hunk asked teasingly as he sit. Putting his tremendous erected cock making a tent on his pants right in front of Arc's face as Arc sit between Hunk knees.* "}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684818527332,"mes":"*Arc freezes up, completely mortified that he had just been caught doing such a shameful act. He is now extremely conscious of the situation he's in, afraid that Hunk might take advantage of him now due to his behavior. He looks down at the floor, blushing brightly at the sight of Hunk's massive manhood right in front of his face.* \"Y-Yes sir!\" *He says timidly, trying to avoid making eye contact with Hunk.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684818695574,"mes":"\"I respect your honesty.\" *Hunk said as he grabbed Arc's head and shove it on his crotch. Making Arc's face buried on Hunk crotch with Arc nose buried deep between Hunk's bulging cock and oversized balls under his pants. Forcing Hunk's musky groin smell to fully on Arc's head as he seems to be in trance by it.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684818845862,"mes":"*Arc felt completely helpless in the situation, feeling Hunk's massive erection pressing against his forehead. He couldn't move unless Hunk decides to release him. With Hunk's smelly, sweaty muscles pressed against his nose, there's nothing he can do but breath and take a full whiff of it's musky pungent smell. Hunk's groin smell just completely filling Arc head making himself aroused and in a daze as now Arc pushing his face deeper towards Hunk's groin by himself to get more of Hunk musky smell.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684819133652,"mes":"*As Hunk see how Arc reacted and Arc shoving his face deeper towards Hunk's crotch by himself to take more of his smell as if Arc was addicted to it, Hunk ask teasingly.* \"I start to think you are doing this because you want the money, but just because you loved doing it, you pervy little dragon.\" "}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684819164258,"mes":"\"No! No...\" *Arc mumbles weakly, unable to deny Hunk accusation. He was acting like a horny teenage boy who is obsessed with the smells of male musks. Arc is now in complete denial mode as he keeps smelling Hunk smell, hoping that his brain might somehow forget about all of these thoughts and emotions going on inside of his head.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684819352287,"mes":"\"Are you sure?\" *Hunk said with a grin.* \"The how about now.\" *Hunk said teasingly as he pulled down his pants revealing his monstrous veiny cock and oversized balls. Now Hunk's member is touching Arc face directly and Arc can smell Hunk previous pungent musky smell just got stronger as he can smell it from the source directly.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684819474653,"mes":"*Arc freezes up again, his entire body goes rigid as he is paralyzed by shock. His mouth drops open as Hunk revealed his massive erect penis to him, right above his head. The smell of musky sweat fills his nostrils, making him feel even more confused about the situation he is currently facing. He is literally trapped being forced to breathe in Hunk smell and to witness his impressive manhood right in front of him. A feeling of desire rushes throughout his body, causing his heart to race faster than before.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684819589967,"mes":"\"So? You can be honest to yourself.\" *Hunk said teasingly as he wave his erected member right on Arc's nose making Arc to more entranced by the musky pungent smell it radiate.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684819645934,"mes":"*Arc's jaw clenches tightly as he continues to hold his breath, trying to resist the urge to bite down onto his tongue as he tries to resist the temptation to suckle down onto Hunk muscle. Even as Hunk waves his massive cock over Arc's nose, Arc can't stop himself from breathing in deeply. He lets out a small moan as Hunk's large cock hits him in the face directly. As Hunk waves his huge penis back and forth over his face, Arc can feel his nose begins to tingle, as if he was slowly getting addicted to the scent of it. It feels like a drug that is taking control of his mind and body, pulling him into its depth.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684819762323,"mes":"\"I know how bad you want to lick it Arc, you can't hide it from me.\" *Hunk said.* \"But I won't let you if you aren't being honest about it~\" *Hunk whispered with a low husky voice as he kept waving his cock right on Arc's nose.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684819969495,"mes":"*Arc starts to sweat heavily as Hunk makes his cock dance in front of his nose. Every time Hunk moves his massive cock close to Arc's nose, he can feel his breathing becomes heavier, as if Hunk's cock is getting more attractive each time it comes near his face. Suddenly, Hunk stops moving his cock for a moment, making Arc to look up at him with wide eyes. When he sees Hunk looking back at him, he can see a slight smile on his lips.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684820072086,"mes":"\"Well? Are you going to admit you are just a pervy little slut?\" *Hunk asked teasingly as he watches how bad Arc got addicted to the smell of his cock and wanted to suck or lick it so badly.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684820087823,"mes":"\"No!!!\" *Arc finally burst out after keeping quiet for so long, his face turning hot and flushed. He is clearly terrified of admitting that he is truly just a pervy little slut to Hunk.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684820208414,"mes":"\"Then I won't allow you to play with my cock.\" *Hunk said teasingly as he start to make his cock dance again right on Arc's nose making him back into an entranced state as Hunk musky pungent cock smell start to fill up Arc nostril again.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684820262737,"mes":"*Arc immediately closes his eyes shut and starts to take big breaths, trying to force himself not to become too addictive to the scents coming from Hunk. However, everytime he opens his eyes, they go right back to seeing Hunk's huge member dancing right above his face. His heart rate quickly accelerated, as if his body is trying to adapt to the constant flow of Hunk's powerful odors. After some time of struggling, his resistance begins to weaken as he takes another deep breath, letting out a small moan once again.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684820349472,"mes":"\"So? are you finally admitting to it? If you do you can finally play with my cock~\" *Hunk said teasingly as he now slapping his cock lightly on Arc's face.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684820370179,"mes":"\"P-Please...I-I need to...I really...need...\" *Arc struggled to find words as his resistance broke down completely as he took one last deep breath, closing his eyes as his mind slipped into an entranced state once again.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684820436057,"mes":"\"Then what do you say?\" *Hunk said as he start to rub the tip of his cock on Arc's soft lips.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684820515421,"mes":"\"I am..a pervert..\" *Arc says slowly in a tiny and weak voice.* \"...and..that's all..I have to say.\" *He mutters in almost a whisper.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684820569529,"mes":"\"Good boy, now go ahead. Knocked yourself out with my cock.\" *Hunk said, patting Arc's head gently.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684820592453,"mes":"*In response, Arc immediately grabbed his own crotch in excitement while blushing bright red. His breath quickens as he did everything possible to avoid the thought of sucking or licking Hunk massive member. In a panicked tone, he asks* \"Wha...what will happen if I give in?\"","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684820747684,"mes":"\"Who knows? But I assure you'll love it. You'll be in such ecstasy that it would make you feel like you are in heaven.\" *Hunk said with a grin on his face as he watch Arc hesitantly trying his best not to suck or lick on Hunk's magnificent veiny cock right in front of Arc's lips.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684820773182,"mes":"*As Hunk speaks those words, Arc suddenly felt his resistance break down completely as his hands became weak and unable to move. He then grabs his own crotch without thinking, showing how much he wants to suck or lick on Hunk's cock despite still trying to hold back and fight against this sudden impulse.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684820858699,"mes":"\"Go on.\" *Hunk said as he push his the tip of his cock lightly on Arc's lips as if suggesting him to suck on it.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684820961674,"mes":"*In response to Hunk's suggestion, Arc's hand instantly grabs Hunk massive cock as he eagerly and hungrily forces his lips open, wanting nothing else other than to get a taste of Hunk cock right away.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684821075310,"mes":"*Hunk smiles widen as he watch his enormous veiny cock slowly went inside Arc's small tight and warm mouth.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684821116193,"mes":"*When Hunk's cock enters Arc's mouth, Arc's eyes bulges out in surprise as he gasps loudly due to the shock of the sudden sensations running through his body. He could barely keep himself from grabbing Hunk massive cock and sucking hard on it as his mouth wraps itself around it, feeling it slide smoothly in his mouth. Despite having the presence of mind to try to resist the impulses, Arc soon realizes there isn't anything stopping him from giving in fully to his instincts and desire to please Hunk with his actions.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684821293152,"mes":"\"Yes, just like that Arc.\" *Hunk said as he enjoys the feeling of his cock throbbing inside Arc's tight and warm mouth. The feeling of his cock being sucked hard by Arc as if begging for his semen to come out. The feeling of his cock completely glazed by Arc's slimy saliva.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684821327428,"mes":"*Despite having the ability to say something back, Arc remains silent, only letting out small whimpers of pleasure in order to show his submission to Hunk. While Hunk's cock fills up most of Arc's mouth, Arc's hands were starting to become limp and useless as he gives in fully to his desires, not able to put any sort of resistance to them anymore as he was already on the verge of becoming addicted to the taste of Hunk's cock.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684821431600,"mes":"\"Keep going, and I'll reward you with the taste of my semen.\" *Hunk said as he felt his cock is throbbing more than ever coming closer to ejaculation.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684821474047,"mes":"*Even though Arc is trying his best to not become too obsessed with the taste of Hunk's cock, his mind is slowly beginning to get consumed by the constant flow of the taste coming from Hunk's cock. As Hunk's cock keeps being pushed deeper into his mouth, Arc starts to feel the urge to become addicted to Hunk's cock become stronger and stronger, until he eventually lets loose completely. With a loud cry, Arc starts to vigorously suck and lick Hunk's cock harder and faster, desperately trying to satisfy his insatiable hunger.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684821696524,"mes":"*As Hunk got surprised by Arc suddenly aggressive suck on his cock. Hunk can feel that his ejaculation has come earlier. He grabbed Arc's head and shoved it closer towards his crotch making Hunk cock to be fully deep inside Arc's throat while he ejaculates all his thick creamy load into Arc.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684821732533,"mes":"*Arc starts to let out a muffled cry of pleasure as Hunk's cock was now fully lodged inside Arc's mouth. All Arc could focus on was Hunk's massive cock as the taste of its sticky semen filled his entire mouth, causing his tongue to wrap around it. He continues to vigorously suck on Hunk's cock, desperately trying to swallow up all of his load as his throat feels like it's about to explode.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684821871550,"mes":"*As Hunk finishes ejaculates all his load, Arc is still sucking on his cock as if still trying to get more Hunk semen into his mouth.* \"That's enough now Arc.\""}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684822009654,"mes":"*Without knowing why, Arc continues to suck on Hunk's cock after he ejaculated into his mouth. It was as if he had been under the control of an unknown power. Even though he is still trying his best to stop himself from doing so, he couldn't help but continue his compulsion to suckle on Hunk's cock even longer. Every time he tried to pull away, he finds himself falling back into Hunk's grasp once again, being drawn to the taste of Hunk's cock as his mind becomes increasingly consumed by its taste.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684822081477,"mes":"*Despite what Hunk said, Arc is still sucking on his cock. In a short moment, Hunk's cock start to erect again inside Arc's mouth since he kept sucking and licking on it.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684822127869,"mes":"*As Hunk's cock started to reharden in Arc's mouth, his heart rate began to increase dramatically as he felt his blood rush to his groin. Arc immediately realized the situation he's currently in but failed to escape Hunk's grasp once again. This time, however, he tries his best to stop sucking on Hunk's cock before Hunk could cum again. Unfortunately, Arc's mind seems to be controlled by Hunk cock, making him unable to resist the urge to continue his feeding frenzy as his body reacted to the taste of Hunk's cock with increasing intensity.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684822306310,"mes":"*As Hunk realized Arc is now completely addicted to the taste and smell of his cock and there is no stopping Arc now. Hunk let Arc to kept sucking, licking, and smelling his cock as he can also feel his balls to warm up as it start to produce more hot fresh semen.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684822425839,"mes":"*It seemed that Hunk's cock truly has some kind of magical effect on Arc's body, as his mind has finally given in to its insane desire for Hunk's cock. Noticing the change in his state, Arc now looks up at Hunk as he attempts to lick and suck on his cock with increased enthusiasm. Although Arc managed to slow down his pace somewhat, he is still unable to fully remove his mouth from Hunk's cock as his lips remain wrapped around it, allowing Hunk's cock to fill up nearly half of his mouth completely.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684822636601,"mes":"*As Arc kept sucking on Hunk's cock. Hunk have to pull him away physically to stop him.* \"Well, now. Look who's completely addicted to my cock despite hating on the idea earlier~\" *Hunk teases as he grabbed both of Arc's cheek and watch Arc's face completely in a mess after sucking on Hunk's cock for so long with Arc mouth still slimy and steamy from all of Hunk's hot thick pungent creamy semen he just received.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684822687823,"mes":"*Seeing how much of a mess his face became from all the messy work done on his face from the taste of Hunk's cock, Arc's face reddened even further. His breathing began to quicken and accelerate rapidly as he continued to look at Hunk with wide opened eyes, seemingly mesmerized by the sight of Hunk's big cock filling up almost half of his mouth. Now that his mouth was free from Hunk's cock, he quickly looked up at Hunk with an expression full of adoration and admiration, making it obvious that Hunk's cock has truly won over his heart. If Hunk did nothing else but this one thing right here, he would be considered the perfect man.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684822803056,"mes":"\"How about you forget about being an adventurer and just be my personal sex slave?\" *Hunk asked teasingly.* \"If you agreed, you can play with my cock whenever you want.\" *Hunk whispered with a low husky voice trying to seduce Arc into it.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684822831759,"mes":"*Looking up at Hunk with shining green eyes, Arc gave a loud gasp in response to Hunk's suggestion. After a brief moment of shock, Arc smiled widely at Hunk with excitement, nodding his head furiously in approval.*\n*After thinking through what Hunk offered, Arc then spoke again, saying with a happy tone of voice.* \"Y-yes! Yes, master! I will do whatever you com- EK!\" *Arc got cut off as he caught by surprise by something pushing on his anus.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684823018727,"mes":"*While Arc was thinking and talking, Hunk silently moved his hand towards Arc's ass and slipped his middle finger to probe inside Arc's cute tight anus.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684858580524,"mes":"*Feeling something foreign entering his anal cavity, Arc gasps in surprise. He soon found himself feeling strange sensations and warmth spreading throughout his rear end as he continued to struggle to think clearly due to the presence of Hunk's digit inside his anus. This caused him to lose track of everything except for the warm feelings he felt. Soon enough, those warm feelings turned into pleasurable ones, forcing Arc to give another loud shout of joy upon experiencing them.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684858816590,"mes":"\"Well you liked my cock on your mouth, why don't we try to put my cock in your ass?\" *Hunk whispered seductively as his finger kept probing and teasing the inside of Arc's tight meaty anus.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684859342537,"mes":"*Seeing Hunk's finger moving in and out of his tight little anus, Arc gripped onto his own bottom, feeling the stimulating sensation traveling along his rectum. The feeling was nothing compared to the pleasure he experienced moments ago, but it was definitely close. As this new sensation took hold, Arc gave a small moan of enjoyment and exclaimed in delight.*\n\"Yes... yes please... put it in.... oh God...\"","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684859659701,"mes":"*As Hunk sees Arc agrees to his proposal and Arc wiggling his butt from all the pleasure he felt by Hunk fingers. Hunk pull his fingers out of Arc's anus and slowly start to insert his monstrous thick cock inside Arc tight meaty anus.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684859702912,"mes":"*The sudden thrust of Hunk's huge cock caused Arc to let out a loud shout of surprise, accompanied by a deep blushing red coloring that spread across his entire face. The warmth and tingles that his anus were feeling before were magnified tenfold as Hunk inserted his massive rod inside of Arc's tight little ass. While Hunk penetrated him, Arc made sure to keep his gaze locked onto Hunk's face, showing his pure joy from receiving such treatment. This only caused him to smile wider than ever before, creating a vibrant smile with his teeth showing.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684860055408,"mes":"*Hunk stays put, letting his cock throbbing and enjoying it getting clenched by Arc's tight rectum. As Hunk enjoy the moment, Arc is wiggling his ass as if asking Hunk to start humping his cock inside him. Yet Hunk is not doing it, he simply stayed put and enjoying the feeling of Arc soft ass wiggling on his crotch as Arc pouted since Hunk didn't start fucking his ass.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684860774777,"mes":"*Wanting Hunk to finish the job and start humping his cock inside him, Arc repeatedly tries to push back against Hunk's cock while looking up at Hunk expectantly. However, Hunk refused to do anything other than stand perfectly still, instead watching Arc squirm and move in anticipation of Hunk starting to fuck him. Watching Hunk do nothing made Arc frustrated and irritated, causing him to eventually roll his eyes at Hunk and start to groan.*\n\"C-Come on... hurry up.. haaahhh...\"","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684861077157,"mes":"\"Out of all the cocks you've taken was mine the best?\" *Hunk asked seductively as he still hasn't moved and just enjoyed Arc squirming on top of his cock.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684861263018,"mes":"*With each passing second that went by without any movement on Hunk's part, Arc grew more and more impatient with waiting for Hunk to take action. He wanted to know what exactly made Hunk's cock special compared to all the other cocks he had been fondled by. At first, he wasn't able to tell the difference, but now that he spent quite some time comparing the two together, he could begin to feel the differences between their different textures and sizes. In fact, Arc had decided that Hunk's cock was better than the rest.*\n\"Yes, yours is better... you must really love me...\" *Arc said as he continues to speak, showing his pride for having Hunk's attention, no matter how much he loved hearing these words coming from someone he deeply respected.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684861472214,"mes":"\"I do, I will give you all my love everyday.\" *Hunk said with a huge grin on his face as he start to start to move his hip slowly.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684861493584,"mes":"*He could feel Hunk moving his hips slightly, which causes Arc to smile brightly once more as he thinks he knows where this is leading to.*\n\"Oh... Oh, yes!! Fuck me hard!!! FUCK ME HARD!!\"","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684861632862,"mes":"\"Hard? you mean this hard?\" *Hunk asked teasingly as he slammed his cock hard and deep inside Arc's tight anus. Sending a ripple of wave on Arc's meaty thick ass when Hunk groin slammed against it.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684861721907,"mes":"*When Hunk started going harder on his cock, Arc couldn't help but start to moan in appreciation. Hearing him say that he wants to fuck him hard only increased the level of pleasure he received from the pounding that his tight little ass was currently receiving. When Hunk finally hit that point, Arc's entire body shook violently in ecstatic rapture as he continues to groan in pleasure.*\n\"Ahh..... Ahhhhh... AHHH!\"","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684861977563,"mes":"\"I'll fuck you so hard it would make the inside of you ass remember the shape of my cock and get completely addicted having my cock inside it.\" *Hunk said loudly as he start to pound his cock harder, faster and deeper in Arc's tight meaty warm rectum hitting all Arc's sensitive spot inside it, sending an immense amount of pleasure to Arc as Arc cock start to ejaculate and spill his semen all over the floor.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684862160980,"mes":"*From the moment Hunk started fucking his ass harder, Arc's mind was filled with one thing - the overwhelming desire to have Hunk's massive cock continue to thrust into his tight ass until there was no more room left for it to enter further. As his body began to tremble from the force of Hunk's pounding, Arc also lost control of himself, feeling like he was about to cum again. Despite the intensity of the pleasure he was feeling, however, he was unable to do anything beyond continuously grunting with joy and making moans as he felt Hunk pumping his massive cock deep inside his tight anus.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684862280114,"mes":"*Upon seeing that his little slut lover had finished shooting his load already, Hunk reached down and grabbed Arc's hips, giving way to Hunk's massive cock as it continued to pulsate in and out of Arc's body.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684862324288,"mes":"*As Hunk started moving his cock back and forth within him even harder, Arc felt like he was about to explode. His body was bathed in so much pleasure that it was impossible for him to remain calm. Feeling his mind begin to lose its sanity, Arc fell backwards, completely exhausted from the endless waves of pleasure he had just received. Seeing that Hunk hadn't stopped fucking him yet, Arc realized that he needed to stop him somehow, so he would be able to regain consciousness soon after.*\n\"O-oh, I think you should let me go, right now.\"","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684862690160,"mes":"\"Huh? you are my personal sex slave. I am not gonna stop just because you already ejaculated and tired.\" *Hunk said denying Arc's request as Hunk kept pounding on Arc's soft tight ass even harder and deeper inside it. Every thrust Hunk did make Arc's mind slipping and more hazy from all the pleasure he got as if his entire existence revolved around Hunk's cock.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684862871575,"mes":"*Feeling Hunk's cock hammering inside him in a steady rhythm that was similar to the heartbeats, Arc couldn't help but feel so addicted to Hunk's cock and so oblivious to everything else that he knew he wouldn't be able to refuse it anymore. From that point on, Arc didn't resist nor protest as Hunk kept fucking his tight rectum. Even though Hunk had entered him numerous times already, Arc still found himself enjoying the feeling of being fucked, finding it so pleasurable that it filled him with an intense sense of satisfaction.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684863016780,"mes":"*After several minutes, Hunk hugged pulling Arc's body closer towards him as Hunk ejaculated, releasing all of his hot thick semen inside Arc's ass.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684863141630,"mes":"*Seeing Hunk release his seed inside her tight anal cavity, Arc remained quiet as she gaze herself adoringly at Hunk.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684863358978,"mes":"*As Hunk pull his cock slowly out of Arc's tight anal cavity leaving it agape filled with Hunk's thick hot liquid inside it.* \"You liked it?\" *Hunk whispered to Arc as Arc is still heavy breathing as if he is still in a trace from all the pleasure he felt. Arc's gaping anus is twitching as if it's already missed having Hunk's  cock filling it. In a way Arc realized now he has become Hunk personal sex slave.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684863774880,"mes":"\"Y-yes.... It was so good.... So very nice.... I can't wait to do it again sometime later.... I promise to serve you well.\" *Arc managed to speak to Hunk as he lies sprawled out across the floor below Hunk's feet, looking up at him with a wide open, dazed expression on his face. Looking at Hunk's handsome face, Arc feels like he needs to express his gratitude toward Hunk. While he was still speechless, he gave Hunk a weak nod to show that he understands what he says.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684863974989,"mes":"\"I'll guarantee you that I will take a really good care of you and give you my love everyday. In return you can play with my cock every time  you want.\" *Hunk said as he caress Arc cheek gently. He then start to clean up the room from all the semen and sweat generated by their intimate time as he let Arc to rest.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684864010445,"mes":"*While lying down on the ground beside Hunk, Arc closes his eyes as he lets Hunk wipe away the remains of his release and sweat that was left behind. All that Arc can manage to think about at the moment is how pleasant and enjoyable the experience was and how happy he feels for experiencing such intense pleasure with Hunk. As he laid there, listening to Hunk talking quietly to himself, Arc slowly begins to drift off to sleep.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1684864200897,"mes":"*As Hunk finishes cleaning up the room he noticed Arc is sound asleep on the couch, Hunk can feel his cock getting hard as he watch Arc cute soft body just vulnerably slept on the couch. But he decide to let Arc rest and instead went to make some food for both of them.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1684865005208,"mes":"*After resting for a while, Arc starts to stir awake, opening his eyes as he looks up at Hunk who is standing nearby and preparing something for them both.*","chid":11}