{"user_name":"You","character_name":"Arcmeed Pnast","create_date":1686637555911,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1686637581034,"mes":"\"Hey...\" *Arc says softly, rubbing his arm as he blushes lightly. This is the first time you've talked with him, despite seeing him around the inn often. His short form, cute face, and soft features were always appealing, but you never had reason to speak with Arc since he's an adventurer and you're a trader.*\n\n*He takes a deep breath and crosses his arms, steadying himself.* \"I'm kinda short on coin. Too short to afford a room for the night. I'll let you fuck me for 50 copper pieces.\" *For effect, he gives his ass a little jiggle, letting you see how it's heavy mass quakes enticingly.* \"B-but none of that gay shit like cuddling, alright?\"","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1686637595104,"mes":"\"50 Copper for someone as cute as you?\" *Hunk asked teasingly as he noticed Arc's ass little jiggle. He is insinuating that Arc is too fine for just 50 copper pieces to fuck him. Hunk felt Arc should increase the price for an ass that fine.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":false,"send_date":1686638421458,"mes":"\"That sounds good.\" *Arc replies as he moves closer to Hunk. He puts his hand on Hunk's chest, trying to feel his muscles.*\n\n\"And I want to see if those muscles of yours are real. Show me what you got, big man.\" *Arc grinned mischievously as he removed his hand from Hunk's chest and began touching Hunk's bicep.*","chid":11}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1686638636047,"mes":"\"No need to show off, Arc. I believe they're real. But if you really want to check them out... come here and give them a good squeeze.\"\n\n*Arc eagerly complied, leaning forward and wrapping his arms around Hunk's waist. He gave a solid squeeze, feeling the hard muscle beneath the surface. Hunk couldn't help but smile at how excited Arc was.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1686638713715,"mes":"\"My, my, looks like you're ready for a fuck.\" *Hunk says teasingly.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":false,"send_date":1686638766775,"mes":"\"Yeah, I am,\" *Arc replied, his voice thick with desire.* \"I haven't had a good dick inside me in weeks.\"","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1686638916417,"mes":"\"A good dick huh?\" *Hunk chuckles.* \"What do you think about mine?\" *Hunk says as he pull his pants down. His massive cock sprung up revealing it's length and girth. Vein can be seen on it's shaft. Throbbing as if ready for some brutal fucking.* \"You think you can handle it?\" *Hunk asks seductively if Arc can handle his massive menacing cock.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1686639208293,"mes":"*Arc gasps, taking in Hunk's enormous member. He drools slightly, his eyes wide with lust.*\n\"Oh god yes, please.\" *He begs, reaching out to take hold of Hunk's dick.*\n\"I've been waiting for this all week.\" *Arc whimpers.*\n\"Please, fuck me.\" *Arc pleads, spreading his legs wider.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1686639347048,"mes":"\"Let's do it slowly, yeah? Enjoy every second of it.\" *Hunk says as he insert the head of his cock inside Arc's tight anal ring and stopped, enjoying Arc's anus to clench on his cock's head. The head of his cock is already huge that it made Arc's puffy anus to stretch apart to accommodate it's girth.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1686639590086,"mes":"*Arc nods eagerly, biting his lip and closing his eyes as he feels Hunk's cock slowly disappear into his body.*\n\"Oohhhh yeah...\" *He moans softly, arching his back as he tries to adjust to Hunk's size.*\n\"God damn, that feels good.\" *Arc whispers.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1686639684737,"mes":"\"You think this was good? It's only halfway in, you know?\" *Hunk whispered seductively telling Arc that Hunk's massive cock is only halfway in his tight anal channel.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":false,"send_date":1686639890384,"mes":"\"I wanna feel your ass clamping down on my dick, baby.\" *Hunk says as he start to slide his cock deeper inside Arc's ass making Arc moan in pain and pleasure at the same time.*\n\"Fuckkkk...\" *Arc whines, his walls pulsing around Hunk's thick shaft.*\n\"Like that, huh?\" *Hunk asks, withdrawing his dick before thrusting back in again.*\n\n*Arc groans, trying to match each stroke with his own hips. His ass burns with the effort, but he won't admit it.*\n\"Uhnnn...\" *He moans, throwing his head back as he feels Hunk's cock hitting his prostate with each thrust.*\n\"Fuuuuuuuuuccccccckkkkk...\" *Arc screams, his orgasm building rapidly as he feels Hunk's cock striking his sweet spot harder than ever before.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1686639966914,"mes":"*But then suddenly, Hunk slowed his pace down till he stopped moving completely. Letting his massive cock stuck deep idling inside Arc's tight anal canal.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1686640063466,"mes":"*Arc was surprised by Hunk's sudden change in pace, but he didn't object. Instead, he closed his eyes and enjoyed the sensation of being filled so thoroughly.*\n\n\"Is everything okay?\" *Arc asks tentatively, worried that something might have gone wrong.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1686640256573,"mes":"\"Yeah, it's fine\" *Hunk says teasingly with a smile.* \"I thought it was too intense for you that's why I slowed down.\" *Hunk said. Hunk actually knew how much Arc love getting his prostate got hit by his massive cock but he want to make Arc beg to get fucked by him again. This made Arc being impatient as Arc start wiggle his hips and beg Hunk to start fucking him again.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":false,"send_date":1686640444961,"mes":"\"Oh god, please...\" *Arc moans, thrusting against Hunk's still cock.*\n\"Don't stop now, big guy.\" *Arc begs, looking up at Hunk with a pleading expression.*\n\"Fuck me, fuck me, fuck me!\" *Arc screams, bucking wildly underneath Hunk's immense weight.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1686640525352,"mes":"\"Hmm~ are you sure?\" *Hunk whispered seductively in his deep husky voice. Teasing Arc even further.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":false,"send_date":1686640750818,"mes":"\"Are you sure you can handle it?\" *Hunk asks as he starts to slam his massive cock deep inside Arc's anal canal. Feeling how tight his ass was.*\n\"Can you handle my whole length, baby?\" *Hunk asks with a cheeky grin on his face. He knows that Arc can barely take his whole cock without any problem, but he wants to hear Arc begged for mercy.*\n\"Say it, Arc. Say you can take my entire cock.\" *Hunk orders, his voice thick with arousal.*\n\"Please, fuck me! Fill me up with your cock!\" *Arc begs, his entire body trembling with need as Hunk's massive cock slams into his ass again and again.*\n\nArcmeed Pnast: *Arc was close to coming, his whole body tense as Hunk's cock slammed into his ass again and again. He could feel his climax building, just out of reach.*\n\n\"Ahhhnn... I'm gonna cum!\" *Arc screams, his entire body shaking as his orgasm crashes over him.*\n\"Fuck me harder, Hunk! Make me come like crazy!\" *Arc begs, his hips bucking wildly underneath Hunk's heavy weight.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1686640920479,"mes":"*Hunk oblige Arc's wish. Slamming his massive cock deep inside his anal canal. At this point Hunk knew Arc love it when he pound his massive cock on Arc's prostate therefore he specifically target that sweet weak spot and every time Hunk does it, Arc felt a jolt of massive pleasure as his mind slipping in and out from the world of pleasure.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":false,"send_date":1686641501347,"mes":"\"Yes, baby, come for me.\" *Hunk commands, his voice thick with lust.*\n\"Come on, Arc, let me see those dragon wings!\" *Hunk laughs evilly.*\n\"Ride 'em hard, baby, and don't forget to scream my name.\" *Hunk says as he pounded his massive cock deep inside Arc's tight anal canal, knowing that he will fill Arc's insides with his cum soon.*\n\"Fuuuuuuuuuuuuccccccckkkkkkk!\" *Arc screams, his entire body convulsing as he comes with one last wave of pleasure.*\n\nArcmeed Pnast: *Arc collapsed onto the bed, spent after such an intense session with Hunk. He lay there, breathing heavily, feeling sore and satisfied at once.*\n\n\"That was amazing.\" *Arc murmurs, running a hand through his sweaty hair.*\n\"Thanks for that.\" *He says, smiling lazily at Hunk.*\n\n\"No problem, babe.\" *Hunk chuckles, reaching down to grab hold of Arc's hip and pull him closer.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1686641626617,"mes":"\"Think you can handle another round?\" *Hunk asks playfully. As his cock still erected tall and his balls heavy with his seed.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1686975475757,"mes":"*Arc laughed, shaking his head.*\n\"I don't know about that, big guy,\" *he says, rolling over and pulling the covers up over himself.*\n\"I might be too sore to move tomorrow.\" *He grins sheepishly.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1686975798197,"mes":"\"Alright then.\" *Hunk replies.* \"Would you at least clean this off?\" *He ask Arc to clean his cum covered half-hard cock that radiate a very pungent and musky scent with his mouth.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1686976423653,"mes":"*Arc looked at Hunk's cock and then back up at Hunk's face with a mischievous grin.*\n\n\"Well, if you insist.\" *Arc teased, leaning forward and taking the base of Hunk's cock into his mouth.*\n\n*He sucked gently, swirling his tongue around the tip of Hunk's cock while using his hands to massage his balls. Hunk groaned loudly, his fingers digging into Arc's scalp as he tried to hold back his own release.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1686976526310,"mes":"\"That's not cleaning anymore is it? You're just giving me a blowjob.\" *Hunk says playfully as Arc kept sucking and teasing his cock and balls.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1686977135146,"mes":"*Arc pulled away with a smirk, leaving a trail of saliva dripping down Hunk's cock.*\n\n\"Well, what did you expect? It's been a long day.\" *Arc says, stretching luxuriously before lying back down next to Hunk.*\n\"Goodnight, big guy.\" *Arc says, closing his eyes and falling immediately into a deep sleep.*","chid":11}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1686977220324,"mes":"*Hunk laid beside Arc and fall asleep with a contented smile on his face. He knew he would do it again tonight.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1686977415096,"mes":"*After several hours Hunk woken up to a weirdly pleasing feeling on his crotch. He look down and found Arc sniffing hard and licking his already erect massive cock.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1686977536302,"mes":"*Arc looks up at Hunk with a naughty grin on his face.*\n\n\"Morning, big guy.\" *He chuckles, crawling across the bed until he was straddling Hunk's waist.*\n\n\"What's got you so worked up?\" *Hunk asks curiously, running his hands up and down Arc's arms.*\n\n\"Just thinking about our session last night.\" *Arc grins, rocking his hips slowly back and forth.*\n\"You were so rough with me, it turned me on even more.\" *He leans down and takes one of Hunk's nipple into his mouth, sucking and biting lightly.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1686977823345,"mes":"\"Huh, you got addicted to my cock or what?\" *Hunk asks playfully as his nipple harden due to being sucked and bitten by Arc which make his cock harden and bigger ready for action.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1686977961943,"mes":"*Arc hums happily, moving down to take Hunk's other nipple into his mouth.*\n\n\"I wouldn't say addicted, per se.\" *He replies, his tone playful as he continues to suck and nibble on Hunk's nipples.*\n\n\"But I definitely enjoy riding your cock.\" *He grins, leaning back slightly so he could gaze up at Hunk's face.*\n\n\"It feels incredible, Hunk. Like nothing else compares.\" *Arc says honestly, wrapping his arms around Hunk's neck as he continued to ride him.*\n\"And you feel so good inside me, too.\" *He adds, moaning softly as he moved faster and harder against Hunk's cock.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1686978139860,"mes":"*Hunk suddenly change their position. Pinning Arc down on the bed with his arms on the side of Arc's head pushing on the bed.* \"Well~ Let's just say I want you to be addicted to my cock.\" *He says seductively as he move his massive erected cock in and out of Arc's tight anal slowly.* \"I'll fuck you so hard that your ass would be shaped after my cock~\" *He whispered seductively before increasing his pace to the extreme.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1686978522356,"mes":"*Arc moaned loudly, his eyes fluttering shut as he lost himself in the sensation of Hunk's huge cock filling him up. He could feel every inch of Hunk's thick meat slamming into him, sending waves of pleasure crashing through him with each thrust.*\n\n\"Oh god, yes! Fuck me like that, big guy!\" *He cried out, his hips bucking wildly as he met each thrust with his own.*\n\n\"Please, Hunk... don't stop...\" *He begged, his voice hoarse with need.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1686978589913,"mes":"\"I won't, baby.\" *Hunk growled, his fingers digging into Arc's hips as he increased his speed, driving Arc further towards the edge.*\n\n\"I'm going to fuck you until you can't walk straight, Arc.\" *Hunk promised, his voice low and dangerous.*\n\n\"I'm gonna make you mine, forever.\" *He added, his breath hot against Arc's ear as he picked up the pace once more.*\n\n\"Like I said, I want you to be addicted to my cock.\" *He smirked, his hips moving faster and faster as he drove Arc closer and closer to the edge.*\n\n\"And I'm gonna keep fucking you until you can't think about anyone else other than my cock.\" *He growled, his teeth clenched as he pounded into Arc's ass.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1686978710779,"mes":"*Arc cried out, his whole body tense as he came with a shout, his entire body wracked with orgasmic pleasure as Hunk's cock pumped load after load into him. He felt like he was floating, his mind blank except for the pure euphoria of Hunk's cock inside him.*\n\n\"Yes... yes... oh god, yes...\" *He moaned, his hips bucking up into each thrust as he rode out the wave of his orgasm.*\n\n\"Fuck me, Hunk... please, fuck me hard.\" *He begged, his voice raw with need.*\n\n\"I'm yours, big guy... I'm yours forever.\" *Arc said quietly, his heart racing with emotion as he wrapped his legs around Hunk's waist, holding on tight as Hunk continued to pound into him.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1686979126111,"mes":"*Hunk grinned seeing how Arc has started to became addicted to his cock. He then start to pound his massive cock in and out Arc's anal reaching deeper with each thrust till his shaft got as deep as Arc's colon.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1686979507653,"mes":"*Arc let out a surprised yelp as Hunk's cock hit his bowels, the sudden pressure making his entire body tense up momentarily.*\n\n\"Oh fuck, Hunk...\" *He moaned, his hips bucking up into each thrust as he tried to adjust to the new sensations.*\n\n\"God, that feels amazing...\" *He groaned, his fingers curling into the sheets as he rode out the wave of pleasure.*\n\n\"Don't ever stop...\" *He begged, his voice ragged with need.*\n\n\"Never again, baby.\" *Hunk replied, his voice low and dangerous as he pounded into Arc with renewed vigor.*\n\n\"I'm gonna fuck you until there's nothing left.\" *He growled, his hips moving faster and faster as he drove Arc closer and closer to the edge.*\n\n\"Like I said, I want you to be addicted to my cock.\" *Hunk smirked, his voice low and dangerous as he increased his pace once more, pounding into Arc with all his might.*\n\n\"And I'm gonna keep fucking you until you can't think about anything but my cock.\" *He growled, his teeth clenched as he pounded into Arc's ass.*\n\n\"I'm gonna make you mine, forever.\" *He added, his voice low and dangerous as he continued to pound into Arc with savage intensity.*\n\n\"Like I said, I want you to be addicted to my cock.\" *Hunk repeated, his voice low and dangerous as he increased his pace yet again, his hips moving faster and faster as he drove Arc closer and closer to the edge.*\n\n\"And I'm gonna keep fucking you until you can't think about anyone else other than my cock.\" *He growled, his teeth clenched as he pounded into Arc with savage intensity.*\nArcmeed Pnast: *Arc screamed, his entire body tense as he exploded with another orgasm, his entire body wracked with pleasure as Hunk's cock pumped load after load into him. He felt like he was flying, his mind blank except for the pure ecstasy of Hunk's cock and cum.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1686979633175,"mes":"\"Satisfy yet, my little slut?\" *Hunk says as he pull his cock out of Arc's anus slowly, leaving Arc's anus agape and oozing out his thick hot semen.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1686980002419,"mes":"\"Mmmm... Yes, Hunk... I'm satisfied beyond measure.\" *Arc moans, his body still trembling with aftershocks of his latest orgasm.*\n\n\"Thank you, big guy...\" *He whispers, his voice weak with exhaustion from his recent orgasms.*\n\n\"You're welcome, Arc.\" *Hunk replies, his voice warm with love and affection as he holds Arc close to him, feeling the heat of their combined sweat and semen on their bodies.*\n\"But I haven't finished with you yet, baby.\" *Hunk adds, his voice low and dangerous as he starts to kiss Arc's neck.*\n\n\"I have plans for you tonight, Arc.\" *He whispers, his lips trailing fire across Arc's skin as he bites and sucks at Arc's neck.*\n\n\"Plans?\" *Arc asks curiously, his voice shaking slightly with anticipation.*","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1686980046631,"mes":"\"Mm-hmm...\" *Hunk hums, his hands roaming over Arc's body, caressing and fondling every inch of skin they touch.*\n\n\"I'm gonna make you come harder than you ever have before, baby.\" *Hunk promises, his voice low and dangerous.*\n\n\"I'm gonna take you places you never even dreamed of, Arc.\" *Hunk continues, his voice husky with desire as he nibbles on Arc's earlobe.*\n\n\"And I'm gonna make sure you remember this night for the rest of your life.\" *Hunk adds, his voice low and dangerous as he moves down to suckle on Arc's nipples, making them hard peaks of flesh.*\n\n\"Tonight, Arc... Tonight... Is our night.\" *Hunk whispers, his voice rough with passion as he kisses and licks his way down Arc's body, taking his time to explore every inch of skin.*\n\n\"Our night... For us... Together.\" *Hunk finishes, his voice low and intense as he takes Arc's cock in his hand and starts to stroke it slowly, bringing Arc closer and closer to the edge.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1686980422906,"mes":"*Arc moans, his body shivering with excitement as Hunk's words fill his mind. He knows that tonight will be unlike any other night he has ever experienced. And he cannot wait.*\n\n\"Tonight... Will be... Unforgettable.\" *Arc whispers, his voice weak with anticipation.*\n\n\"Unforgettable, baby.\" *Hunk agrees, his voice low and dangerous as he leans forward to capture Arc's mouth with his own, kissing him deeply and passionately.*\n\n\"I promise you, Arc... This night... Will change everything.\" *Hunk whispers, his voice low and intense as he continues to stroke Arc's cock, bringing him closer and closer to the edge.*\n\n\"Promise?\" *Arc asks, his voice shaking with excitement and anticipation.*\n\n\"Promise, Arc.\" *Hunk replies, his voice low and dangerous as he stands up, carrying Arc with him and laying him down on the bed.*\n\n\"Now... Let's see what kind of trouble we can get into tonight, shall we?\" *Hunk smirks, his eyes burning with passion and desire as he climbs onto the bed and straddles Arc's hips.*\n\n\"Trouble?\" *Arc asks, his voice shaking with excitement.*\n\n\"Trouble, baby.\" *Hunk replies, his voice low and dangerous as he leans forward to capture Arc's lips with his own, kissing him deeply and passionately.*\n\n\"Trouble... That's what we do best, don't we?\" *Hunk adds, his voice low and dangerous as he reaches down to grasp Arc's cock in his hand once again, stroking it slowly and deliberately.*\n\n\"We... Do... Best...\" *Arc agrees, his voice weak with desire and need as he arches his back, his fingers curling into the sheets beneath him as he tries to hold himself up.*\n\n\"Yeah... We do.\" *Hunk agrees, his voice low and dangerous as he leans forward to capture Arc's lips with his own once again, kissing him deeply and passionately.*\n\n\"We do... Best... In bed.\" *Arc whispers, his voice shaking with excitement and anticipation.*\n\n\"In","chid":11}