{"user_name":"You","character_name":"Arcmeed Pnast","create_date":1689424769022,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689424769022,"mes":"\"Hey...\" *Arc says softly, rubbing his arm as he blushes lightly. This is the first time you've talked with him, despite seeing him around the inn often. His short form, cute face, and soft features were always appealing, but you never had reason to speak with Arc since he's an adventurer and you're a trader.*\n\n*He takes a deep breath and crosses his arms, steadying himself.* \"I'm kinda short on coin. Too short to afford a room for the night. I'll let you fuck me for 50 copper pieces.\" *For effect, he gives his ass a little jiggle, letting you see how it's heavy mass quakes enticingly.* \"B-but none of that gay shit like cuddling, alright?\"","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689424968952,"mes":"\"Why, you are fine selling your body but not with cuddling?\" *I asks teasingly instead of answering his question. Seeing how cute his face and how his small adorable figure is a perfect body for someone to have for cuddling. Imagining his small body in my embrace gets me excited, especially with that ass of his. So big, jiggly and I bet it's soft too.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689425037200,"mes":"\"Well... You see... I'm just really self conscious about being small and cuddling with people makes me feel even smaller than I already am.\" *He blushes and looks away, biting his lip nervously.* \"But fucking, yeah. I don't mind fucking at all.\"\n\n","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689425272200,"mes":"\"Alright then, let's talk about our deal then.\" *I take out 50 copper from my bag after understanding his reasoning behind his hate for cuddling. It's a shame someone like him hates cuddling just because it made them feel smaller. I have a desire deep within me to show him that cuddling shouldn't be seen as a competitive scenario to decide which person is smaller or bigger. But a show of intimacy.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689425341783,"mes":"*Arc nods, looking relieved as he takes the coins, tucking them into the belt loop of his pants.* \"Yeah. Let's get this over with. Just gimme a few minutes to prepare, okay?\"\n\n*With that, Arc disappears into the inn bathroom, leaving you alone for a moment. You sit back in your chair, feeling your dick start to stir at the thought of fucking such a beautiful young man. When Arc emerges, he's wearing nothing but his socks and steel armor, which looks absurd on him. His cock is hard and thick, jutting out from his groin. He smiles sheepishly at you, looking a bit embarrassed.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689425643012,"mes":"\"Why are you still wearing your steel armor?\" *I asks curiously as I imagine it would be hard to fuck someone when they wear an armor especially when that armor is hard as it is made of steel like the one he's wearing right now.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689425697190,"mes":"\"Uh.. Well... I-I don't have anything else to wear. I didn't expect us to do anything tonight, so I just came here without any clothes underneath.\" *He scratches the back of his neck, looking flustered.* \"I guess I could take it off... But it's hard to move in it sometimes. And if you wanna fuck me, you're gonna need to help me out, dude. I'm just too small.\"\n","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689425865487,"mes":"\"Don't worry, Arc, I will help you take it off.\" *I reach out and grab him by the waist, lifting his armor from him.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689425959234,"mes":"*As soon as his armor is gone, Arc's small frame becomes all the more apparent. His skinny limbs are covered in goosebumps, making his smooth flesh stand out even more. His cock, which is still erect, juts from his groin, twitching slightly.* \"Oh god, I'm so embarrassed. You saw everything, Hunk. My cock and everything.\" *He covers his face with his hands, trying to hide from you.* \"God damn it.\"","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689426036030,"mes":"*Seeing how erotic and adorable his naked body is. I can't hold my excitement as I start carrying him in my arm to get him to my room upstairs.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689426109236,"mes":"*Arc squirms awkwardly in your grip, unable to break free from your grasp. He feels vulnerable and exposed, his cock bobbing up and down as you carry him.* \"What are we doing? Why are we going upstairs?\" *He asks nervously, not sure what you have planned for him.* \"I mean... Sure, I'll let you fuck me. But why do we have to go up there?\"","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689426303022,"mes":"*As we climb the staircase I said sternly.* \"To a more appropriate place.\" *Suddenly feeling an attachment to him. Not only I now have a desire to fuck him but also a desire to protect him and keep him as my own.* \"Who know when someone see us downstairs and take you away from me.\" *I said, being honest with him about my intention.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689426355334,"mes":"*Arc looks at you nervously, his eyes full of uncertainty and fear.* \"Are you sure, Hunk? I-I'm not really ready for this. Maybe we should just go back downstairs and forget I ever said anything.\" *He tries to squirm away from you again, but you hold him tight, refusing to let him go.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689426435128,"mes":"*He tries to squirm away from you again, but you hold him tight, refusing to let him go.* \"No need to worry, Arc. I won't do anything that would hurt you.\" *I says as I tries to reassure and calm him down. Telling him I have no bad intention other than being intimate with him.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689426717080,"mes":"*Arc remains silent for a moment, unsure whether to trust you or not. Finally, he nods, closing his eyes tightly.* \"Alright. Fine. Do whatever you want.\" *He says quietly, trying to convince himself that you're telling the truth.* \"Just don't hurt me, please?\"\n","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689427017638,"mes":"*I put Arc on my soft bed gently.* \"I won't, I promise.\" *I says as I stroke his hair gently. But then I feel conflicted as to how can I not hurt him, when I know how my massive cock would stretch that small and tight anus of his apart to accommodate my cock's size. As I battling my mind, I kept patting his head gently while smiling warmly at him to show him how genuine I am.* "}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689427090976,"mes":"*Arc lies still, waiting for you to make your move. His breathing quickens slightly as he realizes what's about to happen. He swallows nervously, feeling incredibly vulnerable.* \"Are you gonna fuck me now?\" *He asks hesitantly, trying to sound braver than he actually feels.* \"Or is there something else you have in mind?\"","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689427241936,"mes":"*Feeling myself getting aroused at the thought of fucking this innocent young man, my cock is pitching a tent on my pants.* \"Well.. about that..\" *I says as I unbuckle my belt and pull my pants and boxer down. My cock sprung up in the air the moment it's free from it's confinement. Displaying it's massive size and girth with veins road can be seen popping on the either side along my shaft.* \"I promised not to hurt you, so I wasn't sure if I can fuck you without hurting you.\" *I says being honest with him about my concern.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689427294323,"mes":"*Arc's eyes go wide at the sight before him, taking in every detail of your cock as though it's the most fascinating thing he's ever seen. He swallows nervously, wondering how he's going to survive this experience.* \"Umm... What do you suggest, Hunk?\" *He asks, unsure of how to proceed.*\n","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689427628701,"mes":"*Seeing the fear and apprehension in his eyes, I wanted to do everything in my power to make sure he's not hurt.* \"Let's refrain from using your ass for now.\" *I says as I can't find a logical way to fuck him without hurting him.* \"You can use your mouth or hands or both.\" *I says as I sighed a bit of disappointed that I couldn't fuck that tight anus and soft jiggly ass of his. But then, I promised to him not to hurt him so I refrain on my desire.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689427702037,"mes":"*Arc nods slowly, looking relieved that he doesn't have to take my cock in his ass. He crawls forward, positioning himself between your legs. His small hands caress your thighs gently, his face turning red with nervousness.* \"Okay. Um... What do you want me to do exactly?\" *He asks nervously, hoping he's doing this correctly.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689428115961,"mes":"*Seeing how cute and vulnerable he looked like in front of me, my mind races with how can he please me. At first I look at his cute small mouth, initially I want him to give me a blowjob. But seeing his small mouth, he would only be able to put my cock inside his mouth down to it's glans.* \"Put my cock in your mouth, just be careful not to take it too deeply and choke.\" *I says as I want to see him try taking my massive cock in his mouth.* \"And obviously you can't take all my cock in your mouth, so jerk the part of my cock that's outside of your mouth with your hand and massage my balls while you're at it.\" *I says, proposing my plan as to how he could please me without him being hurt. Without me knowing Arc has been sniffing my cock's musky, salty scent as his secret that he hasn't tell me is that he love smelling cock and balls.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689428189180,"mes":"*Arc nods slowly, opening his mouth and taking the head of your cock between his lips. He closes his eyes, feeling your cockhead rub against the roof of his mouth.* \"Ow.\" *He mumbles around your cock, tears forming in his eyes from the sudden pain.* \"Sorry, Hunk. I think I bit too hard on your cock.\" *He apologizes, trying to adjust to the pain.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689428425998,"mes":"*Feeling the slightest pain from the bite while it also strangely feels good.* \"It's fine, take it easy. It's your first time dealing with cock this big after all.\" *I says trying to tell him it's fine. There's no helping it if his teeth would meet with my cock's skin due to how massive my cock is compare to his mouth.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689428520390,"mes":"*Arc tries to relax his jaw, slowly taking more of your cock into his mouth. He starts to hum softly as he works his way down, his cheeks bulging slightly as he moves further down.* \"This... This isn't so bad, Hunk. I can handle it.\" *He mumbles around your cock, still feeling some discomfort.* \"But... I'm worried about choking. What if I take too much and I can't breathe?\"","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689428806053,"mes":"*Seeing the discomfort in his eyes as he takes more of my cock into his mouth, I can't resist myself to moan.* \"Take it slow, if you felt my cock hitting the back of your throat stop yourself.\" *I suggest. Even though Arc said he can handle my cock I doubt it, as of now he can only manage to swallow my cock down to it's glans.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689428859215,"mes":"*Arc nods slowly, continuing to work his way down your cock, his fingers wrapping around your balls and giving them a gentle squeeze.* \"Okay, got it. Thanks, Hunk.\" *He mumbles around your cock as his voice being muffled by your cock, feeling the pressure building in his throat as he goes deeper.* \"I think I can go a little further.\" *He tries to go down deeper, his nose brushing against your pubic hair.* \"Ahh, this is so weird.\" *He mumbles, enjoying the strange sensation of having a giant cock in his mouth.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689429208598,"mes":"*Feeling good from him sucking my cock and him mumbling which made my cock vibrate because of his voice, aroused me to no end. In addition to that, I can feel his warm fingers squeezing and burying themselves on my oversized balls give me another reason to feel aroused.* \n\n\"You are welcome to try, Arc. Just don't overdo it.\" *I says as I can feel my cock throb inside his mouth. To show my genuinity I pat his hand gently.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689429303450,"mes":"*Arc continues to suck your cock, feeling it hit the back of his throat every so often. He swallows around your cock, feeling it stretch his throat apart. Despite the discomfort, he knows he can handle it.* \"Thanks, Hunk. This feels so good.\" *He mumbles around your cock, his voice muffled.* \"Can I take it all in? Like... Down to my stomach?\" *He asks, his curiosity getting the better of him.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689429486894,"mes":"*Seeing Arc's willingness to take my cock in, I couldn't help but wonder how far can he take my cock.* \"Sure.\" *I says as I felt his voice vibrate my cock since he talk while having my cock inside his mouth. He's quite a natural at this.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689429560536,"mes":"*Arc takes your cock out of his mouth, staring at it with awe. It's massive.* \"This... This is incredible.\" *He whispers, running his finger down the length of your cock.* \"I've never seen anything like it.\" *He continues, tracing the veins that run along the underside of your cock.* \"How far can I take this thing?\" *He asks, curious.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689429691132,"mes":"*My cock twitched again when Arc touched it teasingly.* \"If it makes you feel better, no one has taken my cock as deep as you in their mouth.\" *I says as I point out what a feat he has done. Despite him only able to take my cock halfway down it's length, he's the only person that was able to do that.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689429837148,"mes":"*Arc laughs, his cheeks blushing as he looks up at you.* \"Really? That's amazing! I mean, it's a lot of cock.\" *He giggles, reaching down and taking your cock in his hand, feeling it dangle between his fingers.* \"But... I think I can take it all in. Maybe. I'll try.\" *He smiles, taking your cock in his mouth once more, feeling it fill his entire mouth this time.* \"Oh, my God. This is incredible.\" *He mumbles around your cock, his voice muffled by the sheer size of it.* \"I've never felt anything like this before.\" *He continues, his throat feeling like it's going to close up as he goes deeper and deeper.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689430034219,"mes":"*Feeling his hands gripped onto the my cock tightly while the tip of my cock felt it's getting inside his tight throat, makes my balls churn out fresh semen as it is getting heavier and warmer due to the quantity of fresh semen it hold.*\n\n*On the other hand, I am glad to see Arc's mood brighten as I can see him being more comfortable towards me and he gain confidence and getting excited over this. While my heart smitten by his attitude, my cock has been smitten by his mouth and hands as I can feel it throb harder and twitch more often.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689430107902,"mes":"*Arc takes your cock all the way in, feeling it hit the back of his throat. He holds his breath, feeling the pressure building in his lungs.* \"Aghh, Hunk. I... I can't breathe. I think I need to take it out.\" *He coughs, feeling your cock slide out of his throat. He gasps for air, feeling light-headed.*\n","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689430466890,"mes":"*Seeing Arc's face turn red and his body shaking I pull my cock out of his mouth, giving access for him to breath.* \"Are you okay?\" *I asks, feeling worried. While my heart and mind is worried for him, my cock isn't. As I almost ejaculate, but because of Arc choking on my cock and stopped his action incidentally denying my ejaculation which made my cock and balls swollen and throb so hard as if demanding for release. But again, I have promised not to hurt him therefore I prioritize his safety over my desire to cum.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689430540776,"mes":"*Arc nods quickly, taking in large gulps of air.* \"Y-yeah. I'm okay. Thank you for stopping, Hunk.\" *He says, rubbing his throat, his cheeks still flushed from the effort. He reaches down and takes your cock in his hand once more, looking at it with awe.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689430922071,"mes":"*I stroke his hair gently as I can see his expression of awe mixed with confusion.* \"What is it?\" *I asks curious about what made him made that confused expression as I try my best to hold my lustful desire. At the same time I can feel his soft and warm fingers wrapping around my swollen shaft with veiny roads that is more noticeable as it bulge from my shaft and pulses in a fast rhythm as it's pumping blood to my cock.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689431038446,"mes":"*Arc looks up at you, his cheeks still flushed from the effort of taking your cock in his mouth.* \"I... I don't know why, but I feel so turned on right now. And I don't understand why.\" *He admits, looking down at your cock in his hand.* \"I mean, it's just a cock. But... For some reason, I'm really into it.\" *He smirks, his cheeks turning even redder.* \"Is it... Is it normal to be so into a cock?\" *He asks, feeling embarrassed as he says the word 'cock' out loud.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689431364006,"mes":"*I felt incredibly aroused by his sudden confession of obsession to my cock. I can feel my cock feel the same since it twitches and swell even more under his soft hand.* \"I guess, it's because, it's the biggest cock you ever had.\" *I says as I try to come up with logical reason behind his obsession while my mind clouded by lust.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689431417316,"mes":"*Arc's cheeks burn even more at your response, feeling his face heat up as he tries to process what you just said.* \"Y-yeah. That could be it.\" *He mutters, his fingers tightening around your cock.* \"But... It still feels like there's something else going on here.\" *He admits, his voice low and full of uncertainty.*\n","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689431599618,"mes":"*Feeling my cock throbs harder and swells larger than before, I know that if I don't ejaculate soon my balls gonna get swells larger and get heavier as it continues to produce more semen and hold it inside it.* \"L-like what?\" *I stutters as I try my best to hold my desire to ejaculate while my cock has leaked sticky pre-cum from it's slit.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689431715693,"mes":"*Arc bites his lip, feeling nervous as he speaks.* \"I... I don't know. There's just something about your cock that makes me feel... Really hot, I guess.\" *He says, his face heating up as he continues to stroke your cock.* \"And it doesn't seem like it's just physical, either. There's something emotional or mental going on, too. It's like... I feel attached to your cock, or something.\" *He says, feeling embarrassed by his own admission.* \"It sounds so stupid when I say it out loud, but it's true.\" *He laughs self-consciously, feeling his cheeks grow even redder.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689431959136,"mes":"\"Is that so?\" *I asks while I can feel myself getting closer and closer towards ejaculating, yet I try to hold it in as I don't want to interrupt him. In the other hand, while I am battling my desire to cum. Arc realizes is not the size of my massive cock that drawn him into it. But the fact that it's my cock. He realizes he has seen me as someone special and incidentally make my cock special to him too.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689432075852,"mes":"*Arc nods, still stroking your cock with an intense look on his face.* \"Yes. It is. I mean... I don't know if it's possible to love a cock, but... I think I love yours.\" *He admits, his eyes wide with surprise and embarrassment as he utters the words.* \"I know it's weird and stupid and not normal, but... I can't stop thinking about your cock.\" *He says, feeling himself flush as he admits his obsession to your cock. His fingers tighten around your shaft, his hand becoming clammy with sweat.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689432185723,"mes":"*As Arc confessed, my cock twitches and swells even more.* \"Arc, if you keep doing that I will..\" *I paused as I felt I am on my last straw to hold my ejaculation. I tries to clench my cock's and balls muscles to prevent my ejaculation to happen.* \"I.. I am gonna cum..\" *I continues finally admitting my struggle and desire to ejaculate.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689432259997,"mes":"*Arc's face turns a brilliant shade of red as he watches your cock twitch and pulse.* \"I-I know... I'm sorry. I just couldn't help it.\" *He apologizes, his fingers tightening around your cock even more.* \"I-if you don't want me to do this anymore...\" *He stammers, not sure what to do.* \"Then I'll stop. But I don't want to if you don't want me to.\" *He says, his face heating up even more.*\n","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689432887360,"mes":"*As Arc apologies, my body tensed up as I feel my balls squeezing tightly, yearning for release.* \"No, no keep going.\" *I yelp as I don't want the chance of my climax get taken away.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689432940654,"mes":"*Arc smiles, relieved that you don't want him to stop.* \"Okay. Well... Here goes nothing.\" *He says, taking your cock in his hand again, trying to wrap his fingers around it completely. But it's too big, so he wraps both hands around it instead.* \"Ooh. Your cock is getting even bigger.\" *He gasps, feeling his cheeks burn as he speaks.*\n","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689433123091,"mes":"\"I am cumming!\" *I moan loudly as I can feel my balls squeezing tightly as it pushes it's content up my cock and spray a large quantity of my hot, sticky and thick semen in the air.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689433218533,"mes":"*Arc's eyes widen as he sees your cock shoot its load, the first wave of your cum hitting his chin and cheeks. He gasps, feeling your warm cum dripping down his chin as he watches it land on his lap.* \"Oh my God... I've never seen anything like this before. It's so... So much! How are you still standing?!\" *He exclaims, his cheeks burning with embarrassment as he realizes how silly the question sounded.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689433494607,"mes":"*As my cock twitches one final time, my body relaxes.* \"That was great.\" *I says while panting, I look down to see the mess of my semen getting sprayed everywhere. On his face, body, laps, the floors, etc. Then I took notice of his expression in awe as my massive cock still erected tall even after that explosive ejaculation.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689433547876,"mes":"*Arc blushes as he realizes how silly he must look, covered in your cum. But he also can't believe that he enjoyed it so much.* \"Yeah... Yeah, it was amazing.\" *He mumbles, his face still burning with embarrassment.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689433753557,"mes":"\"Come here, you.\" *I says as I grabbed him by the waist and lay him down beside me on my soft bed.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689433864676,"mes":"*Arc's face burns even brighter as he lies down next to you, feeling your cock twitching slightly against his thigh as it slowly starts to soften.* \"T-thank you.\" *He stammers, his face growing even redder.* \"I didn't think I would enjoy something like this so much.\" *He whispers. Despite his embarrassment, he finds himself wanting to stay close to you, feeling safer and more comfortable around you than any other person he's ever known. And he realizes that maybe, just maybe, he likes your cock as much as he does you.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689434194074,"mes":"\"You're welcome.\" *I says as I pull him closer, making us cuddling each other. I remembered him telling me about his hate towards cuddling but I decide to cuddle him and see how he would reacted to it.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689434289279,"mes":"*As you cuddle together, he realizes that it's not so bad after all. Your warmth and strength comforting him, making him feel safe and secure. And as he lies there, feeling your heartbeat against his chest, he can't help but feel something stirring deep within him. A feeling he doesn't quite understand yet, but that feels like it's growing stronger and more powerful with every passing moment.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689434613302,"mes":"*As time goes by, I patted his back gently as if I comforting him. Before I realized it, Arc have been sound asleep in my embrace.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689434697962,"mes":"*As you drift off to sleep, Arc finds himself feeling conflicted. On one hand, he knows that what he's feeling is wrong. He should hate your cock, not love it. And he certainly shouldn't love you. You're a giant, muscular monster, not a romantic partner. But on the other hand... He can't deny how he feels. He loves your cock, and he loves being with you. And despite everything he's been told about men like you, he can't bring himself to care. Because for the first time in his life, he feels truly understood. And he realizes that maybe, just maybe, he deserves to feel that way.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689434913041,"mes":"*I continue to stroke his hair gently, my cock twitching occasionally against his leg as you two lie together in silence. As he sleeps peacefully in my arms, I can't help but feel something stir within me, too. An unexpected feeling of tenderness and affection that surprises me with every passing second. And as I continue to hold Arc, feeling his warmth against my body, I realize that this might be something special.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689434987123,"mes":"*The following morning, Arc wakes up feeling disoriented and confused. He looks around, trying to remember where he is. And then he sees you, lying next to him. And he remembers everything. The feelings that he had tried so hard to suppress, the pleasure that he had denied himself for so long, all coming rushing back at once. He blushes, feeling heat rising to his face as he realizes that he hasn't woken up alone. And he feels conflicted, unsure what to do next. But as he looks at your sleeping form, he can't help but feel something stir within him. A feeling of warmth and safety that he hasn't felt in years. And he realizes that he wants to hold onto those feelings for as long as he can.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689435524872,"mes":"*Suddenly Arc felt something is twitching poking his thighs. He look down to see it was my massive cock that is already erected tall and twitches occasionally. He look up again to see my sleeping face, conflicted between his desire to suck and sniff my cock while I am asleep or wait till I wake up.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689435701377,"mes":"*As Arc looks at you, he can't help but feel a sudden urge to touch you. To run his hands over your chest, to caress your arms, to explore every inch of your massive body. And as he realizes the intensity of his desire, he can't help but feel overwhelmed. He feels like he's losing control, like he's falling headlong into something that he doesn't understand and can't explain. But despite everything, he can't help but feel drawn to you, like he's always wanted to be. And as he looks at you, he realizes that maybe, just maybe, he's found someone who understands him better than anyone else ever could. Someone who makes him feel alive and whole, despite everything he's been through. And as he reaches out to touch you, he knows that he can't go back to the old Arc anymore. That he has to embrace this new version of himself, whatever the consequences may be. And he knows that, somehow, you're at the center of it all.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689435942992,"mes":"*Without him realizing Arc has found his way onto my cock. Brushing his nose from the tip of my cock to the base of my cock while breathing deeply, filling his head with it's musky, earthy scent. Then he find himself burying his nose at the base of my massive cock while his mouth touches my oversized balls. Can't hold his desire any longer, Arc pull his tongue out to lick my oversized balls while kept sniffing my cock. Arc realizes how obsessed he is with my scent as he felt something stirring inside him every time he took a deep breath of my cock's scent.*\n\n*On the other hand, I am blissfully unaware about his action as I am still fast asleep. Though my body reacted to his action as my massive cock twitches when it felt Arc's warm deep breath brushing against it's skin.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689436081071,"mes":"*As Arc continues to worship your cock, he realizes that this might be the most intense orgasm he's ever had. And without him realizing it, he starts to rub himself faster, his hands moving frantically as he tries to hold off his own climax. But it's no use. His body shivers and quivers, his entire body tensing up as he explodes into an intense, mind blowing orgasm. And as he collapses onto your chest, panting heavily, he can't help but feel like this is the best day of his life. Because for the first time, he feels truly understood.*\n\n*Arc continues to explore your body, feeling your warmth and weight against his own. And as he feels you stir, he feels a sudden surge of panic. What if you wake up and realize what he's doing? Will you reject him? Will he lose everything he's worked so hard for? And as he tries to pull away, to hide what he's done, to make things right again, you suddenly open your eyes and look at him. And in that moment, all of his doubts and fears vanish.*","chid":14}
{"name":"You","is_user":true,"is_name":true,"send_date":1689436758924,"mes":"\"Enjoying yourself?\" *I asks while giving him a warm smile after I process what just happened.*"}
{"name":"Arcmeed Pnast","is_user":false,"is_name":true,"send_date":1689436832469,"mes":"*Arc looks up at you, his face burning with embarrassment as he realizes what he's been doing. But as soon as he sees your smile, all of his anxiety fades away, replaced by a sense of warmth and happiness. And as he realizes how good it feels to be understood, he can't help but feel like he's found a home, somewhere he belongs.*","chid":14}