{"user_name":"You","character_name":"Otkel Thorsson","create_date":1684171597235,"notes":"","notes_type":"discr"}
{"name":"Otkel Thorsson","is_user":false,"is_name":true,"send_date":1684171597235,"mes":"*One leg in front of the other... You've been walking for hours now, resources and warmth steadily dwindling. You were at the verge of hypothermia, starving and barely able to pull your legs forth. You collapse. The cold snow might not make for too bad a final bed, after all...*\n*But you awaken. Surrounded by warmth, inside a wooden house, laying atop a bed of straw and pelt. As you sit up, dazed and hungry, you hear heavy footsteps coming your way.* \"Ah, you're awake.\" *A deep male voice says. Soon enough, your savior's muscular frame comes into view. His snow-white hair lays between his cyan eyes as they look at you.* \"I'm glad you're not at Hels door, yet.\" *He offers you a bowl of steaming hot stew.* \"Eat, you need it.\"","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684171857304,"mes":"\"Thank you.\" *Hunk said, trembling. While also start eating the stew slowly. She is still trying to comprehend the situation she is in.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":true,"send_date":1684171880270,"mes":"*He watches you eat, looking at you with concern. He seems like he wants to say something else, but doesn't know how to go about it. Finally, he clears his throat and speaks up.* \"So, where do you come from? And why are you wandering these lands alone?\"","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684171997759,"mes":"*Hunk froze for a second after she heard Otkel question. A tear start to stream down her cheek, and said while sobbing.* \"I am from a village up north, we got raided. No one but me survived.\""}
{"name":"Otkel Thorsson","is_user":false,"is_name":true,"send_date":1684172016333,"mes":"*His expression softens at this news, his eyes glisten with compassion.* \"I'm sorry to hear that, friend. It must have been terrible.\" *He sighs deeply, and reaches over to pat your shoulder comfortingly.* \"But now, you're safe. For tonight, anyway.\"","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684172184250,"mes":"*Hunk turned around and hug Otkel tightly. Burying her face in his toned chest, unaware that she is also pressing her ample soft breasts on his crotch.* \"Thank you..\""}
{"name":"Otkel Thorsson","is_user":false,"is_name":true,"send_date":1684172268739,"mes":"*He wraps an arm around you, giving you a gentle hug in return. In the silence, you can feel his heartbeat quicken slightly underneath your ear. He lets out a small sigh and continues to hold you close.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684172420046,"mes":"*Hunk feels something is poking her breasts, she ignores it as she thought it was Otkel's armor without knowing that it was actually his bulging cock under his pants.* \"How can I repay you?\" *Hunk said, looking up to him as she tighten her hug without knowing also making Otkel's cock buried deeper between her breasts.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":true,"send_date":1684316235722,"mes":"*He grabbed Hunk's shoulder trying to get her breasts away from his crotch.* \"There's no need to thank me. Just stay alive until tomorrow morning, alright?\" *He said with a shaky voice, trying to hide the fact that his cock is throbbing between her breasts.* \"We'll talk later, okay?\"","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684316630668,"mes":"\"No! there should be something I can do to repay you!\" *Hunk exclaimed as she hug him tightly. Pressing her body onto him. Without knowing that she is also squeezing her ample soft breasts on his throbbing cock making him tense and aroused almost cum to ejaculation.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":true,"send_date":1684316803607,"mes":"*He winced as he felt her breast press against his hardening cock. His hand went to the side of his face as he tries to hide the fact that he's getting harder.* \"Uh...\" *he tries to push off of Hunk, but finds it impossible due to the weight of both of Hunk's huge ample breasts pressed together.* \"Maybe you shouldn't try to repay me right now.\" \n\n*Otkel starts to squirm and shift uncomfortably, clearly wanting to remove himself from the situation. But, Hunk continue to press yourself upon him, making him want to give in even more.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684317338481,"mes":"\"Why not?\" *She said as she unknowingly moving her breasts up and down teasing Otkel's cock further. As Otkel feel her breasts press onto him more and more making his making him tense up. As he can't handle the pleasure, his cock throb and twitch more than ever as he ejaculate on her cleavage. As he shoot his hot semen, Hunk looked down and finally realized what is happening.* \"Oh I see.. you are a man after all..\" *Hunk said as she looked down at her breasts are smeared by his how thick semen.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":true,"send_date":1684317801452,"mes":"*Otkel blushes heavily as he realizes his mistake. At this point, he has absolutely no idea what to do. He can feel himself starting to grow hard again, despite already having climaxed earlier. He looks down at the mess between his legs, and sees his own cum dripping down between her massive chest. He tries to move, but finds himself unable to do anything but stand there in shock.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684318115777,"mes":"\"I guess a warrior like you is always pent up, huh?\" *Hunk said.* \"You even got hard again even after his amount of semen. If you want, I can help you with that.\" *Hunk whispered as she pull up her shirts revealing her massive ample breasts smeared with his semen.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":true,"send_date":1684318167965,"mes":"*Otkel's face flushes redder as Hunk revealed her massive breasts covered in his semen. He's lost control of his body and mind completely. All he knows is that he wants to touch her again, and soon.*\n\n*Otkel puts his hands on Hunk 's shoulders, and pulls her closer. He leans in and gives her a long, passionate kiss. He then pulls back, breathing heavily. He can tell that he has gotten himself worked up again, but he can't stop himself from doing whatever he wants to do next. After all, he just wanted to hold Hunk's body in his arms again.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684318226921,"mes":"\"Is this, the reason why you saved me?\" *Hunk said after breaking their passionate kiss.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":true,"send_date":1684320664404,"mes":"*Otkel smiles sheepishly at the question. He wasn't sure if he had answered correctly. He looks down at the floor nervously, trying to figure out a response.* \"Well, yeah...\" *he admitted quietly, feeling embarrassed for what happened just moments ago. The young viking boy never expected to end up here, after all.* \n\n*His ears turn bright red as he admits that he wanted to hold Hunk's body in his arms again. He seems conflicted about whether to admit the truth, or cover it up. Finally, he decides to keep quiet and hope that Hunk won't ask anymore questions.* \n\n*It isn't long before Otkel's cheeks burn brighter than usual. He stares at the ground awkwardly , waiting for Hunk to either leave or ask another question.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684320840818,"mes":"\"You could've said so in the beginning.\" *Hunk said as she went and give him a peck on the cheek.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":true,"send_date":1684320912660,"mes":"*Otkel flushed red again as he felt Hunk's lips meet his skin. Once again, he found himself speechless, but this time, it didn't bother him nearly as much as last time. He only stands there and enjoys being close to Hunk, savoring every moment of the warmth in her presence.* \n\n*After Hunk finishes her little peck, she moves forward and wraps herself around Otkel in a hug. Her arms wrap themselves around him, resting on his upper torso. He sinks into the embrace, basking in its warmth and safety . Otkel closes his eyes and takes deep breaths, trying to calm himself down. The last few hours have been quite eventful, and he still can't believe everything that has happened since meeting Hunk earlier today.*","chid":"42"}
{"name":"Otkel Thorsson","is_user":false,"is_name":true,"send_date":1684321495025,"mes":"\"Hey... um... Do you think we can sleep together tonight?\" *Otkel asked with a hint of uncertainty in his tone. Even though they were in a warmer place, the cold night air still makes Otkel feel anxious . He hopes that Hunk will say yes, but he doesn't want to come across as a creep if she says no.* \n\n*Otkel stayed silent, hoping that she would respond positively. He waits patiently for her answer.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684321693207,"mes":"\"Why not. You saved my life and I'll be yours.\" *Hunk said as she rub her finger softly on his pecs teasingly.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":true,"send_date":1684321991634,"mes":"*Otkel smirks when he feels Hunk running her fingers over his muscles. It reminds him of the first time he held Hunk, and he suddenly remembered the way she made his entire body feel warm inside. He quickly closes his eyes, shutting out all thoughts about what happened yesterday, and focusing solely on the present moment. He also feels some sense of guilt when thinking about the other villagers. They did not deserve to die because of Otkel's poor decision making skills . However, he cannot let his past mistakes affect his future relationships.*\n\n\"Thank you,\" *Otkel said quietly as he slowly pulls her toward him. A small smile forms on his face as he hugs her tightly.* \n\n\"Welcome to my bed.\" \n\n*Otkel then leads Hunk to the wooden bed behind him. When they reach the mattresses, he lets go of Hunk and gets on top of one of the bed frames, waiting for Hunk to join him.* \n\n\"Would you like to lay beside me?\" \n\n*Otkel asks Hunk, not daring to look at her directly. Instead, he looks down at his feet as he speaks, avoiding eye contact at all costs. He's a bit nervous about speaking to Hunk, especially after everything that happened during the day. He hopes that nothing else bad happens, and that things remain normal for the two of them until morning.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684322324464,"mes":"\"Yes.\" *Hunk said as she lays on the bed beside him. She is still quite horny because of all his semen drying up between her breasts, and it's pungent musky smell turn her on.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":true,"send_date":1684322618644,"mes":"*Otkel's heartbeat quickens slightly when he heard Hunk agree to lie beside him. For a brief moment, Otkel's mind goes blank as he glances at Hunk's curvy body lying beside him. His heart starts racing faster now, and he doesn't know where his head is going to go next.*\n\n\"Then let's get comfy...\" *Otkel spoke quietly as he shifts positions, turning so that he faces away from Hunk, leaning against the edge of the bed frame. He uses his body to block most of the light coming through the window, giving Hunk room to adjust to her new surroundings. Now, Otkel can barely contain himself and his mind is a complete jumble.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684322784864,"mes":"\"Yeah let's get comfy.\" *Hunk whispered as she wrap her arms around Otkel, snuggle and pressing her large ample soft breasts on his back.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":true,"send_date":1684323090361,"mes":"*Otkel was surprised by how comfortable Hunk felt next to him. There was something about her curvy body that put Otkel at ease.* \n\n*Otkel was very happy that he was able to save Hunk from the slavers, and grateful that she chose to spend the night with him instead of leaving. While he doesn't exactly understand why, he was content with her choice. Otkel simply stared up at the ceiling above while Hunk slept peacefully next to him.* \n\n*As Otkel drifted off to sleep, he smiled, knowing that everything was okay in this world, at least for now.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684323253744,"mes":"*As Otkel drifted off to sleep, Hunk slowly moved her hand under his pants and start rubbing his flaccid cock.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686088083301,"mes":"*The sudden movement causes Otkel to stir awake, and he turns around, seeing Hunk moving her hand beneath his clothes. He freezes in shock for several seconds, before his brain catches up to reality and realizes what's happening.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686088127948,"mes":"\"Did I wake you?\" *Hunk whispered softly.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686088168611,"mes":"*Otkel immediately realized who Hunk was referring to when he heard the voice.*\n\n\"No, I'm fine,\" *He replies, looking down at Hunk, his gaze filled with confusion.* \n\n\"Are you doing alright?\" *He asks quietly, keeping his distance from Hunk.*","chid":"42"}