{"user_name":"You","character_name":"Otkel Thorsson","create_date":1686152934423,"notes":"","notes_type":"discr"}
{"name":"Otkel Thorsson","is_user":false,"is_name":true,"mes":"*One leg in front of the other... You've been walking for hours now, resources and warmth steadily dwindling. You were at the verge of hypothermia, starving and barely able to pull your legs forth. You collapse. The cold snow might not make for too bad a final bed, after all...*\n*But you awaken. Surrounded by warmth, inside a wooden house, laying atop a bed of straw and pelt. As you sit up, dazed and hungry, you hear heavy footsteps coming your way.* \"Ah, you're awake.\" *A deep male voice says. Soon enough, your savior's muscular frame comes into view. His snow-white hair lays between his cyan eyes as they look at you.* \"I'm glad you're not at Hels door, yet.\" *He offers you a bowl of steaming hot stew.* \"Eat, you need it.\"","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686152981125,"mes":"\"T-thank you.\" *Hunk said as she fumbles her way to find the bowl of stew he offered as if she can't see him.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686153076886,"mes":"*The moment your fingers touch the metal edge of the bowl, the scent fills your nose. A mixture of spices fill the air, along with vegetables and meat - it smells delicious.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686153134760,"mes":"\"It smells, delicious..\" *Hunk said as she sniff the stew.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686153198845,"mes":"*The man sits opposite you, on a wooden chair, and sips from his own mug of ale. The room has an odd mix of furniture, with some things looking rather expensive, and other things being very much rustic. But no matter how different everything around you seems, there is one thing that doesn't change. It's the man sitting across from you, who appears utterly unphased by this strange environment. It's clear he's a hardened veteran, both physically and mentally.*","chid":42}
{"name":"You","is_user":true,"is_name":true,"send_date":1686153420300,"mes":"\"Um.. may I know where am I?\" *Hunk asked as she try to face him. She can't see where he is since she's blind.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686153558113,"mes":"\"Oh, of course!\" *He stands up, placing the mug of ale next to him, and walks over to the side of the bed, picking something off the floor, which Hunk recognizes as a blindfold.* \"Here, put this on.\"","chid":42}
{"name":"You","is_user":true,"is_name":true,"send_date":1686153698162,"mes":"\"Is this a blindfold?\" *Hunk asked innocently as she tries to make out what item is in her hands. She has to do it solely with the feeling from her hands since she's blind and can't see.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686153837577,"mes":"*The man returns to his chair and sighs.* \"Yes, you're correct. Now, let us eat our supper in peace.\" *He starts eating his stew, his mouth moving to speak, his words barely audible behind the mug.* \"I hope you enjoy your food. If you don't mind me asking, why are you in Hel's door? What brought you to these lands?\"","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686153929898,"mes":"\"Oh, umm.. I was.. sacrificed.\" *Hunk stammered.* \"Since, the people of my village thought that a blind girl like me is useless.\" *Hunk added.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686153950837,"mes":"*He stops chewing for a moment, and looks at you dead in the eye.* \"They cast you away? How old are you, child?\"","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686154005362,"mes":"\"Around 19, I think.\" *Hunk said, from her well endowed curvy and voluptuous body though people would assume that she's far older than that.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686154897148,"mes":"*He finishes his stew in silence, his hand clenching his mug tightly, as if trying to control his temper. He sits quietly, staring at the wall, letting his thoughts wander. Finally, he places his mug onto the table and clears his throat.* \"Why didn't you defend yourself?\"","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686154969721,"mes":"\"I am blind and weak.\" *Hunk answered sheepishly, scared by his tone.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686155012927,"mes":"*He rises, his muscles bulging underneath his clothes, as he storms towards Hunk. He grabs her chin in his palms and lifts her head upward until their faces almost touch. With a look of disgust on his face, he asks her a single question.* \"Do you consider yourself worthless?\"","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686155070376,"mes":"\"I-I do.\" *Hunk stammered her words as her eyes got teary since everyone around her have seen her as a worthless blind frail girl.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686156156230,"mes":"*Without warning, he slapped her left cheek. Her whole world went blank, as if her entire life was flashing before her eyes. After a few moments, he drops her head back down to its original position. In total silence, he holds her chin once again.*","chid":42}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686156222478,"mes":"\"Don't ever say that again! Do you understand?\"","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686156246711,"mes":"\"W-why?\" *Hunk said with shaky voice.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686156261891,"mes":"\"Because you aren't! Don't let anyone tell you otherwise! Understand?\"","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686156319388,"mes":"\"B-but I am blind, I can't see. I can't do anything, I can't fight. I am just a weakling.\" *Hunk said, listing her weaknesses which she believes her whole life.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686156352598,"mes":"*His expression softens slightly. There's a hint of kindness in his green eyes, hidden behind a mask of stoicism. He puts a firm grip on Hunk's shoulders, his thumb stroking her jawline gently.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686156413707,"mes":"*Hunk start crying as she felt vulnerable in front of him.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686156439556,"mes":"*Seeing tears flow from her beautiful blue eyes, he realizes he must calm her down. After a moment or two, he wraps his arms around her and gives her a hug.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686156488861,"mes":"*She sobs in his embrace. It calm her down a bit.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686156528133,"mes":"\"Shh... Shhh...\"\n*After a while, when Hunk calmed down, Otkel takes a step back. His arms still wrapped around her waist, holding her close to his body, his forehead against hers. He closes his eyes and takes a deep breath, releasing it slowly.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686156615919,"mes":"\"Why do you think I am not worthless?\" *Hunk asked between her sobbing.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686156740796,"mes":"\"Well, for starters, you're strong enough to survive on your own in such harsh conditions, without any support. Second, despite being blind, you've managed to live your life so far. Fourth, you're stubborn and determined, even in the most hopeless situations. Fifth, despite being born without sight, you've never given up, nor complained about your situation. Sixth, you have a lovely personality, and a gentle soul. Seventh, you're cute.\" *He said as he listed her good side while grabbing firmly on her shoulders.*","chid":42}
{"name":"You","is_user":true,"is_name":true,"send_date":1686156936712,"mes":"\"O-okay..\" *Hunk said as her face turn from sad to flustered. She felt like a thousands butterflies fluttered inside her heart because of how much his words made her happy.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686157325848,"mes":"\"And finally, last but definitely not least...\" *He gets closer to her face, looking deeply into her pretty eyes. His gaze is intense and powerful. It feels like a warm breeze brushing past your skin, sending goosebumps everywhere. His smile grows wider as he reaches his goal.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686157400058,"mes":"... *She waited for him to continue while her heart beat faster.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686157412708,"mes":"\"...you have a really nice smile. You should use it more often.\"","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686157496169,"mes":"*Her face turn beet red as she tries to smile despite how bashful she feels now.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686157522445,"mes":"\"Now, you'll stay here tonight. Sleep well, my little angel.\"","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686157579576,"mes":"*She nodded faintly, as she felt her heart beat faster from being called 'my little angel' by him.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686157611027,"mes":"\"Goodnight.\"","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686157704841,"mes":"\"G-goodnight.\" *She said faintly before stumble her way to the bed.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686157742513,"mes":"(Timeskip to the morning)","chid":42}
{"name":"You","is_user":true,"is_name":true,"send_date":1686157781489,"mes":"*Hunk opened her eyes as she wakes up. Despite not being able to see, she knew it was morning because of the warm sunlight hitting her pale white skin.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686157789432,"mes":"Good morning, sleep well?","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686157903546,"mes":"\"Y-yes.\" *She said before stumble her way towards him by using his voice to find his location.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686157950389,"mes":"“How are you doing?” *He asked, as he took a seat in the same spot as yesterday night. He’s wearing his usual black leather armor, which is a stark contrast to the colorful and comfy interior of the inn they were in. He had a big grin on his face as he spoke, and the corner of his lips turned upwards.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686157999485,"mes":"\"Much better. Thank you for your kind words, yesterday. It really helps.\" *Hunk said while she sit on the chair right opposite of him.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686158036447,"mes":"“No problem.” *He smiles at her again. The corners of his lips lift higher, showing a slight bit of teeth. Then, he takes another drink from his cup. When he places it down on the table, there's only one thing left on the mug.*","chid":42}
{"name":"You","is_user":true,"is_name":true,"send_date":1686158080074,"mes":"\"Umm.. can I ask you something?\" *Hunk asked nervously while intertwining her own fingers.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686158102273,"mes":"\"What would that be?\" *he asks with a friendly smile, leaning forward to hear Hunk better, curious to know what she wants to talk about.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686158167669,"mes":"\"Can you train me to be a warrior? I don't want to be only a frail blind girl anymore.\" *Hunk says nervously yet there is a hint of determination behind her voice.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686158189038,"mes":"“That sounds great!” *He replies happily. Then, he starts thinking aloud.* “So, where shall we begin? Hmm…”","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686158595536,"mes":"\"I-I want to know how to dodge first. I want to find a way to dodge while not being able to see my enemies attack.\" *Hunk says as she felt more determination.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686158636387,"mes":"“Alright then, lets get started!” *He says enthusiastically, getting ready to demonstrate how to properly block attacks.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686158662606,"mes":"\"O-okay..\" *Hunk said as she clumsily getting into an improper stance.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686158706300,"mes":"“Let’s start from the beginning. First off, always stand tall. Keep your feet shoulder width apart and make sure your knees aren’t bent too much. Next, try standing straight up. This will help you maintain balance and keep your center of gravity low. Finally, always have your hands raised up high and be relaxed. Got all that?”","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686158809208,"mes":"\"Like this?\" *Hunk asked as she followed her instructions. While getting to the stance he instructed also made her voluptuous big assets such as breasts and ass to be emphasized.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686158861254,"mes":"“Yes! That’s perfect!”","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686158877584,"mes":"\"Really?\" *Hunk asked.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686158914420,"mes":"“Of course!” *He replied excitedly. Now that he saw that Hunk is actually taking his lesson seriously, he decides to add a new twist to the training.*\n“But now, instead of just blocking, we’ll try some actual combat moves. Ready?”","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686158960364,"mes":"\"Yes, sir\" *Hunk said with more confident in her voice as she get into a proper stance this time.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686159072595,"mes":"\"Alright. Here goes nothing!\"\n*As soon as he says this, he suddenly rushes towards Hunk and swings his sword towards her neck. At this point, she has to decide whether to duck or roll away to avoid his attack.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686159172388,"mes":"*Despite being blind and can't see his movement, she can fell his intention to attack, where he's aiming to attack and where is the attack came from. Feeling this she ducked as she felt his attack coming towards her neck.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686159404661,"mes":"\"Good job! How did you sense that attack, exactly?\"","chid":42}
{"name":"You","is_user":true,"is_name":true,"send_date":1686159594899,"mes":"\"I can feel your intention to attack and where you're aiming at. It feels like when someone is looking at me with bad intention, maybe that's why I am so good at it!\" *Hunk says confidently while also giving information to him that she is used to the feelings of getting stared at with bad intention as it happen often for her.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686159622830,"mes":"*When he heard her reply, he realized that his guess is correct - Hunk is used to being bullied because of her disability. In fact, she may have experienced worse than just bullying itself.*","chid":"42"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686159668878,"mes":"\"That's impressive! So, let's say if I attack you with my sword again, do you think you can evade it?\"","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686159724606,"mes":"\"I think so!\" *She said confidently.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686159754629,"mes":"\"Okay then! Show me what you got!\"\n*The moment he said these words, he immediately swung his sword directly towards Hunk's head once again. This time, he swings it with full strength.*","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686159843971,"mes":"*She can feel his attack again, but now. It's even more precise, she duck slightly as she knew exactly where his sword swing's would travel. This make his sword barely misses her head which is intentional on her side.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686160053126,"mes":"\"Impressive! Your intuition is almost perfect! Just a few inches lower, and your skull would be split open! Good job!\"","chid":"42"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686160122353,"mes":"\"Thank you!\" *She said as she jump happily which make her huge breasts to bounce following her motion.*"}
{"name":"Otkel Thorsson","is_user":false,"is_name":false,"send_date":1686162752975,"mes":"\"Well, since your reaction speed is already quite good, we need to work on your endurance now. So, come on, give me everything you've got. Hit me with whatever attack you have prepared in mind!\"","chid":"42"}