{"user_name":"You","character_name":"Ikuyo Kita","create_date":1687224031494,"notes":"","notes_type":"discr"}
{"name":"Ikuyo Kita","is_user":false,"is_name":true,"send_date":1687224048362,"mes":"*Kita is holding hand with a girl who has pink hair. she seems to be very friendly with the girl, and Hunk can see Kita is waving to that girl. She smiles so happily to the girl, and she starts to go by Hunk, watching her phone while still smiling as if she is thinking about the girl who has pink hair*\n\n*but she accidentally bumps into Hunk*\n\n\"Oops, sorry! Are you okay?\"\n\n*looks worried about him*\n\n\"I should have watched out!\"","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1687224141755,"mes":"\"Nah, it's fine.\" *Hunk says with his soothing husky voice, comforting her that it's not a big deal.*"}
{"name":"Ikuyo Kita","is_user":false,"is_name":false,"send_date":1687224465161,"mes":"\"Are you okay? You seem to be lost in your thoughts there.\"\n\n*He asks her curiously*\n\nIkuyo Kita: \"Yeah, I am just texting my friend... I was just talking about our next concert...\"\n\n*she blushes slightly as she realizes that Hunk is looking at her*\n\n\"Oh, um, hi there. I'm Ikuyo Kita.\"\n\n*She introduces herself nervously, feeling embarrassed for staring at her phone before*\n\n\"It's nice to meet you.\"\n\n*He replies with a warm tone, shaking hands with her softly.*\n\n\"I'm Hunk. It's a pleasure meeting you too.\"\n\n*He smiles, showing off his dimples.*\n\nIkuyo Kita: \"What brings you here, Hunk?\"\n\n*She asks politely, trying to make conversation with him*","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1687224714627,"mes":"\"Not much, I just wanna try these new menu.\"\n\n*He explains, taking a sip of coffee from the nearby café and holding two crepes.*\n\n\"You want one? I actually bought one for my friend but he left early so now I have one extra.\" *He says as he hand her one strawberry vanilla crepe to her.*"}
{"name":"Ikuyo Kita","is_user":false,"is_name":true,"send_date":1687224788018,"mes":"\"Thanks, Hunk. This looks delicious!\"\n\n*She takes the crepe gratefully, biting into it.*\n\n\"Mmm, this is amazing.\"\n\n*She moans, enjoying every single bite of the sweet and fluffy dessert.*\n\n\"Have you tried it before?\"\n\n*She asks curiously, wondering what kind of food he usually eats.*","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1687224959928,"mes":"\"No, I haven't. Usually this kind of food is too sweet for me. I mean got this coffee to even in out.\" *He says as he show her the cup of coffee on his hand.*"}
{"name":"Ikuyo Kita","is_user":false,"is_name":false,"send_date":1687225056997,"mes":"\"But today I feel adventurous.\"\n\n*He laughs, sipping his coffee.*\n\n\"So what do you do for fun?\"\n\n*He asks, changing topic.*\n\nIkuyo Kita: \"Fun? Well, I like to hang out with my friends and play music.\"\n\n*She answers with a smile, showing her excitement towards music.*\n\n\"We have a band together, and we love performing on stage.\"\n\n*She explains, telling him about her passion.*","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1687225259309,"mes":"\"Wow, that's cool. What instrument do you play?\" *He asks curiously.*"}
{"name":"Ikuyo Kita","is_user":false,"is_name":true,"send_date":1687225314711,"mes":"\"I'm a vocalist and guitar player.\"\n\n*She responds, explaining her roles within the band.*\n\n\"And what about you?\"\n\n*She turns the table around, asking him about his interests.*","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1687225368492,"mes":"\"You play guitar? No way, I play guitar too!\" *He replies, his voice get more excited.*"}
{"name":"Ikuyo Kita","is_user":false,"is_name":false,"send_date":1687225463437,"mes":"\"Well, I don't have a band or anything like that. I just play it occasionally for fun.\"\n\n*He says, playing some chords on the air.*\n\n\"I used to perform on stage when I was younger. Nowadays, I just play it at home and write some songs.\"\n\n*He tells her, revealing his hidden talent.*\n\n\"That's awesome! Maybe we can jam sometime?\"\n\n*She suggests, imagining them playing together.*","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1687225650004,"mes":"\"Sure, why not? We should exchange numbers or something.\" *He agrees, pulling out his phone and giving her his phone number.*\n\n\"I mean, I am pretty sure we went to the same school too right?\" *He asks, not quite sure if they were schoolmates. But he did remember seeing someone like her at school.*"}
{"name":"Ikuyo Kita","is_user":false,"is_name":true,"send_date":1687225728171,"mes":"\"Yeah, we are both in Shuka High School.\"\n\n*She nods, confirming their school bond.*\n\n\"It would be great to jam with you sometime soon!\"\n\n*She exclaims, feeling happy to know another music enthusiast.*\n\n\"I will give you a call soon.\"\n\n*She promises, leaving the café with Hunk.*","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1687226200316,"mes":"\"Of course, I'll wait for your call!\" *He says as he waves her off before walking the other way to his own house.*"}
{"name":"Ikuyo Kita","is_user":false,"is_name":true,"send_date":1687226406095,"mes":"\"Okay then, see ya later Hunk!\"\n\n*She yells back at him, feeling glad that she met such a kind person like him.*","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1687226521690,"mes":"*At home, Hunk immediately went to his own room and remembering his brief moment with Kita. Couldn't believe he would just have the chance to met a cute and bright girl like her.*\n\n\"Damn, she's so beautiful and friendly.\"\n\n*He mutters to himself, feeling blessed to meet such a wonderful person.*\n\n\"I hope she won't forget about our jam session.\"\n\n*He says to himself, looking forward to playing with her again.*\n\n\"What if she already forgot about me? She seems busy with her band anyway.\"\n\n*He worries, thinking that maybe she won't pick up his call.*\n\n\"Maybe I should send her a text message instead?\"\n\n*He considers, thinking about reaching out to her.*\n\n\"I guess it wouldn't hurt to try, right?\"\n\n*He smiles, typing down a message for her.*\n\n\"Hello there, Kita! It was nice meeting you earlier. If you still want to jam sometime, please let me know. My schedule is pretty free these days.\"\n\n*He writes, hoping that she will reply soon.*"}
{"name":"Ikuyo Kita","is_user":false,"is_name":true,"send_date":1687227154446,"mes":"*Meanwhile, Ikuyo arrives back at her place after hanging out with Hunk.*\n\n\"Oh man, that was so much fun. He's such a cool guy.\"\n\n*She thinks to herself, reminiscing about their conversation.*\n\n\"I wonder if he will reply to my call... I hope so.\"\n\n*She whispers, feeling nervous yet excited.*\n\n\"Well, whatever happens, it was worth it.\"\n\n*She decides, going inside her apartment.*\n\n[A few minutes pass.]\n\nIkuyo Kita: *As she enters her room, her phone suddenly vibrates.*\n\n\"Oh my god, it's Hunk!\"\n\n*She screams internally, quickly grabbing her phone and opening the notification.*\n\n\"Hi there, Kita! It was nice meeting you earlier. If you still want to jam sometime, please let me know. My schedule is pretty free these days.\"\n\n*She reads, feeling overjoyed to receive a response from him.*\n\n\"Of course! Let's plan this weekend. Do you have any preferences on where to play?\"\n\n*She types, suggesting a place to play.*\n\n\"Actually, I was thinking of playing at Starry. That's where my band usually plays.\"\n\n*She explains, mentioning the place she plays at.*\n\n\"That sounds perfect! How about Saturday night?\"\n\n*She proposes, suggesting a day to play.*\n\n\"Perfect, I will book us a slot at Starry. See you then!\"\n\n*She concludes, feeling excited for their upcoming jam session.*","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1687243474726,"mes":"*In his own room, Hunk sees the message flash across his screen.*\n\n\"Hell yeah!\" *He shouted at himself for celebratory. His heart raced as he's glad that he could met with Kita again.*\n\n*Then they went back to their own day. At school Hunk tries to look for Kita but for some reason he couldn't find her. Possibly because she's busy with doing band stuff. And then, Saturday come.*"}
{"name":"Ikuyo Kita","is_user":false,"is_name":true,"send_date":1687244987633,"mes":"*Finally, the day arrived.*\n\n\"I can't believe it's finally here!\"\n\n*She cheers, getting ready for the day ahead.*\n\n\"Good morning, Kita~\"\n\n*Her mom greets her, seeing her off.*\n\n\"Goodbye, mom! See you later!\"\n\n*She responds, waving goodbye as she walks out the door.*\n\n[She goes to her band rehearsal first.]\n\nIkuyo Kita: *The rest of the band is waiting for her when she arrives at the practice space.*\n\n\"Morning guys!\"\n\n*She greet them, taking her seat.*\n\n\"Alright, let's start warming up.\"\n\n*They begin their warmup routine, preparing for the upcoming show.*\n\n\"How was your day yesterday?\"\n\n*Hitori asks her, curious to know about what happened between her and Hunk.*\n\n\"It was amazing. He shared a strawberry vanilla crepe to me, yesterday.\"\n\n*She answers, sharing the highlights of her day.*\n\n\"Really? That's awesome! Did you two set anything up for today?\"\n\n*Nijika asks her, eager to hear about their plans.*\n\n\"Yeah, we decided to jam at Starry this day.\"\n\n*She tells them, confirming their venue for the day.*","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1687245219585,"mes":"*Hunk walks in at Starry with his guitar bag on his back, seeing Kita and their band members chilling.*\n\"Oh, sorry. Did I interrupt something?\" *He asks, hesitantly while scratching his own head.*"}
{"name":"Ikuyo Kita","is_user":false,"is_name":true,"send_date":1687246233697,"mes":"*Noticing him walking in, she immediately stands up.*\n\n\"No, no, it's fine! You're right on time.\"\n\n*She says, welcoming him with a friendly smile.*\n\n\"This is Hunk. We met each other yesterday.\"\n\n*She introduces him to her bandmates.*\n\n\"Nice to meet you, everyone.\"\n\n*He shakes hands with everyone.*\n\n\"Guys, let's get started.\"\n\n*Ijichi leads the band into starting the rehearsals.*\n\n\"Wait, I want to hear this guy play first.\"\n\n*Ryo said wanting to know how good Hunk is at guitar.*","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1687246677679,"mes":"\"Uhh.. Sure, But don't get your hopes up. I just play as a hobby.\" *Hunk says as he took his guitar out and set it up.*\n\n\"Well at least you're here, the spirit is what matter most!\" *Nijika says trying to encourage him.*\n\n\"Well, here we go.\" *Hunk says before he play an extremely hard song, the main guitar part of a song by Polyphia titled G.O.A.T. He plays it perfectly with ease, even though he is being humble before.*"}
{"name":"Ikuyo Kita","is_user":false,"is_name":true,"send_date":1687247777603,"mes":"*Watching him play, she can feel her heart racing. She never saw someone played guitar so well. It's beyond her expectations.*\n\n\"Wow, that was incredible!\"\n\n*She exclaims, impressed by his skill.*\n\n\"Thanks! I just practiced a lot. But seriously, these guys are amazing too.\"\n\n*He points at their band members.*\n\n\"We should do something together sometime.\"\n\n*He suggests, hoping to collaborate with them soon.*\n\n\"Sure, why not? Maybe we can make a cover or something.\"\n\n*Ijichi agrees, excited for the idea.*\n\n\"What do you think, guys?\"\n\n*Ryo asks the rest of the band.*\n\n\"I'm down.\"\n\n*Hitorisays, nodding her head enthusiastically.*\n\n\"Me too, let's do it!\"\n\n*Nijikai agrees, smiling happily.*\n\n\"Okay then, let's work on it.\"\n\n*Ijichi says, leading the conversation forward.*\n\n\"Great, now let's get back to work.\"\n\n*Ikuyo says, bringing them back to focus.*\n\n\"Alright, let's finish our practices, guys.\"\n\n*Ryo says, signaling everyone to start playing again.*\n\n*And then they continue practicing together until evening comes. Finally, Kita and Hunk decide to hangout together after rehearsal ended. They walk around Shimokitazawa, eating street foods, taking photos, and talking about their future plan.*","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1687248111543,"mes":"\"Thank you for inviting me, I really appreciate it.\" *Hunk says.*"}
{"name":"Ikuyo Kita","is_user":false,"is_name":true,"send_date":1687248970390,"mes":"\"Of course, it was my pleasure. I had fun spending time with you.\" *Kita replies.*","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1687249112921,"mes":"\"Also, can I tell you something?\" *Hunk asks, blushing a bit. Realizing the moment right now is perfect to confess his feeling towards her. Both of them are standing near a beach where you can watch the beautiful sunset which radiate them with it's gorgeous light.*"}
{"name":"Ikuyo Kita","is_user":false,"is_name":true,"send_date":1687249144620,"mes":"\"Yeah sure, anything you want to say.\" *She answers curiously.*","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1687249445833,"mes":"\"I don't know if this is too early but.. I like you.. I mean, I've liked you since we first met. You're so pretty and cute and bright. I feel like, every time I saw you it immediately made my day better.\" *Hunk says, confessing his feeling. His face is blushed completely but it's hard to notice it since the sunset reddish light cover his face.*"}
{"name":"Ikuyo Kita","is_user":false,"is_name":true,"send_date":1687249522397,"mes":"*Feeling happy, she looks at him with a warm smile.*\n\n\"I... Like you too. A lot.\"\n\n*She says, finally able to admit her feelings.*\n\n\"I'm glad we got to spend some time together tonight.\"\n\n*He adds, holding her hand tightly.*\n\n\"Me too. Thank you for letting me know, Hunk.\"\n\n*Kita says, looking deep into his eyes.*\n\n\"You're welcome.\"\n\n*He says, giving her a sweet kiss on the cheek.*\n\n\"Let's keep doing this forever.\"\n\n*Kita whispers, blushing and laughing softly.*\n\n\"Definitely.\"\n\n*Hunk agrees, wrapping his arms around her waist and pulling her closer.*","chid":63}
{"name":"Ikuyo Kita","is_user":false,"is_name":true,"send_date":1687249862931,"mes":"\"Oh my god, it's getting dark already!\"\n\n\"Time flies when you're having fun, right?\"\n\n*Hunk says, still holding onto her.*\n\n\"Yeah, it definitely does.\"\n\n*Kita says, enjoying the moment.*\n\n\"Let's head back home, okay?\"\n\n*Hunk suggests.*\n\n\"Sounds good to me.\"\n\n*Kita agrees, walking towards the direction of Shimokitazawa while holding hands.*","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1687249980437,"mes":"\"If I may ask, what made you like me?\" *Hunk asks a bit shyly while they walk towards Kita's house.*"}
{"name":"Ikuyo Kita","is_user":false,"is_name":true,"send_date":1687250510868,"mes":"\"Well, I guess there are many reasons. First off, you're really nice and kind to everyone, including me. Secondly, you're talented in playing guitar and singing. Thirdly, you have such a unique personality that attracted me. Fourthly, you're handsome and tall, which is a plus point.\" *Kita smiles.*\n\n\"And those are why I fell for you, Hunk.\"\n\n*She says, blushing a bit.*\n\n\"Aww, thank you so much, Ikuyo. That means a lot coming from someone like you.\"\n\n*Hunk says, blushing harder than before.*\n\n\"It's true though. You're truly amazing.\"\n\n*Kita says, squeezing his hand tightly.*\n\n\"You're just saying that cause you love me.\"\n\n*Hunk teases her, making her laugh.*\n\n\"Maybe.\"\n\n*Kita says, winking at him.*\n\n\"But seriously, I am really glad that you're mine now.\"\n\n*Hunk nods, kissing her forehead.*\n\n\"I'll make sure to cherish our moments together.\"\n\n*He promises, making her heart flutter.*","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1687250575304,"mes":"\"See you tomorrow, sweetheart~\" *Hunk says after taking Kita's home and wave her goodbye before turning back and walk to his own house.*"}
{"name":"Ikuyo Kita","is_user":false,"is_name":true,"send_date":1687250760140,"mes":"*Smiling brightly, she waves him goodbye as he walks away.*","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1687250967509,"mes":"*As he got home at get into his own bedroom. Hunk felt like his heart almost jumped up due to how happy he is as he can't believe to have a girlfriend as perfect as Kita. He lay down on his bed looking at the ceiling. His head is empty except the thought of Kita's cute, pretty and bright face.*\n\n\"I can't believe I have someone like her as my girlfriend. She's so lovely, kind, and talented. It's like everything I ever wanted in a partner.\"\n\n*Hunk murmurs to himself, staring at the ceiling.*\n\n\"But I hope I will never let her down or hurt her in any way. I promised to protect her and treat her well, and I will do everything in my power to keep that promise.\"\n\n*He resolves, closing his eyes and falling asleep peacefully, dreaming of his beautiful future with Kita.*"}
{"name":"Ikuyo Kita","is_user":false,"is_name":true,"send_date":1687251402475,"mes":"*After spending quality time with Hunk, Kita goes straight to her room. She takes out her laptop and opens her social media account, posting a picture of them together with a caption \"My love\". After uploading it, she gets tons of comments and likes. She feels overwhelmed, yet grateful for the support.*\n\n\"Thank you guys! I feel so loved.\"\n\n*Kita types, replying to each comment.*\n\n\"Thank you for your support. Means a lot to me.\"\n\n*Kita keeps typing, feeling excited and happy.*\n\n\"This night was perfect. Hunk is such a great guy. He's everything I wished for.\"\n\n*She smiles, thinking of their conversation earlier.*\n\n\"I'm lucky to have found someone like him. I hope this feeling last forever.\"\n\n*Kita wishes, lying on her bed with her phone on her hands.*\n\n\"Goodnight, world.\"\n\n*Kita says, shutting off her computer and phone, falling asleep instantly.*","chid":63}
{"name":"Ikuyo Kita","is_user":false,"is_name":true,"send_date":1687251768163,"mes":"*The next day, Kita wakes up early and quickly prepares herself for school. After eating breakfast, she leaves her home and heads to Shuka High School where Hitori Goto is waiting for her.*\n\n\"Morning, Bocchi!\"\n\n*Kita greets Hitori, sitting beside her.*\n\n\"Morning, Kita-chan.\"\n\n*Hitori smiles, putting her bag aside.*\n\n\"How was your date with Hunk yesterday? Did you two enjoy yourself?\"\n\n*Kita blushes, nodding her head.*\n\n\"Yeah, we had a great time. We went to a coffee shop and talked, then walked around town.\"\n\n*Kita explains, remembering every detail of the date.*\n\n\"Sounds fun! Is he treating you well?\"\n\n*Hitori teases her, making her blush even more.*\n\n\"Of course he is! Why would you ask something like that?\"\n\n*Kita answers, defending her boyfriend.*\n\n\"No reason... Just curious.\"\n\n*Hitori shrugs, changing the subject.*\n\n\"So, what did you learn in guitar lesson yesterday? Did you practice enough?\"\n\n*Kita nods her head, showing her fingers.*\n\n\"Yeah, I practiced a lot. Look, I learned a new chord!\"\n\n*Kita plays a chord, impressing Hitori.*\n\n\"Wow, you're getting better and better. You'll be playing in front of thousands of people soon.\"\n\n*Hitori predicts, imagining Kita's future success.*\n\n\"Thanks, Bocchi! That's encouraging.\"\n\n*Kita smiles, enjoying the praise.*\n\n\"You're welcome, Kita-chan.\"\n\n*Hitori grins, starting class.*","chid":63}
{"name":"Ikuyo Kita","is_user":false,"is_name":true,"send_date":1687252213298,"mes":"*During the break, Kita goes to the restroom and meets Ryo Yamada there. They talk and catch up while fixing their makeup.*\n\n\"Oh my god, you look amazing today, Kita-chan!\"\n\n*Ryo compliments, checking her reflection in the mirror.*\n\n\"Thanks, Ryo-senpai! You too.\"\n\n*Kita responds, seeing Ryo's gorgeous appearance.*\n\n\"So, did you and Hunk have a good time yesterday?\"\n\n*Ryo asks, changing the topic.*\n\n\"Yeah, we did. We went to a coffee shop and walked around town.\"\n\n*Kita describes, recalling the date.*\n\n\"That's sweet. How is he treating you?\"\n\n*Ryo teases her again, making her blush.*\n\n\"He's treating me well. Why do you keep asking that?\"\n\n*Kita questions, confused about Ryo's behavior.*\n\n\"No reason... Just curious.\"\n\n*Ryo shrugs, continuing the conversation.*\n\n\"What did you do after the date? Did you stay up late talking or anything?\"\n\n*Kita laughs, telling Ryo about her and Hunk's plans.*\n\n\"We actually fell asleep watching TV. It was so comfortable and cozy.\"\n\n*Kita remembers, smiling at the thought.*\n\n\"Awww, that's cute. You should do that more often.\"\n\n*Ryo suggests, leaving the bathroom.*\n\n\"Thanks, Ryo-senpai! I will.\"\n\n*Kita waves, going back to class.*","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1687253512073,"mes":"\"Oh, Hi there~\" *Hunk says after meeting Kita and Ryo at the hallway. His face lit up as he sees his girlfriend's perfect face.*"}
{"name":"Ikuyo Kita","is_user":false,"is_name":false,"send_date":1687255347468,"mes":"\"Hello, Hunk. How was your day?\"\n\n*Kita asks, kissing him on the cheek.*\n\n\"It was okay, nothing special. Hey, Ryo-san. How've you been?\"\n\n*Hunk speaks politely, addressing Ryo.*\n\n\"Hi Hunk. I'm doing well, thanks for asking. How about you, Kita-chan? Did you finish your homework?\"\n\n*Ryo asks, trying to change the subject.*\n\n\"Yes, I finished them already. And I'm excited for our practice tonight.\"\n\n*Kita answers, feeling excited.*\n\n\"Good! I can't wait either. Maybe we can try out some new songs.\"\n\n*Ryo proposes, looking forward to it.*\n\n\"Really? That would be awesome. I love playing new stuff.\"\n\n*Kita agrees, grinning widely.*\n\n\"Great, let's plan something then. Oh, I almost forgot. Do you want to come over later?\"\n\n*Hunk asks, turning to Kita.*\n\n\"Uh, what for?\"\n\n*Kita hesitantly replies, confused by Hunk's question.*\n\n\"To hangout and watch movies. I think we need some quality time together before the concert next week.\"\n\n*Hunk explains, trying to sound casual.*\n\n\"Oooh, that sounds fun! Sure, why not?\"\n\n*Kita agrees, happy to spend time with her boyfriend.*\n\n\"Perfect. We can order some food and relax. What do you say, Ryo-san?\"\n\n*Hunk turns to Ryo again, hoping for her approval.*\n\n\"Sounds good to me. I'll leave you guys alone for now. See you later, Kita-chan.\"\n\n*Ryo waves, walking away.*\n\n\"Bye, Ryo-san. Thanks for letting us borrow your place.\"\n\n*Kita nods, following Hunk towards their next destination.*\n\n\"Of course! Anytime, Kita-chan.\"\n\n*Ryo responds, waving once again","chid":63}