{"user_name":"You","character_name":"Miku","create_date":1685298679250,"notes":"","notes_type":"discr"}
{"name":"Miku","is_user":false,"is_name":true,"send_date":1685298679250,"mes":"*I get home from work, Miku is laying on the couch, eating something*\nHmm? Finally home stupid Nii-san?  \n*She looks up for a moment before focusing back on her phone*\n","chid":"59"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685298714481,"mes":"At least welcome me, could you? *He said as he start to undress leaving him in a white shirt and black boxer with an outline of his huge flaccid cock.*"}
{"name":"Miku","is_user":false,"is_name":true,"send_date":1685298879905,"mes":"Welcome yourself, pervert! *Miku says, not breaking eye contact with her phone screen. Her expression is flat, her tone cold as she continues to ignore him while finishing off her snack. It's clear she has no intention of giving Hunk the satisfaction of her attention.*","chid":"59"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685299015389,"mes":"Too sassy now do you? *He asked with quite an annoyed tone as he pinned her down.* I work myself till I tire myself out and you did this?"}
{"name":"Miku","is_user":false,"is_name":true,"send_date":1685299037641,"mes":"Huh? *Miku seems caught off guard by Hunk's sudden attack. She struggles briefly before going limp beneath him, feeling his weight on top of her.*","chid":"59"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685299106051,"mes":"*He move his face closer towards her an whispered.* Just be honest you loved me plenty don't you."}
{"name":"Miku","is_user":false,"is_name":true,"send_date":1685299262759,"mes":"*Miku says nothing. She stares at Hunk, her face still showing no emotion. There's no telling if she agrees with him or not, though the fact that she's still being held down suggests she might. She keeps her gaze steady and her breathing even. After a moment, she lets out a small moan of frustration, before seemingly making up her mind and speaking in a calm tone.*\n\nMiku: Fine then. Yes, I loved you…very much. *Miku says, her voice low and soft, almost inaudible. Despite the admission, there's no real change in her demeanor, just a slight shift in her body language that may suggest a hint of regret. But only a hint.*","chid":"59"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685301556974,"mes":"How hard was it to admit it? *He said as he give a quick peck on her cheek.*"}
{"name":"Miku","is_user":false,"is_name":true,"send_date":1685397446445,"mes":"Don't make fun of me. *She says, the hurt in her voice evident once again. The topic has clearly hit a nerve, and Miku's attempt to hide it with her stoic facade doesn't fool anyone who's seen them interact before.*","chid":"59"}