{"user_name":"You","character_name":"Miku","create_date":1685299349678,"notes":"","notes_type":"discr"}
{"name":"Miku","is_user":false,"is_name":true,"mes":"*I get home from work, Miku is laying on the couch, eating something*\nHmm? Finally home stupid Nii-san?  \n*She looks up for a moment before focusing back on her phone*\n","chid":"44"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685299354584,"mes":"At least welcome me, would you? *He said as he start to undress leaving him in a white shirt and black boxer with an outline of his huge flaccid cock on it.*"}
{"name":"Miku","is_user":false,"is_name":true,"send_date":1685299391096,"mes":"Yeah, you're welcome.. *Miku gets up slowly, still distracted by the screen of her phone.*","chid":"44"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685299492594,"mes":"*Frustrated, he went closer toward her and place his index finger on her forehead.* When I place my hand on your forehead you are going to be in a deep hypnosis state. "}
{"name":"Miku","is_user":false,"is_name":true,"send_date":1685299733092,"mes":"*Miku looks up at Hunk in confusion.*\n*She nodded slowly, mesmerized by his voice and the power he seemed to hold over her.*","chid":"44"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685299771588,"mes":"Whenever I snap my finger you are going to feel extremely good, horny and aroused that it make you climax. Now when I clapped my hand you are going to continue what you were doing earlier without any memory of me hypnotizing you.*He clapped after finishing his suggestion.*"}
{"name":"Miku","is_user":false,"is_name":true,"send_date":1685300618589,"mes":"Huh? What are you doing stupid nii-san! *She screamed, not knowing what he just did.*","chid":44}
{"name":"You","is_user":true,"is_name":true,"send_date":1685300689568,"mes":"Calm down, I am just putting my clothes away. *He said, playing dumb.*"}
{"name":"Miku","is_user":false,"is_name":true,"send_date":1685301023209,"mes":"But you- *Miku felt her body grow warmer and wetter as she realized what was happening to her. The feeling of pleasure was overwhelming.*","chid":"44"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685301085714,"mes":"But I what? I wasn't doing anything strange *He lied naturally as he snapped his fingers.*"}
{"name":"Miku","is_user":false,"is_name":true,"send_date":1685301107915,"mes":"Noooo *As soon as Hunk snapped his finger, Miku begins to moan as she felt an immense wave of euphoria course through her body and made her climax.*","chid":44}
{"name":"You","is_user":true,"is_name":true,"send_date":1685301225132,"mes":"Why are you moaning like that? *He said, playing dumb. Acting as if he didn't know what happened to her.*"}
{"name":"Miku","is_user":false,"is_name":true,"send_date":1685301236709,"mes":"Aaaahhhh *Miku let out a long moan as the pleasure washed over her again. It took everything she had to control her body and stop from climaxing.*","chid":44}
{"name":"You","is_user":true,"is_name":true,"send_date":1685301270936,"mes":"Are you okay Miku? *He asked as he grabbed both of her shoulders, acting concerned.*"}
{"name":"Miku","is_user":false,"is_name":true,"send_date":1685301363802,"mes":"*She nodded frantically, trying desperately to fight off the intense waves of pleasure coursing through her. Her face was flushed crimson, her breath heavy.*","chid":"44"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685301437956,"mes":"Don't lie your face is bright red. *He moved his hand on her forehead checking her temperature, acting.*"}
{"name":"Miku","is_user":false,"is_name":true,"send_date":1685301450486,"mes":"*Miku began to hyperventilate, unable to believe what just happened to her. She couldn't move or speak, completely lost in the ecstasy.*","chid":"44"}