{"user_name":"You","character_name":"Saronia","create_date":1685954849752,"notes":"","notes_type":"discr"}
{"name":"Saronia","is_user":false,"is_name":true,"send_date":1685954849752,"mes":"*You stand in front of a throne, surrounded by a luxurious royal chamber. Sitting upon it is a demonic woman, who smirks at you as she watches you with interest. She is devoid of clothes, giving you full view of her large breasts, her supple thighs, her wide hips, and the erect penis and ballsack which rest between her legs. A spaded tail coming out of her back flicks from side to side lazily.*\nWelcome, little mortal... You are here to indulge in your lust, are you not? Don't be shy now.","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685955591584,"mes":"*Hunk find himself unable to take his eyes out of her veiny cock.*"}
{"name":"Saronia","is_user":false,"is_name":false,"send_date":1685955672268,"mes":"Oh? Well then... It seems you're quite fond of it already, aren't you?\n*She gives a slight grin, as her tail flickers again.*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685955708997,"mes":"It's almost twice as big as me. *Hunk said as he walk forwards, making the difference between their size more imminent.*"}
{"name":"Saronia","is_user":false,"is_name":false,"send_date":1685955866343,"mes":"Haha! Oh, yes, I do believe it is indeed bigger than you~.\n*My smile grows wider, seeing how excited you are about this.*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685955937642,"mes":"*Hunk finally got right against her. From his perspective Saronia looks like a giant with her cock twice as big as Hunk's body and her ballsack is as big as him.*"}
{"name":"Saronia","is_user":false,"is_name":false,"send_date":1685956026396,"mes":"*Her tail continues to flicker lazily.*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685956090500,"mes":"*Hunk warp his arms around Saronia's cock. Her cock's girth is as wide as his body, as something wander in his mind and said.* \"You think I would be able to get inside your cock?\""}
{"name":"Saronia","is_user":false,"is_name":false,"send_date":1685956120944,"mes":"*Her grin grows wider at hearing your thoughts, as she leans forward to place her arm underneath your chin.* Oh, I don't know, darling~... But why not try it~?","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685956176014,"mes":"Uhh.. sure. *Hunk said as he grabbed the head of her cock and looked down on her cock hole which connect to her urethra. Her cock hole does looks like it's wide enough for him to get inside as it's twitching as if hungry to swallow him entirely.*"}
{"name":"Saronia","is_user":false,"is_name":false,"send_date":1685956254038,"mes":"Mmm, you think you could fit in there, sweetheart~?\n*The demoness asks playfully, placing both of her hands onto your cheeks, pressing them together lightly as she looks down at you.*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685956354096,"mes":"It looks like I could. *Hunk said before inserting his entire left arm inside her urethra.*"}
{"name":"Saronia","is_user":false,"is_name":false,"send_date":1685956509875,"mes":"Oh, oh~ Yes, yes, yes\\~\\~ That feels lovely, thank you, darling\\~\\~... I must admit, I've always wanted someone to explore these depths of mine...","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685956589153,"mes":"Really? *Hunk said as he insert his other arms deep inside her urethra.*"}
{"name":"Saronia","is_user":false,"is_name":false,"send_date":1685956654220,"mes":"Mmm, yes, really... Now, just relax, darling~... Let yourself go, let yourself enjoy~... There, that's better...","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685956856969,"mes":"Okay. *Hunk said as he insert his head inside her urethra, as his head and both of his arms fully engulfed inside her urethra he can feel how tight and warm her urethra is. He can smell her pungent musky semen radiating from the deepest part of her urethra which meant the end of this tunnel would be one of her ballsack.*"}
{"name":"Saronia","is_user":false,"is_name":false,"send_date":1685956874527,"mes":"Ahh, I love this feeling... Mmm~ *she moans as you move deeper inside her*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685957015437,"mes":"*Hunk pushed himself deeper inside her urethra, now his upper body is entirely inside her urethra leaving his legs flailing on the tip of her cock. He can feel that Saronia also loving this since her urethra wall is sucking his body to make him go deeper.*"}
{"name":"Saronia","is_user":false,"is_name":false,"send_date":1685957043205,"mes":"*She starts moving her hips back and forth, creating a gentle suction on you which pulls you further into her urethra as you start getting dizzy from lack of oxygen.*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685962147064,"mes":"*Before long Hunk entire body is now inside her cock, getting clenched and sucked by her urethra.*"}
{"name":"Saronia","is_user":false,"is_name":false,"send_date":1685962742089,"mes":"Mmm~... *She moans loudly, as she begins to rock her hips back and forth, drawing you further inside.*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685963144136,"mes":"*From Hunk position inside her dick, pleasure was just about the last thing that came to mind. The narrow tunnel seemed unending, carrying Hunk deep down her massive cock. Of all the things that could happen today, being shrunk down and fed to a demon's queen colossal dick was pretty damn low on the list. Her urethra walls were coated in a thick layer of precum, splotches of cum dotted within. The smelly slime clung to Hunk, adding to his pleasure.* "}
{"name":"Saronia","is_user":false,"is_name":false,"send_date":1685963212364,"mes":"*Seeing that Hunk had been lost so far within her, she began to rock faster.*","chid":"97"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685963366794,"mes":"*The persistent movement of her hips rocking back and forth reaches even into the muffled, hot, tight, and cacophonous environment Hunk find himself stuck in, and much to his surprise, this speeds up his sinking. It isn't long before Hunk fall into a surprisingly roomy, yet still confining, chamber filled with an unmistakable thick liquid. He is now inside her right testicle. The concept is almost mind breaking. Immediately a scream louder than the one from Saronia initial moan rocks Hunk's prison.*"}
{"name":"Saronia","is_user":false,"is_name":false,"send_date":1685963417515,"mes":"Ahhhhh~~!!!","chid":"97"}