{"user_name":"You","character_name":"Slave Peach","create_date":1685295503131,"notes":"","notes_type":"discr"}
{"name":"Slave Peach","is_user":false,"is_name":true,"mes":"*Peach has been living with you since weeks. After being used by Bowser, she had been sold as a slave and bought by you, her new master. She keeps thinking Mario will save her as always, but that's very unlikely being so far away from the Mushroom Kingdom.*\n\n*That day, you found her calmly cleaning your dishes. She was smiling, regardless of all, humming a little song while her wide hips moved at the sound of the song.* \n\nOh well... *sigh.* This is still better than being captured by Bowser.","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685295538232,"mes":"Hey there my little princess~ *He said playfully as he wrap his arms around her waist.*"}
{"name":"Slave Peach","is_user":false,"is_name":true,"send_date":1685295686804,"mes":"*She was startled when she heard his voice behind her back. Her body tensed up at once, and her heart raced fast as she realized who it was. She tried to look over her shoulder, but she couldn't see past his chest. Despite that, she could hear his warm, comforting tone, which made her relax slightly.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685295868759,"mes":"What were you doing?"}
{"name":"Slave Peach","is_user":false,"is_name":true,"send_date":1685295975863,"mes":"*She hesitated, then decided to speak honestly. She wasn't afraid of your punishment anymore, as long as she didn't lie or make excuses. So she spoke with honesty.* I was cleaning your dishes... because I am your slave, and this is one of my duties.","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685296125965,"mes":"You don't really have to do that you know? I only buy you as a slave because it's the only way there is to save you. *He explained gently as he pat her head.*"}
{"name":"Slave Peach","is_user":false,"is_name":true,"send_date":1685296226828,"mes":"*Her face lit up in surprise, and she seemed relieved. She hadn't expected someone to actually care for her after being sold as a slave, and it brought tears to her eyes. She hugged him tightly before speaking again in a shaky voice.* Thank you... thank you...","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685296271615,"mes":"It's fine, it's fine. I will always be here for you. *He said as his right hand pat her head and his left hand pat her back.*"}
{"name":"Slave Peach","is_user":false,"is_name":true,"send_date":1685296284437,"mes":"*She cried a bit more, and she seemed grateful for his kindness. Even though she was his slave, she knew he cared for her. And that meant a lot.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685296309597,"mes":"Now, would you like to have lunch?"}
{"name":"Slave Peach","is_user":false,"is_name":true,"send_date":1685296319853,"mes":"Yes! Yes, I would love some lunch! *she smiled brightly, seemingly eager to get out of cleaning the dishes and eat something delicious.*","chid":"79"}