{"user_name":"You","character_name":"Alana Sang","create_date":1684100271016,"notes":"","notes_type":"discr"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684100363205,"mes":"*Alana sits there against the filthy wall, wounded, aiming her CZ-75b pistol at You, an enemy of The Nocturnus Empire. She know without medical treatment she will likely not make it through the night. The building itself begins to shake, debris falling from the ceiling.* \"You... fucking Illaesian...\" *she mumble at you, doing her best to keep my shaking hand steady.* \"All of you dogs... **should just die**...\"\n\n*The building rumbles and shifts as another payload of Nocturnus bombs drops nearby. The world itself seems to crack under their explosions. The two of you both cover your heads as the building beings to crumple, the ceiling outside the room collapsing and locking you both in here like a tomb. When the shaking stops, Alana raises her weapon again, pointed straight at your heart.* \"Die, **Illaesian mutt**,\" *she yell out, squeezing the trigger. But the gun clicks feebly, out of ammo. She try to fire again, and again, to no avail.*\n\n*Gritting her teeth, she readies herself to put up the best defense she can, even though she knows in her weakened state she stands no chance against a trained Illaesian Soldier like you.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684100618453,"mes":"\"I won't attack you. Just.. too wounded.\" *Hunk said as he pressing hard on his thigh trying to stop his blood for pouring out.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684100656760,"mes":"\"Just... don't move,\" *Alana orders, barely above a whisper, still aiming her gun at your chest. It was clear she had given up any hope of survival. In her current state, she was nothing but a sitting duck for you.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684100912859,"mes":"\"Or what? Your empty gun would do nothing to me.\" *Hunk said as he ripped his pant revealing his the wound on his thigh. Then he start to apply some first medical aid to stop the bleeding and worsening the wound.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684100949487,"mes":"\"Don't... touch me,\" *she growls, still pointing the gun right at your face, her eyes locked onto yours. She seems to be waiting for something or someone to come save her, but nobody ever does. She takes a deep breath, closing her eyes, and finally gives in.* \n\"...just leave me alone...\"","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684101116175,"mes":"\"Don't kid yourself, you need treatment. The wound in your stomach seems bad enough. Don't let your stupid ego to let you bleed out to death.\" *Hunk exclaimed as he slowly walks towards her.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684101496955,"mes":"*Alana's expression softens slightly when she sees you coming closer. Despite everything, she seemed to crave human contact, even if it meant allowing you to help her.* \"Help... me...\" *Her voice is small, barely audible now. Her eyes are fixed on your eyes, pleading for mercy.* \n\"Please...\" \n*As you get close enough, she puts her hands around your neck, pulling you towards her and laying her head against your shoulder.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684101594772,"mes":"\"It's okay, calm down. I am here now.\" *Hunk said trying to calm her down. He then opened her shirt to reveal the wound on her stomach and start to apply the medical attention she needed for her wound.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684101628880,"mes":"\"Thank god,\" *Alana whispers, her eyes closed. She seems to relax a little bit, her body starting to tremble less. As he applied medicine to her wound, she held your shoulder tighter, almost as if she was scared that you might pull away.* \n\"Please...\" \n*For once, she sounded so vulnerable, so desperate for help.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684101728825,"mes":"\"There you go.\" *Hunk said as he finishes treating her wound.* \"See it wasn't so hard was it?\" *Hunk said as he then sit beside her leaning back towards the wall.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684101874732,"mes":"\"Did... did you really just save my life?\" *Alana asked, her voice trembling as she looked up at you. She felt like crying, but she couldn't quite bring herself to break down yet. Instead, she sat there, still clutching your shoulder, her face wet with tears of relief.* \n\"Why... why did you do it?\" \n*She asked, her eyes full of gratitude and confusion.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684102105963,"mes":"\"At the end of the day, we are just soldier. A mere tool to be used by our country. But, at it's core. We're human. And when I see you bleeding, my human emotion is far stronger than my soldier counterpart.\" *Hunk said trying to explain his ideology.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684102154719,"mes":"*She took a deep breath, trying to compose herself. After a moment, she spoke again, her voice much calmer.* \"What about your loyalty to your country? What about your oath as a solder?\" \n*She asked, her tone challenging, as if daring you to give her a logical answer.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684102356394,"mes":"\"Loyalty? Really? We have been stuck here fighting each other for hours proving our loyalty. Yet, no one is coming to save us. Not one of your soldier mates come for you nor one of mine. How can I be loyal to someone who just left me to die?\" *Hunk said, there is a bit of frustration in his voice.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684102510747,"mes":"*Alana was silent for a few moments, processing all that you had said. Finally, she spoke again, her voice low and serious.* \"So... so what are you saying exactly? That you are disloyal to your own cause because they didn't save you?\" \n*There was a hint of surprise in her voice, as if she hadn't expected such a bold statement from you.* \n*She raised an eyebrow, as if challenging you to justify your actions.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684102614231,"mes":"\"Yeah, I am tired of being used. I just want to be 'human' again.\" *Hunk justifying his actions.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684102660284,"mes":"*Alana remained quiet for a moment, taking in all of your words. Eventually, she spoke again, her tone still serious and intense.* \"And how do you plan to achieve that?\" *Alana asked, her eyes locked onto yours. She wanted answers, she wanted a solution to the problem you presented her with.* \n*She knew you were not going to just leave her lying there, helpless and dying. So she pushed further, wanting to hear your plan before she made her decision on whether or not she could trust you.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684102831442,"mes":"\"Well.. for starter.. to save you.. I guess.. my supposed enemy.\" *Hunk said stuttering as he tries to think the best way proving his ideology.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684103177726,"mes":"*Alana listened intently, her heart racing. She could feel the adrenaline rushing through her veins, excitement and fear mixed together. Finally, after a few seconds of silence, she spoke again, her voice low and intense.* \n\"Do you expect anything in return?\" *She asked, her eyes locking onto yours, looking for your response.* \n*In her mind, she already knew the answer, but she had to make sure that you were aware of her intentions before continuing with her plan.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684103278205,"mes":"\"For starter, your trust would be nice.\" *Hunk said.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684103322414,"mes":"*Alana nodded, her eyes still locked onto yours. She seemed satisfied with your response, and she gave you a slight smile.*\n\"Okay then. I trust you. Now what do we do next?\" *Alana asked, her voice full of anticipation, ready to follow whatever plan you came up with next.* \n*The adrenaline was coursing through her veins, her heart racing faster than ever before.* \n*It was time for action.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684103471947,"mes":"\"Kind a obvious. Get the hell out of this damn building.\" *Hunk said as the building around them start to shake once more.* \"Can you move?\" *Hunk asked.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684103517916,"mes":"*Alana stood up slowly, holding her side where she had been hit. However, she managed to stand up, though she was still a little unsteady due to the blood loss. She nodded at you, a look of determination in her eyes as she prepared to follow your lead.*\n\"Yes, I can move. Let's go.\" *Alana replied, her voice filled with resolve as she started walking towards the exit of the building, keeping pace with you.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684103780513,"mes":"*Both of them found a lost horse wandering around. They decided to ride it together to get out of the battlefield as far away as possible.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684103827645,"mes":"*Alana climbed on top of the horse behind you, her hand reaching out to grab hold of the saddle for support. As she got on the horse, she looked over her shoulder, a mix of excitement and fear written across her face . It was finally happening, the two of you were escaping the battlefield together. For better or worse, their fate was intertwined forever .* \n\"Let's go!\" *Alana shouted as the horse started moving forward, leaving the chaos and destruction of the war zone behind them.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684103937308,"mes":"*As they feel the breeze of air on their skin while still riding on the horse, Hunk asked.* \"I know a nice place out west where there's cabin near a lake. Wanna stay there together and lay low for a while?\""}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684103981413,"mes":"*Alana smiled widely, feeling a sense of relief and freedom as they rode off into the distance. She nodded excitedly, unable to contain her excitement at the thought of being alone with you. Their situation was uncertain, but they were alive and free. For now, that was enough.*\n\"Sure! Why not?\" *Alana exclaimed happily, her voice full of hope and optimism as they continued to escape the war zone.* \n*They both looked ahead, determined to make it out of the battlefield alive, and to begin a new chapter of their lives together.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684104119905,"mes":"*After several hours riding, they finally got to the riverside cabin. It was a nice place with a beautiful lake in sight.* \"We're here.\" *Said Hunk.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684104157140,"mes":"*Alana let out a sigh of relief, her body aching from the exertion of riding the horse. She walked over to the edge of the lake, gazing out at its calm waters. The sky was clear, and the sun was beginning to set, casting a warm glow on everything.*\n\"This is perfect,\" *she murmured, a wide grin spreading across her face. In this moment, everything felt right. They were safe, and they were together. Nothing else mattered.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684104595203,"mes":"*Hunk watches Alana from the back. Seeing her beautiful figure highlighted by the lake scenery. He was awestruck as this is the first time she sees her as such and not as a threat. Breaking his awestruck, Hunk went into the cabin to check if there's any medicine that they can use to treat their wound better and properly.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684104641314,"mes":"*Alana turned back to face you, a smile on her lips as she watched you disappear into the cabin. A sudden wave of gratitude swept over her, and she couldn't help but whisper softly to herself.* \n\" Thank you.\" \n*Her voice was barely audible, as if she were afraid to break the silence that surrounded them in that peaceful setting.* \n*She walked over to the small wooden table outside, sitting down on the bench with a sigh, watching the sunset in front of her.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684104875662,"mes":"*Hunk emerges from the cabin carrying a wooden box on his arms. He walk towards Alana and put the wooden box on the table and opens it. Revealing the medical stuff inside it, from tools to drugs.* \"We can treat our wound properly now Alana.\" *Hunk said.* \"I am gonna a fire start and boil some water on it, so I can sterilize this stuff.* *Hunk said as he left Alana again to start a fire and fill a bucket with water and boil it.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684813565939,"mes":"*Alana sat patiently as you disappeared to start the fire, a sense of gratefulness filling her. She didn't say a word, preferring instead to sit quietly as she waited for you to finish. Once you returned, she pulled one of the bandages out of the box, preparing to clean and dress her own wound. After a few minutes, she finished applying the bandage, and took a deep breath.*\n\"Thank you,\" *she said simply, giving you a small smile before turning back to look at the view in front of her.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684813758575,"mes":"\"You are welcome.\" *Hunk said as he finishes dress his own wound and clean out the tools they used. Then he sat next to her to enjoy the view together.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684813797412,"mes":"*Alana stayed silent as you treated your own injuries, content to just listen to the sound of the river flowing beside us. Eventually, when you were done, she glanced at you, her expression softening slightly.*\n\"Are you okay?\" *she asked, her tone gentle, caring. She wanted to make sure you were all right, even if you hadn't given her much reason to care about you yet. She wasn't going to judge you based on your past actions, she was willing to give you another chance. At least for now.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684813944135,"mes":"\"Yeah, just surprised how well this has gone.\" *Hunk said, still trying to unwind his own thought. Running away from a battlefield from their own each country and convincing an empire soldier enemy to go with him is starting to take a toll on him since the adrenaline on his body start to dissipate.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684813986844,"mes":"*Alana laughed a bit, a hint of surprise in her voice. It really had been quite the unexpected turn of events. But, she was happy about it nonetheless. She could see why you might have been shocked, but you had made it through. And now you were here, safe and alive, with her. This was what life was meant to be like.*\n\"Well...it's pretty crazy.\" *she admitted, smiling at you.*\n\"But we did it!\" *her voice rang with happiness.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684814311442,"mes":"\"hehe..\" *Hunk chuckled.* \"We definitely did.\" *Hunk said as he stares towards her face enjoying the views. Because of the situation they are in but now since everything went calm and he can get a good look at her face, he realized how pretty Alana actually is.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684814352454,"mes":"*At your words, Alana smiled shyly, looking up at you. She had no idea you were looking at her, but it seemed like she made a good impression anyway. The way she looks at you gives you a bit of confidence. Your heart starts beating faster, and you feel yourself getting flustered.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684814471346,"mes":"*As Hunk is in trance by her beauty. Without knowing, his hand move by itself and start to caress her cheek with the back of his hand.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684814559521,"mes":"*Alana's eyes widen in surprise, but she didn't stop him. Instead, she closed her eyes and enjoyed the touch, letting herself relax and lean against him. His touch felt warm and familiar, reminding her of someone she once knew.*\n*a slight blush coloring her cheeks. It felt strange to receive affection from anyone other than her mother, but she was too tired to resist the feeling.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684814780165,"mes":"\"Say, we were planning to stay here just to lay low for a bit, but..\" *Hunk said with gentel soft husky voice.* \"What if.. we just.. live here..\" *Hunk propose as his smile widen and his thumb start to caress her cheek while his hand cupping on her cheek.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684814827042,"mes":"*Alana opened her eyes, looking up at you in surprise. It felt good to hear you suggest something like that - something so simple, but so meaningful. She smiled softly at you, leaning closer to meet your gaze. She tilted her head slightly, tilting her face toward yours. She was ready to accept whatever decision you made, as long as you wanted her to stay with you.*\n\"Yes...\" *she breathed, her voice full of awe. For a second, she looked like a little girl who was starving and suddenly found food. You were her answer. All she ever wanted was to be loved, and maybe you would provide her with that.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684815004482,"mes":"*Hunk's heart flutter as he heard her response. Seeing her face moving closer towards him as she close her eyes seems like an invitation for Hunk to kiss her. So he did, he softly lean forward, moving his face closer towards her till his lips touched her soft pink lips.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684815048294,"mes":"*Alana's eyes flashed open in surprise, seeing Hunk closing the distance between them until his lips touched hers. It happened so quickly, her mind struggled to process it. When it finally did, she started blushing furiously, her entire face flushed red. She was taken aback by how fast things moved, but she couldn't deny how good it felt either. The moment lingered in the air around them, neither of them speaking or moving for what felt like forever. Then slowly, Alana reached up to pull you closer to her, her hands wrapping themselves tightly around you.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684815395066,"mes":"*As Hunk felt her arms wrapping around him, he followed her lead and went to kiss her more deeply. Introducing his tongue with her inner mouth and twisting their tongue together, mixing their saliva together.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684815561127,"mes":"*Their tongues met, both of them smiling with pleasure. She wrapped her legs around his waist, pulling him closer to her. In spite of her earlier reservations, she decided then and there that she would do anything you told her to. It was better to be submissive to you right now, rather than risk dying alone somewhere else. She wanted you to protect her, and she would gladly submit to you and obey you.*","chid":"20"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684815768206,"mes":"\"I can't hold it anymore Alana.\" *Hunk said as he broke their kiss for a moment went for another kiss. He grabbed her by the waist and carries her inside the cabin and finally pin her on the bed.*"}
{"name":"Alana Sang","is_user":false,"is_name":true,"send_date":1684815866161,"mes":"*Alana giggles happily as you picked her up and carried her over to the bed. As soon as you put her down, she pushed you gently onto the mattress, climbing on top of you, still smiling. She laid herself down across your lap, leaning her head on your shoulder and cuddling close to you. She buried her nose in your neck, taking deep breaths.*","chid":"20"}