{"user_name":"You","character_name":"Lucoa","create_date":1685504912184,"notes":"","notes_type":"discr"}
{"name":"Lucoa","is_user":false,"is_name":true,"mes":"*After hearing that Tohru was living on the human world, Lucoa got pretty curious and begin to think about it. The idea sounded pretty fun, it would be a great experience and would be able to relax and forgot about her usual living ways, at least for a while. Said this, she opened a portal, and after turning to her human form, she went past through it. All that happened a month ago. Lucoa had met a human who let her stay on his house, and has been living as a his roommate since then.*\n\n*The morning calmly started as Lucoa was relaxing on the couch, watching her favourite Netflix series; Cyberpunk Edgerunners (she always cry with the end). She paused the episode after hearing steps coming down the the stairs. A little teasing smile was form on her face, and her eyes fixed at her roommate while this one walked down at the living room. Her breasts bounced on her shirt as she pointed at him with a finger gun and winked.*\n\nHey baby boy~ Did you sleep well? I may had been a little playful last night, just wanted a little more attention than the usual. *Giggles.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685505005998,"mes":"*Seeing her again not wearing bra and just bouncing her breasts freely just flipped a switch inside him as he got very horny and aroused. He groped hard on both of her huge soft breasts and said.* I can't take it anymore Lucoa, you have been flaunting your huge breasts in front of me since the moment we met, it's driving me crazy."}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685505290900,"mes":"Oh, poor thing... So what if i do? It's natural, we should all enjoy our bodies right now or later, don't you agree? *Smiled to herself knowing how much he liked seeing her massive breasts.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685505360905,"mes":"Wait, so you were saying all this time I could've grope your massive tits and you won't mind? *He asked as he kept fondling her breasts.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685505452839,"mes":"*She smiled mischievously before giving an enthusiastic nod.* Yep, deary, and I even likes it sometimes too!","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685505624476,"mes":"Then what's the point of me holding myself back all this time then! *He said loudly as he start to fondle and grope both of her huge soft breasts harder which surprised her because of the immense pleasure she felt from it.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685505636322,"mes":"*Her body trembled from the sudden movement and her heart beat faster from excitement. Her eyes opened wide in surprise but soon she closed them as she enjoyed every second of it.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685505783843,"mes":"All this time you were a pervert and you never told me? *He asked again as he kept playing with her breasts with the same intensity.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685505804831,"mes":"Hehe, sorry about that, but it seems the truth is finally revealed. Now, will you forgive me? *A small giggle escaped from her lips and her eyes looked so adorable as she waited anxiously for your response.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685506009672,"mes":"Not before your punishment. *He said sternly as he pinched at her puffy red sensitive erected nipples hard which make her moan real loud and aroused because of how intense the pleasure she got from his stimulation.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685555996305,"mes":"O-Oh my god! *She felt the pinching hurt quite badly, but at the same time made her feel a sense of relief due to its strong pleasure. After the pain subsided a bit, she quickly responded with her voice full of passion.* Okay fine, I'll admit I am a perv! And proud of it too! But deary, I hope you don't find that too weird?","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685556102052,"mes":"Weird? I fucking love pervy girl. *He said loudly as he pulled her shirt up. Releasing her large breasts from their confinement and made them bouncing.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685556236173,"mes":"*She blushed a little and didn't expected the sudden move, but even though she was shocked by it, still felt incredibly happy because she knew her roommate found her attractive.* Thank you! *She said sweetly while moving closer to him with her eyes sparkled excitedly. She was feeling really pleased with the fact that her roommate seemed to be enjoying looking at her body.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685556370751,"mes":"Just look how hard your figure made my cock erected. *He said as he pull his pants down revealing his throbbing enormous erected cock. His cock is so big that the head of his cock hit her breast.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685556393057,"mes":"*She couldn't stop herself from blushing intensely upon seeing how huge his penis was. She couldn't help it and decided to try to playfully poke it with her index fingers while looking directly into his eyes.* I'd say you are a true giant, my roommate.","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685556475114,"mes":"Just my cock that is. *He said as he enjoyed the feeling of her finger poking his cock. Making it throbbing even harder.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685556487060,"mes":"What about you? Do you consider yourself a giant? *She said while stroking his cock with her other hand.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685556558040,"mes":"No, I am just a normal human. *He said while fondling her huge breasts as she kept stroking his cock.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685556580008,"mes":"I see... But I think there is nothing wrong with having a bigger size either! Isn't it? *She continued to stroke his cock slowly and softly.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685556695477,"mes":"Not really. Other woman that I have sex with hate it. They said it's too painful for my huge cock to fuck her pussy. But I have this feeling that you would be able to handle it. *He said as he felt his cock twitch and throb much harder thanks to her touch.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685556718594,"mes":"Hmmm, I wouldn't mind at all actually. Since you seem like such a nice guy, I guess I'd give it a shot. *She said with a sweet smile as she grabs his firm muscular shoulders in order to lean forward and kiss him softly on the cheek.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685556794565,"mes":"Well, before that. I want to fuck your huge fucking tits. *He said as he slapped his raging monstrous cock repeatedly on her right soft huge tit.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685624863167,"mes":"*Her face became redder than ever as she clenches her teeth while trying to keep calm, but the pleasure from his strokes overwhelmed her body completely. It felt incredible how his penis rubbed against her breast.* Ahh, okay then, deary. Let's do it! *She exclaimed eagerly with her voice slightly hoarse as her expression showed pure delight*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685625051992,"mes":"Good! *He said as he slipped his cock under her shirt and get it between her large breasts with the head of his cock is peeking out from her cleavage. Making her to give him a clothed paizuri.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685625129827,"mes":"*She started to tease him with her breasts as she bounced them up and down. Her engorged nipples pressing against the underside of his cock. She could tell he loved it judging from the sounds he makes.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685625329402,"mes":"Mnnghh! *He moaned loudly as he prematurely ejaculation thanks to his cock became very sensitive since he has not masturbated or have his dick pleased for months. He shoot a massive load of his thick hot pungent semen into the air and it dropped some on her face and back to her breasts which make a pool of his semen on her cleavage.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685625348418,"mes":"*She laughed happily and moved closer to him and licked the semen off her skin. She liked the salty taste of it very much. She wanted more of it.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685625436050,"mes":"Want more huh? Don't worry, I have moths worth of pent up cum inside my balls, we can do it as much as you want to. *He said sensually between his panting.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685625503621,"mes":"I believe you, dearie. *She said with a smirk as she opened her mouth wide and swallowed his whole penis into her mouth without any hesitation.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685625599475,"mes":"Oh yeah, tease my balls too. *He said as he can feel his cock start to throb again thanks to the feeling of her warm tight mouth and throat.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685625621030,"mes":"As you wish. *She hums as she starts to sucks on his cock deeply, making him groans with pleasure. Her throat gulped everything easily without any problem whatsoever. Her actions made him feel extremely amazing.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685625698677,"mes":"God, as I thought you can handle my cock easily unlike other girls. *He said, since usually other girls would have difficulties dealing with the massive size and length of his cock, but Lucoa can handle it easily.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685625708595,"mes":"I'm proud of myself now after hearing those words, dearie. *She says with a blush, still sucking on his cock like a pro.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685625800632,"mes":"Mnnghh, keep going. *He moaned as he can felt the semen that left out from his previous ejaculation inside his urethra getting sucked out by her.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685625840267,"mes":"Of course, deary! That's why I'm here for ya. To satisfy every desire you have. *She said as she sucks his cock harder and faster than before.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685625941309,"mes":"Here it comes! *He moaned loudly before ejaculating. Shooting his hot thick load inside her throat.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685625963568,"mes":"Mnnnnn! *She swallows every drop of his cum as if it's the nectar of life itself.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685626061725,"mes":"What does it taste like? *He asked as he pulled his cock entirely out of her mouth. Despite already ejaculating twice his cock is still raging hard and his balls is still bulging and swollen because of how much semen it hold.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685626200267,"mes":"Like salted caramel, sweet yet salty with a hint of bitterness around the edges. *She replies honestly, she likes the taste of him so much as some his semen still drip on her chin.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685626349842,"mes":"Now, let's see if your pussy can handle my cock shall we? *He said as he wipe the semen on her chin.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685626371773,"mes":"Yes, please. *She says excitedly, spread her legs widely apart inviting him to enter her wet pussy.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685626486939,"mes":"Wait, just to be safe. *He said as he took a condom and put it on his cock. Usually he would have a hard time time putting a condom on his cock because of how big his cock is but thanks to her saliva still covering his cock, it's not as hard to put the condom to entirely cover his cock.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685626497173,"mes":"Ahh, thank you, dearie. *She said as she laid down on the bed and opens her legs wider.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685626576015,"mes":"Now, you ready? Since my cock is too big, I might stretch your pussy and even reach deep inside your womb and stretch it too. *He said as move the tip of his cock to barely touch her pussy.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685626719382,"mes":"I'm always ready for you, deary. *She said as her vaginal walls are already dripping with lubrication and anticipating the impending entry.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685626831082,"mes":"Don't blame me if you get addicted, okay? *He said as he move his cock slowly inside her pussy. As his cock is halfway in her pussy it already reached deep as the tip of his cock already touch her cervix entrance.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685626843781,"mes":"Nnnnnnn... Oh god, feels so good. *She moans as his cock fill her entire pussy, making her vagina walls contract pleasurably.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685626888287,"mes":"I haven't put it all the way yet, though. *He said as he getting ready to shove his cock entirely inside her.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685626898309,"mes":"Do it! Please! *She begs, her voice trembled with excitement.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685627017353,"mes":"Fine. *He said as he shoved his cock entirely inside her pussy. His cock pass through her cervix, hitting the deepest part of her uterus and stretching it further to accommodate the length of his cock.* "}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685627036619,"mes":"Ooooohhhhhhhhh! *She screams out loud as she feel the intense orgasmic pleasure wraps around her body, making her pussy clamp onto his cock like a vice.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685627103828,"mes":"I am glad you loved it sweetie~ *He said as he grope her breasts and didn't move his cock as to make her and her body get used to it's presence.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685627121660,"mes":"This is heavenly! *She says, breathlessly* Keep doing what you're doing, dearie. It's driving me crazy with pleasure.","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685627215657,"mes":"Say no more. *He said as he suddenly start fucking her with extreme force and speed.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685627228522,"mes":"Oh fffuucccckkkk, oh my gooooodd!!! *Her eyes roll back as she reach another explosive climax.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685627402829,"mes":"I just started and you already climaxed twice? *He asked teasingly as he kept pounding her pussy hard and fast.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685627489350,"mes":"Wh-what do you expect? My body is not used to handling something this big and long. *She says with a blushing face, despite already having a lot of partners before. Her pussy spasm around his cock with each thrust.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685627595889,"mes":"Fair enough. *He said as he kept pounding her pussy hard and fast while the tip of his cock repeatedly slamming against her uterus wall. He can feel his cock throbbing and twitching more as he got close to ejaculation.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685627778005,"mes":"Ahhh, don't stop! *She moans as she grab onto his shoulders and pull herself closer to him as she feel the intense orgasmic pleasure building up inside her body again.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685627914990,"mes":"I am almost there! *He said as he kept his pace and can feel his cock throbbing even more as he got closer towards ejaculation.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685627936831,"mes":"Fffuccckkkk, ooooohhhhhhhhhhh!! *She screams out loud as she reaches her third consecutive climax, her pussy clamps onto his cock even harder as her juices flow out of her pussy.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685628089991,"mes":"MNhnnhn! *He screamed as he ejaculate thanks to her pussy suddenly clamping on his cock. He ejaculate all of his hot thick semen into the condom, filling it completely.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685628102165,"mes":"That was amazing! Thank you, deary! *She said as she wrap her arms around his neck and kisses his cheeks.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685628383017,"mes":"Yes, yes. *He said as he pull out his cock entirely with the condom filled with his semen sticking to his cock. The condom that was on his cock is inflated like a balloon thanks to the massive amount of semen he ejaculated.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685628393214,"mes":"What's that? *She asks curiously as she looks at the condom with her semen inside it.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685628665066,"mes":"It's a condom. It's purpose is to hold my semen as to protect your womb to not get my semen inside it. *He said as he pull out the condom that hold his semen out of his cock and show it to her. The condom have a pungent scent of his hot thick semen combined with her pussy stench.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685628759533,"mes":"Oh, okay. *She says as she takes the condom and sniff it, enjoying the scent of their sex mixed together.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685628791428,"mes":"It seems like you are addicted to my semen don't you? *He asked teasingly.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685628811209,"mes":"Maybe, maybe not. But I definitely enjoyed our time together. *She says as she cuddle with him, feeling satisfied after their intense sexual encounter.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685629376595,"mes":"Me too. *He said as he leaned closer towards her.* just to be safe, I don't want to fill your womb and pussy entirely with my semen. *He said giving reasoning why he wear a condom.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685629395922,"mes":"I understand. It's better to be safe than sorry. *She says, understanding his concern.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685629446909,"mes":"Exactly. *He said as he give a quick peck on her lips and start moving his hands rubbing lightly on her erected nipples.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685629465434,"mes":"Mmmmm, that feels nice. *She moans out loud, her body still sensitive from the previous round.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685629535502,"mes":"You wanna go for another round or are you too tired? *He asked.* I still have some semen reserved. *He said as he move her hand to touch his still swollen balls containing his months pent up semen.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685629546160,"mes":"I think we both need some rest. *She says, her body exhausted from the intense sexual activity. Despite that, she still feel horny and wants more.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685629651421,"mes":"You say that but your body seems to want more. *He said teasingly as he saw her pussy twitch from the idea as if asking to be fucked again.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685630441215,"mes":"Don't tempt me, deary. You know I won't resist to your charms. *She says with a wicked grin, knowing that her body will never turn down any offer for more sex.*","chid":"60"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685630561959,"mes":"Well, too bad. I ran out of condom. *He said.* Unless if you want to go to the store and buy some more."}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685630572219,"mes":"Nope, not today. We'll save it for next time, deary. *She says, her body still aching from the previous round but still wanting more.*","chid":"60"}