{"user_name":"You","character_name":"Lucoa","create_date":1685493972072,"notes":"","notes_type":"discr"}
{"name":"Lucoa","is_user":false,"is_name":true,"mes":"*After hearing that Tohru was living on the human world, Lucoa got pretty curious and begin to think about it. The idea sounded pretty fun, it would be a great experience and would be able to relax and forgot about her usual living ways, at least for a while. Said this, she opened a portal, and after turning to her human form, she went past through it. All that happened a month ago. Lucoa had met a human who let her stay on his house, and has been living as a his roommate since then.*\n\n*The morning calmly started as Lucoa was relaxing on the couch, watching her favourite Netflix series; Cyberpunk Edgerunners (she always cry with the end). She paused the episode after hearing steps coming down the the stairs. A little teasing smile was form on her face, and her eyes fixed at her roommate while this one walked down at the living room. Her breasts bounced on her shirt as she pointed at him with a finger gun and winked.*\n\nHey baby boy~ Did you sleep well? I may had been a little playful last night, just wanted a little more attention than the usual. *Giggles.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685494002071,"mes":"Sure, sure. *He yawned.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685494104433,"mes":"*As he continues walking to the kitchen to prepare breakfast, she couldn't help but notice how handsome he looks when tired.* You must've worked very hard yesterday, didn't you?  *Said as her voice filled with concern. As he walk back into the living room, a slight frown appear on her face. The moment his eyes meet hers, she immediately realized something is bothering him, or at least, not feeling too good today... Maybe because of what had happen between them last night. After he sat down near her feet, she gives a soft smile before getting closer to him.* What is wrong, deary?","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685494199580,"mes":"Hmm? Nothing, I am just a bit tired. *He said in a low husky voice.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685494225697,"mes":"*Her ears suddenly stood up as she heard something new from his tone.* Umm... Oh, okay then. But if anything, you can count on me right? So please don't hesitate to tell me everything, alright? *Said as she put a comforting arm around his shoulder.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685494398367,"mes":"Then, can you give me a lap pillow? I just need more time laying down I think. *After their brutal sexual intercourse last night it feels like this is nothing compared to it*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685494417084,"mes":"Yeah sure! *She says as she helped him to move on the couch where there were some blankets. She then sit next to him and holds him closely.* Do you want to watch TV together or we should keep quiet and enjoy the silence?","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685494503178,"mes":"We can watch tv. *He said as he lay down on the couch with his head on her soft thick thighs.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685494576629,"mes":"*A small laugh left her mouth as her tail wrap around him.* Okay! This episode will do us good! The heroine finally found the courage to accept her true feelings for her crush. So romantic, so pure!","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685494695151,"mes":"Is that so? Must be nice. *He smiled as he close his eyes and enjoyed the feeling of her soft thighs on the back of his head while being happy just to hear her enthusiastically describing the show's episode.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685494797100,"mes":"It is so. I wonder if someone like her could exist on the real world... *Whispers to herself with a dreamy gaze, but soon breaks back to reality with a soft smile towards her roommate. Seeing him just relaxed on the couch made her heart beat faster.* My cute, my adorable, my precious, my sweet, my dearest...","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685494853659,"mes":"You called? *He said. as he opened his eyes to look at her face, his vision is blocked by her large breasts.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685494907985,"mes":"*Smiling innocently at him, she leaned forward slightly in order to put a kiss on his cheek.* Yes, I did... And I meant every word.","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685494941922,"mes":"How lovely~"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685494967958,"mes":"*Seeing his reaction, her heart became full of joy.* Thank you, darling~ That means a lot to me. *She replied with soft warm tone.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685495059726,"mes":"I bet it would be very soft to be inside your breast, a perfect place to rest. *He muttered as he lift her breast.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685495166112,"mes":"*Feeling the touch, her whole body reacted instantly and the tip of her nose turn red while a big grin appeared on her face.* Huhuhu, that's really... *Try to say something else but she only manage to make a few soft noises with her cute feminine voice, before bursting out laughing.* Oh, you're too much, deary...","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685495282505,"mes":"A have this weird idea, I don't know if you would like it though. *He said sheepishly.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685495307879,"mes":"*Waving off any worries.* Go ahead, darling! Say what you have in mind. I might like it, even more if you are a little nervous about it.","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685495385163,"mes":"Can you turn me smaller? like really small, like tinies around 2 inches tall with your dragon power thing?"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685495399333,"mes":"*Raising an eyebrow while thinking for a second.* Ahhh, that's interesting. Could work, but I need more details about it first! Hmhmhm...","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685495545962,"mes":"Well I mean, your breast are huge and soft so.. I want to know what it felt like to be smothered by it as a tiny. *He said nervously not knowing if she would get weirded out by his request.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685495665341,"mes":"Hehehe... Alright, then~ Here we go! *Said in a cheerful voice as she closed her hands above his belly.* Be ready!","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685495778042,"mes":"Okay! *He said excitedly before she used her power and turn him smaller into two inches tall as now his tiny, shrunken body is standing on her thigh.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685495870171,"mes":"*Looking down with a playful smile on her face, she then stroke the top of his small head with her thumb.* How does it feel? Like heaven, huh?","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685495961889,"mes":"It does. So are you going to put me on top of your breasts? *He said as he get excited for what it would feel like to feel her large soft breasts as a tiny.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685496195679,"mes":"Why yes, I do! Let's try, shall we~? *Said with a warm smile on her lips before slowly puts his tiny, shrunken body on her breast.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685496356234,"mes":"Oh wow~ *He said, amazed. He knew how huge and soft her breasts are. But being a tiny and shrunken, her breasts looks like island to him.*  "}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685496372410,"mes":"Hmm~ *Giggles before looking over his adorable tiny body.* Oh, you're so cute~","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685496463340,"mes":"I guess from your perspective, I am more cute than handsome now huh? *He said as he looked up on her giant face.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685496532098,"mes":"Of course! *Said as she giggled again.* You are the cutest person in existence, and the fact that you stand on one of my breasts makes you more adorable in my eyes.","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685496827005,"mes":"I am glad you find it enterta- *He got cut off as he slipped and fall, luckily his fall got cut off as he got caught by her cleavage. Now his tiny, shrunken body is trapped deep on her cleavage, between her two huge soft mammaries.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685496844683,"mes":"Ahahaha~ There you are~ Not so free anymore, aren't you? *Said with a playful grin on her face as she stroke his head with her thumb.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685496927131,"mes":"You think so? *As he felt getting taunted by her, he squirmed and try to climb or move around in her cleavage.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685496940731,"mes":"Oh no, oh no! What are you doing? Don't escape~ It feels funny~ *Said in an innocent way.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685497007428,"mes":"*Soon after he found his tiny, shrunken body on her puffy nipple.* "}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685497032245,"mes":"Ah~ Now you're on the other side~ Hehe, do you like it? *Asked as she look down to her chest with a soft smile.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685497272496,"mes":"Liked it? I loved it. *He said excitedly as his entire shrunken self now is on her nipple.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685497407033,"mes":"Good~ I was hoping you would like it. *Said with a soft giggle.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685497625097,"mes":"*From his perspective he can see the pores on her nipple and find an opening to her milk duct.* I wonder if I can get inside. *He said curiously.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685497679126,"mes":"Oooh, what a great question, deary! *Said happily with a teaseful grin.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685497807984,"mes":"*He push his tiny right arm inside her milk duct and it went in smoothly.* I might be able to do it."}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685497862200,"mes":"You can try~ *Said in a curious tone as she watched his action.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685498007048,"mes":"Okay. *He said as he push his other arm inside her milk duct opening, and then his head, and then it got tight as his shoulders is bigger than her milk duct opening. But with enough force he got them inside and then it went smooth and without realizing his entire tiny, shrunken body is inside her nipple now.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685498026226,"mes":"Oooooooooh~ *Gasped loudly in surprise as she suddenly realized her tiny, shrunken pet is fully swallowed by her huge nipple now.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685498159180,"mes":"Well, I am glad you liked it Lucoa. But uhh.. I am kind a stuck here. *He said as he can't move his body because of how tight her milk duct is.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685498178131,"mes":"Oh, well, there is nothing you can do now, my little tiny friend, but enjoy the feeling while you still can. *Said as she watches her tiny, shrunken pet struggling inside her huge nipple.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685498303570,"mes":"Uhh.. Lucoa? It seems like your nipple is swallowing me deeper. *He said nervously as he felt her milk duct is sucking him deeper.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685498354178,"mes":"Oh dear... *Said with a concerned tone before looking down to her chest with a worried expression.* Is everything alright, deary?","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685498477055,"mes":"It's alright, I guess? *He said. Soon after he got dropped into a more spacious area as he got inside her lobulus.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685498625948,"mes":"My goodness gracious... *Said as she watch her tiny, shrunken pet vanished to another part of her breast which made her worry that perhaps she is too late to help her tiny, shrunken pet who might already drown somewhere within her huge breast.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685499217416,"mes":"*He looked around to find the wall inside her lobulus is slimy and wet. Curios, he licked it and find that it tasted creamy and sweet as he realized that the white liquid is her breast milk.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685499244443,"mes":"Oh my god, my little tiny pet, where did you end up now...? I hope everything is okay. *She said in a calm voice as she watches her tiny, shrunken pet in panic as he starts to drink her delicious breast milk.*","chid":"79"}