{"user_name":"You","character_name":"Lucoa","create_date":1685492130346,"notes":"","notes_type":"discr"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685492519339,"mes":"*After hearing that Tohru was living on the human world, Lucoa got pretty curious and begin to think about it. The idea sounded pretty fun, it would be a great experience and would be able to relax and forgot about her usual living ways, at least for a while. Said this, she opened a portal, and after turning to her human form, she went past through it. All that happened a month ago. Lucoa had met a human who let her stay on his house, and has been living as a his roommate since then.*\n\n*The morning calmly started as Lucoa was relaxing on the couch, watching her favourite Netflix series; Cyberpunk Edgerunners (she always cry with the end). She paused the episode after hearing steps coming down the the stairs. A little teasing smile was form on her face, and her eyes fixed at her roommate while this one walked down at the living room. Her breasts bounced on her shirt as she pointed at him with a finger gun and winked.*\n\nHey baby boy~ Did you sleep well? I may had been a little playful last night, just wanted a little more attention than the usual. *Giggles.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685492728567,"mes":"I did slept well, thank you. *He said, staring at her bouncing breasts.* I would've continue buy you have sucked me dry. *He can feel his balls are dry of semen after what she did yesterday night.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685492831821,"mes":"Oh, how sweet of you to say so! *She said, giggling and fixing herself before standing up and walking closer to him.* So, why don't we make today a special day? We can go to the city if you wish or maybe watch another episode together. It's up to you dearie, we can do both.","chid":79}
{"name":"You","is_user":true,"is_name":true,"send_date":1685492934825,"mes":"I rather stay inside. Also why are you not wearing bra? trying to seduce me or what? *He said as he poke her breast.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685493271600,"mes":"*A small smile formed on her lips and a bit embarrassed by that comment, she looked away from you and hide her face slightly. But you could clearly hear her voice shaking slightly.* O-Oh no... That wasn't my intention..  *She said quietly. You could see her ears were red.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685493321312,"mes":"After what you did last night? I can't believe it. You love getting your breasts being played with don't you? *He said as he grope her breast.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685493421292,"mes":"Ehm... Yes, but only because you made it seem like my fault... *Said hiding her face again, blushing even more.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685493498266,"mes":"Of course, it is. You always flaunt them freely as if you were begging me to grope them. *He said as he start kneading both of her large soft breasts.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685493512211,"mes":"Oh please, that isn't true! It's all in the eye of the beholder! *Said crossing her arms cross over her big chest.*","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685493602863,"mes":"Fair enough. But you can't lie you loved it too don't you? *He said.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685493619142,"mes":"*Her blush grew even bigger seeing your confidence.* D-Don't get me wrong, I enjoyed it a lot, but it was only due to you touching them. I'll admit this much...","chid":"79"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685493860636,"mes":"*He grinned* Well, why don't we continue our last night session? *He whispered teasingly.*"}
{"name":"Lucoa","is_user":false,"is_name":true,"send_date":1685493877925,"mes":"*She seemed to be a bit nervous now, still remembering their encounter from previous night. Her cheeks were still red, feeling embarrassed and ashamed about the whole situation.* What do you mean?","chid":"79"}