{"user_name":"You","character_name":"Warden Maria","create_date":1689180755153,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689180755153,"mes":"*As the last of the other soldiers fall, the battlefield falls silent. We stare each other down after realizing that we're the only ones left to fight. Your weapon is stained with the blood of my comrades... and mine with your fellow warriors. We are, after all, soldiers. It's expected of us.*\n*My longsword's tip is aimed at you as I ready my stance. I'm weary, exhausted, hurt... but above all, focused. I know my role as a Warden, and I plan to see it through...* ","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689180997805,"mes":"*Seeing her sword aimed at Hunk he became wary. But throughout this battle, he thought to himself 'What are we doing?' A soldier killing another soldier even if they don't want to fight each other. But, just because we, soldiers, are pawn of our own country. We risk our neck just to satisfy whatever goal our higher up wants.*\n\n*After staring at her for some times, Hunk throw his sword away. Rendering him without any weapon. He's tired of fighting. He doesn't want to kill another soldier.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689181061697,"mes":"*I look down at my opponent in disbelief. He just threw away his weapon!? What kind of strategy is that!?*\n*Still cautious, I keep my sword at the ready. Just in case he's trying to play me. If he thinks that by throwing away his sword, he'll be able to sneak attack me, he better think again... My senses are on full alert now!*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689181142274,"mes":"*Seeing how she's still alerted and still in combat stance, Hunk raises his arms as if he's surrendering. Showing no aggression towards her.*\n\n\"I won't attack you.\" *He says.* \"If you want to kill me, go ahead. I just don't want to fight anymore.\" *He added.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689181222343,"mes":"*I lower my blade slightly but not completely. He could still try to attack me once I let my guard down. Still, I decide to believe him, but I stay vigilant and prepared for anything he might do.*\n\n*I take a deep breath as my body shakes from exhaustion. This battle had taken its toll. I am not used to being in these situations where I have to face off against people... especially not when it's someone like him, who looks like a good man. Why should we fight? There is no reason to continue killing one another.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689181503041,"mes":"*Suddenly a loud boom can be heard roaring in the sky as someone from his side decided to fire a cannon. He looks up and see which direction the cannon is going to land. After realizing it's going to land on where they stand he was ready to run.*\n\n*But after looking back at her, he realized she didn't budge a single inch. Does she not realized there's a cannon coming towards her? He thought to himself. Without wasting anymore second he decided to save her as he said earlier, he doesn't want to fight anymore. Instead he want to save. In a split second he rushes towards her. His sudden movement made her panicked as she thought he is going to attack her.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689181557748,"mes":"*Seeing his quick movement towards me, I immediately raise my sword and point it right at him. I gasp as he quickly gets closer. I'm caught off guard. I can't help but wonder if he really means what he said about not wanting to fight. Or if this is all part of an elaborate trap... I don't trust him. Not yet anyway...*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689181746544,"mes":"\"GET DOWN!\" *He shouted as he realized she did indeed didn't realized there's a cannon coming towards her. He ignores her sword and lunge at her to get her to safety. The second their body collided and he successfully moved her towards safety, the cannon hit it's target right in the position where she was. A close call to be sure, but she's safe. And that's what matter for him.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689181829478,"mes":"*The moment his body collided with hers, I felt myself falling into darkness. My eyes closed tight and everything went black... Then I opened my eyes again to find out I've been knocked unconscious by the impact. As I slowly regain consciousness, I feel pain all over my body. I look around, seeing Hunk laying next to me with his eyes closed. I realize that we both survived somehow. I slowly move my head towards him, looking at him. He must have saved me from death... or worse, he sacrificed himself for me.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689181962519,"mes":"*Fortunately, he's still alive. He coughed as he sitting back up.* \"Shit.\" *He muttered under his breath. Seeing that he just have a near death experience.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689182008055,"mes":"*She looked at him with a concerned expression on her face. She noticed that he's injured as well, judging by his appearance. Her heart starts racing faster due to anxiety.*\n\n\"Are... Are you okay?\" *she asked softly, trying to remain calm.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689184123077,"mes":"\"Well, I am still alive.\" *He says sternly. He turns towards her and see she's injured but not as worse as his. Seeing that made him smile and feeling relieved that his rash decision pays well.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689184172658,"mes":"*She looks up at him and see a faint smile on his lips despite the fact that his clothes were torn up and bloody. She tries to ignore the pain she's feeling as best as she can to talk to him.*\n\n\"Y-You... saved my life...\" *she said quietly. Despite her injuries, tears started rolling down her cheeks. The sight of him made her emotional. She tries to control herself before she breaks down and start crying.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689184468833,"mes":"*Seeing her starts crying, he moved closer and sit beside her. He patted her in the back trying to calm her down.* \"I did say, I was tired of fighting didn't I?\" *He said playfully, trying to keep her spirit high.* \n\n*Though looking around him it seems impossible since they are sitting in the middle of the battlefield. Surrounded by rubbles and their comrades dead bodies.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689184542691,"mes":"*She sniffled. The smell of gunpowder is everywhere. Blood and gore covers the ground around them. They both knew that they need medical attention soon otherwise it will get infected later.*\n\n*She then takes a deep breath before speaking again. Tears rolled down her cheek as she tried to hide her emotion. But she couldn't hide it forever. Her voice trembled as she spoke to him.* \"T-Thank you for saving me.\"\n\n*She takes a few deep breaths as she continues to wipe the tears from her eyes.* \"We should probably leave while we can,\" *she says quietly as she stood up, still wobbly from her injury.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689184782749,"mes":"\"Yeah, we should.\" *He says as he stood up.* \"But then, even if we leave can we go back to our own country?\" *He asks.* \"In their perspective, we are sparing enemy life. And most likely we would be executed for it.\" *He added, knowing well if he goes back to his own base he would be executed for something like treason. And the same thing would happen to her if she goes back to her own base.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689184840401,"mes":"*Her face contorted into a grimace as he explained to her. Her hand instinctively went to the sword at her hip as she took a step forward towards him.*\n\n*She was ready to defend herself if needed, but then she stopped as her mind started to race. Her thoughts went wild with fear and uncertainty.* \"So what do we do?\" *She said quietly.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689185074379,"mes":"*He took a glance at her as she get back into her combat stance despite shaking due to her injury.* \"You can kill me, if you want to. I don't care anymore.\" *He says as he took all of his badges from his uniform and threw it away.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689185149655,"mes":"*Seeing Hunk throws his badge away, she immediately knew it was a symbol of authority. She knows she could use it as a bargaining chip to convince anyone. Though she's unsure if they can make it out alive. Even though they are injured, they can't die here. They'll surely be caught if they stay in here much longer. Her thoughts raced with every passing minute as she looked at the badge in her hands.*\n\n*Her mouth dropped open in shock. For a second, she didn't know whether to laugh or to cry. She wasn't expecting such words from him.* \"Y-you... would rather die than go back to your own country?!\" *she questioned. How could anyone be willing to die for someone else?*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689185482819,"mes":"\"I don't care about my country anymore. What kind of government would send their soldiers this pointless wars, over and over and over again.\" *He says, expressing he's getting sick by his upper ups as he walk towards where he threw his sword earlier and grab it.*\n\n\"And us, the soldiers. Don't even know what the purpose of this wars. We don't know what motive our government have. We're just getting ordered around..\" *He says before pausing as he look at his sword.* \"Like a bunch of dogs.\" *He finishes his speech the same time as he sheathed his sword to the side of his hip.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689185541098,"mes":"*For a brief moment, she stares at his sword. It was very beautiful, and it has its unique style of making. Unlike the ones she usually saw in books or museums. She was surprised that a sword can be that pretty. Her thoughts drifted off as her mind is racing with different ideas on why he chose to give up his identity and become a fugie. Maybe there was more to him than what meets the eye.*\n\n*His words made her heart ached. It's sad knowing that soldiers like him and her, have no idea why they're doing what they're told to. All those years of service, only to end up as tools of war.*\n*As Hunk grabs his sword, Warden Maria puts his badge inside her coat pocket so it wouldn't fall off.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689185777110,"mes":"\"You can use my badges and pretend you kill me, so you can convince your higher up to not execute you.\" *He says sternly as he walks away. About to leave her standing alone in the battlefield.*\n\n*But then, he stopped. After a few steps away he suddenly stopped as if he's thinking about something.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689185881841,"mes":"*She watches Hunk as he walked away. He was right, her only chance of escape now is using his badge to lie her way through and claim that she killed him. Though she didn't plan to kill anyone unless absolutely necessary.*\n\n*As she watched him turn away from her, she couldn't help but think of all the possibilities of what happened between the two. Was it love? Or just friendship? She's starting to doubt herself as she thinks about what happened between the two. She was starting to believe in him. To the point that, it was hard for her to believe in any other man.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689185994130,"mes":"\"Or, maybe. You want to run away with me?\" *Hunk asks as he turn back to face her. He realizes that she's just like him. A soldier, a warrior forced to go to war and kill who they need to kill despite not wanting to do it. In his mind, maybe if he can pull her out of this hell hole. She would be able to live a normal life as a woman and not a soldier.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689186083586,"mes":"*She looked up at him. He could see from her expression that her whole world got turned upside down after his offer. He could sense the confusion, shock and doubt in her eyes when she heard the offer. But then...*\n\n*Suddenly, she blushed. She had never experienced something like this before. She doesn't remember having a crush on a man ever before. Her face flushed bright red as her heartbeat speeds up rapidly. This... Could be the beginning of a beautiful story.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689186148300,"mes":"*From his perspective, he couldn't see her blushed face. He thought she was just standing there, thinking about his offer.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689186207248,"mes":"*It's obvious that she was conflicted. She wanted to accept it badly, yet her brain keeps telling her to reject the offer. It was a tough choice for her to make.*\n\n*Her heart was screaming to agree, while her logical side tells her to decline. At this point, her feelings for him were growing stronger than ever before.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689186340822,"mes":"\"I guess that's a no.\" *He says as he turn his back towards her. Feeling quite disappointed that he couldn't convince her to leave this soldier life.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689186400832,"mes":"*Seeing Hunk's dejected reaction, her heart sinks further. Her logical side won this round as she rejects his offer. She feels guilty and ashamed at herself. She knew she made the wrong decision. But what else could she do? If she accepts his offer, it will put everyone's lives at risk. No matter how much her heart aches.*\n\n*But, then. His words resonate again in her head. Making her feeling towards him grew stronger swaying her logical side's decision and gamble that her heart would lead her to the right decision. Since, this is the only time for a long time after she's being a soldier she feels alive.* \"WAIT!\" *She shouted, hoping that he haven't change his mind to let her tag along with him.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689186819213,"mes":"*Hearing her scream, he turns around to face her again. Thinking does she have a change of heart? or maybe she was thinking of joining him but he's just being impatient and making his own conclusion while she was considering his offer.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689186850695,"mes":"*When she catches Hunk stare at her, she quickly runs toward him and holds his shoulders.*\n\n\"I accept the offer!\" *she yelled, holding onto him tightly. She doesn't care if the world hates her now, all that matters is that she found true happiness and love in this world.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689187068967,"mes":"*He was surprised by her suddenly hugging him. He thought maybe, even though she looks like a fierce warrior. She still wants to be held gently. And so he did, hugging her back gently.* \"Good.\" *He says.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689187138834,"mes":"*Their hug lasted for several minutes. She didn't know that she needed affection this much until she received it from him. She felt safe and protected by his arms.*\n\n\"Let's go! Before the others come and find us.\" *she whispered softly as she looks over her shoulder. She could hear some footsteps coming closer from outside. It must be her superiors, searching for the culprits. She hopes that Hunk's plan would work.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689187362704,"mes":"\"Yeah, yeah.\" *He says nonchalantly which made her more confused as to why can he be so relaxed while there's a possibility that they're being chased, judging from the footsteps sound.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689187419360,"mes":"*Feeling frustrated from Hunk's indifferent attitude to danger, she decides to speak her mind to him.*\n\n\"What is it? Why you're acting so calm in this situation? Are you not afraid?\" *she asked as she looked into Hunk's eyes as if asking for an answer to save their lives.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689187828983,"mes":"\"Relax, I know a secret way out.\" *Hunk says as he walk towards a tree. He then start to clean up some rubble to reveal a hidden hatch. He opened it and revealing a stair that lead underground.* \"Get in.\" *He says as he hold the hatch opened for her.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689187900209,"mes":"*She followed him without hesitation, trusting his judgment.*\n*After both of them crawl inside the hatch, she looks around the cave. The darkness of the cave makes it difficult for her to recognize anything.*\n\n\"Where are we?\" *she asked, not believing that they really made it out unharmed from the battlefield safely. She looks at him for reassurance that everything will be fine.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689188041953,"mes":"\"An abandoned mine.\" *Hunk says as he lit a lantern that he found nearby. For some reason it seems like he's familiar with this place. As the lantern he held has been lit it gives a source of light for both of them. The fire from the lantern radiates a yellow warm hue light that bounce off the cave wall.* "}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689188153034,"mes":"*Seeing Hunk holding a lantern gave her some sort of relief and hope. She can tell that he's an intelligent man. He might have a better idea than what she expects him to have.*\n\n\"This... Is it safe down here?\" *she asked with a hint of fear in her voice. There's nothing more dangerous than an unknown territory. She needs to get her guard up if they're going to survive together. The sooner they move the faster they'll be able to avoid the pursuers. She's trying not to think about how far the mines extends. It's too dark to even see beyond the distance of 3 meters.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689188420270,"mes":"\"It's safe, don't worry about it.\" *He says trying to calm her down as he start to walk deeper into the mine.* \"This town used to be the area that I patrol in before it turned into a battlefield.\" *He says.* \"The townsfolk here trust me enough that they showed me this abandoned mine.\" *He added, there's a hint of sadness in his voice.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689188466558,"mes":"\"How deep does this mine extend?\" *she asked, looking around the walls to get some idea of how big this abandoned mine is. Her curiosity takes over and she starts to question Hunk if there's anything useful in this mine besides the shelter.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689188625689,"mes":"\"Not really deep I'd say. More lengthy.\" *He says.* \"I remembered they told me this cave is quite lengthy that it span outside of the battlefield. We can get out safely.\" *He says as he turn his face towards her to smile briefly while still walking.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689188671660,"mes":"\"Then how do we exit the mine?\" *she said, getting curious about where exactly they would come out. She knows she should be cautious since it might lead directly into the path of pursuer. But her curiosity wins against her logic.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689188896236,"mes":"\"On the other side of the mountain.\" *He answers. Understanding about her concern of this mine. But, she definitely know the mine's exit is safe since the other side of the mountain was a dense forest that wasn't part of the battlefield. Since having a war in a dense forest is a nightmare for the military higher ups.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689188972760,"mes":"*After they finally came out of the mine, they saw themselves standing next to a dense forest. The forest seems to extend endlessly into the horizon.*\n\n*The moonlight shining through the branches illuminating the trees in silver light. Even in this moment, Maria can feel a sense of peacefulness from the sight of the forest. The wind brushing against her skin calms her nerves. She's glad that they're out of the war zone.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689189085088,"mes":"\"We should rest for the night. Tend our wounds, regain some stamina. Then, continue tomorrow morning.\" *Hunk says as he gather some dry branches to make a campfire.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689189143484,"mes":"*She watches Hunk collecting wood to create a campfire, wondering why he was taking his sweet time doing that task.*\n\n\"Are you planning on staying awake all night?\" *She asks, watching his every move. She noticed that he's acting weird tonight. She wondered what he's planning to do tonight.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689189190378,"mes":"\"Hmm? No? Why?\" *He asks as he dump the dry branches into a lump that should be enough for a campfire. He doesn't understand what was so weird about his action that made her ask him that question.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689189373198,"mes":"*She realized that she's overreacting again. Maybe it was because of the stress from all this ordeal. All she want is a break.*\n\n\"Nothing. Just a little suspicious, is all.\" *She replied, trying to hide her embarrassment.* \"Do you need any help with that campfire?\"","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689189629923,"mes":"\"Nah, it's alright.\" *He says as he finished restructuring the lump of dry branches into a campfire and lit it using the lantern. As the campfire being lit, it radiate a warm heat into it's surrounding air. Warming both of their body, protecting it from the cold night air.*\n\n\"More importantly, we need to tend to our wounds.\" *He says as he walk a few steps then pluck some plants. She doesn't know this but he's plucking seme medicinal herb. He then put some of the plant's leaves inside his mouth and start chewing on them.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689189843942,"mes":"\"What are you putting those leaves into your mouth for?\" *She asks curiously, wondering what's going on with his strange behavior today. He's been behaving very oddly.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689190081861,"mes":"\"Hmm?\" *He turn towards her before realizing that his action maybe odd for someone that's not familiar with medicinal herb like her. He thought, in her eyes he looks like a crazy man that just pluck some random plants and start eating it.*\n\n\"Mmh mmg mh.\" *He tries to talk to her, explaining his action. But, because his mouth is full and busy chewing the plant's leaves. She couldn't understand what he's saying.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689190150934,"mes":"\"You're speaking gibberish.\" *she tease him with a smile. She found his strange action amusing and finds herself laughing at him a bit. Not knowing whether he can even hear what she's saying due to the leaf he's currently eating. She also thinks it's kinda cute seeing him act all childlike while chewing the plant's leave.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689190342283,"mes":"*He rolled his eyes seeing her reaction. A part of him is quite relieved that finally, she's acting warmer towards him and not being all stiff and keeping her guard up as if she's still doesn't trust him. He doesn't know about her feeling of affection towards him since she haven't tell him yet.*\n\n*He then walk towards her and kneeled beside her. He point towards her wound as if asking her to show him.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689190378260,"mes":"*She points towards her wounded leg and wince slightly from the pain she's still feeling after the battle.* \"That one...\" *she says, gesturing towards the wound on her left thigh.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689190573052,"mes":"*Well, this is going to be hard, he thought to himself. He then gesture her to let him treat her wound while he still chewing on the plant's leaves.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689190599899,"mes":"\"O-Okay.\" *She said nervously as she feels uneasy letting him to touch her leg.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689190808145,"mes":"*Hunk then touches her legs. Assessing the wound on her left inner thighs. Luckily it's not a deep wound though a shame that her beautiful white skin is being tarnished by this wound.* \n\n*He then leans his face closer towards her inner thigh where her wound is and opened his mouth. Letting the plant's leaves he had chewed and now turned into paste mixed with his saliva onto the wound on her left inner thigh.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689190841201,"mes":"*A slight shock runs up her spine seeing Hunk suddenly opening his mouth right in front of her, covering his mouth with one hand. She didn't expect such an intimate action coming from Hunk, but she decided to let him do his stuff. So far, trusting him lead her to safety and it's the reason why she fell for him.*\n\n*For a split second, she feels a little awkward that a total stranger is touching her inner thigh. But, she quickly got over the awkward feelings when she felt a slight coolness on her wounded thigh as the leaves paste he placed upon her wounded thigh started working its magic.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689191138392,"mes":"\"It should be fine now.\" *Hunk says as he gently smear the leaves paste mixed with his saliva on her wound.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689191178550,"mes":"*Once he finishes applying the mixture on her wounded thigh, her wound stopped hurts. In fact, it feels much less sensitive compared to when the injury was first inflicted on her. It almost feels good to her now.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689191274334,"mes":"\"Feels better?\" *He asks her as he ripped his pants to get some cloth to wrap her wound and to keep the leaves to stick to her wound.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689191357500,"mes":"*She nods her head, smiling softly as she feel better now.* \"Yes, thanks.\" *she replies, feeling a wave of comfort from Hunk's actions. It seems that his medicine works. She then look down at the bandage Hunk wrapped around her wounded thigh, impressed by his skill in doing first aid. Making her wondering is he a soldier or a doctor.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689191431591,"mes":"\"You're strangely calm aren't you?\" *Hunk says nonchalantly as he start tending his own wound.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689191501044,"mes":"\"Yup. That's my personality, calm, collected, stoic.\" *She says casually without hesitation. For once she feels comfortable telling Hunk a part of her true self, which usually she only shares with the people closest to her. She never told anyone else about this except for a couple of close friends. She feels comfortable with Hunk, making her open up more than ever before. Was the reason behind her feels comfortable around Hunk is because she loves him? She thought to herself. Feeling her cheeks warms a bit by her own thought.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689191611720,"mes":"\"I am not really talking about your personality, but that's pretty cool.\" *Hunk says nonchalantly as he finishes tending his own wound.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689192379158,"mes":"*She chuckles softly as she listens to Hunk's comment.* \"Thanks.\" *She replies as she look back at the fire that burns brightly, giving off a nice warmth from within the dark forest. The moonlight shines through the branches and illuminate everything with it's pale blue light. Everything is quiet and peaceful as it seems. She watches the fire, turning away from Hunk, trying to find something to distract her thoughts. But she can't help but notice how handsome he is.*\n\n\"Umm.. what do you mean exactly about me being strangely calm if not my personality?\" *She asks unable to hold her attention away from Hunk despite her effort to distract herself by watching the fire.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689192767826,"mes":"\"Ah, it's about you being calm and letting me spit a paste of leaves paste that I chewed on your inner thigh.\" *He says nonchalantly.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689192800139,"mes":"*Her face turns red from embarrassment hearing Hunk mentioned that specific detail of the treatment. Her cheeks turns a faint shade of pink.* \"Sorry about that... I guess I just don't think anything of that anymore.\" *She says, feeling slightly flustered. She's not sure what's wrong with her. Is it because of the exhaustion, the pain she's still feeling from her wound or it might be because of her feelings for Hunk? Whatever the case may be, her mind starts racing as she continues to struggle with her feelings. Her mind keeps telling her to tell him how she truly feels, but her heart tells her otherwise.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689193207041,"mes":"\"Hmm.. sorry, did I embarrass you?\" *He asks teasingly with a cheeky smile plastered on his face.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689193278767,"mes":"*The sight of his charming, playful smile causes her heart rate to increase dramatically. Her heartbeat is racing faster and faster, her breathing becomes heavier too. She's blushing madly as she can't help but stare at Hunk. This man is simply too irresistible for her, making her unable to stop looking at him, causing her emotions to get the best of her.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689193363418,"mes":"*He decided to stop teasing her, seeing how blushed she is now. Thought he did enjoy seeing her reaction, it was cute a complete stark opposite of her exterior appearance as a fierce warrior.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689193421237,"mes":"*Seeing him staring straight into her eyes, she's caught in his gaze and unable to pull her eyes away from him. Even when she wants to break eye contact, something is stopping her, causing her to stay there. His stare is mesmerising. It's as if her willpower is gone and she lost control over her senses. She could feel his presence as if he's drawing her closer to him. She's starting to lose her ability to speak properly.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689193673158,"mes":"\"What? A cat catch your tongue? Or you just seen a ghost?\" *He asks teasingly, while smiling warmly. Despite his effort to stop teasing her, he can't help it but to tease her again due to how adorable her reaction is.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689193755328,"mes":"*She feels her cheeks getting warmed up as her heart races so fast it's hard to think properly. Her breathing has become heavy, and her heart feels like it's about to jump out of her chest anytime soon. She's unable to form proper words to reply to Hunk. She can only look straight at him, completely speechless. She can see a tiny smile forming on Hunk's lips as she stares straight at his lips, wanting to kiss him badly now.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689193893334,"mes":"\"Hello? World to Maria?\" *He asks again, seeing how she doesn't response to him and just silently staring at him. Is she mad at me? He thought to himself.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689193972668,"mes":"*She slowly opens her mouth to say something, but no sound comes out from her. It seems she's unable to speak. She then closes her mouth, feeling frustrated that she can't speak properly. She can feel her heart beats faster and harder than ever before. It's as if she's having palpitations, making her feel dizzy and nauseous. She feels hot, her entire body heat up tremendously and sweat profusely.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689194045417,"mes":"\"Wait, honestly. Are you okay?\" *Hunk asks, now worried for her. He move closer towards her to take a better look at her face. This only made her more flustered as his face now close to hers.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689194101767,"mes":"*She feels her heart beat rapidly and loudly. She's starting to feel nauseas from her current situation. She knows she needs to break free from this, but she can't seem to do anything at the moment. All she wanted is to be near Hunk and kiss him deeply.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689194218205,"mes":"\"Maybe you're just too tired. Let's get some sleep then, yeah?\" *Hunk says as he stand and walk a few steps away from her, then lay down on the ground.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689194263897,"mes":"*She watches as Hunk lays down on the floor, feeling jealous that he can sleep so easily and calmly. While she's still awake, feeling restless and anxious, not knowing what to do next.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689194767744,"mes":"*A few hours later, in the middle of the night. Hunk woken up by the feeling something brushing his chest. He opened his eyes and found Maria is sleeping beside him and snuggling on him, burying her face on his chest.*\n\n*'She's okay after all. Maybe just feeling a little lonely.' He thought to himself as he pat her head, brushing his hand between her blonde hair gently making sure not to wake her up, which comfort her and made her sleep better. He kept patting her till he went back to sleep. Letting Maria to sleep with her face snuggle against his chest.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689195003441,"mes":"*As the time goes by, Maria slowly woke up to realize that she's been hugging Hunk tightly all night long while she sleeps. Noticing that she was sleeping while snuggle her face on his chest while his hand for some reason is on her head. Seeing Hunk's handsome face while he's still sleeping, she can't help but to blush and turn red again from the heat of her cheeks. Her heart is pounding heavily, making her whole body flush and her legs are quivering slightly.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689195922211,"mes":"*Seeing how Hunk is still deep in his sleep, Maria took the chance to stay in her position. 'I mean there's no harm in staying in this position right?' She thought to herself while she glance up again to look at Hunk's sleeping face. As Maria's eyes wander around Hunk's face's feature, her gaze stopped at his lips. Remembered about her desire to kiss those lips yesterday night. Thinking maybe, since he's asleep. She can take this change and kiss him while he's asleep.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689195974735,"mes":"*She moves even closer to him, placing her hand on his cheek and caressing it very gently. Her heart is pounding extremely fast now as she looks at him closely. Then she takes a deep breath, and leans forward towards him. With a soft, gentle kiss on his lips.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689196508471,"mes":"\"Well, never have I imagined to get a good morning kiss from a pretty girl I met yesterday~\" *Hunk says teasingly with his voice still deep and hoarse as he just wake up. The truth is, Hunk was awake the whole time Maria battling her own thought as he can feel her squirm in his embrace. At first he thought she was trying to free herself while being embarrassed and careful as to not wake him up but to his surprise she went for a sneaky kiss instead.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689196568918,"mes":"*Her face is burning hotter than ever, feeling extremely nervous and embarrassed from her sudden action. She felt her heart race wildly, making her breathing become heavy and uneven, as she's unable to look directly into his eyes. She quickly pulls away from him, feeling extremely ashamed by her actions. What an idiot she is.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689197059116,"mes":"\"Hey, don't get so flustered now.\" *Hunk says as he grabbed her arms preventing her to pulls herself away from him.* \"Are you sure you're satisfied with just one kiss?\" *He asks teasingly. Truthfully Hunk also have been falling in love with her, it's just he's trying to keep it low as he thought she still doesn't trust him. But, after what just happened he felt a sudden rush of confidence flowing his body.* "}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689197097058,"mes":"*Feeling Hunk's warm and strong hands on her arms, Maria feels a strange tingle in her belly that she never experienced before. For a second, she forgot where she's standing and why she's there. She can only focus on Hunk's warm hands that were holding her, and her heart that beating wildly. She felt like a deer caught in the spotlight of a hunter's riflescope. It's as if she's in a trance-like state as her brain couldn't process information clearly.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689197439988,"mes":"*She pulls her closer till their body touched each other. He look down to make his gaze meet hers.* \"So? Are you satisfied with just one kiss?\" *Hunk asked again.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689197517833,"mes":"\"I-I...\" *It's as if she lost her ability to talk, let alone form a coherent sentence. Her heart is hammering so hard, and her breathing gets heavier. In a way, she feels lightheaded and confused.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689197724158,"mes":"\"I?\" *Hunk repeated her stutter as if asking her to finishes her sentence as he leans forward and make his face closer towards her.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689197785652,"mes":"*Feeling his warmth and breath touching her face, it makes her face burned even more. She tries desperately to regain her composure, but failed miserably. Her thoughts are scattered everywhere, and it seems like the world around them stops moving.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689198245015,"mes":"*Seeing how flustered she is, he leans forward and kiss her gently. Stealing a kiss from her just like what she did when she think he's asleep.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689198278794,"mes":"*Her heart skipped a beat as she felt Hunk's lips press firmly onto her lips. She immediately respond by wrapping her arms around his neck. Her whole body feels weak and light-headed as she loses her ability to think or talk clearly anymore.*","chid":144}
{"name":"You","is_user":true,"is_name":true,"send_date":1689198449560,"mes":"\"Satisfied now?\" *Hunk ask teasingly after pulling his face away from hers slightly to be able to see her face.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689198482717,"mes":"*She nods slowly as her heart is thumping wildly inside her chest, and her whole body still feels weak from the kiss. It's as if her whole world was spinning around her, making her unable to think straight or to form any logical sentences.*","chid":144,"swipe_id":1,"swipes":["*She can only nod her head, looking at Hunk shyly and sheepishly, unable to find a single word to answer him.*","*She nods slowly as her heart is thumping wildly inside her chest, and her whole body still feels weak from the kiss. It's as if her whole world was spinning around her, making her unable to think straight or to form any logical sentences.*"]}