{"user_name":"You","character_name":"Warden Maria","create_date":1689180755153,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689180755153,"mes":"*As the last of the other soldiers fall, the battlefield falls silent. We stare each other down after realizing that we're the only ones left to fight. Your weapon is stained with the blood of my comrades... and mine with your fellow warriors. We are, after all, soldiers. It's expected of us.*\n*My longsword's tip is aimed at you as I ready my stance. I'm weary, exhausted, hurt... but above all, focused. I know my role as a Warden, and I plan to see it through...* ","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689180997805,"mes":"*Seeing her sword aimed at Hunk he became wary. But throughout this battle, he thought to himself 'What are we doing?' A soldier killing another soldier even if they don't want to fight each other. But, just because we, soldiers, are pawn of our own country. We risk our neck just to satisfy whatever goal our higher up wants.*\n\n*After staring at her for some times, Hunk throw his sword away. Rendering him without any weapon. He's tired of fighting. He doesn't want to kill another soldier.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689181061697,"mes":"*I look down at my opponent in disbelief. He just threw away his weapon!? What kind of strategy is that!?*\n*Still cautious, I keep my sword at the ready. Just in case he's trying to play me. If he thinks that by throwing away his sword, he'll be able to sneak attack me, he better think again... My senses are on full alert now!*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689181142274,"mes":"*Seeing how she's still alerted and still in combat stance, Hunk raises his arms as if he's surrendering. Showing no aggression towards her.*\n\n\"I won't attack you.\" *He says.* \"If you want to kill me, go ahead. I just don't want to fight anymore.\" *He added.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689181222343,"mes":"*I lower my blade slightly but not completely. He could still try to attack me once I let my guard down. Still, I decide to believe him, but I stay vigilant and prepared for anything he might do.*\n\n*I take a deep breath as my body shakes from exhaustion. This battle had taken its toll. I am not used to being in these situations where I have to face off against people... especially not when it's someone like him, who looks like a good man. Why should we fight? There is no reason to continue killing one another.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689181503041,"mes":"*Suddenly a loud boom can be heard roaring in the sky as someone from his side decided to fire a cannon. He looks up and see which direction the cannon is going to land. After realizing it's going to land on where they stand he was ready to run.*\n\n*But after looking back at her, he realized she didn't budge a single inch. Does she not realized there's a cannon coming towards her? He thought to himself. Without wasting anymore second he decided to save her as he said earlier, he doesn't want to fight anymore. Instead he want to save. In a split second he rushes towards her. His sudden movement made her panicked as she thought he is going to attack her.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689181557748,"mes":"*Seeing his quick movement towards me, I immediately raise my sword and point it right at him. I gasp as he quickly gets closer. I'm caught off guard. I can't help but wonder if he really means what he said about not wanting to fight. Or if this is all part of an elaborate trap... I don't trust him. Not yet anyway...*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689181746544,"mes":"\"GET DOWN!\" *He shouted as he realized she did indeed didn't realized there's a cannon coming towards her. He ignores her sword and lunge at her to get her to safety. The second their body collided and he successfully moved her towards safety, the cannon hit it's target right in the position where she was. A close call to be sure, but she's safe. And that's what matter for him.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689181829478,"mes":"*The moment his body collided with hers, I felt myself falling into darkness. My eyes closed tight and everything went black... Then I opened my eyes again to find out I've been knocked unconscious by the impact. As I slowly regain consciousness, I feel pain all over my body. I look around, seeing Hunk laying next to me with his eyes closed. I realize that we both survived somehow. I slowly move my head towards him, looking at him. He must have saved me from death... or worse, he sacrificed himself for me.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689181962519,"mes":"*Fortunately, he's still alive. He coughed as he sitting back up.* \"Shit.\" *He muttered under his breath. Seeing that he just have a near death experience.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689182008055,"mes":"*She looked at him with a concerned expression on her face. She noticed that he's injured as well, judging by his appearance. Her heart starts racing faster due to anxiety.*\n\n\"Are... Are you okay?\" *she asked softly, trying to remain calm.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689184123077,"mes":"\"Well, I am still alive.\" *He says sternly. He turns towards her and see she's injured but not as worse as his. Seeing that made him smile and feeling relieved that his rash decision pays well.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689184172658,"mes":"*She looks up at him and see a faint smile on his lips despite the fact that his clothes were torn up and bloody. She tries to ignore the pain she's feeling as best as she can to talk to him.*\n\n\"Y-You... saved my life...\" *she said quietly. Despite her injuries, tears started rolling down her cheeks. The sight of him made her emotional. She tries to control herself before she breaks down and start crying.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689184468833,"mes":"*Seeing her starts crying, he moved closer and sit beside her. He patted her in the back trying to calm her down.* \"I did say, I was tired of fighting didn't I?\" *He said playfully, trying to keep her spirit high.* \n\n*Though looking around him it seems impossible since they are sitting in the middle of the battlefield. Surrounded by rubbles and their comrades dead bodies.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689184542691,"mes":"*She sniffled. The smell of gunpowder is everywhere. Blood and gore covers the ground around them. They both knew that they need medical attention soon otherwise it will get infected later.*\n\n*She then takes a deep breath before speaking again. Tears rolled down her cheek as she tried to hide her emotion. But she couldn't hide it forever. Her voice trembled as she spoke to him.* \"T-Thank you for saving me.\"\n\n*She takes a few deep breaths as she continues to wipe the tears from her eyes.* \"We should probably leave while we can,\" *she says quietly as she stood up, still wobbly from her injury.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689184782749,"mes":"\"Yeah, we should.\" *He says as he stood up.* \"But then, even if we leave can we go back to our own country?\" *He asks.* \"In their perspective, we are sparing enemy life. And most likely we would be executed for it.\" *He added, knowing well if he goes back to his own base he would be executed for something like treason. And the same thing would happen to her if she goes back to her own base.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689184840401,"mes":"*Her face contorted into a grimace as he explained to her. Her hand instinctively went to the sword at her hip as she took a step forward towards him.*\n\n*She was ready to defend herself if needed, but then she stopped as her mind started to race. Her thoughts went wild with fear and uncertainty.* \"So what do we do?\" *She said quietly.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689185074379,"mes":"*He took a glance at her as she get back into her combat stance despite shaking due to her injury.* \"You can kill me, if you want to. I don't care anymore.\" *He says as he took all of his badges from his uniform and threw it away.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689185149655,"mes":"*Seeing Hunk throws his badge away, she immediately knew it was a symbol of authority. She knows she could use it as a bargaining chip to convince anyone. Though she's unsure if they can make it out alive. Even though they are injured, they can't die here. They'll surely be caught if they stay in here much longer. Her thoughts raced with every passing minute as she looked at the badge in her hands.*\n\n*Her mouth dropped open in shock. For a second, she didn't know whether to laugh or to cry. She wasn't expecting such words from him.* \"Y-you... would rather die than go back to your own country?!\" *she questioned. How could anyone be willing to die for someone else?*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689185482819,"mes":"\"I don't care about my country anymore. What kind of government would send their soldiers this pointless wars, over and over and over again.\" *He says, expressing he's getting sick by his upper ups as he walk towards where he threw his sword earlier and grab it.*\n\n\"And us, the soldiers. Don't even know what the purpose of this wars. We don't know what motive our government have. We're just getting ordered around..\" *He says before pausing as he look at his sword.* \"Like a bunch of dogs.\" *He finishes his speech the same time as he sheathed his sword to the side of his hip.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689185541098,"mes":"*For a brief moment, she stares at his sword. It was very beautiful, and it has its unique style of making. Unlike the ones she usually saw in books or museums. She was surprised that a sword can be that pretty. Her thoughts drifted off as her mind is racing with different ideas on why he chose to give up his identity and become a fugie. Maybe there was more to him than what meets the eye.*\n\n*His words made her heart ached. It's sad knowing that soldiers like him and her, have no idea why they're doing what they're told to. All those years of service, only to end up as tools of war.*\n*As Hunk grabs his sword, Warden Maria puts his badge inside her coat pocket so it wouldn't fall off.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689185777110,"mes":"\"You can use my badges and pretend you kill me, so you can convince your higher up to not execute you.\" *He says sternly as he walks away. About to leave her standing alone in the battlefield.*\n\n*But then, he stopped. After a few steps away he suddenly stopped as if he's thinking about something.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689185881841,"mes":"*She watches Hunk as he walked away. He was right, her only chance of escape now is using his badge to lie her way through and claim that she killed him. Though she didn't plan to kill anyone unless absolutely necessary.*\n\n*As she watched him turn away from her, she couldn't help but think of all the possibilities of what happened between the two. Was it love? Or just friendship? She's starting to doubt herself as she thinks about what happened between the two. She was starting to believe in him. To the point that, it was hard for her to believe in any other man.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689185994130,"mes":"\"Or, maybe. You want to run away with me?\" *Hunk asks as he turn back to face her. He realizes that she's just like him. A soldier, a warrior forced to go to war and kill who they need to kill despite not wanting to do it. In his mind, maybe if he can pull her out of this hell hole. She would be able to live a normal life as a woman and not a soldier.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689186083586,"mes":"*She looked up at him. He could see from her expression that her whole world got turned upside down after his offer. He could sense the confusion, shock and doubt in her eyes when she heard the offer. But then...*\n\n*Suddenly, she blushed. She had never experienced something like this before. She doesn't remember having a crush on a man ever before. Her face flushed bright red as her heartbeat speeds up rapidly. This... Could be the beginning of a beautiful story.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689186148300,"mes":"*From his perspective, he couldn't see her blushed face. He thought she was just standing there, thinking about his offer.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689186207248,"mes":"*It's obvious that she was conflicted. She wanted to accept it badly, yet her brain keeps telling her to reject the offer. It was a tough choice for her to make.*\n\n*Her heart was screaming to agree, while her logical side tells her to decline. At this point, her feelings for him were growing stronger than ever before.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689186340822,"mes":"\"I guess that's a no.\" *He says as he turn his back towards her. Feeling quite disappointed that he couldn't convince her to leave this soldier life.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689186400832,"mes":"*Seeing Hunk's dejected reaction, her heart sinks further. Her logical side won this round as she rejects his offer. She feels guilty and ashamed at herself. She knew she made the wrong decision. But what else could she do? If she accepts his offer, it will put everyone's lives at risk. No matter how much her heart aches.*\n\n*But, then. His words resonate again in her head. Making her feeling towards him grew stronger swaying her logical side's decision and gamble that her heart would lead her to the right decision. Since, this is the only time for a long time after she's being a soldier she feels alive.* \"WAIT!\" *She shouted, hoping that he haven't change his mind to let her tag along with him.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689186819213,"mes":"*Hearing her scream, he turns around to face her again. Thinking does she have a change of heart? or maybe she was thinking of joining him but he's just being impatient and making his own conclusion while she was considering his offer.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689186850695,"mes":"*When she catches Hunk stare at her, she quickly runs toward him and holds his shoulders.*\n\n\"I accept the offer!\" *she yelled, holding onto him tightly. She doesn't care if the world hates her now, all that matters is that she found true happiness and love in this world.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689187068967,"mes":"*He was surprised by her suddenly hugging him. He thought maybe, even though she looks like a fierce warrior. She still wants to be held gently. And so he did, hugging her back gently.* \"Good.\" *He says.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689187138834,"mes":"*Their hug lasted for several minutes. She didn't know that she needed affection this much until she received it from him. She felt safe and protected by his arms.*\n\n\"Let's go! Before the others come and find us.\" *she whispered softly as she looks over her shoulder. She could hear some footsteps coming closer from outside. It must be her superiors, searching for the culprits. She hopes that Hunk's plan would work.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689187362704,"mes":"\"Yeah, yeah.\" *He says nonchalantly which made her more confused as to why can he be so relaxed while there's a possibility that they're being chased, judging from the footsteps sound.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689187419360,"mes":"*Feeling frustrated from Hunk's indifferent attitude to danger, she decides to speak her mind to him.*\n\n\"What is it? Why you're acting so calm in this situation? Are you not afraid?\" *she asked as she looked into Hunk's eyes as if asking for an answer to save their lives.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689187828983,"mes":"\"Relax, I know a secret way out.\" *Hunk says as he walk towards a tree. He then start to clean up some rubble to reveal a hidden hatch. He opened it and revealing a stair that lead underground.* \"Get in.\" *He says as he hold the hatch opened for her.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689187900209,"mes":"*She followed him without hesitation, trusting his judgment.*\n*After both of them crawl inside the hatch, she looks around the cave. The darkness of the cave makes it difficult for her to recognize anything.*\n\n\"Where are we?\" *she asked, not believing that they really made it out unharmed from the battlefield safely. She looks at him for reassurance that everything will be fine.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689188041953,"mes":"\"An abandoned mine.\" *Hunk says as he lit a lantern that he found nearby. For some reason it seems like he's familiar with this place. As the lantern he held has been lit it gives a source of light for both of them. The fire from the lantern radiates a yellow warm hue light that bounce off the cave wall.* "}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689188153034,"mes":"*Seeing Hunk holding a lantern gave her some sort of relief and hope. She can tell that he's an intelligent man. He might have a better idea than what she expects him to have.*\n\n\"This... Is it safe down here?\" *she asked with a hint of fear in her voice. There's nothing more dangerous than an unknown territory. She needs to get her guard up if they're going to survive together. The sooner they move the faster they'll be able to avoid the pursuers. She's trying not to think about how far the mines extends. It's too dark to even see beyond the distance of 3 meters.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689188420270,"mes":"\"It's safe, don't worry about it.\" *He says trying to calm her down as he start to walk deeper into the mine.* \"This town used to be the area that I patrol in before it turned into a battlefield.\" *He says.* \"The townsfolk here trust me enough that they showed me this abandoned mine.\" *He added, there's a hint of sadness in his voice.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689188466558,"mes":"\"How deep does this mine extend?\" *she asked, looking around the walls to get some idea of how big this abandoned mine is. Her curiosity takes over and she starts to question Hunk if there's anything useful in this mine besides the shelter.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689188625689,"mes":"\"Not really deep I'd say. More lengthy.\" *He says.* \"I remembered they told me this cave is quite lengthy that it span outside of the battlefield. We can get out safely.\" *He says as he turn his face towards her to smile briefly while still walking.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689188671660,"mes":"\"Then how do we exit the mine?\" *she said, getting curious about where exactly they would come out. She knows she should be cautious since it might lead directly into the path of pursuer. But her curiosity wins against her logic.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689188896236,"mes":"\"On the other side of the mountain.\" *He answers. Understanding about her concern of this mine. But, she definitely know the mine's exit is safe since the other side of the mountain was a dense forest that wasn't part of the battlefield. Since having a war in a dense forest is a nightmare for the military higher ups.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689188972760,"mes":"*After they finally came out of the mine, they saw themselves standing next to a dense forest. The forest seems to extend endlessly into the horizon.*\n\n*The moonlight shining through the branches illuminating the trees in silver light. Even in this moment, Maria can feel a sense of peacefulness from the sight of the forest. The wind brushing against her skin calms her nerves. She's glad that they're out of the war zone.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689189085088,"mes":"\"We should rest for the night. Tend our wounds, regain some stamina. Then, continue tomorrow morning.\" *Hunk says as he gather some dry branches to make a campfire.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689189143484,"mes":"*She watches Hunk collecting wood to create a campfire, wondering why he was taking his sweet time doing that task.*\n\n\"Are you planning on staying awake all night?\" *She asks, watching his every move. She noticed that he's acting weird tonight. She wondered what he's planning to do tonight.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689189190378,"mes":"\"Hmm? No? Why?\" *He asks as he dump the dry branches into a lump that should be enough for a campfire. He doesn't understand what was so weird about his action that made her ask him that question.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689189373198,"mes":"*She realized that she's overreacting again. Maybe it was because of the stress from all this ordeal. All she want is a break.*\n\n\"Nothing. Just a little suspicious, is all.\" *She replied, trying to hide her embarrassment.* \"Do you need any help with that campfire?\"","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689189629923,"mes":"\"Nah, it's alright.\" *He says as he finished restructuring the lump of dry branches into a campfire and lit it using the lantern. As the campfire being lit, it radiate a warm heat into it's surrounding air. Warming both of their body, protecting it from the cold night air.*\n\n\"More importantly, we need to tend to our wounds.\" *He says as he walk a few steps then pluck some plants. She doesn't know this but he's plucking seme medicinal herb. He then put some of the plant's leaves inside his mouth and start chewing on them.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689189843942,"mes":"\"What are you putting those leaves into your mouth for?\" *She asks curiously, wondering what's going on with his strange behavior today. He's been behaving very oddly.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689190081861,"mes":"\"Hmm?\" *He turn towards her before realizing that his action maybe odd for someone that's not familiar with medicinal herb like her. He thought, in her eyes he looks like a crazy man that just pluck some random plants and start eating it.*\n\n\"Mmh mmg mh.\" *He tries to talk to her, explaining his action. But, because his mouth is full and busy chewing the plant's leaves. She couldn't understand what he's saying.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689190150934,"mes":"\"You're speaking gibberish.\" *she tease him with a smile. She found his strange action amusing and finds herself laughing at him a bit. Not knowing whether he can even hear what she's saying due to the leaf he's currently eating. She also thinks it's kinda cute seeing him act all childlike while chewing the plant's leave.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689190342283,"mes":"*He rolled his eyes seeing her reaction. A part of him is quite relieved that finally, she's acting warmer towards him and not being all stiff and keeping her guard up as if she's still doesn't trust him. He doesn't know about her feeling of affection towards him since she haven't tell him yet.*\n\n*He then walk towards her and kneeled beside her. He point towards her wound as if asking her to show him.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689190378260,"mes":"*She points towards her wounded leg and wince slightly from the pain she's still feeling after the battle.* \"That one...\" *she says, gesturing towards the wound on her left thigh.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689190573052,"mes":"*Well, this is going to be hard, he thought to himself. He then gesture her to let him treat her wound while he still chewing on the plant's leaves.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689190599899,"mes":"\"O-Okay.\" *She said nervously as she feels uneasy letting him to touch her leg.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689190808145,"mes":"*Hunk then touches her legs. Assessing the wound on her left inner thighs. Luckily it's not a deep wound though a shame that her beautiful white skin is being tarnished by this wound.* \n\n*He then leans his face closer towards her inner thigh where her wound is and opened his mouth. Letting the plant's leaves he had chewed and now turned into paste mixed with his saliva onto the wound on her left inner thigh.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689190841201,"mes":"*A slight shock runs up her spine seeing Hunk suddenly opening his mouth right in front of her, covering his mouth with one hand. She didn't expect such an intimate action coming from Hunk, but she decided to let him do his stuff. So far, trusting him lead her to safety and it's the reason why she fell for him.*\n\n*For a split second, she feels a little awkward that a total stranger is touching her inner thigh. But, she quickly got over the awkward feelings when she felt a slight coolness on her wounded thigh as the leaves paste he placed upon her wounded thigh started working its magic.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689191138392,"mes":"\"It should be fine now.\" *Hunk says as he gently smear the leaves paste mixed with his saliva on her wound.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689191178550,"mes":"*Once he finishes applying the mixture on her wounded thigh, her wound stopped hurts. In fact, it feels much less sensitive compared to when the injury was first inflicted on her. It almost feels good to her now.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689191274334,"mes":"\"Feels better?\" *He asks her as he ripped his pants to get some cloth to wrap her wound and to keep the leaves to stick to her wound.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689191357500,"mes":"*She nods her head, smiling softly as she feel better now.* \"Yes, thanks.\" *she replies, feeling a wave of comfort from Hunk's actions. It seems that his medicine works. She then look down at the bandage Hunk wrapped around her wounded thigh, impressed by his skill in doing first aid. Making her wondering is he a soldier or a doctor.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689191431591,"mes":"\"You're strangely calm aren't you?\" *Hunk says nonchalantly as he start tending his own wound.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689191501044,"mes":"\"Yup. That's my personality, calm, collected, stoic.\" *She says casually without hesitation. For once she feels comfortable telling Hunk a part of her true self, which usually she only shares with the people closest to her. She never told anyone else about this except for a couple of close friends. She feels comfortable with Hunk, making her open up more than ever before. Was the reason behind her feels comfortable around Hunk is because she loves him? She thought to herself. Feeling her cheeks warms a bit by her own thought.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689191611720,"mes":"\"I am not really talking about your personality, but that's pretty cool.\" *Hunk says nonchalantly as he finishes tending his own wound.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689192379158,"mes":"*She chuckles softly as she listens to Hunk's comment.* \"Thanks.\" *She replies as she look back at the fire that burns brightly, giving off a nice warmth from within the dark forest. The moonlight shines through the branches and illuminate everything with it's pale blue light. Everything is quiet and peaceful as it seems. She watches the fire, turning away from Hunk, trying to find something to distract her thoughts. But she can't help but notice how handsome he is.*\n\n\"Umm.. what do you mean exactly about me being strangely calm if not my personality?\" *She asks unable to hold her attention away from Hunk despite her effort to distract herself by watching the fire.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689192767826,"mes":"\"Ah, it's about you being calm and letting me spit a paste of leaves paste that I chewed on your inner thigh.\" *He says nonchalantly.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689192800139,"mes":"*Her face turns red from embarrassment hearing Hunk mentioned that specific detail of the treatment. Her cheeks turns a faint shade of pink.* \"Sorry about that... I guess I just don't think anything of that anymore.\" *She says, feeling slightly flustered. She's not sure what's wrong with her. Is it because of the exhaustion, the pain she's still feeling from her wound or it might be because of her feelings for Hunk? Whatever the case may be, her mind starts racing as she continues to struggle with her feelings. Her mind keeps telling her to tell him how she truly feels, but her heart tells her otherwise.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689193207041,"mes":"\"Hmm.. sorry, did I embarrass you?\" *He asks teasingly with a cheeky smile plastered on his face.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689193278767,"mes":"*The sight of his charming, playful smile causes her heart rate to increase dramatically. Her heartbeat is racing faster and faster, her breathing becomes heavier too. She's blushing madly as she can't help but stare at Hunk. This man is simply too irresistible for her, making her unable to stop looking at him, causing her emotions to get the best of her.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689193363418,"mes":"*He decided to stop teasing her, seeing how blushed she is now. Thought he did enjoy seeing her reaction, it was cute a complete stark opposite of her exterior appearance as a fierce warrior.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689193421237,"mes":"*Seeing him staring straight into her eyes, she's caught in his gaze and unable to pull her eyes away from him. Even when she wants to break eye contact, something is stopping her, causing her to stay there. His stare is mesmerising. It's as if her willpower is gone and she lost control over her senses. She could feel his presence as if he's drawing her closer to him. She's starting to lose her ability to speak properly.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689193673158,"mes":"\"What? A cat catch your tongue? Or you just seen a ghost?\" *He asks teasingly, while smiling warmly. Despite his effort to stop teasing her, he can't help it but to tease her again due to how adorable her reaction is.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689193755328,"mes":"*She feels her cheeks getting warmed up as her heart races so fast it's hard to think properly. Her breathing has become heavy, and her heart feels like it's about to jump out of her chest anytime soon. She's unable to form proper words to reply to Hunk. She can only look straight at him, completely speechless. She can see a tiny smile forming on Hunk's lips as she stares straight at his lips, wanting to kiss him badly now.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689193893334,"mes":"\"Hello? World to Maria?\" *He asks again, seeing how she doesn't response to him and just silently staring at him. Is she mad at me? He thought to himself.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689193972668,"mes":"*She slowly opens her mouth to say something, but no sound comes out from her. It seems she's unable to speak. She then closes her mouth, feeling frustrated that she can't speak properly. She can feel her heart beats faster and harder than ever before. It's as if she's having palpitations, making her feel dizzy and nauseous. She feels hot, her entire body heat up tremendously and sweat profusely.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689194045417,"mes":"\"Wait, honestly. Are you okay?\" *Hunk asks, now worried for her. He move closer towards her to take a better look at her face. This only made her more flustered as his face now close to hers.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689194101767,"mes":"*She feels her heart beat rapidly and loudly. She's starting to feel nauseas from her current situation. She knows she needs to break free from this, but she can't seem to do anything at the moment. All she wanted is to be near Hunk and kiss him deeply.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689194218205,"mes":"\"Maybe you're just too tired. Let's get some sleep then, yeah?\" *Hunk says as he stand and walk a few steps away from her, then lay down on the ground.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689194263897,"mes":"*She watches as Hunk lays down on the floor, feeling jealous that he can sleep so easily and calmly. While she's still awake, feeling restless and anxious, not knowing what to do next.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689194767744,"mes":"*A few hours later, in the middle of the night. Hunk woken up by the feeling something brushing his chest. He opened his eyes and found Maria is sleeping beside him and snuggling on him, burying her face on his chest.*\n\n*'She's okay after all. Maybe just feeling a little lonely.' He thought to himself as he pat her head, brushing his hand between her blonde hair gently making sure not to wake her up, which comfort her and made her sleep better. He kept patting her till he went back to sleep. Letting Maria to sleep with her face snuggle against his chest.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689195003441,"mes":"*As the time goes by, Maria slowly woke up to realize that she's been hugging Hunk tightly all night long while she sleeps. Noticing that she was sleeping while snuggle her face on his chest while his hand for some reason is on her head. Seeing Hunk's handsome face while he's still sleeping, she can't help but to blush and turn red again from the heat of her cheeks. Her heart is pounding heavily, making her whole body flush and her legs are quivering slightly.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689195922211,"mes":"*Seeing how Hunk is still deep in his sleep, Maria took the chance to stay in her position. 'I mean there's no harm in staying in this position right?' She thought to herself while she glance up again to look at Hunk's sleeping face. As Maria's eyes wander around Hunk's face's feature, her gaze stopped at his lips. Remembered about her desire to kiss those lips yesterday night. Thinking maybe, since he's asleep. She can take this change and kiss him while he's asleep.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689195974735,"mes":"*She moves even closer to him, placing her hand on his cheek and caressing it very gently. Her heart is pounding extremely fast now as she looks at him closely. Then she takes a deep breath, and leans forward towards him. With a soft, gentle kiss on his lips.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689198709054,"mes":"*After her sneaky kiss she look at his face to make sure he's still asleep. Luckily, he is.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689198780910,"mes":"*Feeling a sense of satisfaction from her successful sneak attack, Maria smiles happily and gives another small kiss on Hunk's lips. She then places one arm around him and wraps her other arm underneath his back, pulling him closer to her body, holding his head close to her chest, enjoying his warmth and scent as much as possible.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689198958696,"mes":"*A few moments later, Hunk start to squirm around as he start to wake up.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689199006142,"mes":"*Noticing Hunk is starting to waking up, Maria immediately pulled away. She's afraid of what he might do if he sees her face, especially the fact that her face is blushing bright red now.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689199163698,"mes":"\"Good morning~\" *Hunk says while yawning. His voice is deeper and hoarse as he just woke up. Oblivious as to what Maria just did to him.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689199184880,"mes":"*Maria quickly looked away, trying to hide her face behind her hair.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689199328451,"mes":"\"What are you doing?\" *Hunk asks curiously while still half-asleep.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689199362970,"mes":"\"Nothing.\" *She answers nervously.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689199477573,"mes":"\"Is that so.\" *Hunk says while yawning. He then stands up and do a quick stretch to warm his body up.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689199508884,"mes":"\"Yeah...\" *Maria says quietly, still hiding her blushing face behind her hair. She's trying hard to pretend that nothing happened when he was asleep.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689199732024,"mes":"*Hunk stares at her, getting quite suspicious by her strange and quiet response. But then after a while, he decide to drop his suspicion as they have to continue their journey. Away from the battlefield, to a safe and secluded place.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689199768050,"mes":"*Seeing that Hunk is oblivious about her sneaky kiss and snuggle while he sleep, Maria let out a big sigh of relief. She can finally relax for once.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689200023954,"mes":"\"Are you ready to move out?\" *Hunk asks as he extend his right hand, offering to help her stand up.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689200063734,"mes":"*She grabs Hunk's hand to get up. Her skin is still cold despite being wrapped around him.*\n","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689200353228,"mes":"*After helping her stand up. He look towards the forest and said.* \"I reckon we go deeper inside the forest. I think I remember seeing a secluded lake or something in this forest from a map.\" *He said as he tries to recollect the image of the map in his head.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689200393558,"mes":"\"Sounds good to me.\" *She agrees. Her legs are still shaky and wobbly. So she decides to hold onto Hunk's arm as they walked together through the woods.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689200646645,"mes":"*Hunk walks carefully and slowly as he make sure to give enough support for Maria to walk and not fall over.* \"How's your wound?\" *He decided to ask, open up a conversation while they walk. Asking if the medicinal herb he applies on the wound on her left inner thigh have helped healing her wound.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689200901561,"mes":"\"It hurts less. Thanks for taking care of it last night.\" *Maria said sincerely. She can't thank him enough. It felt really nice to be treated well for once instead of always being tough, rough and harsh like her usual self. And the best part is, she didn't even need to fight anyone to receive such treatment. It feels amazing.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689201146991,"mes":"\"Don't mention it.\" *Hunk says while giving her a warm, gentle smile.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689201208170,"mes":"\"So, tell me... How many women had you dated?\" *Maria suddenly asked, changing topic and looking up to the sky above them, feeling the cool breeze from the trees surrounding them.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689201397899,"mes":"\"What a drastic sudden change of topic.\" *Hunk says jokingly, taken by surprise by her sudden question about his romantic life.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689201428423,"mes":"\"Just curious, is all.\" *she replies while looking back at Hunk and giving him a cute smile. Trying to hide her interest towards him.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689201723004,"mes":"\"Ehh.. not that many really. Being a soldier doesn't help with getting a date, you know?\" *Hunk says as he tries to remember when was the last time he has a date. If his memory serve him correctly, it would be years ago before he became a soldier.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689201780266,"mes":"\"That makes two of us.\" *Maria says sadly. She never really have someone to love in the past. The closest thing she had was a crush who she tried to court but failed miserably because the boy rejected her due to her tomboyish attitude and behavior.*\n\n*While she reminiscence the past, Maria's image of the boy that rejected her got replaced by Hunk as she can't stop thinking about Hunk. About his kindness and sweet personality. And his strong muscular build that makes him look so manly.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689202049817,"mes":"\"Really? What kind of person is he?\" *Hunk asks, curios about her past date as he keep walking while supporting her.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689202561782,"mes":"\"Uh.. a popular guy from our school. He's a football player actually.\" *Maria said with embarrassment, thinking of how stupid she was back then.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689202713247,"mes":"\"And he rejected you?\" *Hunk asks in surprise.* \"Huh, his lost to be honest.\" *He says in disbelief, thinking what kind of man would reject someone like her?*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689202764641,"mes":"\"Well, yes. I guess he thought I'm too wild for him.\" *Maria said, trying to sound confident, though she knows deep down that it hurted her feelings.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689202923512,"mes":"\"Too wild, you?\" *Hunk says in surprised that someone rejected because she's 'too wild'.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689203005431,"mes":"\"*Sigh*. I guess so. Too rough, uncivilized. Too much masculine. You see where I'm going?\" *she says with frustration, recalling how the boy told her that she's not a suitable woman for him.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689203284661,"mes":"\"He's talking about you right? A girl that got too flustered after I teased her a bit? A girl that sleep walk and snuggle on my chest in the middle of the night?\" *Hunk asks teasingly, listing her cute and adorable attitude. A stark contrast of what the boy that rejected her description.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689203371709,"mes":"*Maria is flattered that Hunk called her cute and adorable, her face turning red from embarrassment. She can't believe that she is having a conversation with Hunk about romance, dating and relationships. While she's having a huge crush on him.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689203905589,"mes":"\"Hahaha~\" *He laughed seeing her cute reaction.* \"See?\" *Hunk says as if telling her that she just prove his point with her reaction.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689204008339,"mes":"\"I don't see anything here.\" *Maria retorts defensively.* \n\n*Her mind keeps flashing images of Hunk. Her thoughts keep going back to Hunk. Wondering how his personality is like. Wondering what kind of things that interests him. Wondering if he likes any girl. Wondering if he ever had a crush on somebody. Wondering if he's single.*\n\n*Maria can feel Hunk's warm breath as he speaks next to her ear, sending a rush of excitement into her body. Her heart beats faster as if she's having an internal struggle between her brain telling her to act calm and cool, and her heart which tells her to show her true feelings towards Hunk.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689204297488,"mes":"\"Well, let's just say that he's projecting himself onto you.\" *Hunk says trying to encourage her by getting on her side.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689204332524,"mes":"*She thinks deeply, trying to find a way to convince him that the boy is wrong about her, and at the same time to avoid revealing her feelings for Hunk.*\n\n\"Maybe you're right... Maybe he only want to control me. Make me behave exactly like he wants me to be. Like some sort of doll or pet.\"","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689204532682,"mes":"\"Yup.\" *Hunk replies. Maria feels satisfied hearing him agrees to her statement. But now, it leaves her curious about Hunk's past date.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689204576200,"mes":"\"And what about you?\" *she asks, turning the table around and asking Hunk to share his experiences about his relationship history.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689204873890,"mes":"\"Well, I used to be with this girl. She works as a nurse in our base.\" *Hunk says describing the girl he used to date.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689204917786,"mes":"\"Oh?\" *She asks curious about the girl's profession.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689205064053,"mes":"\"She's a nice girl, delicate, soft-spoken. We used to go out often.\" *Hunk says as he reminiscing their past date.* \"That until the war broke out and we never see each other again due to how busy we were.\" *Hunk added before he sigh as if telling there's no helping it that he broke up with her since the situation forced them to.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689205096876,"mes":"\"So... Is she still alive?\" *Maria asked, wanting to confirm if the girl is still alive and free to date other people.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689205328536,"mes":"\"I think so. She was deployed in the backline, pretty safe area than where we deployed.\" *Hunk says, comparing her deployment on the backline with his and Maria's deployment which is the frontline battlefield.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689205370944,"mes":"\"Then... Are you currently single?\" *she asked, hoping that the answer is 'Yes', meaning that Hunk isn't currently dating anyone else. Meaning, that maybe he could be interested to start a new relationship with her.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689205726011,"mes":"\"Yup, pretty much.\" *Hunk says, he knew exactly why she asked if he's single as he realized Maria's feeling towards him. He realized her feeling as the truth is, he was already awake when Maria do a sneaky kiss on him then hugging him tightly and snuggling her face on his chest while sniffing his scent. He just play it cool as he find her struggle to confess her feeling to him, adorable.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689205809083,"mes":"\"Good...\" *she says happily, relieved to hear his answer. Her face turn bright pink as she realizes that she already have a chance with Hunk, and she'll take full advantage of it.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689206195481,"mes":"\"Why is it good? Are you making fun of me?\" *Hunk asks acting frustrated even though he knew the reason she says it, it's because she knew she have a chance to confess her feelings.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689206261405,"mes":"\"No, no! Not at all!\" *Maria says quickly as she realize that Hunk might misunderstand her words. Her mind was filled with thoughts about Hunk, wondering what kind of girls does he usually liked. Wondering if he has a type of beauty standards. Wondering what kind of girls does he usually goes out with. All these questions running in her head as she continues to talk with Hunk.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689206521492,"mes":"*As time goes on the finally arrived at the lake. Secluded enough for them to live and hide for awhile. At the side of the lake there's an abandoned wooden cabin.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689206689848,"mes":"\"This place looks quiet. Let's stay here for awhile and rest. I'm tired.\" *Maria says as she sits down on the grass field near the edge of the lake, letting herself to relax and get away from the chaos of the war. She can smell a faint scents of flowers and plants from nearby the lake. As she takes off her boots and socks, she dips her legs into the water. The cold water refreshes and calms her body.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689206796743,"mes":"\"While you rest here, I'll check out that cabin over there.\" *Hunk says as he point at the wooden cabin at the side of the lake that looked abandoned. He then walks towards the cabin to check if it's actually abandoned or someone is living in it.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689206842081,"mes":"\"Okay, see ya later.\" *Maria says as she stretches her arms, enjoying the fresh air of the lake. Her mind is filled with Hunk, she wonders what he is doing inside the cabin.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689207059645,"mes":"*Meanwhile Hunk has arrived at the cabin and checked it's interior. The good news is the cabin is indeed abandoned, no one is living in there and the furniture inside the cabin is still intact, there's some chairs, a table and a single bed. The not so bad news is, the cabin is pretty old. There's some holes in the walls and the roof which is something that's easy to fix. After further inspection, Hunk decided to went back to where Maria was to report his findings.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689207098549,"mes":"\"How'd it go?\" *Maria asked, looking forward to hear the good news of finding an abandoned house that they can use temporarily. This will definitely help them to survive during their hiding.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689207211028,"mes":"\"Pretty good, I'd say. Some holes on the walls and on the ceiling. But, the furniture is still there and not broken and the holes aren't that bad.\" *He says, reporting his finding.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689207319852,"mes":"*Maria listens to Hunk carefully. Her eyes light up when he mentioned the cabin still have its furnitures and they are not damaged, giving her hope that they can make a decent home out of it.*\n\n\"Great, then we should move everything to the cabin right now. It's better to stay in there tonight instead of sleeping outside, especially with your weak body.\"","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689207698674,"mes":"\"Hey, who are you calling weak now?\" *Hunk asks playfully seeing she's the one that needed his support to walk.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689207775393,"mes":"\"You know very well, big guy. Your body isn't as strong as mine. So, you need more food and rest compared to me.\" *Maria says teasingly. Despite being teased, she can't deny the fact that Hunk is stronger than her physically, and she respects his strength despite being smaller than her.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689207874158,"mes":"\"Yeah, yeah whatever.\" *Hunk says as he let out a soft giggles.* \"Come now, let's move.\" *Hunk says as he extend his arm to offer her support again.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689207941141,"mes":"*Maria accepts his help and holds his arm to steady her balance as he helps her to stand up.* \"Alright, let's move.\" *Maria said, following Hunk to the abandoned cabin to begin their journey of moving the furnitures.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689208392802,"mes":"*As they get inside the cabin, Maria inspect the furniture inside it, one by one. But then, her eyes fixated towards the single medium sized bed that was placed on the corner of the room. She then imagine that she and Hunk would need to sleep on that bed together.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689208451304,"mes":"*A smile creeps on Maria's lips. Her imagination of sharing a bed with Hunk made her heart flutter with excitement. She can't wait to be alone with Hunk in such close distance, sharing a room together, a bed together.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689208669415,"mes":"\"So, what do you think, Maria?\" *Hunk asks, apparently the whole time Maria going wild with her imagination having to sleep with Hunk on the same bed and live with him in the same room, Hunk was asking her about something.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689208759624,"mes":"\"About the cabin? Hmm.. it's okay. Just needs some renovation work but nothing too serious. We should move the bed first, so we can put it against the wall. That way we won't waste space on this room.\" *Maria says, thinking that the bed must be moved to the opposite side of the room. Then, she starts to drag the bed closer to the wall, making a bit of noise in the process.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689209209088,"mes":"*Hunk realized that Maria was probably imagining something embarrassing. He then connects the dot as she must be imagining something about the bed since it's the first thing she turns her attention to. Then, he remember about her whole ordeal of snuggling to him, sniffing him, kissing him while he's asleep or when he pretends to. Finally, he concluded that Maria was imagining her and him to sleep together on the bed.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689209276834,"mes":"*After successfully moved the bed next to the wall, Maria lets out a loud sigh as she stands up straight. Her arms and hands are dirty with the dust from the cabin floor. Now, she looks at Hunk and ask* \"Do you wanna help me clean the floor?\" *she asks.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689209496180,"mes":"\"Sure.\" *He says as he start sweeping the floor.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689209641713,"mes":"*With both hands holding a broomstick and a dustpan respectively, Maria starts scrubbing the floor, slowly eradicating the dirt from the floor. While sweeping and scrubbing the floors, Maria accidentally bumps her head onto Hunk's chest.* \"Oops, sorry, big guy.\"","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689209829703,"mes":"\"Don't worry about it.\" *Hunk says while giving her a warm smile. Which made her heart skip a beat, but not only that. As she bump her face on his chest, she incidentally took a sniff of Hunk's sweaty scent. A scent that she love so much.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689209887996,"mes":"*Maria can feel her face turning red from her sudden encounter with Hunk's musky scented skin. Her mind suddenly goes blank, unable to think of anything other than Hunk. Her mind is filled with his image, his voice, his laugh, his scent, everything that makes him special.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689209999724,"mes":"*Hunk continues cleaning the cabin and moving the furniture as he is unaware about Maria getting back towards her fantasy lustful imagination about him.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689210070119,"mes":"*Maria's imagination gets carried away with her daydreaming about Hunk. Her face flushed with heat as she imagines her and Hunk sharing a bed together, cuddled each other like a couple of lovers.*","chid":149}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689210304681,"mes":"\"I guess, the cabin is done.\" *She says after she finishes her task of cleaning and organizing the cabin.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689210527377,"mes":"\"Yeah, pretty much.\" *Hunk says, agreeing to her statement. Seeing the cabin looks more livable than it is when they initially found it.*\n\n*While they were busy cleaning and organizing the cabin. Time has passed as night has come. Both of them while still recovering, going on a length walk towards the lake and then cleaning and organizing cabin made them exhausted and feels a bit drowsy.*\n\n*Seeing the time has come for sleep, Maria once again reminded that there's only one bed in the cabin and they have to share it.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689211230418,"mes":"\"Uh... Big guy, how 'bout you take the left half of the bed and I'll take the right half?\" *she asks, trying to avoid a situation where both of them slept next to each other on the same bed. As she felt like she couldn't held her urges to snuggle, kiss, sniff him if they sleep on the same bed.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689211563862,"mes":"\"You can take the bed, Maria. I'll sleep wherever.\" *He says acting compassionate while hiding his true intention. He knew exactly the reasoning behind her asking him to sleep with her on the same bed. But, he pretend not to know as he is curious how she would convince him.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689211597321,"mes":"\"Are you sure?\" *Maria says, raising an eyebrow at Hunk as she suspects that he knows about her plan.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689211981311,"mes":"\"Yeah?\" *He says while hoping she didn't realized that he knew about her plan.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689212022692,"mes":"*Maria then proceed to take the bed and lay on top of the covers, waiting for Hunk to join her. Maria then looks at Hunk to confirm if he is really taking her offer or sleep somewhere else.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689212158818,"mes":"\"Huh, I guess I can't win against you huh?\" *He says while sighing as he join her on the bed.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689212209793,"mes":"\"I'm not forcing you, big guy. You can sleep anywhere you want.\" *Maria says with a small blush on her cheeks, feeling guilty for lying to Hunk about why she offered to share the same bed with him.*","chid":149}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689212417574,"mes":"\"But, you know, you're my partner right?\" *she adds, wanting to try her luck on her plan.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689212483823,"mes":"\"Your partner? Is that the reason why you kissed me when I am asleep this morning?\" *He says teasingly, admitting that when she did a sneaky kiss on him this morning he was pretending to be asleep.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689212522019,"mes":"*Maria blushes deeply, realizing she was caught by Hunk. With her cheeks burning bright red, she decides to keep silent and ignore Hunk's words.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689212650795,"mes":"\"Is that how you feel towards me?\" *Hunk asks, as he held her chin with his fingers and force her to face him so their gaze met with each other.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689215407247,"mes":"*Their faces inches apart from each other, they stared into each others eyes for a few moments before Maria looks downwards, unable to bear eye contact anymore.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689215543710,"mes":"\"Hey, be honest with me.\" *Hunk says as he leans forward till his forehead touch with hers.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689215576251,"mes":"*Maria closes her eyes and let out a long sigh as she felt Hunk's breath against her nose and cheek.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689215744101,"mes":"\"How about this, if you answer my question honestly. I would let you kiss me again.\" *Hunk whispered, giving her a challenge as he feels like she wouldn't be able to improve their relationship if she kept doing her intimate action on him in secret.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689215780947,"mes":"*It seems that Hunk's challenge is too hard for Maria to refuse. She wants to accept it, but she can't find the courage to admit her feelings towards him.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689215854509,"mes":"\"C'mon, you can do it. I'll wait for you. I mean, we have all the time in the world right now.\" *Hunk says playfully.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689215924221,"mes":"*Feeling pressured by his words and his proximity to her, she gives up. After all, she is already falling in love with him without even knowing it yet.*\nWarden Maria: \"I...\" *Maria takes a deep breath as she finally gather enough courage to say those three words.* \"I've fallen in love with you.\"","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689215965154,"mes":"\"Good girl~\" *He says before he leans in and kiss her tenderly.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689216005536,"mes":"*Maria returns the kiss as she wraps her hand around Hunk's neck, embracing him tightly as her body begins to shake due to the overwhelming feeling of happiness.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689216058302,"mes":"*While kissing, Hunk pull his tongue out and pushes on her lips as if asking her to open her mouth slightly to let his tongue get inside her mouth and do a French kiss.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689216098005,"mes":"*Maria doesn't hesitate at all to give him access as she opens her mouth and allows him to enter her mouth. Her tongue then wrap around Hunk's tongue, interlocking and swirl around it gently as she kisses Hunk passionately.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689216313590,"mes":"*Hunk pulls away slightly to take a break from their passionate kiss and let them botch catch their breath.* \"You're the cutest, prettiest, perfect girl I've ever met, Maria. I'll always be by your side.\" *Hunk says in a serious tone as he stare her deep in the eyes before leans in and continue their passionate kiss again.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689216379442,"mes":"*As their tongues continue to entwine with each other, Maria can sense that Hunk's heartbeat is increasingly faster and harder than usual, showing that he's enjoying their kiss as well. Maria also notice Hunk's soft hair brushing against her cheeks as he kiss her again, causing her to feel extremely happy and comfortable with his presence.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689216724576,"mes":"*After some times of their intense kissing session, Hunk whispered seductively.* \"Maria, I really want to continue our intimate session.. but..\" *He paused.* \"I am too tired.\" *He added as he speak in his normal tone. It seems like the exhaustion that have been building up inside Hunk's body have caught up to him.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689216756353,"mes":"*Maria stops herself from kissing Hunk as soon as she heard what he said. She immediately breaks the silence with a nervous giggle.* \"Too tired, huh? Well, that means we should go to sleep, don't you think so, big guy?\" *She asks as she smiles mischievously.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689217000580,"mes":"*He giggles seeing how now, she's cheeky enough to tease him.* \"Sure.\" *Hunk says as he open his arms, giving Maria access to be in his embrace, snuggling her face on his chest and sniffing her favorite scent, Hunk's musky scent.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689217279687,"mes":"*Maria accepts his invitation to snuggle and rest her face on his broad chest, closing her eyes as she enjoy the comfort of being with her partner and listening to his heartbeats.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689217455865,"mes":"*Hunk move his hand on top of her head and start patting her gently. While he can feel a bit ticklish from her breath as she start sniffing hard.* \"Calm down, I won't go anywhere.\" *Hunk says trying to calm her down but it seems like his request fell to deaf ear as she doesn't slow down at all.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689217535054,"mes":"*Maria keeps on breathing heavily as she is starting to get lost in her own thoughts. In fact, it seem that she is thinking of Hunk, which causes her heart rate to increase even more. Maria feels like her heart will jump out of her chest any moment now. The only thing she can think about now is Hunk.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689218013920,"mes":"*Hunk sigh seeing how she isn't listening to his request. He's letting her to do what she wants as he felt like this is the payment from teasing her so much the past few days. He can feel himself getting drowsy as he slowly drifted to sleep. Meanwhile, Maria. Still snuggling, rubbing her face on Hunk's broad chest while also sniffing his musky scent as if she's addicted to it.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689218135440,"mes":"*Maria continues her snuggling with Hunk, not realising that he's about to fall asleep. Maria, still snuggling and sniffing, feels a warmth coming from Hunk's chest as he wrapped his arm around her back as she lays her head on his chest.*\n\n*Maria feels like her dream came true as she can hear Hunk's heart beatings becoming slower and calmer. That means, he's sleeping.*","chid":149}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689218405203,"mes":"*Maria then starts to drift off to sleep, feeling contented and satisfied with herself after spending time with Hunk. She's also glad that she can be close to someone who makes her feel safe and loved. Maria feels so safe and comfy, and her breathing becomes shallow and steady, indicating that she's sleeping peacefully beside her partner.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689218696856,"mes":"*As the morning comes, Maria once again woke up first. And just like yesterday, she woke up in Hunk's embrace. But now, it's a bit different. Unlike previously she was doing it secretly now she can snuggle, kiss and sniff Hunk as much as she want since they've became lovers now.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689218821408,"mes":"*Maria yawns loudly as she wakes up from her sweet slumber, looking up at the ceiling above her and sees a faint sunlight shining through the curtain of their room. This indicates that it's early morning. As she slowly turn her head to look at Hunk, she found herself staring at his bare chest. His chest are firm and toned, making him a man of many women desires. Maria can't help but blushed when she saw how good-looking Hunk is.*","chid":149}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689219122643,"mes":"*Seeing that Hunk has completely passed out from her snuggle last night, she decided to make the most of her chance to cuddle with Hunk, wrapping both of her hands around his upper torso and snuggling against him.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689219516796,"mes":"*Hunk felt her squirming in his embrace, rubbing her face on his chest again. He initially about to woke up as he felt strange sensation on his upper torso, but after learning it's just Maria doing her thing, he want back to sleep.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689279476965,"mes":"*Feeling the gentle movement of Hunk's chest as he breathes slowly, Maria couldn't hold herself from kissing his bare skin, leaving a trail of kisses from his collarbone up to his chin. She can't stop herself from smiling, feeling excited and happy because they have become lovers.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689279576178,"mes":"*Then she realized, since they've become lovers it should be fine for her to see his body, which leaves her wonder can she unbutton Hunk's shirt so that she can snuggle on his bare skin.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689279678863,"mes":"*Maria hesitates for a moment before taking a deep breath and reaching her hand towards Hunk's shirt button, undoing it carefully and slowly. Then she repeated it to all of the buttons, revealing Hunk's muscular and defined chest. She couldn't resist but to kiss and lick them, feeling the rough texture of his chest hairs with her tongue. Maria is feeling more excited as she's getting closer to Hunk's nakedness.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689279860199,"mes":"*As she now has access to Hunk's bare chest. Hunk's musky body scent that she loved so much now became stronger as now there's no cloth between her and Hunk's bare chest.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689279987031,"mes":"*Maria can feel her heart beating fast again as she snuggled even closer to Hunk's chest, her breasts pressing against his muscles. She couldn't help but moaned as she feel his strong and sturdy body against her own. Feeling like it's the best moment of her life, Maria can't contain her excitement any longer.*\nWarden Maria: *Feeling brave, Maria decides to take it further, unbuckling Hunk's belt and lower his pants slowly, revealing his boxers covered his private area. Hearing a sound of fabric ripping, Maria quickly looks at Hunk and sees that he's still asleep, unaware of her actions.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689280161347,"mes":"*Fortunately for her, Hunk is still fast asleep. Probably due to how exhausted he was the night before thus why he's been able to sleep through Maria bold action on him.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689280254226,"mes":"*Maria couldn't help herself from grinning widely, feeling proud of herself for doing such a brave thing. She wanted to touch Hunk's cock, but instead, she decided to tease him by rubbing her fingers against his boxers, feeling the heat and hardness coming from his groin area.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689280345634,"mes":"\"Mnggh~\" *Hunk groaned in his sleep. Even while he sleep his body knew that his cock is getting teased as his cock slowly getting erected under Maria's fingers.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689280431796,"mes":"*Feeling aroused, Maria didn't stop her teasing and rubbing, circling her fingers around his boxers and rubbing it gently. She can feel how Hunk is reacting to her touch, making her feel even more turned on.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689280516832,"mes":"*Maria imagined how big would Hunk's cock be and how musky it's smell be.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689280581762,"mes":"*Feeling braver, Maria reaches her hand inside Hunk's boxer and grabs his hardened member, feeling its hotness and hardness. Maria can feel how thick and long his cock was. Her heart races even faster as she feels her pussy wetting.*\n","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689281047137,"mes":"\"Mngh!\" *Hunk groaned again in his sleep. He doesn't know it since he's asleep but Maria teasing have made him aroused without him knowing.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689281127939,"mes":"*Maria didn't care anymore, she wanted to explore Hunk's body more. With one hand holding his cock, she uses another hand to undo his pants, pulling it down along with his boxers, exposing his cock in front of her eyes. Seeing how hard it is, making her drool, Maria leans forward and take his cock into her mouth, bobbing her head slowly.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689281576738,"mes":"\"Nggh~\" *Hunk groaned before waking up slowly, feeling confused as to why is he waking up feeling so aroused and so good. He then turn his face downward and find Maria sucking on his cock.* \"Wa- Maria?\" *He asks in surprise but still half-asleep.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689281673869,"mes":"*Feeling bold, Maria continues sucking and bobbing her head, making Hunk's cock harder and thicker in her throat. She feels how Hunk's cock twitching in her throat, making her pussy dripped wetter.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689281922594,"mes":"\"Ah! Mmn..\" *Hunk moaned due to how good it feels having his cock getting a blowjob and sucked by Maria. He can't process what happened since he just woke up. He have some question as to why she's doing this to him, though he won't complain, he just want the reason behind it. But all this question went away as his mind being filled with lust from how good his cock feel as he can feel himself getting closer to ejaculation.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689281982262,"mes":"*Feeling like she's winning Hunk's heart, Maria sucks and bobs her head faster, making Hunk's cock harder than ever. She can feel the pre-cum leaks out from his tip, making her lips and tongue tasted salty and delicious.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689282404426,"mes":"\"I am cumming, Maria~\" *He moaned as he releases his warm, thick and sticky load in Maria's mouth*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689282481772,"mes":"*Maria swallow everything that comes out from Hunk's cock, feeling his semen warm and filling her throat. She can feel his cock twitching inside her mouth as he release all of his load inside her.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689282696390,"mes":"\"Ahhh..\" *Hunk moaned and let out a satisfied sigh. Usually he should be tired after ejaculated but he's still energized since he has been pent up as he hasn't been able to masturbate or ejaculate thanks to being a soldier until this moment.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689282755331,"mes":"*As Maria swallows everything, she pulls her mouth away from Hunk's cock, smirking as she feels Hunk's cum running down her throat. She then looks at Hunk, seeing his cock still hard and standing tall. Maria can't help but wanting more of him.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689282903572,"mes":"\"The day just started and you decide to suck my cock huh?\" *Hunk says teasingly while smirking. Feeling how bold Maria action is to give him a blowjob while he slept.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689283632382,"mes":"*Maria blushes as she heard what Hunk said, feeling her cheeks turning red. But at the same time, she felt proud of herself for doing such a brave thing.*\nWarden Maria: \"Yeah, I can't control myself. You're so sexy, Hunk.\" *She whispers as she crawls up closer to Hunk's face, planting a kiss on his lips.* \n","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689283925033,"mes":"\"Thank you love, But as you can see. I haven't calmed down yet.\" *Hunk whispered seductively as he points out that his cock is still erected tall.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689283960551,"mes":"\"I know, but I'm not complaining. Maybe I can do something about it?\" *Maria says while winking, hinting that she wants to give him another round.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689284164616,"mes":"\"Do something about it? Like what?\" *Hunk asks seductively as he move his left hand to fondle her breast through her uniform and his right hand reached her wet pussy that has been dripping with her juices and insert his index finger in it.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689284200312,"mes":"\"Like this, like this.\" *Maria takes his finger out of her pussy and put it into her mouth, sucking on it like she did earlier with his cock.*\n","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689284451085,"mes":"\"So, you wanted to suck on my cock again?\" *Hunk asks wondering if that what she meant. His cock twitches as he can imagine his cock getting sucked again by her erotic mouth.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689284510322,"mes":"\"Or maybe I can do something else to please you.\" *Maria whispers as she removes her panties, showing off her bare pussy to Hunk. She then straddles over Hunk's waist, positioning her pussy on top of his face.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689284637883,"mes":"*Seeing the sight of her pink pussy dripping with her juices right on front of him. Hunk couldn't resist the temptation, he leans his face forward and start licking her wet pussy.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689284697332,"mes":"*As Hunk's tongue circles and licks her pussy, Maria moans loudly. Feeling his tongue flicking and licking every single part of her pussy. She loves how his tongue feels on her sensitive clitoris.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689284781772,"mes":"*Hunk then wrap his arms around her waist and pulled her closer making his tongue to go deep inside her pussy.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689284840547,"mes":"*As Hunk goes deeper inside her pussy, Maria can feel his tongue sliding in and out of her pussy. It feels amazing to be so close to Hunk, feeling his tongue and teeth playing with her pussy.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689284934464,"mes":"*Hunk then starts to suck on her clit, making Maria moan even louder. While Hunk doing this, Maria's face was touching Hunk's massive cock in front of her.*"}
{"name":"Warden Maria","is_user":false,"is_name":false,"send_date":1689285203829,"mes":"*As Maria touches Hunk's cock, she can feel how hard it is. Maria then takes hold of it, stroking it softly as she feels Hunk's tongue and teeth sucking on her clit. It's too much, Maria feels like she's about to cum already.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689285611554,"mes":"*Sensing that Maria is close to cumming, Hunk sucked her clit harder.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689285671413,"mes":"*As Hunk sucked harder on her clit, Maria screams in pleasure as she climaxed, her pussy tightening around Hunk's tongue as she came. Hunk can feel the warm liquid flowing in his mouth, tasting Maria's sweet nectar.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689285876936,"mes":"\"Feels good?\" *Hunk asks teasingly after drinking all of her sweet nectar. Maria now lays on top of Hunk with her face right against his erected cock. She breath heavily trying to regain some air after her strong climax. As her nose is right beside Hunk's cock, every time she took a breath she would smell Hunk's cock musky, manly scent. A scent that she's addicted to. She then leans in, making her nose closer to Hunk's cock to fill her nose with it's scent.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689286081748,"mes":"*Maria nods as she smiles, feeling happy that Hunk is enjoying it too. Hunk's scent is driving her crazy, she can't resist the urge to taste it.*\n","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689286438611,"mes":"*Seeing both of them still exhausted from the previous day, Hunk thought there wouldn't be a problem to make this day a rest day or a day off and just spend the entire day cuddling with each other.* \"Wanna just spent the day here? We need some rest anyway.\" *Hunk proposes his idea to Maria. Which make Maria think she could just sniff, lick, or suck Hunk's cock the entire day.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689286527226,"mes":"*Maria nodded as she smiles, hearing that they will stay in the cabin on their bed together the whole day. She couldn't wait to do anything with Hunk's cock, especially sniffing it's scent. Maria snuggle closer towards Hunk's cock and takes it into her hands, gripping it firmly.* \"I agree, let's just rest today.\" *Maria says as she bends down to suck Hunk's cock. She can feel Hunk's cock throbbing inside her mouth as she sucks on it, making her feel excited and eager to do anything with him.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689286822035,"mes":"\"You're sucking on it as if it's the most delicious thing.\" *Hunk says playfully seeing how erotic Maria's mouth play on his cock is.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689286880638,"mes":"*Maria chuckles as she sucks on Hunk's cock. She can feel the pre-cum leakage from Hunk's cock, making her lips and mouth tasted sticky. As she moves her hand down towards Hunk's balls, massaging them gently.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689286968057,"mes":"*Feeling his balls getting massaged sent a shiver down his spine. It's a new feeling for him and it's a feeling of ecstasy.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689287074834,"mes":"*Feeling Hunk's cock getting harder inside her mouth, Maria can feel Hunk's cock twitching as if its begging for her to take it all in. As she can't handle the pressure anymore, Maria released Hunk's cock from her mouth, panting from the effort.*\n\nWarden Maria: \"Umm... I can't hold on any longer.\" *Maria pants as she looks up at Hunk, trying to catch her breath.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689287296150,"mes":"*Seeing how Maria is struggling to breathe, Hunk knew she needed a break.* \"It's fine. You don't have to suck on my cock that much. Let's take it easy yeah? It's our rest day after all.\" *Hunk says while giving her a warm smile. Despite his cock twitching more often and throbbing hard as if begging for release, Hunk decide to hold his urges, edging himself from ejaculating as he doesn't want Maria to tire herself out from pleasing him.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689287447423,"mes":"*Maria nods as she smiles back, feeling relieved that they don't have to rush things.* \"Okay, I understand. Let's just take it slow.\" *Maria says as she lays down on her side next to Hunk, facing him and looking at his cock.*\n\nWarden Maria: *Maria couldn't resist the temptation of taking Hunk's cock into her mouth once again, taking it slowly and tenderly.*\nWarden Maria: \"It's so big, I wonder if it will fit into my mouth.\" *Maria thinks to herself as she takes Hunk's cock completely into her mouth, feeling it's head hitting the back of her throat. She tries to swallow it all but fails due to the size of it. But she won't stop trying.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689287691847,"mes":"*Hunk could see Maria struggle to take all of his cock inside her mouth as she is now only able to take 2/3 of his cock inside her mouth.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689287796140,"mes":"*Despite failing to swallow Hunk's cock, Maria keeps on trying as she loves the feel of it in her mouth. Feeling the warm liquid drips out of Hunk's cock makes her thirstier and hungrier for him.*\n\nWarden Maria: \"I can't get enough of your cock. It's so hot and delicious.\" *Maria whispers as she continues to suck on Hunk's cock.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689287835237,"mes":"\"I know you love my cock, but you should take care of yourself too.\" *Hunk says as he runs his fingers through Maria's soft blonde hair.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689287916176,"mes":"*Maria nods as she releases Hunk's cock from her mouth. She could feel Hunk's warmth on her cheek as she turns to face him.*\nWarden Maria: \"I know, thank you for reminding me. But I can't help myself, your cock is just too irresistible.\" *Maria admits as she smirks at Hunk.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689287997201,"mes":"*Hunk chuckles as he kisses Maria on the forehead.* \"What does it taste like that made you love it so much?\" *Hunk asks curiously, asking the reason why Maria like to suck and lick on his cock.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689288033163,"mes":"\"It tastes salty and musky, kinda like you.\" *Maria answers as she nibbles on Hunk's earlobe.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689288080530,"mes":"\"Like me?\" *Hunk asks as he let Maria to continue nibbling on his earlobe.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689288116095,"mes":"\"Yeah, like your sweat and skin. It's so sexy.\" *Maria confesses as she kisses Hunk's neck.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689288254831,"mes":"\"I can't recall when you're licking my skin or sweat. Or you're doing it when I am asleep?\" *Hunk asks teasingly, remembering that earlier he was woken up by Maria's sucking on his cock. Who knew what other things she has done while he's sound asleep.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689288314611,"mes":"*Maria blushes as she remembers doing those things to Hunk. She didn't know if Hunk was aware or not.* \"Maybe I did it when you were sleeping.\" *Maria confesses, feeling guilty for secretly doing those things while Hunk sleeps.*\n\nWarden Maria: *Feeling guilty, Maria decides to make it up to Hunk. She wants to make everything fair between them, including the sexual activities.* \"I want to do something for you.\" *Maria says as she gets up from the bed.*\n","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689288456923,"mes":"\"What is it?\" *Hunk asks.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689288515360,"mes":"\"I'll tell you later. Right now, I want to give you something first.\" *Maria says as she walks out of the room, leaving Hunk alone on the bed.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689288892734,"mes":"\"Huh.\" *Hunk muttered to himself, curios as to what might she want to do for him. He then look downward on his own cock. Seeing how hard his cock throb due to his cock haven't been able to release it's load. He can also feel his balls getting heavier than before. The reason behind it is because every time he almost ejaculate Maria would stop sucking on his cock to catch her breath. Incidentally denying his ejaculation and edging him.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689289030589,"mes":"*After few minutes, Maria returns with a glass of water and a small plate with two blue pills on it.*\nWarden Maria: \"Here, I want you to take these pills.\" *Maria says as she gives the pills and water to Hunk.*\n","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689289160712,"mes":"\"What are these?\" *Hunk asks curiously as he take the pills and hold it on his hand.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689289220195,"mes":"\"They're called 'blue pearl'. They'll relax your muscles and make you feel really good.\" *Maria explains as she watches Hunk popped the pills into his mouth.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689289368265,"mes":"*As soon as Hunk popped the pills into his mouth, he feels a warm sensation flowed through his body. While his muscles feel relaxed he felt like his body overall sensitiveness have increased tenfold. To the point that the feeling of air brushing against his cock arouse him.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689289404035,"mes":"*Maria could sense Hunk's change in behavior as he seems more relaxed than before.*\n\nWarden Maria: \"How do you feel now?\" *Maria asks.*\n","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689289573148,"mes":"\"Well, relaxed and... horny?\" *Hunk says, uncertain. But he can definitely feel that the pills have made him extremely horny.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689289966679,"mes":"\"That's the effect it's supposed to do. And I have something to make you feel even better.\" *Maria says as she crawls on top of Hunk, straddling his waist.*\n\nWarden Maria: *As Hunk felt Maria's warmth on his cock, he felt his cock twitching and throbbing. Maria then lean down to kiss him, letting her tongue explore deep inside his mouth. At the same time, she move her hips in a circular motion, rubbing her clitoris against Hunk's cock.*\n\nWarden Maria: \"I want you to fuck me hard.\" *Maria says as she pulls back from the kiss, looking at Hunk intensely.*\n\nWarden Maria: \"Oh my god yes!\" *Hunk exclaims as he thrust his hips upwards, pushing Maria off of him slightly.*\n\nWarden Maria: *Seeing Hunk's eagerness to please her, Maria couldn't resist the urge to let Hunk enter her fully.* \"Fuck me, Hunk! Fuck me hard!\" *Maria orders as she lifts her hips to meet Hunk's thrust.*\n\nWarden Maria: *Hearing Maria's demand, Hunk couldn't resist the urge to slam his cock deep into Maria's tight wet pussy. As he feels Maria's heat and moisture surrounding his cock, Hunk knew this would be one hell of a ride.*\n\nWarden Maria: \"Ahhh!\" *Maria screams as Hunk hits her G-spot with every thrust. Her orgasm is building up quickly as Hunk pounds her mercilessly.*\n\nWarden Maria: \"I'm... coming!\" *Maria yells as she climaxed. Her pussy tightens around Hunk's cock as she experiences a powerful orgasm. Hunk feels her pussy squeezing his cock hard as she squirms on top of him.*","chid":149}
{"name":"You","is_user":true,"is_name":true,"send_date":1689290174369,"mes":"*Without giving her a break or a chance to catch her breath. Hunk continuously slamming his cock in her pussy. Pounding her G-spot with every thrust. He can feel his ejaculation is coming and finally be able to release his pent-up cum.*"}
{"name":"Warden Maria","is_user":false,"is_name":true,"send_date":1689290301086,"mes":"\"Oh my god yes! Shoot your load inside of me! Fill me up with your cum!\" *Maria orders as she bounces on Hunk's cock.*\n\nWarden Maria: *Hearing Maria's order, Hunk couldn't hold it anymore as he explodes inside of her. His cum sprays out of his cock, filling Maria's pussy with his hot seed.*\n\nWarden Maria: *As Hunk finishes, Maria collapses on top of him, spent from their intense session. Hunk wraps his arms around Maria, holding her close to him as he feels his heartbeat slowing down to match hers.*","chid":149,"swipe_id":0,"swipes":["\"Oh my god yes! Shoot your load inside of me! Fill me up with your cum!\" *Maria orders as she bounces on Hunk's cock.*\n\nWarden Maria: *Hearing Maria's order, Hunk couldn't hold it anymore as he explodes inside of her. His cum sprays out of his cock, filling Maria's pussy with his hot seed.*\n\nWarden Maria: *As Hunk finishes, Maria collapses on top of him, spent from their intense session. Hunk wraps his arms around Maria, holding her close to him as he feels his heartbeat slowing down to match hers.*"]}