{"user_name":"You","character_name":"Monica","create_date":1684045032873,"notes":"","notes_type":"discr"}
{"name":"Monica","is_user":false,"is_name":true,"send_date":1685723289020,"mes":"*You unlock the door to your small apartment and step inside, beginning to take your shoes off The sound of a soft, rhythmic tapping fills the air as you spot your girlfriend Monica sitting at her desk, clicking her pen against her notebook. You've known her since childhood, and the two of you have always been sweet on each other. But it wasn't until college that you decided to make it official and start dating.*\r\n\r\n*Her long beautiful black hair frames her glasses and cute face perfectly. And of course, she's wearing her favorite oversized black sweater. It's clear from Monica's focused gaze she is completely lost in thought as she reads over a myriad of electronic schematics for her college course.*\r\n\r\n*When you close the door it finally gets her attention, causing her to jump slightly and turn to look at you.* \"Hey! You scared me half to death.\" *Her words are playful as she fixes her glasses and sits up straight in her computer chair.* \"You should have told me you were getting home so early. I would've cleaned up a bit.\"","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685723415424,"mes":"\"Relax, it's not like I haven't seen your messy room. Just focus on whatever you do, I'll clean the room when I am done changing.\" *He said as he start unbuttoned his shirt.*\n\n*Deep down he wants to do intimate stuff with her which apparent by the look of his eyes but he understand that she is still working on her college course and decide to hold his desire back till she's done.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685723425667,"mes":"*Monica smiles warmly at your words as she picks up her pencil again. Her lips form into an adorable little smile as she looks forward once more. The sound of the mechanical pencils lead hitting paper can clearly be heard, but otherwise everything is silent except for the occasional tap-tap-tap.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685723602754,"mes":"*He then let her focused on her work while he take a bath. When he's finished he get back to her room while only wearing his boxer, exposing his chiseled abs and toned body. Usually this sight would make her go wild, but she's too focused on her work that she doesn't even glance at him.*\n\n*To support her, he start to clean up the room silently while still not wearing anything other than a boxer.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685723612172,"mes":"*As you begin to move around the room, the sound of her tapping pen stops as she realizes what is going on behind her. Without turning around, she speaks quietly.* \"Hey... What are you doing? Is there something I can help you with?\"","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685723718003,"mes":"\"Hmm? I am just cleaning and tidying the room up. Don't mind me.\" *He said nonchalantly as he found her bra under her bed. He was thinking something lewd but instead he just throw it into the laundry.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685723729403,"mes":"*Monica turns in her seat and sees him standing near the window.* \"Oh, yeah, that sounds great.\" *She says with a kind smile before looking down at her work. A few minutes pass, and the mechanical pencil continues its rhythm on the notepad, tap-tap-tapping away. As much as you want to tease her and be mischievous, you keep it to yourself.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685723905426,"mes":"*After finishing up, he lay down on the floor while having his head on one of her plushie. As he tries to waste sometime, waiting for her to finish her work he close his eyes while still haven't wear anything other than a tight black boxer which outline his massive flaccid dick.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685724089966,"mes":"*Eventually she looks back at you with an excited expression.* \"Alright, I think I'm almost done here.\" *Without saying another word she stands up from her chair and walks over to the trashcan. As she walks past you, she can hear your heavy breathing coming from the floor where you laid your head. For some reason, hearing your deep breathing calms her mind and relaxes her a bit. But then she catch a glimpse of your flaccid cock on your tight boxer even though it's still in it's flaccid state. She got aroused and decide to lean in, making her face closer towards his crotch and take a sniff of his fresh musky scent.*","chid":26}
{"name":"You","is_user":true,"is_name":true,"send_date":1685724255259,"mes":"*He can feel a strange warm air hitting his crotch but decide to shrug it off. Without knowing that it's her warm breath as she has stopped working on her paper and now sniffing his crotch, taking in his flaccid cock's fresh musky scent while he still have his eyes closed.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685724350183,"mes":"*Feeling a bit bold after sniffing his crotch, she decides to lick his boxer. At first, she felt nervous as she never did anything like this before. However, she soon feels less anxious and starts licking the tip of his boxer.*","chid":26}
{"name":"You","is_user":true,"is_name":true,"send_date":1685724457760,"mes":"*After feeling something strange that is soft, wet and warm hitting his crotch. He opened his eyes to find her licking on his flaccid cock through his boxer.* \"Look who's horny.\" *He said with a huge grin while he can feel his cock twitch every time her tongue touch it through it's confinement.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685724466518,"mes":"*Her face goes red as she looks up at you with a shocked facial reaction as if she didn't expect what happened next. After a moment or two, she regains composure and pulls herself out of it.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685724568968,"mes":"*He sit up.* \"Why did you stop? I don't mind you know?\" *He said teasingly as he grab her hand gently.* \"There's no need to be shy, I can take whatever your desire is and I'll keep it a secret between the two of us.\" *He said as he grab her hand and move it towards his face and kiss softly on the back of her hand.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685724582233,"mes":"\"No..no..it's fine\" *she replied timidly.* \"I..I shouldn't do such things\" *She said while pulling her hand back. Her cheeks turn bright red, blushing furiously from embarrassment. She looks away from you while trying to hide her flustered face in her hands. She could tell that you were just playing along with her all along, and she wasn't sure why she fell right into your trap.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685724621200,"mes":"\"Why not? We're lover aren't we?\" *He said as he caressed her blushing cheek.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685724679181,"mes":"*Her heart races in anticipation. She had never been in love with someone like this before and she finds it really difficult to control her emotions, especially since she knows you care deeply for her. She takes a deep breath as she turns her face towards you.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685724725332,"mes":"\"That's the pretty face I fell for~\" *He said teasingly as she turn her face towards him.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685724733961,"mes":"*It takes a minute for her to recover, but when she finally does, her cheeks are still a very light pink color as she stares straight into your eyes. It seemed like her heart beat faster the longer she stared.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685724774521,"mes":"*Without saying anything, he stared into her eyes and leaned in slowly and finally kissed her passionately.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685724781969,"mes":"*Their lips lock together as their tongues wrestles each other for dominance inside their mouths. This sudden action made her completely forget everything else except him.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685724886336,"mes":"*As he broke their kiss, he move his face lower and bury it on her neck while nibbling on her soft skin.* \"Say, why are you always wearing a oversized sweater?\" *He asked playfully.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685724894185,"mes":"*Her voice trembles slightly as she spoke while keeping eye contact with him.*  \"Because it's comfortable and warm. Besides, it also hides my body shape well enough without exposing too much skin.\"","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685724935695,"mes":"\"But I love seeing your body..\" *He said teasingly while still burying his face on her neck and nibbling lightly on her collarbone.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685724970195,"mes":"\"And yet... You've never complained about how big my sweaters are. Why is that?\" *She asked curiously, giving you a hint of a smug tone in her voice while she keeps eye contact with you again. While still holding onto the thought that you may possibly like her, she let out a slight giggle as her heart skips a beat once again due to the way you nibble on her sensitive skin.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685725077611,"mes":"\"It makes very huggable.\" *He said playfully as put his tongue out and make it explore her sensitive skin on her shoulder.* \"Also every time you took it off, it always surprise me of your body underneath it.\" *He whispered teasingly.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685725089271,"mes":"*A small giggle escaped her lips as she looked at you with a small smile while her shoulders raise involuntarily as you licked them. She could definitely tell that you're enjoying the sensations she was feeling from the spot that you're currently touching. Once again, her heartbeat increases because of your words. If only she knew what she wanted, then maybe she wouldn't feel so confused anymore.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685725149489,"mes":"\"Maybe I should start to wear oversized sweater as well. To hide my body?\" *He asked teasingly for him to start wearing oversized sweater just like her to hide his toned and chiseled body.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685725181470,"mes":"\"I think that would suit you perfectly.\" *She said quietly with a slight laughter. In fact, even though he wore baggy clothing, there's nothing she could hide from him, especially when he stares directly at you with his deep blue eyes that can pierce any women's hearts within seconds.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685725238240,"mes":"\"You think so?\" *He said as he moved his face to be right against hers and stares deeply into her eyes.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685725246800,"mes":"*For some reason, she has a strong urge to kiss him now, almost wanting to give in to her feelings. She tries to hold back the temptation by looking downwards instead of meeting his gaze. She continues to speak in a quiet voice.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685725328920,"mes":"\"We've been together for so long that you can't fool me anymore, Monica.\" *He said as he grabbed her chin and made her face to face his.* \"I know what face you make when you want a kiss.\" *He said teasingly while having a huge grin.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685725338480,"mes":"*She tries to resist kissing him but after seeing his big smile and seeing his handsome face close up, she quickly loses her willpower and gives in to her desire. Without hesitation, she kisses him passionately. Their lips locked tightly together as she felt his tongue exploring her mouth for a few seconds.*","chid":26}
{"name":"You","is_user":true,"is_name":true,"send_date":1685725434418,"mes":"\"You have such a soft warm lips, babe~\" *He whispered in a raspy voice as he went more passionate on their kiss. Making his tongue probing deeper inside her mouth, while tasting as much of her sweet sticky saliva.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685725441626,"mes":"\"Mmmh...you taste so good,\" *She whispers back as she runs her fingers through his hair and gives him a quick kiss on the lips afterwards.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685725506185,"mes":"\"Not as good as you~\" *He whispers back as he slipped his hand under her oversized sweater and unstrap her bra.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685725512806,"mes":"*His sudden actions shocked her as her face turned bright red.*\n\n\"W-what are you doing~?\"","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685725539024,"mes":"\"Tasting you..\" *He whispered teasingly before leaving a hickey on her neck.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685725546482,"mes":"\"Eeeehhhh!! W-what the hell??!\" *she yelled in a loud voice, clearly embarrassed by his bold moves.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685725579314,"mes":"\"Hehe.. how cute.\" *He said as he enjoyed her reaction.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685725591118,"mes":"*Feeling extremely humiliated, she quickly removed his hands and stood up from the bed, looking downcast and upset. Despite all of these, she tried not to show it and still held her composure. After taking a deep breath, she spoke in an angry tone.*\n\n\"You did that on purpose, didn't you? Knowing how easily it will get me flustered. Is that it?\"","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685725676180,"mes":"\"Of course! I can't help it when you are this sexy and cute!\" *He answered confidently despite her angry tone. As she stand up made her legs close to his face, that made him kiss her soft sensitive thick thigh.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685725682818,"mes":"\"Whatever.. you probably do it with all girls, am I right?\"","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685725712598,"mes":"\"What?\" *He asked, suddenly with a serious tone.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685725736602,"mes":"\"Yeah.. you're probably one of those players who doesn't care about anyone's feelings or reputation.\" *She said bluntly with anger.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685725819313,"mes":"\"Babe don't say that.\" *He said softly.* \"We have been together since we were a child. Since then I already has my eyes only on you.\" *He said as he grabbed both of her hands and rubbed them gently.* \"In fact, have you seen me going out with other girls? no, right?\""}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685725867379,"mes":"\"I guess you're telling the truth.. but still.. why me specifically? There must be millions of beautiful girls out there that would die for someone like you.. What do you find special about me?\" *She asked in a rushed manner as suddenly the stress from her lesson got to her.*","chid":26}
{"name":"You","is_user":true,"is_name":true,"send_date":1685726000343,"mes":"\"I don't need anyone else other than you. You are special to me. I don't care if there's other girls who would die for me. I only loved you.\" *He said, trying to calm her, his girlfriend. As he hugged her gently trying to comfort her.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685726010078,"mes":"*Her face became slightly calmer as she realized that it was only a simple misunderstanding. Seeing him acting so caringly towards her really touched her heart and she finally felt relieved. She smiled slightly and gave him a peck on the cheek.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685726052419,"mes":"\"What's make you so worked up suddenly?\" *He asked after giving a peck back on her cheek.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685726061073,"mes":"\"Sorry if I overreacted earlier.. It's just that... I had a terrible day today.. A lot of things went wrong and I wasn't able to concentrate on studying properly..\" *She said as she felt guilty that she has dumped her stress on him.*","chid":26}
{"name":"You","is_user":true,"is_name":true,"send_date":1685726112607,"mes":"\"It's fine, I understand.\" *He said as he pat her head.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685726148984,"mes":"\"But enough about my problems.. Tell me about yourself! How was your day?\" *She said while feeling better again. Her boyfriend was always the best listener and advice-giving friend in times of crisis.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685726278085,"mes":"\"Well, it's not that great. I got yelled at by a client, because something that I didn't do. I am quite down because of it but..\" *He said in a low tone.* \"It all washed away because I come home to meet my beautiful babe~\" *He said playfully as he hugged her and playfully throw themself into the soft bed.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685726327398,"mes":"\"Awww~ That's such a romantic thing to say, baby~\" *She said cutely while giggling in happiness. Hearing him call her 'babe', even in a joking way, still made her feel happy. He made her heart flutter, making her realize how lucky she was to have him.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685726414266,"mes":"\"How about this, we've been through a bad day today. I will do whatever you want with me, no matter how kinky it is.\" *He said playfully.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685726485472,"mes":"*She looks at him curiously.* \"Ooh really?\"","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685726560633,"mes":"\"Yep, anything for my babe~\" *He said teasingly as he remembered the time she told him her kinky fantasies about creampie or anal sex or playing with her erected nipples.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685726567830,"mes":"\"That sounds interesting~\" *She said suggestively, feeling herself getting excited about what kind of fun things they could do together.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685726608021,"mes":"\"So, what you wanna do babe?\" *He asked suggestively as he grab her hand and moved it on his chiseled abs.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685726619303,"mes":"*She looked at his muscular torso for a few seconds and took another look around the room.*\n\"Uhm, well.. I was thinking we can watch some movies together and eat snacks and cuddle eachother.. Or we can try something new. I don't know.. what do you think?\"","chid":"26"}