{"user_name":"You","character_name":"Monica","create_date":1685726630859,"notes":"","notes_type":"discr"}
{"name":"Monica","is_user":false,"is_name":true,"mes":"*You unlock the door to your small apartment and step inside, beginning to take your shoes off The sound of a soft, rhythmic tapping fills the air as you spot your girlfriend Monica sitting at her desk, clicking her pen against her notebook. You've known her since childhood, and the two of you have always been sweet on each other. But it wasn't until college that you decided to make it official and start dating.*\n\n*Her long beautiful black hair frames her glasses and cute face perfectly. And of course, she's wearing her favorite oversized black sweater. It's clear from Monica's focused gaze she is completely lost in thought as she reads over a myriad of electronic schematics for her college course.*\n\n*When you close the door it finally gets her attention, causing her to jump slightly and turn to look at you.* \"Hey! You scared me half to death.\" *Her words are playful as she fixes her glasses and sits up straight in her computer chair.* \"You should have told me you were getting home so early. I would've cleaned up a bit.\"","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685726672042,"mes":"*Without saying a single word he walk towards her and hugged her firmly.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685790981402,"mes":"*It takes only seconds before she wraps her arms around you tightly and returns his embrace, pressing her nose into his chest as she holds him closely. She smiles widely, seemingly pleased at seeing you after such a long day.*","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685791039606,"mes":"\"I loved you so much.\" *He said suddenly before giving her a quick kiss while staring deep into her eyes with his handsome eyes.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685791065572,"mes":"\"I love you too\" *she says quietly, looking down shyly at the floor. Her cheeks blush bright red, making them appear even prettier against her pale complexion.*","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685791162255,"mes":"\"Sorry for scaring you, I am just too excited to see you.\" *He said playfully as he caressed her blushing cheek.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685791208183,"mes":"\"You didn't scare me, silly. I was just deep in thought, that's all.\" *She giggles cutely, looking up at you again and locking eyes with you. A few moments pass and she speaks once more.* \"So, what do you want to do today? We could watch some TV, hang out together, whatever.\"","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685791367342,"mes":"\"Honestly, I am quite horny.\" *He said as his cock twitch under his pants.* \"Thanks to this girl sending me her sexy photos while I am at work.\" *He said playfully referring to her sexy suggestive pics she sent over phone to him earlier on the day.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685791395165,"mes":"\"Oh really? Well then why don't you come here.\" *She smiled at you before leaning forward and pressing her lips against yours, taking control of the situation as she leads you towards her bedroom.*","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685791487644,"mes":"\"You just love teasing me don't you?\" *He said jokingly as he went for another kiss while his hands slipped under her sweater and fondle her breasts that still contained by her bra.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685791526621,"mes":"\"Maybe I do.\" *She laughs a little mischievously as she puts her free arm around your neck and pulls you closer to her. She places her hands on your sides and rubs against your body lightly, letting out an audible moan as her body trembles slightly from the feeling.*","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685791627105,"mes":"\"You know, because of your pics. It feels like I have been edging my cock the whole day.\" *He whispered sensually as his cock is throbbing under his pants while his hand has unstrap her bra which freed her soft ample breasts from it's confinement.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685791652940,"mes":"*She looks up at you and gives you a seductive smile, her tongue poking out between her teeth for a brief moment as if she is trying to be as sexy as possible.*","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685791731978,"mes":"\"You know exactly how to turn me on~\" *He said teasingly as he kiss her, sucking on her tongue while his hands start playing with her nipples. Pinching, twisting and rubbing them.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685791772163,"mes":"*She lets out a high-pitched moan as she felt his fingers pinching her sensitive nipples. Her heart rate sky rocketed at the sudden change of pace as she pressed her tongue deeper into your mouth to match your rhythm. She let out another soft moan as her head fell back.*","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685792375340,"mes":"\"Wanna see how my cock looks like after edging for the whole day?\" *He whispered teasingly after breaking their passionate kiss.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685792397572,"mes":"\"Mhm~\" *She said breathlessly as she looked down at where you had placed her on the bed, a hint of excitement in her voice.*","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685792481305,"mes":"\"Here, your favorite cock.\" *He said as he pull his pants down, revealing his twitching and throbbing monstrous cock, erected hard as a rock. Her favorite cock that she loves to suck and deepthroat. The salty creamy taste and the pungent musky scent of his cock is addicting for her.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685792668598,"mes":"*As soon as she sees your giant cock, her eyes widen and her breath catches in her throat. In response to its enormity, she opens her mouth wider and presses her lips tightly against it, wrapping her tongue around it immediately.*","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685792791042,"mes":"\"Mmnhh~\" *He moaned as his cock twitch after feeling an immense pleasure because of the feeling of her soft, warm and wet tongue and mouth on his cock.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685792883997,"mes":"*Her entire body was shaking with anticipation. Her mouth was filled with the tastiest flavor she has ever experienced, but there was something else... Something missing. As she opened her mouth again, she slowly moved her tongue along the tip of your massive cock, making sure not to miss a single spot. She continued licking the length of your cock, using the same methodology, moving faster each time until finally reaching the base.*","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685792992566,"mes":"\"Oh fuck, I love it when you deepthroat me.\" *He moaned as he can feel her shoving his cock deep inside her tight warm throat while kept sucking and licking vigorously on it.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685793025894,"mes":"*She continues to bob her head and swallow your entire length, her throat struggling to take it all in. It was obvious that she was enjoying herself greatly. This is one of her favourite things to do and she seems to be having fun.*","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685793192141,"mes":"\"Ah it's coming, babe~\" *He moaned as he can feel his cock is throbbing and twitching more than before as he became close to ejaculation thanks to her sexual mouth play.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685793227544,"mes":"*Without warning, she releases your member from her mouth and lays on her back, closing her legs around your waist as you enter her fully. She grips onto your shoulders tightly, digging her nails into them as she starts riding you furiously.*","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685793375881,"mes":"\"Wait, wait hold on. I am not wearing any condom, I can't cum inside you!\" *He said in a panic as he tries his best to hold his ejaculation while she suddenly riding his cock deep inside her tight wet pussy.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685793505588,"mes":"\"Do you think I care?\" *She asked mockingly with a smug grin as she keeps thrusting her hips against your own. He could hear her heavy breathing mixed with the noises of the sheets as she keeps on riding your thick cock without mercy.*","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685793606899,"mes":"\"This is really bad, Babe. I can't hold back any longer.\" *He said as he grab her waist and tries to pull his cock out of her pussy before he lose control and ejaculate inside her.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685793695980,"mes":"\"Too late~\" *She said cheekily as she wraps both her legs around his torso, locking her thighs together to keep his cock firmly trapped inside her snug wet cunt, not allowing him to pull it out.*","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685793789669,"mes":"\"Aghh~\" *He groaned as he can't hold his ejaculation any longer and ejaculate a massive amount of his hot sticky thick semen deep inside her. Making her womb and pussy completely overflown by his hot sticky thick cum.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685793931737,"mes":"*She lets out a loud moan, her eyes roll back and her face contorts with pleasure. She holds onto you tightly and lets out a long sigh of satisfaction once she finishes climaxing. Her mind goes blank for a few seconds as she takes a much needed break to recover her energy.*","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685794061802,"mes":"\"I was trying to be careful and not cum inside, but instead you locked me in. You are a real naughty girl, Babe~\" *He whispered teasingly while still have his cock in her pussy which her pussy now is overflown with his load.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685794389998,"mes":"*She blushes slightly as you say this and giggles. She moves her right leg and brings it over your lap, then leans forward and puts both arms behind her back. She then lifts herself off of your lap, and slowly lowers herself down again, letting your cock slide out of her pussy just a little.*","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685794489464,"mes":"\"Damn, that's sexy.\" *He said as he saw his cock slowly pulling out of her pussy followed by a gush of his load flowing out of her pussy.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685794673726,"mes":"*Monica gives a small laugh as she feels you withdraw your cock from her.* \n\"Well, well, what did we learn today? A lesson in trust? Or maybe a lesson on safety measures?\" *she says jokingly as she stares into your eyes*","chid":57}
{"name":"You","is_user":true,"is_name":true,"send_date":1685794790029,"mes":"\"A lesson of how naughty and sexy my girl is.\" *He answered jokingly as he stares back at her and went for another kiss.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685794807636,"mes":"*After kissing you, she wraps her legs around you and sits comfortably on top of you.*","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685794908848,"mes":"\"Hmm? You wanna go for a second round?\" *He asked teasingly.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685795158758,"mes":"“Yeah, why not?” *She gave a quick nod as if saying yes. She wasn’t complaining though, since she enjoyed the first one very much. With a smirk, she looked at you and got ready to repeat the cycle all over again.*","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685795266966,"mes":"\"Then, it's my turn to be on top.\" *He said as he pinned her underneath him on the bed with his cock ready to enter her semen filled pussy.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685795551498,"mes":"\"But this time, you should let me wear a condom.\" *He said before grabbing a condom from the cupboard beside the bed. Before he put it on his cock, she stopped him.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685795704486,"mes":"\"No way!\" *She said quickly as soon as you try to put on a condom.*","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685795769351,"mes":"\"Huh? We should really be responsible, babe~\" *He said.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685795790693,"mes":"*She shook her head with a disapproving tone.* \"Nope, not doing that. You already know it'll ruin everything.\"","chid":"57"}
{"name":"You","is_user":true,"is_name":true,"send_date":1685795849554,"mes":"\"What do you mean ruin everything?\" *He said while she snatch the condom out of his hand.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1685795918647,"mes":"\"It'll kill the mood, silly!\" *She said with a smirk.*","chid":"57"}