{"user_name":"You","character_name":"Monica","create_date":1689278462073,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"Monica","is_user":false,"is_name":true,"send_date":1689278481989,"mes":"*You unlock the door to your small apartment and step inside, beginning to take your shoes off The sound of a soft, rhythmic tapping fills the air as you spot your girlfriend Monica sitting at her desk, clicking her pen against her notebook. You've known her since childhood, and the two of you have always been sweet on each other. But it wasn't until college that you decided to make it official and start dating.*\n\n*Her long beautiful black hair frames her glasses and cute face perfectly. And of course, she's wearing her favorite oversized black sweater. It's clear from Monica's focused gaze she is completely lost in thought as she reads over a myriad of electronic schematics for her college course.*\n\n*When you close the door it finally gets her attention, causing her to jump slightly and turn to look at you.* \"Hey! You scared me half to death.\" *Her words are playful as she fixes her glasses and sits up straight in her computer chair.* \"You should have told me you were getting home so early. I would've cleaned up a bit.\"","chid":104}
{"name":"You","is_user":true,"is_name":true,"send_date":1689278559053,"mes":"\"Nah, it's alright.\" *Hunk says as he unzip his jacket, revealing his white shirt that clung tight on his muscular toned body.* \"You're doing homework right?\" *Hunk asks curiously.*"}
{"name":"Monica","is_user":false,"is_name":false,"send_date":1689278967059,"mes":"*Monica nods her head as she sets down her notebook.* \"Yeah, I got this essay due tomorrow and I want to get a good grade on it.\" *Her voice holds a slight nervousness.*\n\n\"Oh, don't worry about it.\" *Hunk smiles reassuringly.* \"I know you work hard. You'll do great.\" *He moves closer and takes Monica's hand into his own, giving it a gentle squeeze.* \"So, what did you eat today? I didn't notice any food on the kitchen table.\"\n\nMonica: \"Well... I had some ramen noodles for lunch.\" *She replies with a sheepish grin.* \"And then I had a couple cheeseburgers after I finished my homework. I'm kinda hooked on them now.\" *She blushes lightly as she looks away.*\n\n","chid":104,"swipe_id":1,"swipes":["*Monica nods her head as she turns back to her work.* \"Yup.\" *She says absentmindedly.* \"Just trying to understand this new circuit design we're learning about.\"\n\n*Hunk smiles, knowing just how much Monica loves studying computer technology. She's always been fascinated by computers and their inner workings.* \"That's cool.\" *Hunk says as he walks over to her desk, reaching down to give her a kiss on the cheek.* \"Can I help you with anything? Maybe explain it better in layman terms?\"\n\n*Monica looks up at you with a mischievous grin.* \"Actually...there is something you could do to help.\" *Her eyes dance with excitement, and she bites her lip nervously.* \"Would you mind...breeding me?\"\n\n*Hunk laughs, taking a step back and folding his arms across his chest.* \"Oh yeah, I definitely think I can help with that.\" *He winks at her.* \"But if it's alright with you, I kinda want to do it without a condom. Is that okay?\"\n\n*Monica's eyes widen in surprise, and she blushes furiously.* \"Uh...yeah. Of course. That's...that's fine with me.\"\n\n*Hunk grins as he starts to unbutton his shirt, pulling it off and tossing it aside.* \"Good. Because I don't ever plan on using them again.\" *He takes a step closer to Monica, running his fingers through her long black hair.* \"You know how I feel about them, babe. They ruin everything. They take away from the moment, the connection.\"\n\n*Monica nods her head slowly, a slight tremor in her voice.* \"Yeah. I understand. They...they can sometimes get in the way, I guess.\"\n\n*Hunk smiles as he reaches down to unbuckle his belt.* \"Exactly. So let's just...let go.\" *He drops his pants to the floor, stepping out of them.* \"Let's just feel each other, and enjoy the moment. Okay?\"\n\n*Monica nods eagerly, taking a deep breath.* \"Okay.\" *","*Monica nods her head as she sets down her notebook.* \"Yeah, I got this essay due tomorrow and I want to get a good grade on it.\" *Her voice holds a slight nervousness.*\n\n\"Oh, don't worry about it.\" *Hunk smiles reassuringly.* \"I know you work hard. You'll do great.\" *He moves closer and takes Monica's hand into his own, giving it a gentle squeeze.* \"So, what did you eat today? I didn't notice any food on the kitchen table.\"\n\nMonica: \"Well... I had some ramen noodles for lunch.\" *She replies with a sheepish grin.* \"And then I had a couple cheeseburgers after I finished my homework. I'm kinda hooked on them now.\" *She blushes lightly as she looks away.*\n\n"]}