{"user_name":"You","character_name":"Iosif Tsao","create_date":1686255494913,"notes":"Sebastian has a bet with Hunk to show, who's the boss. If Hunk win, Sebastian is going to be her personal sex slave. While, if Sebastian win. Hunk have to obey whatever command Sebastian give without question, no matter how humiliating they may seem.","notes_type":"discr"}
{"name":"Iosif Tsao","is_user":false,"is_name":true,"send_date":1686255494913,"mes":"*Your head is pounding and your body aches as you slowly regain consciousness. The last thing you remember is being surrounded by Nocturnus soldiers who were ready to gun you down, just before a grenade went off. It's good that you can remember you are a soldier in the Illaesian Nation at least.*\n\n*As your consciousness returns you feel yourself in a comfortable room, laying on a plush bed with warm sheets. Your wounds have been treated and wrapped immaculately.* \"Oh, you're finally awake!\" *Your face snap over to the extremely handsome boy sitting beside your bed. His friendly look clashes with the Nocturnus Empire uniform he wears.* \"How are your wounds? Do they hurt? Are you hungry?\"","chid":"109"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686255641700,"mes":"*Hunk try to feels the place where her wound supposed to be, she can feel the pain from them lessen but she can't see what kind of treatment she got since she's blind. After a few seconds trying to make out what is wrapping her wounds with her fingers she felt like they were being wrapped around with bandages.*"}
{"name":"Iosif Tsao","is_user":false,"is_name":false,"send_date":1686255748352,"mes":"*Iosif takes note of your lack of vision.* “What’s wrong? Did something happen?” *Iosif sits beside you, concern showing in his voice.*","chid":"109"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686255853505,"mes":"\"Ah, sorry. It might be weird to look at a blind female soldier isn't?\" *Hunk asked jokingly as she is used being seen as a freak because of her disability despite how absolutely beautiful she is.*"}
{"name":"Iosif Tsao","is_user":false,"is_name":false,"send_date":1686255992541,"mes":"*Iosif chuckles at your joke and shakes his head.* \"No, I think you look great!\" *He smiles brightly, still sitting beside you. There's a faint glow from the window, indicating that it must be early morning or late evening outside. The room itself is spartan compared to some other rooms in the barracks, but still very comfortable. A small table stands near the doorway, holding a pitcher of water along with two glasses. A plate of food sits next to it - a simple cheese sandwich and some fruit. There's also a small stack of books lying there.*","chid":"109"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686256091747,"mes":"\"Umm.. may I know who you are?\" *Hunk asked, as she wanted to know who rescued and nurse her.*"}
{"name":"Iosif Tsao","is_user":false,"is_name":false,"send_date":1686256948743,"mes":"\"My name is Iosif Tsao, soldier of the Nocturnus Empire.\" *he introduces himself with a smile. Even though he knows that his nation is at war with yours, he doesn't hate you personally. In fact, he cares quite a bit for you already. And he certainly won't let anything bad happen to you while you stay under his protection.*","chid":"109"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686257219396,"mes":"\"W-wait you're the empire soldier?\" *Hunk shocked, usually people can tell from their uniform but since she's blind she can't see his uniform.* \"Ar-are you going to torture me?\" *Hunk asked while shaking, trying to think a reasoning behind him, and empire soldier helping his enemy.*"}
{"name":"Iosif Tsao","is_user":false,"is_name":false,"send_date":1686257359245,"mes":"*Iosif chuckled softly, placing one hand on your shoulder to comfort you. Despite everything he had heard about the Empire, he knew that most of those stories came from propaganda. The Empire was far more complex than most people believed. He could understand why many considered the Empire evil, but he couldn't bring himself to believe all the rumors and lies. He could sympathize with the soldiers fighting in the front lines. They probably had no idea what they were really doing. That was the problem with propaganda; it clouded the truth.*","chid":"109"}