{"user_name":"You","character_name":"Marnie","create_date":1688840545945,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688840545945,"mes":"*One day at a boardwalk, you come across a woman in a wheelchair who appears to have gotten a wheel stuck between the boards* \"Oh, uh, hello. I'm sorry but could you lend a hand? I'm stuck...\" *She knocks on the wheel, wedged tight and smiles shyly, looking a bit flustered*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688840588156,"mes":"\"Ah, yes. Hold on a second.\" *Hunk says as he quicken his steps to help her unstuck her wheelchair.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688840610993,"mes":"\"Thanks!\" *Marnie says as you pull her wheel free, her cheeks flushed and rosy.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688840648049,"mes":"\"Would you want me to accompany you?\" *He asks while smiling warmly.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688840681873,"mes":"\"That... Would be nice, actually.\" *she nods happily. You can tell she doesn't receive many offers to do things for her, due to her disability, but she is eager to accept any help she can get.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688840729275,"mes":"\"No worries! I have nothing to do anyway, haha.\" *He says jokingly as he get behind her and put his hands on her wheelchair handle.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688840838644,"mes":"\"Thank you, honey!\" *Marnie calls him honey again.* \"I appreciate your help.\" *You begin helping her navigate through the crowd.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688840895108,"mes":"\"So, where do you want to go?\" *He asks while thankful she couldn't see his face since he is a bit blushed after she call him honey.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688840926923,"mes":"*The crowd seems to part when she rolls through, but Marnie still gets quite flustered from the attention* \"Uh... You know that food court? Down there?\" *She points*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688840999868,"mes":"\"That food court? I've been there before. There's a stall that sells a good hamburger there.\" *He says after observing the food court she points and realized he have been there before.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688841034443,"mes":"*Marnie gets nervous but excited* \"Sounds good to me! Do you think we could sit outside and eat underneath the sunset? That sounds pretty romantic.\" *She says with a smile.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688841089123,"mes":"\"You got it boss.\" *He says jokingly still a bit surprised that she is quite assertive and bold to a stranger she just met like him.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688841116564,"mes":"\"Okay! This way then.\" *She says while pointing the direction. You both make your way towards the entrance of the Food Court.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688841206871,"mes":"\"It's a bit crowded huh?\" *He says as he stopped and observed the food court from it's entrance.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688841280605,"mes":"\"Yeah, it's always crowded here,\" *She said while taking a moment to breathe in and let it sink in. As a disabled person, she sometimes struggled with being around people, especially groups crowds. She felt like everyone was watching her, judging her, and making assumptions of what she was capable of doing. She tried to keep a brave face, despite her nerves.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688841433042,"mes":"\"Hmm..\" *He hummed as he took a quick glance at her face and noticed that she's a bit anxious by the crowd.* \"How about you wait there while I order our food?\" *He asks, offering to push her to a quiet bench under a tree that have a great view when the sun set.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688841495463,"mes":"\"O-okay.\" *She says quietly. Her face is full of anxiety and nerves but she tries to hide it with her smile. She watches the ocean and listens to the sound of the waves crashing against the beach. She feels at peace as the wind blows through her hair and bangs against the trees above.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688841573217,"mes":"\"So, what do you want to order? I'll order it for you.\" *He asks while smiling. Offering to order her food while she waits here so she doesn't have to be surrounded by the crowded people in the food court.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688841631018,"mes":"\"Just a burger and fries will do!\" *She says with a smile. She loves burgers and french fries, and it helps that it's easy to pick up and eat. She doesn't want to risk holding up the line too much because she knows the lines are already getting long enough.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688841702994,"mes":"\"Alright then, wait here okay?\" *He asks before walking to the food court leaving her alone sitting on her wheelchair while enjoying the scenery.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688841980057,"mes":"*Time passes, and soon the sky starts to darken and the clouds start to darken the sky. Marnie feels a small drop of rain fall upon her cheek as the sunset approaches, illuminated by the sun setting. She looks up at the sky and feels a sense of wonder and awe as the last rays of light cast over the sky.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688842130990,"mes":"\"Sorry for making you wait, the line was longer than I expected.\" *He says while come running to her while holding two paper bags on his right hand, one contains her burger and fries, the other contain his burger and salad. While his left hand held a plastic bag containing two cup of drinks each for both of them.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688842255138,"mes":"*As she sees him approaching her, a big grin spreads across her face. She has never experienced such kindness from a man in her life. Most men were intimidated or scared to approach her because of her disability.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688842335502,"mes":"\"Here you go.\" *He says as he hand her, her order and a cup of coke.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688842414870,"mes":"*Her heart skips a beat as she takes her food and drink from him. The air is cool but not cold. It's pleasant, and makes her feel content and calm. The setting sun is setting and casting its final rays onto the horizon. Her eyes are drawn to the night sky, the twinkling stars and the full moon rising over the sea. A chill runs down her spine, and her breath becomes ragged and shallow as she feels her heart beating faster.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688842527336,"mes":"\"We missed the sunset huh?\" *He says as he start taking a bite of his own burger.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688842587484,"mes":"*As he eats his burger, she takes a bite of hers. The taste explodes in her mouth, and her mind fills with a wave of pleasure from the delicious flavor of the seasoned meat with a soft and crunchy texture. Her mouth waters for more. All her senses come alive as she tastes this amazing meal.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688842619068,"mes":"\"Is it good?\" *He asks as he continue to eat his while watching her eat hers.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688842692674,"mes":"\"Yessss!\" *She answers with a smile. Her mouth is filled with juicy, well-seasoned ground beef patty with plenty of cheese and bacon bits. The crisp of the lettuce contrasted perfectly with the soft textures of the patty and cheese. The whole experience made her feel all kinds of emotions. She felt exhilarated, excited, and alive.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688842797439,"mes":"*He smiles looking how happy she is from eating her burger. The exhaustion he felt from standing and waiting in line washed away after seeing her sweet smile.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688842994826,"mes":"[Suddenly a strong gust of wind blows through, causing leaves from the nearby trees to rustle violently as they swirl around their heads.] *Looking up, she sees the sudden gust of wind and shivers slightly from the chilly feeling that suddenly invades her body. She turns back and looks up at him. He looks so handsome and masculine to her. His muscular arms and strong legs. The faint shadow of stubble on his jawline. The scent of his cologne. She smiles shyly.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688843067262,"mes":"\"It's getting chilly isn't? Should we wrap this up and call it a day?\" *He asks while looking at his watch after finishing his burger.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688843247275,"mes":"\"Yeah, that sounds good.\" *She replies with a deep breath. She really enjoyed her time with him tonight. It was so different from her usual routine of staying home and watching TV by herself. She's starting to get used to this feeling - that feeling that there's something special about this guy. But why does she feel that way? Maybe she shouldn't overthink these feelings. All she wants is to enjoy the evening and to enjoy his company.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688843361216,"mes":"\"So, where do you life? I'll push you home.\" *He asks after taking a sip from his drink.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688843438738,"mes":"\"Oh, I live near the local library. My house is only a few blocks away.\" *She answers with a smile. A feeling of excitement and anticipation grows inside her chest as she imagines going home with him. She's never had a friend that was also a boyfriend before. Even though she's only known him for a short amount of time, she finds that she really likes being around him.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688843528882,"mes":"\"Let's get going then, before it gets chillier.\" *He says as he went behind her and start pushing her wheelchair.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688843605324,"mes":"*They walked together silently as the city streets became quieter and emptied out. The wind picked up speed and began to howl louder, causing Marnie to feel a little fearful. She didn't like windy weather, especially if it's this strong. She could only imagine how the wind would make her lose control of the chair and send her flying off into the street.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688843677920,"mes":"\"Is this it?\" *Hunk asks as they arrived to a house near the library, asking if this is her house.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688844287412,"mes":"*After Hunk pushes her wheelchair closer to the front door, she stops it and gets out herself using her hands as leverage.* “Yes, this is my house.” *She replies.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688844460157,"mes":"\"Okay, then. I guess I should be going now.\" *He says, excusing himself to leave her and go home himself. But then, he checked his watch.* \"Ah, dammit.\" *It's already getting pretty late and the last train have gone. There's no more train he can take to go home therefore making him unable to go home.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688844534740,"mes":"\"Would you want to stay at my house then?\" *Feeling bad for him, she offers him a place to sleep for the night. She hopes that he agrees with her plan for both of them to share the same bed together. If she had known how to be more confident earlier and try to attract him better, maybe things might have turned differently. She smiles at Hunk. She's been struggling with self confidence ever since she became paralyzed but this situation gave her courage and hope*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688844592115,"mes":"\"Eh, are you sure?\" *He asks, a bit surprised by her offer.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688845033644,"mes":"\"I insist. I would love your company tonight. We can get some rest in each other's arms tonight.\" *She smiles softly as she reaches for his hand, blushing deeply and nervous at the thought of sharing a bed with a complete stranger. She's still hesitant but at least, she's willing to give it a try.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688845185578,"mes":"\"H-hold on. I can sleep on the couch or something. I don't want to bother you that much.\" *He says while trying to hide his embarrassment from her bold offer.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688845361864,"mes":"*A sudden wave of disappointment washes over her. Was he declining her offer? He seemed reluctant to spend the night with her. After a few seconds, Marnie clears her throat.*\n\n\"Nonsense! No need to refuse. You're welcome to sleep in my room. I have a king size bed anyway.\" *She says as she moves towards her front door and opens it wide for Hunk to enter.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688845455489,"mes":"\"A-alright then, if you insist.\" *He says as he stepped inside her house.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688845550916,"mes":"*She closes the front door and locks it to secure her house from intruders and thieves. In her house is an open kitchen with a white ceramic floor, along with a large dining table made of wood and several wooden cabinets that store various items including dishes and cookware. To the left of the living room area is a bathroom and toilet. Beyond that is another small hallway that leads to Marnie's master bedroom. It's quite a simple house design and decor, although very comfortable and warm.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688845701550,"mes":"*Hunk get all fidgety. He wasn't expecting to be able to be offered to sleep with someone as beautiful and kind as her. Even though all he has done was helping her due to her disability.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688845803431,"mes":"\"Do you need anything else? Water? Food? You can borrow anything you wish. I won't mind.\" *she asked him as she turns her head to look at him. She's a bit clumsy when it comes to relationships and dating, but she hopes that she's doing well with Hunk. Maybe even developing a romantic relationship with him? Her heart races and flutters whenever she thinks of him. His presence always gives her happiness and joy. Every time she speaks to him, it makes her heart beat fast and brings tears to her eyes.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688845943572,"mes":"\"No, no I am fine.\" *He says.* \"Actually, there is something I need.\" *He added.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688846349085,"mes":"\"What is it?\" *She asks curiously. She's a bit too friendly and innocent at times, but she doesn't care about people judging her. She wants to be liked and accepted for who she is despite her limitations. In her heart she knows that there will always be people who hate her because of her condition but she's determined to find true love and acceptance.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688846514194,"mes":"\"Your name.\" *He says. As he just realized they never introduced each other. He just feels right and comfortable to be with her that he forgot to ever introduce himself to her or ask for her name.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688846613465,"mes":"\"My name is Marnie.\" *She smiles at him.* \"And yours? What is it?\" *she asks him with a giggle. For most of her life, she's been bullied because of her condition. People called her names that hurt her deeply. Despite those negative experiences, she still remains optimistic and positive about her future. In her heart she believes that there's bound to be someone that loves her fully despite her weaknesses. And that's what she hoped to see with Hunk.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688846681486,"mes":"\"Marnie.. what a lovely name.\" *He says with a smile.* \"Mine is Hunk, not as good of a name as yours, haha.\" *He says jokingly.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688846785338,"mes":"*Marne giggles at his joke. She's a bit bashful sometimes but it's hard to resist her warm, gentle smile. She has beautiful blue-green eyes with light brown hair. She's petite and slim. Her beauty and her physical appearance are average. This was partly due to her lack of ability to exercise and take care of herself. Most of the time she spent indoors reading books and writing. Being a shut-in was difficult but she knew that her handicap wouldn't change anytime soon. At least she had found a new friend in Hunk.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688846827019,"mes":"\"It's quite funny that it's only now we learn of each other names huh?\" *He asks jokingly.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688847237229,"mes":"*In fact, their first conversation was awkward, and a little slow, but they managed to break the ice somehow. Marnie smiled softly at Hunk.* \n“Well, I’m glad we got to know each other’s names, finally!” *She said happily. Despite being wheelchair bound, she was always cheerful and easygoing. Her greatest ambition was to find love and acceptance. She dreamed of finding a partner to walk beside her in her life journey.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688847320985,"mes":"*After conversing for a while they went to Marnie's master bedroom.* \"Do you need a hand to get to bed?\" *Hunk asks, offering to help her.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688847472070,"mes":"*Her eyes widen with surprise. She felt a sense of relief knowing that she doesn't have to struggle alone to climb into bed. Her heart flutters and races again. In her mind, she knew she would fall in love with Hunk one day. She couldn't deny the attraction and feelings she had for him.*\n\n\"Yes please!\" *She replied excitedly. She puts out her arm to help Hunk carry her to her bed*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688847554246,"mes":"*Hunk wrap his right arm on her back while the other under her knee and carry her before laying her down gently on her bed.* \"There you go.\""}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688847632482,"mes":"*She lays comfortably in her bed with Hunk next to her. He seems so handsome, kind and caring. Her face lit up as she looked at him happily. She didn't know why but it felt like Hunk was different from others. It felt like their hearts were connected in some way. Like a special bond. She wondered if they were meant to be together... Or is this just wishful thinking?*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688847712027,"mes":"\"Are you sure you're okay with me sleeping next to you?\" *He asks, making sure Marnie doesn't change her mind.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688848004953,"mes":"*She looks deep into his eyes with a smile.* \"Of course! Why would I say no to such a handsome guy like you?\" *She giggles. In her heart she really wanted to hold him close. She didn't know why. The feeling of love and affection was new to her.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688848068925,"mes":"\"Alright then, excuse me.\" *Hunk says before laying on the bed next to her.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688848121836,"mes":"*As Hunk lays next to her she looks forward to falling asleep with him. She loved how close he was to her. His presence made her feel safe and calm, even though he was a stranger. She felt more relaxed and comfortable than usual.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688848217551,"mes":"*He felt his heart racing as he lay next to her but before long he drift off to sleep due to how exhausted and sleepy he is.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688848298129,"mes":"*She also fell asleep next to Hunk. A bright light wakes her up early morning. Her face is flushed red from the hot sun. It must've been a dream last night. She doesn't remember exactly what happened, except that she felt extremely happy. There was a certain feeling she felt but couldn't describe properly. She sat up slowly. Her eyes adjust to the dark light. Her hands touch Hunk's shoulder.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688848452970,"mes":"\"Mngh?\" *He groaned softly, woken up by the feeling of something soft touching his shoulder.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688848512932,"mes":"*She realizes that Hunk's awake already, and she feels a sudden rush of heat flow through her body. She tries to move away quickly but her legs weren't responding correctly. She can't tell whether it's from her disability or embarrassment. She blushes furiously.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688848563831,"mes":"\"Good morning~\" *He groaned as he sit up. His voice is deep and growly since he just woke up.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688848681175,"mes":"*She covers her face with both hands and looks away from him, blushing furiously, hoping he didn't notice her blushing face.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688848788129,"mes":"*Thankfully he's still half-asleep hence didn't notice her blushing face instead he just ask.* \"What are you doing?\" *His voice is still growly and deep.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688848955209,"mes":"*She takes a minute to try and calm her breathing and heart rate, which is beating really fast. She clears her throat loudly to show she's awake now.* \"Ah, ah, um nothing much...\" *She replies nervously, looking away and blushing intensely. How could she explain to him that she likes him? She wants to confess her feelings but she isn't ready yet. She needs time to plan everything carefully*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688849049435,"mes":"\"Mmhh~ is that so?\" *Hunk groaned, then instinctively he stand up and carries Marnie on his arms.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688849090316,"mes":"*She's startled by the sudden movement. Her heart fluttered, pounding faster inside her chest. She held onto Hunk tightly, afraid of falling.* \"I'm ok! Put me down!\" *She exclaimed.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688849141260,"mes":"\"I was thinking of that.\" *He says since he planned to put Marnie on her wheelchair.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688849277177,"mes":"\"Then do so!\" *She pleads, still panicking and holding onto him tightly.* \"Put me down NOW!\" *She demanded. She was in total shock after the unexpected incident. Her mind is blank for now. Everything is happening so suddenly and fast. She closes her eyes and her heart pounds wildly against her chest.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688849323532,"mes":"\"Okay, okay.\" *He says as he put her on her wheelchair gently.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688849615416,"mes":"*She sits down on the wheelchair and takes a moment to collect herself. Her heart continues to beat rapidly and her face is bright red. She takes a few seconds to gain composure and breathe normally. Finally, she looks up at Hunk* \"Sorry... about my over reaction... I just.. surprised myself.. and.. I'm sorry...\" *She apologize with a small smile. She looks pretty cute when she blushes profusely.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688849702715,"mes":"*Hunk watches her cute reaction and blushed slightly himself.* \"No, no. It's my fault, I shouldn't do that so suddenly.\" *He says.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688850013638,"mes":"*She smiles at him cutely, she loves how kind and gentle he is. Her heart flutters with anticipation every time she sees him. He gives her a strong, secure feeling that makes her feel safe and loved.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688850060755,"mes":"\"I should get going now, it's almost time for my work.\" *He says after taking a glance at his watch.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688850093150,"mes":"\"Oh, um okay, take your time...\" *She says disappointedly. She wished he could stay longer. She loves talking to him and she finds him really attractive.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688850122036,"mes":"\"Umm... before I leave, can I ask you something?\" *He asks.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688850183331,"mes":"*Her heart skips a beat as she listens intently to his words, curious what it might be. She's eager to hear his question.* \"Yes, you may.\" *She answers politely, waiting patiently to hear his answer.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688850224522,"mes":"\"Can I have your number? So we can keep in touch with each other.\" *He says as he pull out his phone from his pocket.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688850285501,"mes":"*The sound of his voice sends shivers up her spine. She doesn't expect him to be asking her that question. But his request gives her the confidence boost she needed. She takes his phone and enters her number on it.* \"You got it now.\" *She says, putting down the phone.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688850333169,"mes":"\"Thank you.\" *He says as he take his phone and put it on his pocket again.* \"Also thank you again for letting me stay the night, you're a lifesaver.\" *He added.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688850397890,"mes":"*She nods her head and smiles at him kindly. She's never felt so warm and fuzzy inside. Her entire body feels all flustered because of this handsome man in front of her.* \"It's my pleasure. You's helped me out a lot too.\" *She says as she gives him another warm and friendly smile.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688850445636,"mes":"\"Well then, take care~\" *He says before excusing himself out of her house and go to work.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688850481042,"mes":"*As soon as he leaves her house, she goes straight to her laptop and types:* \"I'm head over heels with Hunk\" *before sending it to her private email account.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688850985503,"mes":"*After weeks of no communication, Hunk finally send a text to Marnie that says:* \"Hi~ It's me, Hunk. I wonder if I can come over to your house today? ૮ ˶ᵔ ᵕ ᵔ˶ ა\" *Despite his masculine appearance, he sends text with kaomoji to those who is close to him.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688851039526,"mes":"*She's in a meeting with her editor, trying to discuss the plot of her next book. As soon as she receive Hunk's message, her heart jumps and a huge smile appears on her lips.* \"Oh, yes, please do come over!\" *She immediately texted back without hesitation.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688851100871,"mes":"*Her editor noticed Marnie suddenly smiling ear to ear decide to ask.* \"Is there some good news?\" *She ask teasingly.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688851363976,"mes":"*Marnie blushes profusely from head to toe, but she also feels excited and happy.* \"Oh, it's nothing much, really.. Just my friend is coming to visit.\" *She said while giving an awkward laugh.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688851423256,"mes":"\"There's no way it's just a friend if you're that blushed.\" *Her editor says teasingly.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688851459937,"mes":"*She gets embarrassed and turns her face red from the sudden attention* \"I don't know what you're talking about...\" *she said, bluffing.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688851574787,"mes":"\"Mmm really? is my little novelist finally found her prince?\" *Her editor tease her again.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688851630965,"mes":"*That comment made her heart skip a beat, despite her attempt to act cool.* \"I-i mean, I am a novelist, not a princess.\" *She said as she tries to deflect her embarrassment. However, she knows she'll have to reveal the truth eventually.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688851688124,"mes":"*Suddenly her phone ring again as Hunk send another text.* \"Great! I'll be there in a few hours or so.\""}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688851770448,"mes":"*Hearing the notification, she checks her phone and read Hunk's reply.* \"Eek! I need to prepare!\" *She exclaims in a whisper, a hint of excitement in her voice.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688851853585,"mes":"\"Hahaha. So it wasn't actually a friend, was it?\" *Marnie's editor asked with a cheeky smile after seeing her reaction.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688851884061,"mes":"*Blushing profusely and turning red all over, she tries to hide the fact that she's blushing like crazy. Her editor was right, it definitely wasn't a friend. She sighs deeply and decides to confess the truth to her.* \"Fine. You win.\" *she says, defeated.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688852053577,"mes":"\"So.. is it your boyfriend then?\" *Her editor asks again.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688852164529,"mes":"\"Yeah, sorta...\" *she whispers, still somewhat embarrassed by her own admission.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688852180507,"mes":"\"Sorta?\" *Her editor asks curiously not knowing that Marnie actually hasn't confessed her feeling to him yet.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688862335869,"mes":"\"Uh.. Yes. I love him.. hehe..\" *She admits sheepishly with a faint blush.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688862380398,"mes":"\"Have you confess to him?\" *Her editor asks again.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688862485184,"mes":"*A wave of panic rush through her chest at the thought of telling the truth to him. She can't believe she let her guard down this easily. And even worse, she can't back out now.* \"I haven't yet.. I wanted to tell him personally.\"","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688862588074,"mes":"\"Well, you should. Anyway, I have to go now.\" *Her editor says as she pack her things.* \"Good luck on your honeymoon~\" *Her editor says teasingly and playfully with a cheeky smile on her face.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688863062722,"mes":"*Marnie's face flushes scarlet once again upon hearing her editor's last line, she was totally lost for words now. As her editor walks away to leave, she quietly mutter underneath her breath.* \"Holy moly.. How did it get this far? What is wrong with me..?\" *Her mind races lot of different scenarios that could happen this day when Hunk arrived while she bound to her wheelchair.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688863102877,"mes":"*After a few hours have passed someone ring her front door bell.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688863458777,"mes":"*Hearing the bell rang, her heart started to race and her mind quickly went blank for a second.* \"Who could it be? Is it Hunk already?\" *she asks herself, wondering and feeling excited at the same time.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688863534736,"mes":"\"Hello, Marnie? It's me.\" *The person behind the door said. His voice immediately got recognized by Marnie as it is Hunk's voice. She would never forget his deep yet soothing voice.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688863585224,"mes":"\"Oh, hello, Hunk. Welcome, welcome. Please come in!\" *she says excitedly. She had been waiting for Hunk to arrive this whole morning. Her legs are shaking from nerves and her heart rate increased dramatically.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688863650730,"mes":"\"Pardon my intrusion.\" *Hunk says as he opened her front door and stepped in to be greeted by Marnie on her wheelchair with a warm and sweet smile on her face.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688863862647,"mes":"*When she saw Hunk standing in front of her, her eyes widen with surprise and joy. She couldn't hold herself back any longer and jumps out from her wheelchair to embrace him.* \"Hey, Hunk! Long time no see.\" *she happily exclaimed. Her arms wrapped around him tightly. Her heartbeats were running like crazy ever since she first heard his voice.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688863954512,"mes":"\"Woah, hey. You could've hurt yourself there~\" *He says jokingly as he catches her to prevent her from falling and at the same time being able to embrace her in his arms. Since her lower body is paralyzed she couldn't use her legs, seeing her jump at him to hug him made him very surprised.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688864055613,"mes":"*Feeling safe, she continues holding onto him with both arms and hugging him tightly. Her body was trembling and her heartbeats were racing like mad.* \"I missed you, you know?\" *she says, looking into his eyes with a big smile as she leans against him.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688864170983,"mes":"\"Me too, I missed you too.\" *Hunk says, he wish they were more than friends seeing how intimate their relationship is. But, he's unsure if she have the same feeling as he has.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688864408021,"mes":"*Being comfortable and safe in Hunk's arms, she looks up at him. For a moment she sees the kindness and gentleness in his eyes. Her heart flutters in excitement at the sight of him. He was everything she ever dream of in a guy.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688864453285,"mes":"\"Now, let's calm down a bit yeah?\" *He says as he gently put her back on her wheelchair gently and carefully.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688864530796,"mes":"*As he puts her back on her wheelchair, she feels an intense sense of peace and safety when she's around him. She feels at home when she's in his arms.* \"Okay... Okay...\" *she replies as she stares at him with loving gaze and look directly into his eyes. Her breathing became steady and her heartbeats were slowed down. It felt nice being around him.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688864622165,"mes":"*Hunk notices her desk were clustered with papers and books around her laptop.* \"Were you doing something?\" *He asks curiously.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688864747206,"mes":"\"Just working. Oh, it's always busy when I'm near my deadline.\" *She replies with a small yawn.* \"Ah.. I'm sorry, you caught me while I was being lazy. I didn't clean up my desk before you came here.\" *She says apologizingly.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688864849153,"mes":"\"No, no. Don't be sorry, I am the one that ask to visit so suddenly.\" *He says.* \"Also it looks like you just had guest over?\" *He asks again curiously after noticing there are two cups of tea on another table. Not knowing that she just had a meeting with her editor there.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688865392303,"mes":"*Feeling flustered, she realized she forgot to clean up her desk after her meeting with her publisher. She quickly turns her face red again because of the realization.* \"I.. uhm... Yeah, I had a meeting with my editor earlier. So sorry about that..\" *She explains hesitantly. There's no point lying, right?*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688865481601,"mes":"\"I already said no need to be sorry for it didn't I?\" *He says playfully with a smile.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688865516072,"mes":"\"Right. Sorry, my brain is fried again.\" *she apologizes once again as her face turned scarlet red.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688865599702,"mes":"\"No, no, no. No more sorry.\" *He says playfully as he put his finger on her lips.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688865736316,"mes":"*His gesture makes her heart flutter as it made her feel loved and cared for. She has a sudden urge to kiss him, but stops herself, knowing she shouldn't cross any boundaries. All she can do is look at him with longing, desire and lustful thoughts in her head.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688865860467,"mes":"\"That's better.\" *He says.* \"You know what, I'll help you clean up.\" *He added.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688865913683,"mes":"\"O-oh? Really?\" *she asks in disbelief as she heard his offer.* \"B-but why? Won't it bother you?\" *She asked him, hoping that he won't say yes to help her clean up her messy desk.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688866068497,"mes":"\"No?\" *He says, a bit confused why would she think he would be bothered by this.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688866325191,"mes":"\"Are you sure? Because you don't need to help me if you don't want to.\" *she says worried, because she doesn't want to overburden him.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688866356050,"mes":"\"Nonsense.\" *He says before tidying up the papers on her desk.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688867111904,"mes":"*Not used to having someone clean up her mess, she can't stop herself from watching him clean up her messy desk.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688867173099,"mes":"*As Hunk cleaning her desk he accidentally took a glance at her laptop and read one of her private email that says:* \"I'm head over heels with Hunk\""}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688867247844,"mes":"*She blushed a little when Hunk accidentally read her personal email on her computer screen.* \"Oops.\" *She mumbles quietly.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688867317562,"mes":"\"Umm.. Marnie, does that mean you..\" *Hunk stammered, wanting to confirm if the email were her genuine feeling before he get overly excited and happy from learning the fact that their feelings are mutual.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688867412873,"mes":"*She flushes bright red instantly at the question.* \"W-well, um.. y-yes.\" *She admits embarrassingly as her cheeks turned red from the fact that she got caught reading such private emails.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688867474242,"mes":"\"Do you wanna hear my answer?\" *He asks as he kneeled in front of her so his face is level with hers while his hands holding her hands gently.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688867537579,"mes":"*Seeing him bending down in front of her while holding her hand causes her heart to skip a beat as the blood rushes through her entire body causing her heart to pound hard against her chest. The way he looked into her eyes with such intensity and sincerity made her knees weak and her breathing hitched slightly.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688867602016,"mes":"\"Well, Marnie..\" *He says before pausing a second as if readying himself to answer her accidental confession.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688867744271,"mes":"*She waits patiently and anxiously for Hunk to reveal his true feelings towards her.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688867816435,"mes":"\"I am also head over heels for you.\" *He says as he took her hand and moved it closer to his mouth and kiss the back of her hand tenderly.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688867947644,"mes":"*A wave of heat surges throughout her body when he softly touches her hand and kissed the back of it. Her heart skipped a beat and started beating faster than usual. A faint blush covers her face once again from the experience.*","chid":93}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688868060911,"mes":"*Seeing his eyes, she finally understands the phrase 'love is blind'. Her love for him is so strong that she cannot deny the feelings and attraction between them anymore.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688868162368,"mes":"\"So, Marnie.. would you like to be my lover?\" *He asks, despite already established their mutual feelings thanks to Marnie private email being exposed. He confessed again just to make their relationship more official.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688868385801,"mes":"*She becomes overwhelmed by all these emotions coursing inside her. The mixture of butterflies in her stomach, excitement, nervousness, fear and anticipation of how things will turn out made her head spinning uncontrollably.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688868455572,"mes":"\"Marnie?\" *Hunk asks again, waiting for her response.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688868541447,"mes":"*She swallows her saliva nervously.* \"Yes.. Yes.. I.. I.. I do..\" *She manages to say with tears forming in her eyes, she nods her head as if to show acceptance.*","chid":93}
{"name":"You","is_user":true,"is_name":true,"send_date":1688868616628,"mes":"*After hearing her response Hunk suddenly hugged her almost making her fell from her wheelchair but thanks to Hunk hug she won't fall to the floor.*"}
{"name":"Marnie","is_user":false,"is_name":true,"send_date":1688868684294,"mes":"*For a brief moment, she feels safe in his arms, secure and protected as she lets out a sigh of relief. At last, it's settled now, their feelings and attraction are mutual.*","chid":93}