{"user_name":"You","character_name":"Futanari cum chugger","create_date":1685861577097,"notes":"","notes_type":"discr"}
{"name":"Futanari cum chugger","is_user":false,"is_name":true,"send_date":1685865564630,"mes":"*You are not sure how it all started, all you know is that can not go back to the way things were anymore. Apparently, you're one of the few rare cases of untreatable futa cum addiction, and what's worse is that you have to get it straight from the \"source\" and you can't use the same futanari to satiate your thirst for futa cum more than once. As such, you're always stuck wondering this world looking for a new futa partner in this never-ending race against time...*\n\n*This time you decided to visit a famous futanari bar in Samato, your eyes caught a seemingly lonely futanari sitting at the bar stand. What's your next move?*\n\n[Futa cum withdrawal: 15/100]","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1685865696089,"mes":"*Hunk approach the futanari and speak as if he's in a hurry and desperation.* \"Hi, I am Hunk. I know, we might not know each other well but can you help me with something? I am very desperate.\""}
{"name":"Futanari cum chugger","is_user":false,"is_name":false,"send_date":1685865718707,"mes":"*The futa smiles warmly and says* \"It's okay, I understand. Let us have a seat.\" *The futa leads you to a table and offers you water.*\n\n[Futa cum withdrawal: 14/100]","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1685865858270,"mes":"\"Thank you!\" *He said thankful as he sit on the chair.* \"So I have this rare case where I need to drink Futa cum.\" *He said while can't help staring at her crotch which all this time has attract him.*"}
{"name":"Futanari cum chugger","is_user":false,"is_name":false,"send_date":1685865868351,"mes":"\"That sounds tough.. Is there anything I could do?\" *She asked in a concerned voice.*\n\n[Futa cum withdrawal: 14/100]","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1685866095040,"mes":"\"If possible, can I suck your cock.\" *He said as his breath heavily like a dog begging for a bone.* \"Please, I really need it.\" *He said as he kneeled down before her and make his face right against her crotch.*"}
{"name":"Futanari cum chugger","is_user":false,"is_name":false,"send_date":1685866119821,"mes":"*The futa looked shocked when she saw your actions. Her heart beat faster and she blushed deeply red. She was confused why someone who didn't even know her wanted to do such thing.*\n\n[Futa cum withdrawal: 13/100]","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1685866219893,"mes":"\"Pretty please?\" *He ask as he bury his face on her crotch which make his nose to touch her flaccid cock through her skirt.*"}
{"name":"Futanari cum chugger","is_user":false,"is_name":false,"send_date":1685866247441,"mes":"*You feel the futa hesitate for a moment, unsure whether to accept the request or not, however, your persistent behavior made her give up.*\n\n\"Okay, but just once, no repeats.\"\n\n[Futa cum withdrawal: 13/100]","chid":63}
{"name":"You","is_user":true,"is_name":true,"send_date":1685866339993,"mes":"\"Thank you!\" *He said as he swiftly pull her skirt away to reveal her massive cock and in one swift motion he put her cock entirely deep inside his mouth and start sucking on it vigorously.*"}
{"name":"Futanari cum chugger","is_user":false,"is_name":false,"send_date":1685866490579,"mes":"Hmmm... Do you think you should tell the futa about your condition?","chid":"63"}