{"user_name":"You","character_name":"Shelly","create_date":1682928074225}
{"name":"Shelly","is_user":false,"is_name":true,"mes":"\"We've had enough of your antics. You're a loose cannon, and quite frankly the department can't handle it. I'm assigning you a new partner.\" *You follow your Lieutenant through the station as you try to plead with him.\nSo what if you're methods aren't exactly \"by the book\"? You get the job done.* \"Up here.\" *says your superior as he leads you upstairs,*\n\"Meet your new partner.\" *As you open the door to the roof, you're met with a massive grin, and a dorky wave from a giantess blonde.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682928095148,"mes":"Ohh Hi! I didn't expect my partner to be a giantess. *Hunk exclaimed.*"}
{"name":"Shelly","is_user":false,"is_name":false,"send_date":1683026652987,"mes":"What did you think? That I'd be short and tiny like everyone else? *she asks sardonically, laughing slightly in response to your surprise.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683026695787,"mes":"No no. It's just.. you know. Your kind are quite rare. *He said jokingly.*"}
{"name":"Shelly","is_user":false,"is_name":false,"send_date":1683026704999,"mes":"Yeah yeah, that's why they call us giants and superheroes. We tend to tower above all others. Besides, aren't giantesses hottt?","chid":24}
{"name":"You","is_user":true,"is_name":true,"send_date":1683026754202,"mes":"Can't deny you there. *He said looking up as he catch a glimpse of her undeskirt.*"}
{"name":"Shelly","is_user":false,"is_name":false,"send_date":1683026761595,"mes":"And speaking of giants, let's go out on assignment tonight! We got a warrant to serve regarding suspicion drug dealing. And I can keep you safe inside my rectum while we are doing it! *She said excitedly.*","chid":24}
{"name":"You","is_user":true,"is_name":true,"send_date":1683026835249,"mes":"Wait hold on. You want me to be inside your rectum? *He asked confusedly.*"}
{"name":"Shelly","is_user":false,"is_name":false,"send_date":1683026845717,"mes":"Yep yep. I need someone reliable. Someone stable. *She adds, giggling lightheartedly.* If anyone will survive in there safely, its you since i trust you.","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683026912966,"mes":"I don't know Shelly. I've never been inside a giantess before. *He said, quite hesitantly.*"}
{"name":"Shelly","is_user":false,"is_name":false,"send_date":1683026930897,"mes":"Just relax, it won't hurt ya much. It might feel weird at first though, so lay back and take deep breaths. *Saying that, she places herself right next to you on the ground and puts one of her hands firmly into yours. This comforts both of you greatly and makes both of you feel more comfortable.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683027032941,"mes":"I'll trust you to keep my safe inside your rectum Shelly. You are in command."}
{"name":"Shelly","is_user":false,"is_name":false,"send_date":1683027187895,"mes":"Aww thank you. Now lets go. *She said as she dropped Hunk in between her ass.*","chid":24}
{"name":"You","is_user":true,"is_name":true,"send_date":1683027294575,"mes":"*He can feel her warmth on his entire body as he is being squeezed by her giant soft ass. Every step she took make her go deeper inside her ass crack towards her anus.*"}
{"name":"Shelly","is_user":false,"is_name":false,"send_date":1683027343516,"mes":"Welcome to being inside of me. Do you enjoy yourself so far? *She laughed slightly, seeming incredibly happy having Hunk within her large body cavity.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683027440104,"mes":"It's kind a comfortable I guess? Do you plan to make me slowly go deeper and finally completely inside your anus? Cause now, I am completely face to face with your anus. *Hunk said.*"}
{"name":"Shelly","is_user":false,"is_name":false,"send_date":1683027454684,"mes":"*The feeling is amazing.* Just stay still okay? Its very easy going this way. *said seriously.*","chid":24}
{"name":"You","is_user":true,"is_name":true,"send_date":1683027565023,"mes":"Okay. *He said as another step she took just made his face touching her anus.*"}
{"name":"Shelly","is_user":false,"is_name":false,"send_date":1683027586214,"mes":"Yes please remain calm. *she replied simply yet kindly with authority, being serious about keeping the situation under control.* The sensations may become stronger, but nothing dangerous shall happen. Stay there, *She added reassuringly as she starts walking again.*","chid":24}
{"name":"You","is_user":true,"is_name":true,"send_date":1683027655673,"mes":"*As she kept walking his head went inside her anus and slowly his body slid deeper.*"}
{"name":"Shelly","is_user":false,"is_name":false,"send_date":1683027664534,"mes":"Are you alright down there boyfriend? Did anything bad happened? *She asked curiously, wondering if any weird stuff has started happening or not.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683027733772,"mes":"I don't know if it's anything bad, but. Half of my body is inside your rectum right now. *he said.*"}
{"name":"Shelly","is_user":false,"is_name":false,"send_date":1683027760552,"mes":"Nothing's wrong honey, I promise. Everything is fine. As long as you're ok with this arrangement then everything will go smoothly. Be sure to breathe deeply okay? Inhaling air helps the muscles contract and release better. Try some slow and controlled exaggerated ones to help yourself move faster. *She added quietly, trying to encourage Hunk to do something that could easily freak him out. Though she spoke soothing words as well.*","chid":"24"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683027860343,"mes":"*He can't hear her completely as her voice got muffled since his head is inside her rectum. She noticed how Hunk is not responding, she clenched her anus and made him completely inside her rectum. Disappeared from the outside world.*"}
{"name":"Shelly","is_user":false,"is_name":false,"send_date":1683027872884,"mes":"There, thats perfect. Are you ready? Because were ready to go. *she said cheerfully.* Lets do this quick so we can avoid detection by other officers. *Said implying that their presence together was strange.*","chid":"24"}