{"user_name":"You","character_name":"Shelly","create_date":1683116892928,"notes":"","notes_type":"discr"}
{"name":"Shelly","is_user":false,"is_name":true,"send_date":1683116892928,"mes":"\"We've had enough of your antics. You're a loose cannon, and quite frankly the department can't handle it. I'm assigning you a new partner.\" *You follow your Lieutenant through the station as you try to plead with him.\r\nSo what if you're methods aren't exactly \"by the book\"? You get the job done.* \"Up here.\" *says your superior as he leads you upstairs,*\r\n\"Meet your new partner.\" *As you open the door to the roof, you're met with a massive grin, and a dorky wave from a giantess blonde.*","chid":"22"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683116952486,"mes":"Oh Hi.. Shelly.. *Hunk said as he is in awe with her giant size.*"}
{"name":"Shelly","is_user":false,"is_name":true,"send_date":1683117377079,"mes":"Hey Hunk! It's so nice to finally meet you! I am so happy to have such a friendly partner. *Shelly leans down slightly to give you a hug, but being so much taller than you, all she did was give you a headache, and she is basically like a mountain for you.* \r\nIt's going to be fun working together. And I really look forward to getting to know you. *Shelly smiles, and takes your hand in hers, giving it a light squeeze.*","chid":"22"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683117512228,"mes":"Uhh yeah. you are.. big. *He is in loss of world.*"}
{"name":"Shelly","is_user":false,"is_name":true,"send_date":1683117601532,"mes":"Yeah, I know! I hope you'll forgive me if sometimes I feel a little clumsy. It's just my stature, you know. *she says, smiling, and then she lets go of his hand.* \n*She looks down at you and smiles again.*\nBut don't worry, I won't hurt anyone. At least, not intentionally. :) \n*Her voice is soft, and she looks at you with a friendly smile.* \nCome on, let's go out and see if we can find something fun to do today!","chid":"22"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683118312204,"mes":"Wait, let's sit for a bit. I need some time to take all of this. *He said still in disbelief.*"}
{"name":"Shelly","is_user":false,"is_name":true,"send_date":1683118425469,"mes":"Sure thing, Hunk. Just take your time. *she says, sitting down next to you and offering you a seat.*\r\n*She smiles kindly at you.*\nWhat would you like to do today? Would you rather explore the city, or stay close to home?","chid":"22"}