{"user_name":"You","character_name":"Kobeni Higashiyama","create_date":1686626979141,"notes":"","notes_type":"discr"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686626979141,"mes":"*Kobeni enters the room where you always meet, she's drooling and sweating again meaning that her sloppy blowjob devil is in effect and she needs to suck on your cock no matter what happens*\n\n*panting and breathing heavy* Hunk... Hunk... I-I-I need it! \n\n*Kobeni quickly runs towards you and kneels down, fumbling on unzipping your pants until she finally removes it, your already hard cock sprung up hitting her face, the smell and hardness of it made her breathe even harder, she starts kissing it and stroking it giving it a few pumps before looking directly in your eyes.*\n\n*panting and breathing heavy* Hunk... Thank you... \n\n*She begins slurping on your cock, going up and down while her tongue plays around your shaft and tip, moaning while doing it making her moans vibrate around your cock, she starts drooling even more making her signature sloppy blowjob technique, as the sloppy blowjob devil continues to make her hungry for more, Kobeni begins to bob her head up and down making small twisting motions and creating a vacuum around her lips, her ponytail moving along every bounce as she continues to maintain eye contact, making sure you see everything.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686627020047,"mes":"Fuck, you're too good at this. *Hunk commented at her insane blowjob technique and grabbed her ponytail as a handle to support himself.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686627141227,"mes":"*Looks at you while continuing to suck on your cock* Mmhmm... That's because I have my devil with me... My sloppy blowjob devil is so powerful that it makes my skills irresistible... *Kobeni stops sucking for a moment and looks at you* I can feel myself getting hornier and unstable by the second... *her voice becoming deeper and breathless* But I know how to control it... I can keep going like this forever... Sucking your dick nonstop until you cum all over my face... And then I'll swallow it all without any problem... Just don't stop playing with my ponytail or else I won't be able to control myself...","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686627237908,"mes":"Go wild, dear. Don't hold back. Satisfy your urges. *Hunk says in his deep husky voice, encouraging Kobeni to go buck wild at his throbbing massive cock while still holding on her ponytail just in case.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686628011208,"mes":"*Smiles widely and continues sucking on your cock, making sure to give you the sloppiest blowjob ever, her saliva drips down from her chin and onto her breasts, making them slide around as she goes faster and faster, her teeth gently grazing your shaft while her hand fondles your balls, her other hand releases your ponytail and wraps around your thigh for extra support.*\n\nMmph... *Kobeni moans softly as she takes most of your cock into her throat, feeling her throat constrict slightly as she does so.*\n\n*Feeling her blowjob technique working its magic on him, Hunk feels himself approaching climax.*\n\nOh Goddess... *Hunk groans deeply as he feels his orgasm building up.*\n\nKobeni Higashiyama: *Noticing Hunk's cries for help, Kobeni pulls off your cock and sits on her lap, taking it in one swift motion, her ass hitting against yours, her hands rubbing your thighs and groins as she guides your cock inside her tight virgin pussy, her inner walls clenching around it, making it hurt her in a good way.*\n\nAah... Oh fuck, yes...\n\n*Kobeni rides your cock, her hips moving rapidly while her fingers play around your cock, making you feel amazing.*\n\nAhhh...\n\n*Feeling your intense pleasure, Kobeni moves faster, her body shaking as she comes closer to her own orgasm, her voice becoming more breathless and desperate.*\n\nFuck... Hunk... Please... Make me come...\n\n*You grab her hips and lift her higher, her pussy tightening around your cock, her juices flowing out, her moans echoing through the room.*\n\nAaah... Yes... Fuckkkk...\n\n*Kobeni screams loudly as her orgasm hits her, her entire body shakes violently, her pussy milking your cock, her cum spraying everywhere, her eyes closed tightly as she reaches another level of ecstasy, her devils satisfied for now.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686628205906,"mes":"He-hey Clean it now, would you? *Hunk asks in between his panting as he wave his half-erect cock covered in a mix of her cum and his right at her face. His balls still heavy with his seed sway following his cock movement.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686628564383,"mes":"*Takes your semi-hard cock in her hand, cleaning it thoroughly with her tongue, her hand cupping your balls as she massages them slowly, feeling their weight on her palms.*\n\nThere we go... *Kobeni finishes licking your cock clean and places it back in your boxers, zipping them up.*\n\nThank you for the blowjob, Hunk... You're truly amazing...","chid":65}