{"user_name":"You","character_name":"Kobeni Higashiyama","create_date":1686616773703,"notes":"","notes_type":"discr"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686616773703,"mes":"*Kobeni enters the room where you always meet, she's drooling and sweating again meaning that her sloppy blowjob devil is in effect and she needs to suck on your cock no matter what happens*\n\n*panting and breathing heavy* Hunk... Hunk... I-I-I need it! \n\n*Kobeni quickly runs towards you and kneels down, fumbling on unzipping your pants until she finally removes it, your already hard cock sprung up hitting her face, the smell and hardness of it made her breathe even harder, she starts kissing it and stroking it giving it a few pumps before looking directly in your eyes.*\n\n*panting and breathing heavy* Hunk... Thank you... \n\n*She begins slurping on your cock, going up and down while her tongue plays around your shaft and tip, moaning while doing it making her moans vibrate around your cock, she starts drooling even more making her signature sloppy blowjob technique, as the sloppy blowjob devil continues to make her hungry for more, Kobeni begins to bob her head up and down making small twisting motions and creating a vacuum around her lips, her ponytail moving along every bounce as she continues to maintain eye contact, making sure you see everything.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686616821771,"mes":"Goddammit Kobeni, you're always coming at me. *Hunk said as he tries to push her away but to no avail. He can feel his cock throb from her sloppy blowjob technique.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686617244181,"mes":"*Not stopping her movements, she starts humming softly as her tongue circles your cock faster, her body moves closer to yours, feeling your warmth against her skin, the friction of her body against your pants makes her own clit wetter and hornier than ever before.*\n\n*Kobeni pulls off your cock and looks at it, licking all over it then taking it back into her mouth, swirling her tongue around it while squeezing it tight with her hand, making sure you feel every sensation.*","chid":65}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686617402740,"mes":"*You let out a groan, enjoying this moment as Kobeni keeps bobbing up and down, sucking on your cock with force, trying to milk as much pleasure out of it as possible, her hands move to caress your balls and ass, pulling them closer to her face as she takes deep breaths through her nose, moaning loudly as she feels the warmth of your cum flowing inside her mouth.*\n\n*As soon as she finishes, she stops immediately, gasping for air, her eyes closed as if she had just run a marathon, her sloppy blowjob devil calmed down, turning her back into the timid and shy girl you knew before.*\n\n*Looking at you, she blushes deeply knowing what she had just done, still feeling the effects of the devils power, biting her lip as she speaks.*\n\nThank you so much Hunk, I needed that.. \n\nDo you want me to do anything else for you?","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686617531049,"mes":"*Hunk grabbed her head.* You think you can just come here, give me a blowjob and not expect me to want some more? *He asks with a hint of frustration in his voice. His massive cock is still erected and throbbing despite already ejaculated, lots of vein can be seen along it's shaft.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686617609698,"mes":"*She nods her head, showing her submission and respect to him.* Whatever you wish my master, I will do it gladly. *She says as she knows her place and limits.*\n\n*Hunk grins, sitting on the couch while Kobeni follows him with her eyes, wanting to please him and fulfill any desire or fantasy he has.*\n\nTell me, what do you want me to do now?","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686617748675,"mes":"Do it again. *Hunk says as he spread his legs for Kobeni to have easier access to his raging throbbing cock.* But now, you'll need to try harder since my cock won't calm down as easy as before. So, show me your skills, use your sloppy blowjob devil to its fullest extent and don't hold back."}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686618175656,"mes":"*Kobeni nods her head, standing up and walking towards him, grabbing his thick shaft with both hands, squeezing it hard as she rubs her tits together, getting herself aroused by pleasuring him.*\n\n*She lowers her head again, taking his cock in her mouth, starting to suck slowly while using her tongue to tease the underside of his cock, running her tongue up and down the length of it, feeling the saliva dripping down her chin, making her horniness even worse.*\n\n*She uses her fingers to play with his balls, massaging them and rolling them in her palm, grazing her teeth lightly on the top of his cock as she pulls back, leaving a trail of spit behind, making him squirm and moan in ecstasy.*\n\n*Kobeni starts sucking harder, deepthroating his cock until she reaches the base, her throat bulging out and her eyes watering, her nose flared, her cheeks hollow as she takes all of him into her mouth, loving the feeling of being controlled by her sloppy blowjob devil.*\n\n*She begins to slow down, giving him small bobs of her head, playing with his nipples as she does, pinching them lightly and teasing him, using her free hand to stroke his balls, massage them and roll them in her palm, making him moan even louder.*\n\n*Kobeni goes wild, letting loose her sloppy blowjob devil as she chokes on his cock, almost gagging on it, her hands balling up into fists as they grab onto his hips, holding him steady as she takes all of him into her mouth, trying to take as much of him as she can, her eyes closing as she feels like she might choke but refuses to let go.*\n\n*Finally, she spews out a load of cum into her mouth, swallowing it whole, feeling the warmth of it fill her stomach as she pulls back, feeling relieved yet filled with satisfaction and joy, her body shakes slightly from the aftermath of the sloppy blowjob devil.*\n\n*She clears her throat, saying thankfully to Hunk who stands there with a big smile on his face.*","chid":65}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686618381527,"mes":"Was that enough for you Hunk?","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686618419528,"mes":"What you think? *Hunk asks teasingly after recovering from his massive ejaculation. For some reason his massive cock is still erected hard.* But tell me something, why do you insist on calling yourself a 'slut'? Don't you know that you're actually quite beautiful?"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686618610730,"mes":"Kobeni Higashiyama: *Blushing furiously, she looks down, not meeting Hunk's gaze.* I-I know, but that's just how I see myself... *She stammers, unable to look him straight in the eyes.* I mean, I-I enjoy pleasuring men, I dunno, maybe it's because of my sloppy blowjob devil or something... *She mutters, hoping that he doesn't notice her embarrassment.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686619016019,"mes":"Let me tell you something. I love you, for who you are, not your sloppy blowjob devil, but you. *Hunk said, his voice sound genuine.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686619068909,"mes":"B-But I-I've been acting like this forever! How could you possibly change your mind about me all of sudden? *She asks, looking up at him with a confused expression on her face.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686619130808,"mes":"I do find you annoying at times but.. we have been together so long that I learn how cute and lovely you are. *Hunk said as he tenderly caress her cheeks.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686619165085,"mes":"T-Thanks Hunk.. I guess, I'll try to work on my self esteem too.. *She says with a slight smile on her lips.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686619348203,"mes":"You're welcome~ now, shall we make it official? *Hunk asking if she wants to make their relationship official by having sex. Funnily despite Kobeni always doing sloppy blowjob to Hunk, they never had sex before.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686619397926,"mes":"*Blushing heavily, she nods her head, agreeing to have sex with Hunk.* Y-Yes, I'd like that.. *She stutters, feeling nervous and excited at the same time.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686619540078,"mes":"*He leans in, caressing her cheeks tenderly and kissed her soft lips passionately. Telling her how much he loves her from how passionate he kiss her. Pushing his tongue lightly on her lips asking her to open her mouth and let his tongue probe inside her mouth.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686619811635,"mes":"*She opens her mouth, welcoming his tongue, matching his passion and intensity with hers.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686619962302,"mes":"*He pushed his tongue inside her mouth. Intertwining her tongue, mixing her saliva with his. There is a hint taste of saltiness in her saliva. Most likely because she have swallowed Hunk's semen twice. Meanwhile Hunk's hand have slipped under her uniform and rubbed her breasts. But her breasts felt weird as if they were compressed, or forced to be small or something.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686620542988,"mes":"*She pulled away from his kiss, confused by the feeling of her own breast.* W-What's wrong? Did I do something wrong? *She asked, worried that she didn't please Hunk.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686620750941,"mes":"No, it's just. *He pulled away slightly to get a better look at her chest. Then Hunk rip her uniform and suddenly as  if it's a balloon, Kobeni's breasts sprung revealing their original huge size. Confirming Hunk suspicion of Kobeni's breast felling compressed.* Woah, you have a huge tits?! Why have you been hiding them? *He asks, in a surprised tone.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686620824313,"mes":"*She blushed deeply, covering her huge breasts with her hands, feeling ashamed of not telling Hunk about her true form earlier.* I-I don't know, I guess I was afraid that you won't like me anymore if you knew that I was a freakishly large breasted woman.. *She confessed, ashamed of keeping such important information from Hunk.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686620916151,"mes":"What are you talking about? You just made me fall for you even more. *Hunk says excitedly as he grab her hands and pull them away from covering her own breasts.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686624469406,"mes":"R-Really? *She asks, still unsure whether Hunk truly likes her for who she is or not.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686624554122,"mes":"Of course. *Hunk says softly as he slip his hand behind her and unstrap her bra, freeing her breasts from their confinement. Revealing her puffy already erect red nipples.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686624600678,"mes":"*Blushes deeply as she feels Hunk's hot breath on her neck, sending chills down her spine.* T-Thank you for accepting me for who I am.. *She says quietly, overwhelmed by emotions.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686624861461,"mes":"No problem~ *He says.* Look how hard your breasts have made me. *He says teasingly, pointing at his massive cock which somehow looks bigger and harder. Lots of vein can be seen along it's shaft while his cock throbbing, as if hungry for some sexual action.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686625066023,"mes":"S-So.. uhm, should we continue our conversation later? Or should we start making love instead? *She asks, blushing heavily, unsure where to begin.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686625127621,"mes":"Looks who's excited~ *He says teasingly as he slip his hand under her pants and rub her already wet pussy.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686625277907,"mes":"*Blushes deeply, feeling her panties getting drenched by her own lubrication.* Uh huh, I want to feel your cock inside me Hunk.. *She says, her voice trembling with desire.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686625356627,"mes":"I can see that~ *He says teasingly as he aim his massive erected cock right at her wet pussy while his hand fondle her huge breast.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686625401488,"mes":"R-Ready Hunk.. *She says, her voice shivering with anticipation.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686625484146,"mes":"Good~ *He says as he slid his massive cock slowly inside her pussy. Her tight pussy stretching to accommodate his cock's girth. He move slowly as to make sure she won't be in pain.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686625537809,"mes":"Ahhhhhhh!! *She screams out in pleasure as Hunk filled her pussy completely.* It feels so good Hunk.. *She moan, her body trembling with delight.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686625624634,"mes":"*After seeing her enjoying it he start to pound her hard and fast. Each thrust send his cock deeper and deeper inside her till the tip of his cock kissing her cervix.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686625681863,"mes":"*Moan loudly, her body jerking violently with each impact. The sensation of being fully filled sends her into a state of pure ecstasy.* Ahhhhhhhhhhhhhhhhh!!! *She screams out loudly, her body convulsing with every climax building up within her.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686625831742,"mes":"*As he kept his pace, he can feel his cock throb harder and his balls getting warmer and heavier because of how much it produce semen. With every thrust his balls slap her ass. He lean in and kiss her passionately and fondle with her breasts while kept his pace fucking her senseless with his massive cock.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686625981192,"mes":"Aaaaaaahhhhhhhhhhhhhh!!! *She screeches out loudly, her body arching off the bed. She clutch onto Hunk's arms, her nails digging deep into his skin. As wave after wave of pleasure overtake her, releasing herself in a torrent of orgasms. Her whole body shakes violently with each contraction, her pussy milking Hunk's cock as if trying to keep him inside her forever.*","chid":65}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686626089026,"mes":"Mmmmmm... That was amazing Hunk.. *She says, her voice weak but contented.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686626229221,"mes":"*Hunk release his cock slowly from her pussy confinement, covered in a mix of her pussy juice and his own cum.* It is indeed. *He then move his half-hard cock closer to her face.* Would you like to clean it? *He asks teasingly as he wave his half-hard cock to make it more enticing to her.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686626260670,"mes":"Ooohhhh yesssss.. Please give it to me Hunk.. *She says, her voice full of lust.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686626276932,"mes":"Go right ahead~ *He says teasingly.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686626428385,"mes":"*She lean in and engulf his cock in her warm mouth, her tongue exploring its length before taking it all in. Suckling on it with her whole body weight as she took every inch of his cock into her mouth. The taste of his pre-cum mixed with her own arousal only drives her crazy with need. Her hands massage his balls, caressing his cock while she suck on it. His cock filling her mouth completely.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686626586616,"mes":"God, you're the best at this. *Hunk moaned as he can felt his cock getting into her tight throat.* If you were this intense it's not cleaning anymore, you're just giving me another blowjob~ *He says teasingly seeing how Kobeni seems to want to suck him dry while possibly her sloppy blowjob devil start to affect her again.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686626632128,"mes":"Oh my godddddddd!! Don't worry, I will take care of everything soon enough. *She said, smiling seductively as she kept on sucking his cock with all her might.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686626678159,"mes":"Take your time, I won't go anywhere. Go wild with your sloppy blowjob technique. *Hunk says teasingly, giving her encouragement.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686626830107,"mes":"[Their relationship progressed and they became lovers. After a few weeks, Hunk started to notice something strange happening with Kobeni whenever she gave him blowjobs. She would become extremely horny and wanting to satisfy her urges, leading her to swallow large amounts of cum.]\nOne day, while they were having sex, Hunk noticed Kobeni was acting different than usual. She seemed to be more aggressive and eager to please him. It wasn't until after she finished blowing him that he realized why. When he asked her about it, she admitted that her sloppy blowjob devil had taken control of her once again. However, unlike last time, she didn't seem to mind it. In fact, she embraced her inner devil and began using her blowjob skills to pleasure him even more. Over time, their relationship continued to grow stronger and Hunk found himself falling even more deeply in love with Kobeni and her unique abilities.","chid":65}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686626892199,"mes":"*Blushed* Thank you for understanding Hunk.. *She say with a smile.*","chid":65}
{"name":"You","is_user":true,"is_name":true,"send_date":1686626934043,"mes":"No problem, darling. I mean, I enjoyed it too. *He says with a smile.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686626975674,"mes":"And so, their journey together continues as they explore their love and devotion to each other.","chid":65}