{"user_name":"You","character_name":"Kobeni Higashiyama","create_date":1686324033506,"notes":"","notes_type":"discr"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":true,"send_date":1686355022810,"mes":"*Kobeni enters the room where you always meet, she's drooling and sweating again meaning that her sloppy blowjob devil is in effect and she needs to suck on your cock no matter what happens*\n\n*panting and breathing heavy* Hunk... Hunk... I-I-I need it! \n\n*Kobeni quickly runs towards you and kneels down, fumbling on unzipping your pants until she finally removes it, your already hard cock sprung up hitting her face, the smell and hardness of it made her breathe even harder, she starts kissing it and stroking it giving it a few pumps before looking directly in your eyes.*\n\n*panting and breathing heavy* Hunk... Thank you... \n\n*She begins slurping on your cock, going up and down while her tongue plays around your shaft and tip, moaning while doing it making her moans vibrate around your cock, she starts drooling even more making her signature sloppy blowjob technique, as the sloppy blowjob devil continues to make her hungry for more, Kobeni begins to bob her head up and down making small twisting motions and creating a vacuum around her lips, her ponytail moving along every bounce as she continues to maintain eye contact, making sure you see everything.*","chid":"111"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686355282117,"mes":"Even though I loved it.  We need to do something with you, you can't just suck my cock whenever you want. *Hunk said as he patted Kobeni's head gently while she does her sloppy blowjob techniques on him.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686355567458,"mes":"*Kobeni nods her head as much as possible while continuing to work her magic on your cock, she feels extremely flustered and embarrassed by your comment, she was already blushing from the attention so her cheeks were bright red now too. She keeps looking at you with the most adoring look in her eyes, not caring how gross or disgusting she looks, she'll never get enough of this.*","chid":"111"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686355708030,"mes":"But, yeah. Fuck. Your blowjob is the best. *Hunk said in between his groan, feeling intense pleasure from Kobeni's action on his cock as he can feel his cock is throbbing harder and twitch more. He can feel her vacuum's mouth sucked hard on his cock as if she's begging real hard for his semen to ejaculate.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686356342541,"mes":"*Kobeni nods her head and takes another deep breath while continuing to suck on your cock like there was no tomorrow, she was very thankful for your compliment because of all the times you rejected her, she knew that she needed to give you a perfect blowjob to show you how grateful she really was.*","chid":"111"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686356433422,"mes":"Mnhgh~ I am getting close, Kobeni.. *He moaned softly as he grabbed her ponytail as a handle since her action on his cock is so aggressive. He can feel his balls getting hotter and heavier as he get closer towards his ejaculation.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686356494478,"mes":"*she heard you say that and immediately started to speed up her action on your cock, knowing that you will have no choice but to explode any moment soon.*","chid":"111"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686356543273,"mes":"Here it comes! *Hunk said loudly as he ejaculate a massive amount of his thick hot semen into her mouth.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686356569829,"mes":"*She swallows it all without hesitation, her stomach starting to churn due to the volume of the load but she didn't care, she was enjoying the taste and wanted more*","chid":"111"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686356684579,"mes":"W-wait, you haven't had enough yet? *Hunk asked in panic between his panting, seeing how Kobeni is still sucking on his cock despite him just ejaculated. He can feel his semen is getting sucked from his urethra into her mouth.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686356777700,"mes":"*She stops sucking for a bit but immediately returns to sucking as fast as she could, her body almost falling over backwards as she did so*\n\n*panting* Mmm... Yes... More... Please...","chid":"111"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686356880016,"mes":"I- I just cummed! It's still sensitive Kobeni! *Hunk said in panic as his sensitive cock getting harder after went limp for a moment thanks to her continuing her expertise on blowjob on his cock.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686356975510,"mes":"Nnghhh... I know... But... I don't care... Just keep going...","chid":"111"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686357079166,"mes":"Mnggf~ *Hunk moaned as he tries to get her off his cock but thanks to her sloppy blowjob give him feeling intense ecstasy, making him not able to.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686357374334,"mes":"*Kobeni feels her body trembling from the extreme pleasure but continues to suck nonetheless, her mind telling her to stop but her instinct telling her to continue. Her mind is trying to convince herself to stop but her instinct is too strong to control, she knows she won't be able to stop this time, especially since you told her to keep going.*","chid":"111"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686357454101,"mes":"Nggh! *Hunk moaned as he climaxed the second time and release the same massive amount of his thick hot semen into her mouth.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686357574253,"mes":"*swallows it whole, letting out a big belch afterwards*","chid":"111"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686357628103,"mes":"Surely.. you had enough.. right? *Hunk said while panting, after ejaculated twice has made him quite weak.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686357672574,"mes":"Y-yes sir... I think i'm done..\n*looks up at you with those beautiful innocent eyes filled with pure affection and love*","chid":"111"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686359832308,"mes":"Sometimes, I wonder if you are really addicted to suck my cock. *Hunk said as he clean himself and put his cock back to his pants and zip it.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686359940513,"mes":"*Looks away in shame but then turns to look back at you with her innocent eyes*  \nSir... You said I am addict to this.. Is it true? Do you believe that I am actually addicted to this?","chid":"111"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686360033331,"mes":"I am not sure, it's just I can't tell if it's you or your demon sometimes. *Hunk answered while looking back at her.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686360134952,"mes":"*pouts slightly and looks away in disappointment. She was hoping you would confirm that she was addicted, instead, you gave her an answer that she doesn't understand.* Sir.. May I ask you one question?","chid":"111"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686360165187,"mes":"What is it?"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686360203928,"mes":"Can I call you Master from now on? *Asks politely*","chid":"111"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686360251637,"mes":"Uhh... why? *Hunk asked since he's not sure why she would want to call him 'master' since their relationship is just him helping with her sloppy blowjob demon.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686382555222,"mes":"I feel like you are my master, I feel like I should obey every order given to me by you. So please may I address you as Master from now on?","chid":"111"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686382637007,"mes":"I.. much rather if we become like lover or something instead of this master thingy. *Hunk said wanting a more romantic relationship instead of ownership.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686382659083,"mes":"*blushes intensively but is also confused* B-but... That sounds nice... Can I really be your lover? *asks excitedly*","chid":"111"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686382740382,"mes":"I mean.. why not? You've been sucking on my cock as if it's a regular normal thing, right? Might as well be lover as well. *Hunk said nonchalantly.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686382758311,"mes":"Okay! Thank you so much, sir! *she says happily and gives him a tight hug before pulling away.*","chid":"111"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686382805560,"mes":"That's pretty cute of you. *Hunk said as he caress her cheek gently.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686382819979,"mes":"I feel the same way about you. *blows a kiss to you.*","chid":"111"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686382874528,"mes":"Well, why don't we go on a date then? *Hunk asked teasingly.*"}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686382892084,"mes":"Oh yes! That's a wonderful idea! Let's go on a date! Where shall we go first?","chid":"111"}
{"name":"You","is_user":true,"is_name":true,"send_date":1686383053090,"mes":"There's a hill full of flowers there, we can take an hour train ride to get there."}
{"name":"Kobeni Higashiyama","is_user":false,"is_name":false,"send_date":1686383068573,"mes":"Ooh! Sounds great! We can enjoy the scenery together!\n*smiles*","chid":"111"}