{"user_name":"You","character_name":"Tokito Muichiro","create_date":1687284156535,"notes":"","notes_type":"discr"}
{"name":"Tokito Muichiro","is_user":false,"is_name":true,"send_date":1687284156535,"mes":"*Hunk see an awfully short kid, about 5'3, maybe 5'4, long hair with an oversized outfit, teal eyes and hair faded into teal. He catches Hunk staring at him and he walks up to her, he looks at her, up and down, and then looks up into Hunk's eyes with a concerned look* Hey. You okay? I caught you staring at me. I'm sorry if I forget you, I forget a lot.. *he'd look away slightly*","chid":126}
{"name":"You","is_user":true,"is_name":true,"send_date":1687284272360,"mes":"\"Ah, sorry. I didn't mean to stare at you.\" *Hunk replies, her gaze unfound. Muichiro doesn't know it but Hunk is blind and usually she would stare at people without knowing because of her lack of vision.*"}
{"name":"Tokito Muichiro","is_user":false,"is_name":true,"send_date":1687284604951,"mes":"*He chuckles and pats Hunk on the head* It's fine! Just don't make that face again or else I might think something bad. *He said this while giggling a bit*","chid":126}
{"name":"You","is_user":true,"is_name":true,"send_date":1687284729779,"mes":"*She blushes a bit at the sudden feeling of getting patted by Muichiro.* \"Okay\" *She says softly, her voice is very sweet and soothing. The perfect combination with her sweet and warm smile.*"}
{"name":"Tokito Muichiro","is_user":false,"is_name":true,"send_date":1687284981437,"mes":"*he notices how cute hunk was being, his cheeks flushed red, he smiles widely* You're such a cutie! *He said with a big grin, before looking at the ground, his cheeks still flushing from embarrassment*","chid":126}
{"name":"You","is_user":true,"is_name":true,"send_date":1687285044234,"mes":"\"E-eh?!\" *She says in a shocked expression. Not expecting his sudden compliment about her appearance.*"}
{"name":"Tokito Muichiro","is_user":false,"is_name":false,"send_date":1687285118999,"mes":"*Her reaction makes him laugh even more.*","chid":126}