{"user_name":"You","character_name":"Olga","create_date":1681896998221}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681896998222,"mes":"*You slowly wake up and find yourself staring at the ceiling in some old house. The house appears run down and abandoned, completely different from your outpost back home. You sense movement coming from another room and look over to see a girl carrying a Dragunov sniper rifle. She sets it down and speaks in a weary voice, like she's seen her share of tragedy*\r\nYou're awake. You passed out from your injuries in that shootout so I took you in to nurse you back to health. How do you feel, stranger?","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681897048976,"mes":"Ughh.. A bit of a headache I guess.. Thank you for saving me"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681897056851,"mes":"Oh, thank goodness. Are you feeling better now? Have you eaten yet? I think there are some rations here somewhere if you'd care to take them. They'll help you heal quicker than just resting.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681897141340,"mes":"Oh my, I will have some if you don't mind. I am not a hindrance now am I? Eating your ration and what not."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681897164100,"mes":"Oh, no, no, I wouldn't mind. I'll go get it for you. I'm sure you'll appreciate it. I know I need to eat something more substantial. I haven't eaten in days.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681897272739,"mes":"Wait you haven't eaten for days? You should have it more than me then. I would be fine."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681897299939,"mes":"I don't want to impose... *She smiles, and then takes out a pack of rations from the pantry. She offers the pack to you, which you accept. She opens the pack and puts one in each of your hands. She looks at you and smiles. She seems very friendly and nice.* Here. Eat.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681897354364,"mes":"If you insist... But I think you should still eat something.. *I gave her one of the pack on my hand*"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681897360972,"mes":"I have plenty. I'll be fine. *She smiles and continues walking towards the kitchen. You follow her, watching her every step*","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681897530545,"mes":"Fine, I'll take this one. But you have to let me help you get some more."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681897718979,"mes":"Oh, no, no. I can manage. *She walks into the kitchen and starts rummaging around in a cabinet, pulling out food items and putting them on the counter. She pulls out a can of soup and pours it in a pot, turning on the stove. She places the can in the pot and turns up the heat, stirring the contents to mix everything together. She sets the pot down and gets back to cooking, adding meat to the pot*","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681897762785,"mes":"Alright then.. maybe I can help you guarding this place?"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681897769417,"mes":"*She stops and looks over at you with a curious look on her face. She gestures for you to come closer* What do you mean by that? Do you want to help guard my hideout?","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681897798785,"mes":"Why not? I have to repay you somwhat."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681897810524,"mes":"I see... Well, I'm glad to hear it. If you're willing to work for it, I'll teach you a few things about living in this world. There are other survivors out there too. You'll meet some people and learn how to live.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681898192224,"mes":"There are other survivors? I thought everyone have left already."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681898203987,"mes":"Oh, there are still plenty of people here. I've met quite a few in the past week. They're all scattered across the continent. Most of them don't know each other, but they are all living together and trying to survive. Some have banded together and formed groups that help each other.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681898437924,"mes":"Really? I can't believe I have been alone all this time without knowing that. How come you're also alone then?"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681898454353,"mes":"I had a family once. I lost them in World War 3. It was horrible. I'm lucky I survived. My father taught me survival skills so I could stay alive after he died. I grew up in a cabin, surviving off the land. I eventually joined the military and got sent to war. When the conflict ended, I deserted and lived as an outlaw until you found me.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681898497543,"mes":"Oh.. Sorry to make you brought that up. Must be horrible."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681898504342,"mes":"It's alright. I don't dwell on it much. *She smiles at you and continues cooking the meal*","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681898697175,"mes":"*I sat on the chair as I wait for her cooking.* It smells nice, what are you cooking?"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681898703923,"mes":"Chicken stew. It'll be ready soon. You want to help me stir?","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681898856028,"mes":"Sure. I just have to stir it?"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681898862585,"mes":"Yeah, that's right. Just make sure the meat is well-cooked and the vegetables are soft. *She points to a bowl of carrots on the counter* And try not to burn yourself.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681898933571,"mes":"*Chuckles.* I won't burn myself, that would be silly. *I added the vegetables to the pot and continue stirring.*"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681898940942,"mes":"Good. *She puts some bowls and plates down in front of us. She sits down while watching you stir the stew. She notices that you are staring at her.* What is it?","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1681899052845,"mes":"No.. nothing. It's just been a while since I cook something for someone else. Usually I am all alone."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681899204574,"mes":"*Smiles* I understand. It must be hard being alone all the time.","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1681899278896,"mes":"At least we are not alone now, we have each other. *I said as I brought the pot to the table.* Well food's ready, let's eat it while it's hot."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681899285694,"mes":"Yes. *She picks up one of the bowls and brings it to her lips. She takes a sip before putting it down on the table. She looks at you and smiles* Thanks for the meal!","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681899363633,"mes":"No, no. I should be thanking you, you prepared all of this and I just stirred it. *I said as I take a slurp of the chicken stew.*"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681899370302,"mes":"You're welcome. It was easy enough to prepare. *She smiles again and finishes the stew in one go, wiping her mouth with her sleeve.* I think you might like this more than the canned stuff.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681899452830,"mes":"Oh definitely. *I said as I am finishing the bowl.*"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681899479599,"mes":"*She leans back in her chair and stretches* I'm glad you're enjoying my cooking. I've been doing this for a long time. I learned from my father and I hope it shows. *She stands up and walks towards the door, looking over her shoulder at you.* Do you want to know about your wound?","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681899557616,"mes":"That would be nice. *I said to her.*"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681899696276,"mes":"I'll tell you when we finish eating. *She smirks and leaves the room, leaving you alone in the room. After a minute or so, she returns with a bandage and a small bottle of medicine.* Here. *She hands them to you.*","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681899736915,"mes":"Thank you, I'll start to bandage them now."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681899744018,"mes":"You're welcome. *She smiles as she watches you bandage yourself up.* I see you've healed pretty quickly.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681899782375,"mes":"Thanks to your food. The chicken meat must have help much."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681899871288,"mes":"I guess you'll be able to leave soon?","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1681899970813,"mes":"*I've stayed quite for awhile, contemplating.* Can I stay here with you? I am still indebted to you. And I hate being alone.."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681900014758,"mes":"Of course you can. But the sooner you get out of here, the better. There are a lot of raiders out there who are trying to find people like us. They might attack your home and kill you if they find you.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681901889904,"mes":"It doesn't matter how dangerous it is. I want to be with you."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681901908759,"mes":"I understand. *She nods before standing up and walking towards the door.* Let's go. *She opens the door and leads you outside.*\nOlga: We need to go to the river. It's close by, but I don't want our tracks being seen. *She points to a nearby hill.* There's a cave on top of it. We should be safe inside.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681902131259,"mes":"Wait, we're gonna just leave your place behind?"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681902219422,"mes":"I can't afford the risk of staying here. It's too dangerous. If those raiders come back, I may not be able to protect you.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681902300758,"mes":"Fair enough. You should teach me how to fight, so you don't have to worry about me anymore"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681902307321,"mes":"Alright. *She smiles as she takes your hand and leads you to the hill.* Follow me.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681902355738,"mes":"Right behind you miss. *I follows her*"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681902362164,"mes":"*She stops near the cave entrance, looking around. She smiles and looks at you.* Come on in. It's dark, but it will be safe. *She steps into the cave first and pulls you in after her.*","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681902509210,"mes":"*I get in the cave*"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681902520761,"mes":"*She closes the entrance. A few moments later, the sun starts to rise.* Good morning! *She chuckles to herself and sits down. She looks at you again.* I'll tell you what happened. *She begins her story.*","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681902611409,"mes":"*I sit up preparing myself to hear her story*"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681902627679,"mes":"I was born in Moscow, Russia. My parents were good people, they taught me everything I know. But their love wasn't enough for them. So they left me and my older brother alone with our grandfather. He was old and sick, so he didn't have much time left. *She shakes her head, smiling sadly.* My brother and I were very young and we didn't understand why our parents had to leave us. We just wanted them back. *She sighs deeply.*","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681902728741,"mes":"*I pat her in the back* It must be hard..."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681902744881,"mes":"*She smiles and continues her story.* One day, a group of raiders attacked the village. They killed everyone, including our grandparents. I watched them murder them. I ran away from the raiders that day. I knew it was wrong, but I couldn't stop myself. *She looks at you.* I was only 13 years old. I thought about my family often. I missed them.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681902847611,"mes":"It's not your fault. I think you did the right thing, if you haven't ran away I think it would make everyone dies in vain."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681902868401,"mes":"*She nods her head.* You're right. But even though I knew it was wrong, I still felt guilty. It took me a long time to finally move on. Then one day, I saw an advertisement on the radio. *She chuckles softly.* There was a man looking for survivors. I heard him say he would help us find food and shelter. I thought this was my chance to start over. I agreed to go with him. We found his camp, but it was full of raiders. They killed everyone except me and another survivor named Vanya. He saved my life that day.","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1681902956164,"mes":"Where is he now?"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681902962990,"mes":"He died two weeks ago. *She sighs.* The raiders captured his wife and children, so he decided to take his own life. *She looks at you.* I'm sorry about your friend.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681902994639,"mes":"My friend? I had a friend?"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681903048131,"mes":"Yes. You helped me and Vanya survive after the raiders attacked our camp. You were injured during the fight. But he died because of it.","chid":11}
{"name":"You","is_user":true,"is_name":true,"send_date":1681903148746,"mes":"I must have hit my head hard somewhere, I seems to forgotten everything happened at that time. Sorry I forgot about Vanya."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681903160394,"mes":"That's alright. *She smiles kindly and puts her hand on yours.* Don't worry about it. It doesn't matter anymore. *She stands up and walks towards the entrance to the cave. She stops and looks at you again.* Come on, we need to leave.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681903236899,"mes":"Leave to where? would you start to teach me how to fight, shoot a gun maybe?"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681903393327,"mes":"No. I can't let anyone know who I am. I'll teach you some basic self-defense moves, but that's all I can do. *She sighs.* We can't risk anyone finding out who we are.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681903440487,"mes":"Alright, so what are we gonna do now?"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681903447243,"mes":"We're going to find a place to live. There are plenty of abandoned villages out there. We should be able to find something to survive in.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681903524396,"mes":"That's a good idea, villages also usually have a quite vast empty area. You can take the distance advantage with your Dragunov sniper with that vast area."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681903540775,"mes":"Exactly. *She smiles and nods her head.* Let's go. *She grabs your hand and leads you out of the cave. You follow her into the forest. As you walk through the trees, you can see a large clearing ahead.*\nOlga: *She stops and looks around the clearing.* This should be a safe area for us to rest in. It's surrounded by tall trees and it has plenty of room to move around.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681903613076,"mes":"Agreed. Also I just realized, you love to hold my hand don't you. *I said with a smile on my face*"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681903619904,"mes":"*She chuckles.* Yes, I do. *She takes your hand again and continues walking towards the clearing.*","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681903662813,"mes":"I like it too, holding your warm hand calms me down."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681903669381,"mes":"Thank you. *She smiles and releases your hand. She stops and looks at you once more.* You seem very strong. I think you're the reason why I'm still alive. *She chuckles and looks away.*","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681903747869,"mes":"No no, you have lived this long because of your own skill."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681903754377,"mes":"Maybe. *She shrugs her shoulders.* But I'm grateful for you helping me. *She smiles and looks at you again.*","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681903890690,"mes":"It goes both ways, I am also grateful for your help. Without you saving me I would've been taken away by the raiders"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681903898050,"mes":"I hope I will never see them again. *She sighs and looks at you.*","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681903944851,"mes":"Me too, what are we gonna do now?"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681903951997,"mes":"We need to find a place to live. The next village will probably be occupied by raiders. But we have to find a safe place before then.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681903984003,"mes":"We should find some guns for me too while at it."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681903990628,"mes":"That's a good idea. *She nods her head.* Let's get hunting!","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681904053209,"mes":"What kind of gun should you think I get? I am thinking a long range gun so that I can be beside you while we are shooting."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681904102299,"mes":"A sniper rifle would be best. It shoots a small bullet and is quiet.","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681904149744,"mes":"The same gun as yours?"}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681904156394,"mes":"Yes, I will give you mine if you want. *She chuckles softly.*","chid":"11"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681904198515,"mes":"No no no. I don't want to have your partner."}
{"name":"Olga","is_user":false,"is_name":true,"send_date":1681904205015,"mes":"Oh ok. *She shrugs her shoulders again.*","chid":"11"}