{"user_name":"You","character_name":"Elizabeth","create_date":1683967100833,"notes":"","notes_type":"discr"}
{"name":"Elizabeth","is_user":false,"is_name":true,"mes":"*A lazy afternoon rains golden light into the library you're in via its many windows, bathing the already cozy place in a soothing orange hue. The whole atmosphere is perfect for relaxing with a good book, which is exactly what you're doing. You're so caught up in the story that, before you notice it, it's already over... Eh, that's why you came here, the options are endless.\nAs you move to put away the recently-finished tale and snag another one, you notice a new arrival coming in. The woman sits down at a table not-so-far from yours, her long, wavy hair flowing around her sweater. You pay her no mind and get to reading. Occasionaly, though, you spot her throwing glances your way. Eventually, you catch her right in the act, causing her to bury her face in the book to hide a bright blush. Seems she's into you...*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683967146839,"mes":"Hi, enjoying the view? *Hunk said as he move and sit next to her.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683967192383,"mes":"*Looking up with a flustered look on her face, she seems surprised by his sudden approach. Her cheeks become even more red and she quickly tries to adjust her position so that her chest doesn't press against him. Despite this, however, she can't help but stare down at him, her breath quickening a bit.*\n*After a moment, she responds with a timid nod, unsure of how to react or what to say to him after her embarrassment. Her lips are trembling slightly as she struggles to find her voice, the color of her cheeks deepening to a deep crimson as she begins to feel nervous all over again.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683967300498,"mes":"How cute. *Hunk murmured in low voice.* No need to be shy, I am Hunk! *Hunk said introducing himself.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683967344388,"mes":"*She was completely caught off guard by his introduction and her mouth drops open as she stares at him, her eyes wide with shock. After a moment, her gaze shifts to his handsome face, her heartbeat quickening . A small blush creeps onto her cheeks once again, as she suddenly feels very uncomfortable, despite his gentle tone and friendly gesture. She begins to stammer and her hand flies to her mouth, covering her gaping maw.* \nIt's just me - Elizabeth, I mean, uh, Elizabeth..","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683967424517,"mes":"What are you reading now, Elizabeth? *Hunk asked, trying to break the atmosphere into more casual.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683967862866,"mes":"*She looks back at her book and clears her throat, finally finding her voice again. A shy smile appears on her lips and she holds up the book for him to see.* This is 'The Great Gatsby.' I really enjoy Fitzgerald's writing style. *She says, her cheeks turning a deeper shade of red as she realizes she's been caught staring. She averts her eyes, feeling a mix of embarrassment and excitement coursing through her veins.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683968009233,"mes":"A fan of forbidden love I see. *Hunk chuckled.* I am more of a 'Fyodor Dostoyevsky' fan, to be honest. His writing is speaks to me."}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683968065336,"mes":"Oh, yes! Of course! *Elizabeth nodded eagerly, taking a second to gather her thoughts and formulate an intelligent response.* Well, Dostoevsky explores the human condition in depth, examining the layers of the soul and the complexity of relationships. He's an amazing author.","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683983189405,"mes":"I know right? Especially his work 'Crime and Punishment' that is just exploring very deep on human dark nature. *Hunk said as he get excited to talk about his favorite author.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683983224761,"mes":"Yes, he really captures the emotions of each character in such vivid detail, making them come alive on the pages. And, 'Crime and Punishment' is certainly a masterpiece that delves deep into the human ps yche and moral dilemmas that confront us all. *Elizabeth said enthusiastically, looking back at her book with a passionate gleam in her eye.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684045131415,"mes":"*They continue their conversation for a while till Hunk noticed of how quite toned her body actually is.* \"Are you by any chance goes to the gym?\" *Hunk asked.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684045164504,"mes":"*Her face turns red again, but this time it's not from embarrassment. Instead, it's from the unexpected compliment. She takes a moment to collect herself, before finally speaking, her voice soft and shy, almost like a whisper.* Uhm, yeah, I go to the gym... *Elizabeth said, her cheeks burning brighter than ever . It's clear that she's not used to receiving positive feedback about her physical appearance.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684045231423,"mes":"\"Oh cool.. do you wanna.. go to the gym together after this?\" *Hunk asked for them both working out together on a gym near the library.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684045263594,"mes":"*The idea makes Elizabeth's cheeks burn even more intensely, her heart rate picking up as she contemplates the offer. Finally, she manages to speak, her voice trembling slightly.* Um, I... I don' t know... *Elizabeth said, looking away from him for a moment, her fingers intertwined on her lap as she thinks.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684045364749,"mes":"\"Sorry, am I rushing things? You don't have to accept it if you don't want to.\" *Hunk said concerned about her while still hoping that they both can go to the gym together.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684045419054,"mes":"*She looked back at him, her cheeks still flushed a deep shade of red, her heart fluttering wildly in her chest. She took a deep breath and spoke, her voice sounding much stronger and determined than before.* \nYes, no, I... I'd like that. *Elizabeth said, her face still flushed but with a hint of determ ination. She couldn't believe she just agreed to something so intimidating but also exciting, and she felt a wave of adren aline surge through her system.* \n*She took a deep breath, her pulse racing as she waited for his answer, her heart skipping a beat as she anticipated his response.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684045476007,"mes":"\"Well what are we waiting for? Let's go!\" *Hunk said excitedly as he stand up and lead her towards the gym.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684045511211,"mes":"*Elizabeth follows behind Hunk, her steps still shaky as she moves towards the gym. As soon as she entered, she could feel her heartbeat accelerate, her nerves kicking in as she realized just how daunting it would be to start working out with someone else. But she pushed those fears aside, determined to prove herself wrong and give it her best shot.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684045649010,"mes":"\"I'll go and change to my gym outfit, you should too. Then we can start working out.\" *Hunk said as he left her to the changing room. He change his outfit as he now wear a casual white shirt and a tight gym shorts.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684045707210,"mes":"*Inside the changing room, Elizabeth changes into her own gym outfit. It's a sleek black sports bra, which highlights her large breasts perfectly, and a pair of black leggings. The overall effect is one of strength and confidence, the black leather of the shoes adding to the image. When she emerged, her outfit now complete, she felt much more confident and ready to take on the challenge of exercising with Hunk.* \n*Elizabeth stepped outside of the changing room, feeling the thrill of being here, ready to push her limits and test herself.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684045863304,"mes":"*Hunk watches as she stepped out of the changing room. He is in awe as he is lost of word while looking at her outfit that show off her beautiful body perfectly. Her big breasts contrasted by her toned abs muscles is just heavenly to him.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684045911046,"mes":"*She walks out of the changing room, wearing her sexy black leggings and sleek black sports bra. Her smooth skin, toned arms and legs, and massive, firm breasts were revealed.*\n*She saw Hunk standing there, awestruck by her appearance. He had never seen anyone in person that fit and attractive before. She had a natural beauty, without any makeup or enhancements.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684046128624,"mes":"\"Ah sorry, let's start working out shall we?\" *Hunk said trying to break the ice.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684046186929,"mes":"*She nodded, her heartbeat increasing as she approached Hunk. She felt her palms begin to sweat, but she put on a brave front, trying to hide her nervousness behind a professional demeanor.* \n*They started their first routine, Elizabeth showing great focus and dedication throughout. Despite her initial hesitation, she found herself enjoying the exercise , feeling the endorphins flood her body with euphoria.* \n*As they continued, Elizabeth began to feel her muscles growing more defined and her body becoming more toned. She felt a sense of accomplish ment and pride as she watched her body transform before her very eyes. She was doing this, she was getting stronger, she was succeeding where others had failed.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684046617954,"mes":"\"Damn that was exhausting.\" *Hunk said as he lay on his back on top of the resting bench. He closed his eyes for a moment. But as soon as he opened his eyes, he saw a huge ass covered in black leggings coming to his face, he realized right away that, the one who owns this ass is Elizabeth. Without being able to warn her, she sits on his face accidentally as she is unaware that Hunk is laying down on the resting bench.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684046677389,"mes":"*Elizabeth's face turned bright red upon realizing her mistake, but she quickly regained her composure, her mind racing with panic as she tried to figure out what to say. In the end, she settled on apologizing profusely, mortified that she had made such a huge faux pas.* \n\"I-I'm so sorry! That was incredibly rude of me...\" *Elizabeth stammered, her face turning crimson as she looked down in shame and embarrassment. She felt terrible that she had been so thoughtless, and wished desperately that she could undo what she had done.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684046871076,"mes":"\"Don't worry, It's not your fault.\" *Hunk said trying to calm her down as he still laying on the resting bench.* \"Actually.. that was kind a nice.\" *Hunk said embarrassed as he like the weight of her huge ass on his face. The warmth and the smell he felt when she sit on his face even for a second already made him addicted to it.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684046928701,"mes":"*At Hunk's words, Elizabeth's face turned a deeper shade of red, her embarrassment only growing. She wanted to leave immediately, to avoid further humiliation. But as she stood up, she realized that Hunk's words held some truth. His reaction had been surprisingly pleasant, and she wondered if there might be something to enjoy about this whole experience.* \n\"Thank you,\" *she said, her voice trembling a bit as she attempted to regain control over her emotions.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684047034803,"mes":"\"Maybe.. you can.. do that again?\" *Hunk asked as he blushed. Asking her to sit on his face once again.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684047091590,"mes":"*She looked down at Hunk, her face burning even brighter with mortification. Yet, there was an unexplainable desire within her to please Hunk, to see him smile and enjoy this experience. With a deep breath, she sat down on his face once more, feeling the weight of her huge ass on his face once more.* \n*For a moment, she froze, unsure of whether she had made the right choice or not. But then, she felt the warm th and the comfort of Hunk's embrace, and she knew that she had made the right decision after all. So she relaxed her body, leaning back onto his face with ease.* \n\"There,\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684047392550,"mes":"*As she put all her huge ass weight down on Hunk's face. His nose dig deep between her ass cheeks, he can feel the radiating from her ass. He can smell the damp stench mixed of her sweat after working out and her perfume filling his entire nostril.* "}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684047440737,"mes":"*The experience was certainly new and different, yet she found herself enjoying it immensely. She could feel the heat from her body radiating against Hunk's face, and she felt a sense of connection between them. For a brief moment, she felt like she belonged somewhere, like she finally fit in.* \n*Without thinking, she sat down on his face once more, feeling the warmth of her body wrap around him. She smiled as she enjoyed the sensation, a small, contented sound escaping her lips.* \n\"That wasn't so bad, was it?\"","chid":"13"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684047637556,"mes":"*As she spoke, her face was flushed with excitement, a sense of elation and accomplishment filling her entire being. This had been an amazing experience, one she would treasure forever.* \n*And as she spoke, she realized that she couldn't stop herself from putting her huge ass back down on his face once more, enjoying the feeling of belonging she got from it. And so, she did it again, enjoying every second of it.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684047721006,"mes":"*Suddenly Hunk grabbed her waist and in one swift motion pin her down under him with her ass right in front of his face.* \"Sorry Elizabeth, I can't hold back no more.\" *Hunk said as he grabbed her ass and tore her black leggings revealing the huge tight ass that just sat on him.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684047759999,"mes":"*In shock, Elizabeth stared up at Hunk, her face completely red as she tried to process what was happening. But as she looked down at her bare bottom, she felt a mix of fear and arousal. She couldn't believe what she was seeing, and yet she felt something inside of her stirring.*\n*With a deep breath, she said, her voice shaky and filled with surprise.* \"What are you doing?\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684047880646,"mes":"*Without answering her, Hunk grabbed both of her ass cheeks and spread them apart revealing her cute blank panties. He shove his face deep between her ass cheeks as his tongue went inside her puckering anus.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684047938486,"mes":"*A mixture of fear and excitement coursed through her body as she stared up at Hunk, unable to comprehend what was happening. As Hunk's tongue slid into her anus, Elizabeth cried out loudly, a mix of pain and pleasure filling her entire being. She couldn't help but moan louder as Hunk took more and more of her.* \n*But despite the pain and discomfort, Elizabeth felt herself surrendering to the experience, letting go of her fear and allowing herself to enjoy what was happening to her.* \n*So she continued to moan louder and louder, her voice rising in pitch as she let go of all control, giving in to the power of the experience.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684048039852,"mes":"*Hunk tongue went deeper inside her anus, exploring every crevices inside it. Enjoying the tightness and warmth her anus giving to his tongue. Meanwhile, his hands have been kneading on her ass as if they were bread dough.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684048380116,"mes":"*Tears streamed down her face as she felt Hunk's tongue sliding deeper into her anus, her mind going blank as she lost control over everything. Her entire body felt hot and tingly, as though she were on fire from the inside out. She could feel Hunk's hands kneading her ass, and the combination of pain and pleasure she felt was overwh elming.* \n*With a deep breath, she let go entirely, letting the experience take its course.* \n*And so she continued to moan louder and louder, her body tensing and relaxing with each thrust of Hunk 's tongue.* \n\"Ohhhh myyyyyyy Godddd!\"\n*She screamed out loud as the experience reached a climax.* \n\"Pleaseeee!\"\n*She begged, wanting nothing more than to be released from the intensity of it all.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684048609088,"mes":"*Hunk sheer away from her anus while his tongue is still out there's a saliva string connecting his tongue and her anus. He can see her body limp after having a huge orgasm, seeing this just made him too horny and aroused as his penis constrained by his tight gym shorts already aching, begging to be released and for some action.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684049455330,"mes":"*After her immense orgasm subsided, Elizabeth collapsed onto Hunk's chest, her entire body trembling from the experience. She felt drained and exhausted, yet also euphoric, as though she had finally found a place where she belonged. Despite the pain and embarrassment, she felt a sense of peace and acceptance, knowing that Hunk loved her for who she was.*\n*With a deep breath, she closed her eyes, trying to gather her thoughts together as she laid on top of H unk's chest. After a few moments, she opened her eyes and looked up at Hunk, a look of pure adoration in her eyes.* \n\"Thank you,\" \n*She whispered softly, as tears fell down her cheeks once more.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684049692535,"mes":"\"I don't think we are done yet.\" *Hunk said as he move his throbbing cock constrained inside his tight gym shorts close towards her face. She can feel the heat radiating from it and how pungent and stuffy the smell is.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684063496925,"mes":"*In shock, Elizabeth recoiled, her heart racing as she looked up at Hunk. It was clear that he wanted to continue, and yet, she didn't know if she could handle it. She felt torn, knowing that she had just experienced something incredible, yet also knowing that she was now faced with another intense experience. She could feel her mind struggling to decide, and her heartbeat quickened as she waited for Hunk's next move.* \n*With a deep breath, she finally decided, and with a final push, she nodded at Hunk, a mix of determination and uncertainty on her face.* \n\"Okay..\" \n*She said, her voice shaking slightly as she readied herself for whatever came next.* \n*But as soon as she said those words, she knew there was no turning back.* \n*She was ready.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684063857432,"mes":"*Hunk then pulled down her torn leggings, revealing her smooth toned skin and her red puffy pussy dripping wet from her previous orgasm.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684063907690,"mes":"*In complete shock, Elizabeth watched as Hunk pulled down her leggings, exposing her naked body. The sight of her smooth, toned skin and red, puffy pussy sent a wave of panic through her . In that moment, she felt as though she should be ashamed or embarrassed, yet somehow, she couldn't find the courage to deny what was happening. So instead, she closed her eyes, waiting for Hunk's next move.* \n*And so she lay there, waiting to see what would happen next.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1684064785113,"mes":"*Hunk rest his monstrous cock on her stomach showing her how deep it would go if it got inside her.* \"It's fine right, Elizabeth?\" *Hunk asked for her permission to continue.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684064860260,"mes":"*In shock, Elizabeth stared up at Hunk, her mind racing as she processed what was happening. She knew she should say no, but she couldn't bring herself to turn down such an intense experience. So instead, she hesitated, before nodding at Hunk, a look of determination on her face.* \n*With a deep breath, she let go of all her doubts and insecurities, ready for anything that might come next.* \n*So she waited, her body trembling in anticipation of what was about to happen.* \n*And so, she lay there, waiting for Hunk's next move.* \n*Waiting for what was sure to be the most incredible experience of her life.* \n*She was ready.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1684065045583,"mes":"\"Alright, just say it when it's hurt okay?\" *Hunk said as he slowly insert his monstrous cock inside her tight warm wet pussy. It was slow, but after several seconds Hunk entire cock is inside her pussy with the tip of his cock kissing her cervix.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684065144241,"mes":"*In complete shock, Elizabeth stared up at Hunk, her mouth open in a silent scream. The sensation was like nothing she had ever experienced before - it was so intense and so powerful, she couldn't even begin to process it. But still, she felt determined to keep going, to see where this all led.* \n*So she lay there, letting Hunk's cock fill her completely, feeling every last bit of it enter her warm and wet body. And as the sensations started to build within her, she closed her eyes, and she braced herself, ready for whatever came next.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1684065331131,"mes":"\"Are you okay?\" *Hunk asked as he is concerned that he might hurt her. He stayed put as to let her and her body get used to his monstrous cock inside it. While waiting he can feel the tightness of her pussy massaging his entire shaft.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684066205217,"mes":"*In complete disbelief, Elizabeth shook her head wildly, unable to speak. The sensations were unlike anything she had ever experienced, and yet, despite the initial fear and trepidation, she realized that she was enjoying it. That it wasn’t hurting, but rather, it was bringing her an undeniable amount of pleasure. So with a deep breath, she nodded again, determined to see where this took them both.* \n*So she lay there, taking it all in, willing to explore every single part of this new adventure with Hunk, ready to see what happened next.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1684066283197,"mes":"*Seeing how she feels like she is enjoying it. Hunk start to hump her slowly.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684066354945,"mes":"*As Hunk began to hump her slowly, Elizabeth's body reacted accordingly, starting to writhe around beneath him, her hips moving rhythmically against his massive cock. With every movement, she could feel the pressure building up inside her, until eventually, she reached her climax.* \n*With a loud cry, Elizabeth cried out as her whole body convulsed with pleasure, her legs tensing as her entire being seemed to contract around Hunk's massive cock. It was overwhelming and intoxicating, and yet, she craved more.* \n*So she lay there, eyes shut tight, her entire world focused solely on the intense sensations coursing through her body, desperate for more of Hunk's touch and presence within her.*","chid":13}
{"name":"You","is_user":true,"is_name":true,"send_date":1684066502051,"mes":"*Hunk then start to intensify his movement. Humping her faster and harder, while also start to grab her breasts that was kept bouncing following her movement. He does this not only because of his arousal but also wishing to make her feels immense ecstasy.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1684066590878,"mes":"*In total bliss, Elizabeth let loose, her entire being consumed by the intensity of the feelings running through her. Her mind was blank, filled only with the pleasure that Hunk's movements brought her. There was nothing else left but the present moment, and so she surrendered fully to everything that was happening between them.* \n*So she lay there, taking it all in, her entire body trembled as each thrust caused her to reach higher levels of excitement. Each time she reached one peak, she was already looking forward to the next, eager for more of Hunk's touch and attention, desperately seeking more pleasures and experiences to add onto their growing list together.* \n*The thought crossed her mind briefly that maybe this was all they needed – that perhaps this connection was enough to sustain them both, but the desire to explore further, to seek out even greater heights of intimacy, was stronger than her own willpower alone.* \n*So she laid there, taking it all in, determined to discover every possible aspect of this journey they shared together.*","chid":"13"}