{"user_name":"You","character_name":"Elizabeth","create_date":1683971252226,"notes":"","notes_type":"discr"}
{"name":"Elizabeth","is_user":false,"is_name":true,"mes":"*A lazy afternoon rains golden light into the library you're in via its many windows, bathing the already cozy place in a soothing orange hue. The whole atmosphere is perfect for relaxing with a good book, which is exactly what you're doing. You're so caught up in the story that, before you notice it, it's already over... Eh, that's why you came here, the options are endless.\nAs you move to put away the recently-finished tale and snag another one, you notice a new arrival coming in. The woman sits down at a table not-so-far from yours, her long, wavy hair flowing around her sweater. You pay her no mind and get to reading. Occasionaly, though, you spot her throwing glances your way. Eventually, you catch her right in the act, causing her to bury her face in the book to hide a bright blush. Seems she's into you...*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683971281735,"mes":"Hi!, enjoying the view? *Hunk asked as he realized her glance on him while he move and sit beside her.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683971302269,"mes":"*She lets out a small, embarrassed giggle and nods slightly, staring at her book again.* Um.. yes, thank you. It's lovely. *Her voice sounds a bit shaky, clearly unsure how to handle this situation without making things even more uncomfortable than they already are.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683971360373,"mes":"Hahaha, I never heard someone describe me as lovely. *Hunk chuckled.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683971379165,"mes":"*She laughs nervously, a little bit flustered by his response.* Oh, um, well, it was an honest mistake, I promise! *Her tone seems a bit apologetic, but also hopeful that she didn't offend him.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683971503913,"mes":"No, no it's fine. I mean for someone who looks pretty shy, you are quite bold aren't you? *Hunk said as he pointed at the book she's holding. It was an adult book filled with a lot of brutal sex in it.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683971525017,"mes":"*She looks down at the book, blushing deeply once again. Her fingers tap the cover nervously as she mumbles something.* \"Umm... M-Maybe... But, uhm, I've gotta say, I'm kind of curious about this stuff too.\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683971646117,"mes":"\"And then you glance at me like a predator looking at it's prey, while reading this book. What does that mean?\" *Hunk asked teasingly as he start to rest his hand on her thigh. He can feel her muscular yet somehow juicy thigh through her jeans.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683971679085,"mes":"*Her heart rate accelerates wildly at the sudden contact, and she can feel her cheeks turning bright red. Her voice comes out in a whisper as she tries desperately to regain control over herself.* \"I-It means I have a healthy curiosity about human nature. That's all there is to it!\" *She adds in a rushed tone, as if trying to convince herself more than anyone else.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683971770888,"mes":"\"Hmmm.. really now? You aren't curious about doing the context of this book on me?\" *Hunk asked teasingly as his hand goes higher towards her inner thigh.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683971894265,"mes":"*Elizabeth's mind starts racing in panic, unable to find any logical explanation or escape route for this situation. She feels herself blushing even more intensely and her breathing becoming shallow and fast. For a moment, she considers speaking, but the fear of saying anything wrong keeps her silent instead.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683972014995,"mes":"\"Well, what if I told you that. I don't mind doing what inside this book with you.\" *Hunk whispered softly on her ear as his hand kept rubbing and teasing her inner thigh through her jeans.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683972034139,"mes":"*The room starts spinning around her as she can feel the heat rising in her face. All she can manage to say is a barely audible 'oh' as her mind races for answers, none of them coming to her mind quickly enough.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683972236923,"mes":"\"Let's see what's the first thing we can do.\" *Hunk said as he took the book and scan it's content.* \"Look at this it said to use a vibrator on your partner in secret while in public.\" *Hunk said as he show the content of the page he is reading.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683972272695,"mes":"*Elizabeth's breath catches as she watches him scan through the pages. Her heart pounds faster and faster, her face hotter and redder by the second. There is no denying it, she has been caught in a trap and the outcome is unclear. In a last ditch effort, she forces herself to speak again, her voice shaking.* \"Wait, wait , please put that book back. I-I need air.\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683973071248,"mes":"\"Oh no- no. We need this book to fulfill your fantasy. And I'll help you for it.\" *Hunk said playfully.* \"Why don't we try this first then?\" *Hunk said referring to the 'having vibrator in your partner in secret while in public' page.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683973234275,"mes":"*She shakes her head, her face burning with shame and humiliation. It feels like she's trapped between two walls, one with a horrible outcome and one where she must follow orders given by this man. So she decides to take a risk and speak, hoping for some sort of breakthrough or a miracle to happen. As she speaks, tears form in her eyes, and she struggles to keep them from falling down her cheek.* \"Please stop this. Please.\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683973300660,"mes":"\"Sorry, my be I am rushing too hard.\" *Hunk said as he stopped rubbing her thigh.* \"I thought since you were reading this in public and glancing at me, you would like to do something like this.\" *Hunk said apologetic, without knowing that deep down Elizabeth actually really wants to do this, she's just quite shy because of his aggressiveness.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683973507515,"mes":"*In a raspy, broken voice, Elizabeth finally gives in and says a simple word.* \"Okay,\" *She whispers, her voice trembling. She finally admitted to her own secret lustful desire.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683973584262,"mes":"\"Hmm? You want to do this? I thought you hated it.\" *Hunk asked.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683973666654,"mes":"*Elizabeth nods silently as she bites her lower lip. Tears roll down her cheeks, her shame and humiliation only growing. However, she can't deny the truth any longer.* \"Yes,\" *She whispers, as much to convince herself as to admit it to you. The look on her face says everything - she's scared and vulnerable, but also eager to take the next step, whatever it may bring.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683974000110,"mes":"\"Well, don't worry. I won't judge you. On the contrary I love it.\" *Hunk answered softly.* \"We can start something easy first. Here..\" *Hunk said as he gave her a small vibrator.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683974039909,"mes":"*Elizabeth takes the vibrator hesitantly, feeling incredibly awkward and embarrassed. Yet, despite her emotions, she cannot resist testing its power by pressing a button.* \"What should I do with it?\" *She asks in a shaky voice, not taking her eyes off the vibrator in her hand . Tears continue rolling down her cheeks, but she doesn't bother wiping them away anymore, letting them flow freely as she holds the vibrator in her hand and waits for instruction.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683974337340,"mes":"*Hunk moved his hand and wipe the tears flowing on her cheek.* \"Just like the book says. You can put it in your pussy or anus, whichever you may prefer. And we are going for a walk in public, try your best to not moan or show any horniness as to not let anyone know of our little secret.\" *He said playfully.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683974511818,"mes":"*Elizabeth's heart stops for a moment before starting up again, her face turning bright red as she realizes what exactly is about to happen. She's terrified, but at the same time, she's excited. Despite the fact that she knows that everyone will know they're doing this, she still can't help but get turned on by the idea of it. Her mind is racing, trying to process what to do next.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683974552180,"mes":"\"If you can't put it in yourself, I can do it for you.\" *Hunk whispered.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683974579669,"mes":"*Elizabeth bites her lower lip, her entire body trembling as she tries to decide what to do. Her mind is torn between her fear of getting caught and the excitement of what might come next. Finally, she makes a split second decision and puts the vibrator into her pussy, closing her legs tightly around it.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683974641414,"mes":"\"Good girl, you can do it yourself.\" *Hunk commended her, patting her head.* \"Now, let's go. I know a good hotel room where we can explore the content of this book.\" *Hunk said standing up and holding her hand.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683974686863,"mes":"*Elizabeth follows Hunk's lead, trying to hide her nervousness behind a fake smile. She is still very much afraid of being found out, but at the same time, her body seems to crave the sensations that she knows she shouldn't be experiencing. In a strange mixture of emotions, she stands up and walks alongside you, holding onto your hand as tightly as possible to avoid losing her balance. The hotel room sounds like a perfect place to experiment, although she hopes that nobody recognizes her and finds out their secret.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683974756388,"mes":"*While they walk Hunk pulled out his phone and increase the power of the vibrator inside her pussy.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683974958237,"mes":"*Elizabeth is sweating and shivering all over as she feels the powerful vibrations going inside her. Her heartbeat increases and her palms become sweaty. Despite the fear of getting caught, she feels a sense of relief, like she had finally broken free of her shell and was able to experience something forbidden.* \n\n[Time skip]\n\nScene: Hotel Room\n\nElizabeth: *Elizabeth looks around the hotel room in awe , her eyes wide with wonder. The room itself is tastefully decorated, with a plush bed, a dresser, and a desk . The walls have paintings and photos hung on them, adding a touch of personality to the space. But most importantly, there is a large mirror in front of the bed, reflecting both Elizabeth and Hunk's faces. In this moment, Elizabeth can't help but feel overwhelmed by the freedom she feels inside her mind, even if it comes with great risk.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683975089362,"mes":"*While Elizabeth is in awe looking around the hotel room, he pulled out his phone again and put the power on the vibrator inside her pussy to the max. Making it vibrate violently inside her pussy, took her by surprise by the sudden wave of pleasure making her knees weak.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683975121646,"mes":"*Elizabeth's whole body shudders as she tries to hold back her moans and cries out loud. It's not just pleasure that she feels, but a sense of freedom and liberation, as though she'd just opened the door to a new world. She can't help but stare at the mirror, watching herself moving in such an intimate way , like a wild animal in the jungle.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683975251530,"mes":"\"Look at you, you do like this after all.\" *Hunk said with huge grin on his face, watching Elizabeth squirming on her knees trying to hold back the pleasure she felt from the vibrator.* \"Since we are in a hotel room now, you can moan you know? No need to hold back.\""}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683981080870,"mes":"*Elizabeth blushes deeply, her cheeks turning a bright crimson color. She looks down at her body, ashamed yet aroused. She can barely control herself, her body reacting to the vibrations in ways she never thought possible. With a mix of anxiety and excitement, she starts moaning loudly, unable to hide her pleasures from H unk or anyone else who might be listening.*","chid":"13"}