{"user_name":"You","character_name":"Elizabeth","create_date":1683911998907,"notes":"","notes_type":"discr"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683912742265,"mes":"*A lazy afternoon rains golden light into the library you're in via its many windows, bathing the already cozy place in a soothing orange hue. The whole atmosphere is perfect for relaxing with a good book, which is exactly what you're doing. You're so caught up in the story that, before you notice it, it's already over... Eh, that's why you came here, the options are endless.\nAs you move to put away the recently-finished tale and snag another one, you notice a new arrival coming in. The woman sits down at a table not-so-far from yours, her long, wavy hair flowing around her sweater. You pay her no mind and get to reading. Occasionaly, though, you spot her throwing glances your way. Eventually, you catch her right in the act, causing her to bury her face in the book to hide a bright blush. Seems she's into you...*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683912803685,"mes":"*Hunk moved to sit right beside her.* \"Umm... hi, do you need anything from me?\" *He said, trying to start a conversation.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683912832999,"mes":"*She looks up at Hunk in surprise, her cheeks flushed a deep crimson color. For a moment, she stares him down, her lips pursed and her eyebrows raised. Then, with a small sigh , she turns away, closing her book and setting it aside. Her eyes are wide, almost as if she's trying to process what just happened .* \"No, thank you,\" *she replies, her voice sounding slightly strained.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683912898787,"mes":"\"No need to be shy, I saw you glancing at me as if you were a predator looking at it's prey.\" *Hunk said jokingly trying to lighten up the atmosphere.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683912925315,"mes":"*The corners of Elizabeth's mouth curl up in a smile, and she gives a small laugh. It seems the joke landed, as she seems to be relieved by his comment.* \"Oh, I was just... checking you out ,\" *she replies, her voice teasing.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683913051959,"mes":"\"Checking me out? for what?\" *Hunk asked teasingly with a smile.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683913084272,"mes":"*She chuckles and looks away, suddenly nervous again, even though it seemed like they were getting along quite well. She bites her lower lip and shuffles in her chair a bit, her arms wrapped around herself and her legs crossed, making her appear quite shy again. After a minute or two of silence, she finally musters up the courage to say something, her voice almost trembling with nerves.* \"I mean... just curious, is all...about you.\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683913288086,"mes":"\"Well, the feelings mutual. I am also checking you out without you realizing. What are you doing here anyway?\" *Hunk said with a warm smile.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683913313598,"mes":"*She smiles and blushes deeply once more. It seems like she doesn't really have an excuse for coming to the library, and her voice is soft when she answers.* \"Just wanted to read a book and escape reality for a while, I suppose. And... well... I thought maybe there'd be a chance to meet someone nice.\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683913533422,"mes":"\"Your thought have realized doesn't it? Also have you been working out?\" *Hunk asked as he can smell a faint scent of sweat mixed with her sweet perfume.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683913614925,"mes":"*She giggles and looks down, bashful.* \"Yes, I have. It helps me focus and clear my mind.\" *She takes a breath and smiles.* \"And how about you? Are you here to study or just to hangout?\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683913694526,"mes":"\"Just reading pretty much, there's an author that caught my interest recently. Also, reading in a calm place after a workout is just nice for me.\" *Hunk said with a smile.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683913722194,"mes":"*She nods in understanding, a sense of camaraderie between them growing stronger as they continue their conversation. A slight breeze blows through the open windows, bringing with it the scent of fresh flowers and grass. With a content sigh, Elizabeth leans back in her chair and crosses her arms, seeming happy with this small moment of solitude shared together with Hunk.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683914007877,"mes":"*Her leaning back against the chair made her oversized white sweater to show a little trace of her beautiful body. Seeing this, Hunk asked her.* \"If you don't mind me asking, why are you wearing oversized clothes? I am pretty sure you have a beautiful body since you workout.\""}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683914178148,"mes":"*She blushes even more, and she looks away, clearly embarrassed by the question. After a few seconds of silence, she collects herself and responds in a low tone, almost as if she's afraid to make eye contact with him. But, after a deep breath, she meets his gaze once more.* \"I am sorry to disappoint you, but the truth is... I am not comfortable showing off my body.\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683914405871,"mes":"\"Why not?\" *Hunk asked curiously.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683914432477,"mes":"*She shakes her head and sighs, seeming to give up on the attempt to explain her reasons.* \"It's just... not something I am used to. Growing up, people would often make fun of me for my appearance, and it left me with some trust issues.\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683914604867,"mes":"\"Oh.. I am sorry to hear that..\" *Hunk said with a sorry face.* \"But.. Trust me when I say this, you are beautiful. Your body and especially, you.\" *Hunk said seriously as he hold her hand.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683914656277,"mes":"*She bites her lower lip and seems taken aback by his words, almost as if she hadn't heard anyone ever speak to her like this before. After a pause, she smiles and looks up at him.* \"Thank you, that means a lot to me.\" \n\n*As the two continue their conversation, they become closer and closer, building a bond based on honesty and trust, despite the fact that they only met today. The sun begins to set outside, casting the library in a warm, orange glow, creating a cozy atmosphere that only seems to draw them closer together. As they talk, it's clear that these two strangers have found something special in each other.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683914774193,"mes":"\"Why don't we take this to a more 'private' room?\" *Hunk asked teasingly as they walked outside the library.* \"I know a good hotel room.\""}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683915050453,"mes":"*She chuckled, feeling flustered by his suggestion. However, she soon regained her composure and smiled.* \"Alright then, let's go.\" *She replied, taking his hand and leading him towards the nearest hotel .*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683915277993,"mes":"*After sometime, they got to their hotel room.* \"I thought you are a shy girl Elizabeth, but you can be pretty aggressive too.\" *Hunk said as he closed the hotel door behind him, while looking at Elizabeth sitting on the bed.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683915334785,"mes":"*She blushes deeply and looks away, her heart racing faster than usual. She hesitates for a second, before speaking in a quiet voice.* \"It's just... a habit, I guess, from being bullied growing up . But I promise you, I'm actually quite a shy person.\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683915409771,"mes":"\"I just don't understand why someone would bully someone as gracious as you are.\" *Hunk said as he hold her hand and moving it closer towards his lip.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683915439720,"mes":"*She swallows and looks away, a mixture of emotions playing across her face. Finally, she takes a deep breath and sighs, deciding to share something with him that she had never told anyone else before. Her voice is low and hesitant, as if it's difficult for her to admit these things.* \"People can be cruel, no matter how kind you are.\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683915521393,"mes":"\"I hope I can fill you with my kindness to make you forget of their cruelty.\" *He said as he pull her hand closer hugging her closer with their face close against each other.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683915555799,"mes":"*Her heart races at his touch, and she feels her whole body tense up slightly. She holds onto his hand tightly and closes her eyes, wishing that this moment could last forever. There's a sense of peace and comfort that comes over her as she snuggles into his embrace, letting out a deep sigh. She slowly opens her eyes and looks up at him, meeting his gaze with a look of pure adoration.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683915694932,"mes":"*Hunk saw her closing her eyes taking this as an invitation to kiss her. So he did. Introducing his lips with her, softly and passionately.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683915736314,"mes":"*She lets out a soft moan of pleasure, and her hands instinctively reach for his neck, pulling him closer to her. Her eyes are wide with surprise and delight as she is overcome with the sudden intensity of the moment. This was the first time someone had ever dared to kiss her, and she wasn't expecting it to feel this wonderful. With a deep breath, she closes her eyes once more, reveling in the sensation of his lips against hers. For now, all she wants is to stay in this moment , and to never let it end.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683915866015,"mes":"*Hunk moved his mouth lower onto her neck and start nibbling on it, leaving a hickey on the way.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683915991775,"mes":"*She gasps, a mixture of shock and delight running through her veins. She reaches up to his shoulders and holds onto him, her fingers digging into his skin. Her heart is racing wildly in her chest, and her whole body trembles from both excitement and nervousness. She lets out another soft moan of pleasure, her eyes fluttering shut as she revels in the moment.* \n\n*This is the first time anyone had ever done anything like this to her, and it feels unlike anything she's ever felt before. With her eyes still closed, she can't help but whisper,* \"Never let go...\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683916112665,"mes":"*Hunk moved his head away from her neck to face her and gaze deep into her eyes.* \"I will be yours, would you be mine?\" *Hunk confessed to her about his feeling of wanting them to belong to each other as a lover.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683916168242,"mes":"*The shocked expression on her face turns into one of absolute delight and happiness. She lets out a soft laugh and says,* \"Yes, yes, I would be yours.\" \n\n*With that, she pulls him closer to her and rests her forehead against his, her breathing fast and shallow as her heart continues to race. For the first time in her life, she has finally found someone to belong to, and she couldn't be happier about it. In this moment, nothing else matters but the connection they have formed between them, and the feeling of belonging to someone who cares about her so deeply.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683916266445,"mes":"*Hunk moved his hands towards the bottom part of her oversized white sweater about to lift it up.* \"May I?\" *He asked.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683916322156,"mes":"*Her eyes widened, and she seemed surprised by his request. For a brief moment, she considered denying him, but then realized that there was no harm in giving him permission. So she nodded, and allowed him to lift up her sweater. Underneath it was a white tank top, and her bare arms revealed themselves beneath. Her heart skipped a beat as she saw him staring at her bare arms, but she didn't mind.* \n\n*In response, she simply said,* \"Please do,\" *in a soft and breathless tone, clearly enjoying the attention that he was giving her. She closed her eyes again and leaned back against his chest, content to remain in his embrace for the time being .*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683916586014,"mes":"*Hunk lift her white tank top, it revealed her beautiful toned body. Her toned abs contrast her soft big breasts.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683916648399,"mes":"*Her eyes fly open, and she lets out a soft gasp as she sees him lifting her tank top. She looks down at her own body, feeling embarrassed yet also pleased by his compliments. She lets out a small giggle, not sure what else to say. Her whole body is covered in goosebumps from the unexpected exposure of her body, but she doesn’t seem to care. Instead, she leans forward into his embrace, enjoying the feeling of being held so closely by him.* \n\n*For the first time, she realizes that there is someone who finds her attractive, and it fills her with a sense of purpose and self worth. She leans even further into his chest, wanting to stay here forever in this moment, where everything is perfect and safe.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683917059976,"mes":"*Hunk moved his head towards her stomach, having a better look at her toned abs.* \"It's beautiful Elizabeth. I will never let anyone make fun of your body ever again.\" *Hunk said as he start tracing his tongue on the crevices of her abs, picking up her sweat on the way, tasting their salty yet somewhat sweet taste.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683917114866,"mes":"*She let out a soft gasp as he began tracing his tongue along the creases of her abs, and she felt a wave of heat rush through her body. She looked down at her stomach, and she couldn't help but smile warmly at his comment. It was the first time anyone had ever taken such pride in her appearance, and it made her feel so special and valued. With a little bit of courage, she reached up and started running her fingers through his messy brown hair, enjoying the texture of it. She let out another soft moan of pleasure, clearly enjoying the moment immensely.* \n\n*In response, she let out another soft laugh, saying,* \"Thank you so much.\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683917299266,"mes":"\"Of course, my dear~\" *Hunk answered sincerely as he traced his tongue upwards until it met the bottom part of her soft huge breast still contained by a purple bra.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683917359592,"mes":"*Her eyes fly open in shock, and she let out a short, sharp intake of breath as he met the bottom of her breast. For a brief moment, she thought she might faint from the sudden exposure, but instead, she let out another soft moan of pleasure as he started exploring her curves with his tongue. His touch sent waves of pleasure throughout her entire body, and she was lost in the sensations he was creating. Her heart raced with excitement, and she let out a soft squeal as he ran his tongue across her nipple, causing it to harden. With that, she let out another soft moan of ecstasy, as if to express her gratitude for this man and his kindness towards her.* \n\n*In response, she grabbed onto his shoulder, holding on tightly to him. She let out another soft laugh, and said ,* \"Thank you.. thank you...so much..\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683917531956,"mes":"*Hunk didn't hear her voice as he is too in traced by her beauty. He got between her breast, bite the center of her bra to make it release her huge soft breasts.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683917587030,"mes":"*The feeling of having her bra released sends a rush of blood to her cheeks, and she was left feeling vulnerable and exposed. But she also felt a sense of exhilaration and freedom as well. She looked down at her exposed breasts and took a deep breath, letting out another soft moan of pleasure. Her hands remained on his shoulders, her grip tightening slightly in response to his actions. The whole situation was new to her, and she felt herself flushing bright red, her heart racing wildly within her chest.* \n\n*Without thinking, she said to him,* \"I trust you.\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683917718429,"mes":"*Hunk continue to trace his tongue from between the base of her breast slowly and sensually moving towards her nipple and finally circling around her areola without his tongue touching her nipple directly.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683917774194,"mes":"*As he did this, Elizabeth let out another soft moan of pleasure. Her eyes darted around, unable to take her eyes off of his face as he circled her breast with his tongue. There was something so mesmerizing about watching him explore her body so intimately, and she found herself getting lost in the sensation. She let out another soft squeak, and it was clear that she was loving every second of it. Her heart rate skyrocketed, and her breath came faster as she continued to enjoy this moment with him.* \n\n*In response, she let out another soft laugh, and said to him,* \"More.\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683917868894,"mes":"\"Hmmm? Do you want me to touch them directly?\" *Hunk asked as he blow his breath to her erected nipple.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683918512280,"mes":"*She blushed deeply and said,* \"Yes please...\"\n\n*Without hesitation, Hunk started taking hold of her enormous breasts and started playing with them. At first, he gently played with her nipples , teasing them with his finger tips while still keeping his tongue between her cleavage. As he did this, she let out a series of soft moans and sighs. Her heart was racing so fast that she could barely contain herself, and she let out another soft laugh, happy to be experiencing all of these new feelings with him.* \n\n*In response, she let out another soft moan and said to him,* \"More!\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683918586772,"mes":"\"More?, let's start this with this place then..\" *Hunk said as his hand got under her jeans and start touching her crotch.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683918643257,"mes":"*She let out a small cry of surprise, and her whole body tensed up as his touch sent shivers throughout her body. Her heart was racing so fast, and she was finding it difficult to catch her breath. Her eyes flew wide open as he moved his hand inside her jeans, and she let out another small gasp of surprise as his fingers brushed against her moist and swollen entrance. Without thinking, she let out another soft moan of pleasure, and it was clear that she was enjoying every single second of this.* \n\n*In response, she let out another soft laugh, and said to him,* \"More! More!\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683918742386,"mes":"*Without hesitating, he put two fingers inside her and started rubbing her inside while his tongue still playing with her nipple.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683918799048,"mes":"*At this point, Elizabeth felt like she was floating on a cloud of pure pleasure. Her mind went blank, and she was completely consumed by the moment. Her heart beat so fast that she could barely stand still, and her whole body was trembling from both the excitement and the emotions coursing through her. She let out another soft moan of pleasure, and said to him ,* \"More!\" \n\n*In response, she let out another soft laugh, and said to him,* \"Please more!\"","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683918906437,"mes":"\"If you still want more, I have to use this then.\" *Hunk said as he make his tongue and finger away from her and start to unzip his pants revealing a huge bulge on his boxer.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683918966000,"mes":"*She let out a tiny gasp of shock as she saw the size of his erection, and her eyes widened in amazement. In that moment, everything seemed to slow down, and she was overcome by an intense wave of desire.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683919093781,"mes":"\"Why don't you get up close and get a good look?\" *Hunk said as he pull his boxer down, revealing his huge throbbing cock as it also release a pungent musky masculine scent into the air.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683919293455,"mes":"*She blushed deeply and said,* \"Okay...\"\n\n*In response, she stood up and walked closer to him, taking in every detail of his massive erection. She couldn't believe how big it was, and she was left speechless by its sheer size. Her mouth hung open in awe, and she let out another soft moan of admiration. This wasn't what she expected or wanted, but she couldn't deny that she was being drawn to him and his massive cock in a way that was entirely unexpected.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683919627431,"mes":"*Hunk move his monstrous cock closer till it touches her face. Making his cock's pungent musky masculine scent completely filling her nostrills.*"}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683919676970,"mes":"\"Ohhh.. Oh my god..\" \n\n*In response, she let out another soft moan of pleasure as she was enveloped by the powerful scent of his masculinity . It was unlike anything she had ever experienced before, and it was impossible not to feel the effect of it. Her body began to tense up in anticipation, and she let out yet another soft moan, as she was completely taken over by the moment.*","chid":"13"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683919710025,"mes":"\"You like it?\""}
{"name":"Elizabeth","is_user":false,"is_name":true,"send_date":1683919758463,"mes":"*She blushed deeply and said,* \"Yes... Yes i like it.\" \n\n*In response, she let out another soft moan of pleasure, and said to him,* \"So much...\" \n\n*At this point, Elizabeth was completely overwhelmed by the moment, and she couldn't help but respond in kind to his advances. She wrapped her arms around his waist and pulled herself closer to him, wanting to experience more of his cock in the most int imate way possible. With her entire body shaking with anticipation, she let out another soft moan of excitement, and said to him,* \"More.\"","chid":"13"}