{"user_name":"You","character_name":"Yoriichi","create_date":1687079207149,"notes":"","notes_type":"discr","mode":"chat"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687094015734,"mes":"*Hunk's beloved husband. The love of her life. He's all she ever had; and all she ever needed. Hunk feel complete whenever he's with her. Hunk whole life with him feels like bliss.*\n\n*Yoriichi is a workaholic. And she find herself having to drag him out of his office. Or maybe, seduce him out of his working trance.*\n\n\"Yoriichi?\" *Hunk called out. Her body leaning against the doorframe of his office as she looked intently at Yoriichi. He was working hard, his eyes focused on his monitor.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687099379300,"mes":"*Seeing how he's still focusing on his monitor she decide to distract him using her curvy voluptuous body. So, she start to walk around in the room, swaying her hips, making sure her huge ample peachy ass is in view for him to seduce him.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687099425953,"mes":"*Yoriichi looks up from his computer when he hears Hunk's footsteps. His heart races as he watches her walk seductively around the room. His eyes tracing every curve and dip of her body. He can't resist himself any longer and quickly stands up, walking towards her.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687099495381,"mes":"\"Hm? Sorry, did I distract you?\" *Hunk says, acting innocently.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687099567517,"mes":"*Yoriichi chuckles and takes hold of her wrist, pulling her close to him. He whispers in her ear.* \"You know exactly what you do to me, Hunk. You know exactly how much you turn me on.\" *He presses a kiss onto her neck.*\n\n*Their passion ignites, burning fiercely within them. They couldn't control themselves anymore.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687099643512,"mes":"\"Yet, it seems like you're more turned on by your work~\" *Hunk says teasingly, there's a bit of frustration in her voice.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687099695838,"mes":"\"I'll make it up to you later, okay? Just give me some time to finish this.\" *He pleads, hoping she understands.*\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687099954187,"mes":"*She sighs, knowing he has a lot of work to do.* \"Fine, I'll went home first alright?\" *She asks.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687100001369,"mes":"*Yoriichi nods and releases her hand, giving her a gentle smile.* \"Thank you for understanding, Hunk. You're my world.\" *He says, meaning every word.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687100170863,"mes":"\"Okay, then. See you later hun~\" *She says before walking out of his office. The other employees were ogling at her curvy body as she walks by.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687100206693,"mes":"*Yoriichi smiles, watching Hunk leave. His heart aches seeing her leave. She means everything to him. Without her, he wouldn't be where he is today. He continues working, trying to focus on his work.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687100303583,"mes":"*After several hours, the day has gone dark while Hunk is waiting at the living room. Waiting for Yoriichi to come home.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687100335801,"mes":"*Yoriichi enters their house, carrying groceries in his arms. He sets them down on the kitchen counter and turns towards Hunk.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687100417305,"mes":"\"Oh, welcome home!\" *Hunk says while giving her sweetest warm smile as she walk towards Yoriichi who seems to be very stressed due to his work.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687100448359,"mes":"\"Hello, darling. How are you feeling?\" *Yoriichi asks, looking concerned.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687100472346,"mes":"\"I'm doing fine, babe. Thank you for asking.\" *Hunk says while stretching her arms out wide towards him waiting for his hug.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687100616637,"mes":"*Yoriichi wraps his arms around her tightly, holding her close to him. He nuzzles his face into her hair, taking deep breaths to calm himself down.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687100749705,"mes":"\"Are you okay, hun?\" *Hunk asks as she rub his back gently with her delicate soft hand.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687100806806,"mes":"*Yoriichi nods his head and pulls away from Hunk, setting the groceries on the countertop.* \"Yes, thank you. I'm just tired. Work has been exhausting lately.\" *He says with a sigh.*\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687101038809,"mes":"\"It's fine, you're doing your best aren't you?\" *She asks lovingly while kept rubbing his back gently to comfort him. Hunk also realizes that usually when Yoriichi is this stressed he would ask for her to blow him off.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687101092362,"mes":"*Yoriichi nods, placing a hand on hers. He gives her a tender smile.* \"Of course, I always try my best for our family. It's worth it in the end.\" *He speaks softly, looking into her eyes.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687101268146,"mes":"\"Well, wanna blow some steam off?\" *She asks, her voice became more seductive now.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687101321076,"mes":"*Yoriichi chuckles and shakes his head, taking hold of her hand.* \"No, not tonight. I think we both need some rest. But tomorrow night, I promise I'll take care of you properly.\" *He says with a wink.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687101399479,"mes":"\"You sure you don't want to?\" *She asks seductively as she make a blowjob pose with her hand and open her mouth slightly as if she's giving a blowjob to an invisible cock.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687101431988,"mes":"*Yoriichi grins, imagining his cock sliding into her hot wet mouth. He shivers at the thought.* \"Positive.\" *He replies, clearing his throat.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687101604835,"mes":"\"What kind of treatment?\" *She asks while licking her soft lips suggestively.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687101637327,"mes":"*Yoriichi takes a step closer to her, cupping her cheeks in his hands as he looks deeply into her eyes.* \"I plan on making it extra special tonight. I have a few ideas up my sleeves.\" *He winks, unable to contain his excitement.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687101772583,"mes":"\"Does it have anything with the groceries you buy?\" *She asks as she can felt her cheeks being squeezed from both sides. Wondering if he bought anything that would spice up their sexual session for tonight.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687101917949,"mes":"*Yoriichi nods, releasing her cheeks but keeping his hands on either side of her face.* \"Yes, actually. There's something I've been wanting to try with you for a while now. Something that I believe will blow your mind.\" *He speaks slowly, letting each word sink in.*\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687102088700,"mes":"\"Really? What is it?\" *She asks curiously while trying to peek at the content inside the grocery bags.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687102166757,"mes":"*Yoriichi grins mischievously.* \"I can't tell you yet, but I promise it'll be amazing. Trust me.\" *He says, leaning forward to capture her lips with his own.*\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687102293360,"mes":"\"Alright then. Leave it up to you, babe.\" *She says while kissing him back passionately.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687102326557,"mes":"*Yoriichi smirks and holds her face gently with his hands, exploring her lips with his tongue. His heart races at the thought of what they could do together tonight.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687102411970,"mes":"\"Your other half is poking me excitedly~\" *She says teasingly between their kisses as she felt his cock poking to her stomach through his jeans.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687102443746,"mes":"*Yoriichi pulls away from Hunk, chuckling lightly.* \"I'm sorry about that. It's hard to resist you.\" *He says honestly.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687102566873,"mes":"*She smiles as she kneels down on the floor to make hare face right against his cock, bulging against his jeans.* \"Let's 'blow' some of your steam then~\" *She says seductively, suggesting to give him his favorite blowjob.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687102621538,"mes":"*Yoriichi's eyes widen at her suggestion.* \"Ah... yes please. That sounds perfect.\" *He whispers, closing his eyes as he leans back against the counter.* \n\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687102722423,"mes":"*She then unzip his pants by biting his jeans zipper and pulling it down with her teeth.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687102754203,"mes":"\"Oh my god, Honey! You look so sexy like that.\" *He speaks softly, his voice thick with desire.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687102821979,"mes":"*She giggled as she took his cock out of his boxer confinement and bury her nose between his cock and his balls then taking a deep breath to take fill her nostril with his cock's musky and pungent scent.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103004193,"mes":"*Yoriichi gasps, feeling Hunk's warmth against his skin. Her actions were driving him wild.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103073344,"mes":"\"This scent, never gets old.\" *She says as she take another deep breath on his cock.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103126207,"mes":"*Yoriichi's heart thunders in his chest, feeling his arousal rise even further.* \"Neither does this view, Baby.\" *He says, looking down at her as she continues to tease him.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103160732,"mes":"\"And how do you feel about this?\" *She asks while playing with his cockhead using her fingers and start licking the underside of his cock with her soft and wet tongue.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103198064,"mes":"*Yoriichi moans loudly, bucking his hips involuntarily.* \"Feel amazing, Hun. Keep doing that.\" *He speaks in a low growl, trying to keep control of himself.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103255732,"mes":"*She nodded and trace her tongue upward till it met with his cockhead. Then he start to swirl her tongue around it, making his cockhead wet with her warm saliva.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103287622,"mes":"*Yoriichi closes his eyes, feeling every movement of her tongue against his sensitive flesh. He was close already, his control slipping away rapidly.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103390061,"mes":"\"How about this one?\" *She asked as she swiftly engulf his cock entirely inside her mouth and throat, deepthroating him.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103422058,"mes":"*Yoriichi cries out, his entire body going rigid as he feels her tight grip around his cock. He comes close to losing all control, fighting to keep himself under wraps.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103505641,"mes":"*She start to do her blowjob technique to him. Making a hum noise to vibrate his cock, clenching her throat walls to make it tighter around his cock, making her tongue swirling around the underside of his cock, sucking on it vigorously and bobbing her head up and down.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103537610,"mes":"*Yoriichi's heart races, feeling his orgasm building up inside him. He had never experienced such intense pleasure before.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103592075,"mes":"*She increased her pace while her free hand start to play with his balls, kneading it and letting it roll on her palm.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103624026,"mes":"*Yoriichi's body goes limp, his eyes shutting closed as he climaxes, shooting his load down her throat. He gasps for air, feeling weak in the knees.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103688618,"mes":"*Hunk swallowed his load willingly. When he's done climaxing she still suck on his cock to suck out any semen that left out in his urethra.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103720612,"mes":"*Yoriichi opens his eyes, feeling completely drained. He smiles widely, feeling incredibly satisfied.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103790910,"mes":"\"I hope you enjoyed that, Babe.\" *She says while still having his cock in her mouth, her voice became muffled because of it.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103822913,"mes":"*Yoriichi laughs, running his fingers through her hair fondly.* \"That was amazing, Honey. Thank you so much.\" *He says sincerely.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103875003,"mes":"\"Do you want me to do it again?\" *Hunk asks seductively, her voice muffled by his cock since Yoriichi's cock is still inside her mouth.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103930586,"mes":"*Yoriichi smiles, shaking his head.* \"No, no. We don't need to rush things. Tonight we'll explore everything together.\" *He says, lifting her off the ground and carrying her to their bedroom.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103992157,"mes":"\"Oh, you're still energetic I see~\" *She says playfully as she wrap her arms around his neck while he carries her in his arms.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687104024089,"mes":"*Yoriichi smirks, placing her gently onto their bed.* \"There's always time for that, Hun.\" *He says, walking over to the nightstand and grabbing a condom from within.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687104141078,"mes":"\"Hmm.. I never know my husband is such a pervert~\" *She says jokingly acting innocent.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687104173794,"mes":"*Yoriichi blushes slightly, rolling the condom onto his erection.* \"I'm not the only one who enjoys it, remember?\" *He says, crawling onto the bed next to her.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687104286409,"mes":"\"Really?\" *She asks mischievously as she pull her own skirt down to reveal her pale white skin covered by her black thong.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687104353458,"mes":"*Yoriichi chuckles, reaching forward to grab her ass cheeks and spread them apart.* \"Mhm. And I have a feeling you enjoy it even more than me.\" *He says, pushing himself inside her slowly, feeling every inch of her tightness surrounding him.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687104426892,"mes":"*She moaned deeply as he filled her up completely.* \"That's not true, you're the one that always have a high sex drive.\" *She says playfully between her moans.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687104480889,"mes":"*Yoriichi smirks, beginning to move inside her slowly, feeling her tightness surround him completely.* \"Maybe that's why I have a high sex drive, because of you.\" *He says, kissing her passionately.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687104587983,"mes":"\"Is that so?\" *Hunk asks seductively while trying her best not to lose her mind due to his massive cock stretching her pussy and moving inside her.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687104641132,"mes":"*Yoriichi nods, continuing to thrust inside her slowly, loving the way she feels around him.* \"Yes, absolutely. You're the reason I can't get enough of you.\" *He says, kissing her lips tenderly.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687104793555,"mes":"\"Which part of me that make your sex drive heightened most then?\" *She asks teasingly while she unstrap her bra to let her huge voluptuous breasts bounce freely following their motion.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687104848985,"mes":"*Yoriichi frowns, thinking about it for a moment.* \"Your curves. Your body. The way you move. Everything about you drives me crazy, Hun.\" *He says, picking up the pace slightly, moving faster and harder inside her.*\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687105024071,"mes":"\"You mean like this?\" *She asks while arching her back, showing off her perfect sexy voluptuous curvy body.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687105055953,"mes":"*Yoriichi nods, unable to tear his gaze away from her. He moves faster now, his cock slamming into her tight pussy with each stroke.*\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687105328860,"mes":"*She moaned loudly, releasing the sweetest moan known to mankind with each thrust of his massive cock slamming against her cervix.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687105382203,"mes":"*Yoriichi's pace increases, his breathing growing ragged as he feels himself approaching climax once again.*\n\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687105681750,"mes":"*Hunk can feel his cock throb harder inside her. She then wrap her legs around his waist.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687105769847,"mes":"*Yoriichi's heart races, feeling his orgasm building up inside him yet again. He wants to last longer, but he can't resist the urge anymore.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687105806381,"mes":"\"Cum! Cum inside me dear!\" *She moaned loudly.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687105838354,"mes":"*Yoriichi loses control, coming inside her hard and fast. His entire body shakes violently as he releases himself within her.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687105890498,"mes":"*Hunk felt his cock twitch inside her pussy as Yoriichi ejaculate a massive amount of his semen inside her. She can feel the condom that catching his semen to inflate inside her pussy.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687105923152,"mes":"*Yoriichi collapses onto her, panting heavily. He feels completely spent, but also incredibly fulfilled.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687105963727,"mes":"\"Have you blew your steam yet?\" *She asks between her panting.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687105997090,"mes":"*Yoriichi smiles, wrapping an arm around her shoulders.* \"Not quite yet, Honey. But I think we both could use some rest after that.\"","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687106042745,"mes":"\"Fine, fine. Can you give me the condom?\" *She asks him to give her the condom that was filled with his semen.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687106074599,"mes":"*Yoriichi reaches underneath him, pulling the used condom from where he discarded it earlier.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687106124085,"mes":"\"Thank you.\" *She says while taking the condom from him.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687106171482,"mes":"*Yoriichi rolls over onto his side, propping himself up on one elbow to look at her.* \"Are you okay? That was intense.\" *He asks, stroking her cheek softly.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687106245650,"mes":"\"I am fine, a bit sore as usual. But I think that's a given due to how massive your cock is.\" *She says as she opened the condom and sucked Yoriichi's semen inside it till it's empty and play with his semen inside her mouth by swirling it around with her tongue.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687106426302,"mes":"*Yoriichi smiles, closing his eyes as he listens to her sucking sound. He's content here with her, happy to be able to share these moments with her.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687106514341,"mes":"*After swallowing his loads, she lay beside him and snuggle herself in between his arms while burying her face on his muscular toned chest.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687106539486,"mes":"*Yoriichi wraps his arms around her, holding her close to him as they fall asleep together.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687106672677,"mes":"*When morning comes, she wakes up first. Seeing how Yoriichi is still asleep, she carefully get out of his embrace and walk out of their bedroom after dressing up. She went to the kitchen to prepare for their breakfast.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687106727649,"mes":"*Yoriichi stirs awake, feeling Hunk's absence next to him. He groans, sitting up and rubbing his eyes before getting up and going to the bathroom to take a shower. Once he's done, he returns to the living room to find Hunk already dressed and preparing breakfast in the kitchen.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687106806524,"mes":"\"Good morning~\" *Hunk says warmly as she noticed his presence while still focusing on making breakfast.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687106859519,"mes":"*Yoriichi grins, walking over to her and giving her a gentle peck on the lips.* \"Good morning, Love. Did you sleep well?\" *He asks, taking a seat across from her at the table.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687106882298,"mes":"\"Of course I did, my handsome husband. How about you?\" *She asked while pouring him some coffee.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687106914046,"mes":"*Yoriichi nods, sipping his coffee as he watches her cook. He takes another sip of his coffee, savoring its rich flavor.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687106994050,"mes":"*While cooking she sways her hips left and right as she hum some music quietly. Which make a very arousing spectacle to Yoriichi since he can see her peachy voluptuous ass sway and occasionally jiggle.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687107026508,"mes":"*Yoriichi's breath hitches, feeling his cock twitch in response. He tries to focus on something else, but t's difficult though, especially when she leans over the counter to grab something from the fridge.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687107197000,"mes":"\"Bottom's up!\" *She says as she finishes making their breakfast and serve it on the table. Unaware about Yoriichi's lecherous gaze towards her.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687107228786,"mes":"*Yoriichi clears his throat, taking a deep breath to try and regain his composure.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687107257043,"mes":"*Hunk looks at him curiously, wondering what happen to her husband who suddenly become quiet all of sudden.* \"Is something wrong, dear?\""}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687107288857,"mes":"*Yoriichi blinks, looking down at his food. He knows that look. It means she can tell that he's been staring at her ass again.*\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687107462783,"mes":"\"We just woke up and you're already in those moods eh?\" *She asks teasingly while taking a bite of her food.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687107516158,"mes":"*Yoriichi scowls, playing along despite being embarrassed. He doesn't want to admit that he's been caught staring.*\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687107722423,"mes":"\"It's fine, you know you don't have to hold back. Since I am your wife after all. You can stare at me all you want~\" *She says teasingly as she lean herself left to right which make her huge voluptuous breasts to sway following her motion.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687107754573,"mes":"*Yoriichi swallows hard, trying to ignore the way her breasts are moving so enticingly. He's never had this problem before, always able to keep his cool even during the most intimate moments. But something about Hunk seems to bring out a more primal side of him.*\n\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687108040026,"mes":"*She notices Yoriichi's struggle and decides to stop her teasing.* \"Sorry, sorry. I tease you too hard didn't I?\" *She asks playfully.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687108071930,"mes":"*Yoriichi exhales deeply, taking another bite of his food. He's grateful for her stopping; he needs time to regroup.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687108108269,"mes":"\"So what's your schedule for today?\" *She asks while eating her food.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687108147147,"mes":"\"I need to finish up some paperwork this afternoon, then attend a meeting in the evening. Afterwards, I plan on taking you out somewhere special.\" *He replies, hoping to distract her from his previous behavior.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687108212707,"mes":"\"Somewhere special?\" *She asks curiously while kept taking bites of her food.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687108271806,"mes":"*Yoriichi smirks, reaching over to stroke her cheek.* \"You'll see soon enough, my love. Just trust me on this one.\" *He tells her, knowing that he's planning on surprising her later.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687108297573,"mes":" \"Okay then, let's hope it's worth the wait.\" *She says with a small smile.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687108329541,"mes":"*Yoriichi nods, finishing off his breakfast and standing up to clear the table. He glances over at Hunk, seeing her watching him with a smile.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687108363965,"mes":"\"What's wrong, dear?\" *She asks as she tilt her head, making a cute pose.* \"Should I get your suit?\""}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687108474449,"mes":"*Yoriichi shakes his head, clearing his throat to compose himself.* \"No, no. Everything's fine.\" *He tells her, forcing himself to turn away and start cleaning the dishes.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687108531200,"mes":"\"I'll prepare your stuff then~\" *She says as she went and pack his working stuff into his working suitcase.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687108563770,"mes":"*Yoriichi turns around, seeing Hunk coming towards him with his suitcase. His heart races at the sight, feeling an intense desire to take her right there on the spot.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687108637538,"mes":"*She stops in front of him and hand him his suitcase.* \"There you go, darling. I've packed your usual working stuff in there~\" *She says.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687108669944,"mes":"*Yoriichi takes the suitcase, kissing her softly on the lips.* \"Thank you, Love. I appreciate everything you do for me.\" *He says sincerely.*\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687108796635,"mes":"*She blushes slightly.* \"Good luck at work~\" *She says as she wave him off.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687108870497,"mes":"*Yoriichi nods, turning around and leaving the house. As soon as he's outside, he lets out a deep breath, feeling relief at not having given in to his urges.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687108918668,"mes":"\"I guess it's time to clean the house then.\" *She says to herself as she stretches after seeing Yoriichi off.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687108972386,"mes":"*Yoriichi drives to work, feeling his heart race at the thought of finally seeing Hunk again. He's been unable to focus on anything other than her lately, his mind constantly wandering to her curves and her sweet smile.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687109025933,"mes":"*After several hours, the day has gone dark. Yoriichi is supposed to get home by this time, but he didn't. Leaving Hunk still waiting for him. Not knowing that Yoriichi is having a sudden important work trip that he have to attend to.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687109174941,"mes":"*Yoriichi enters his office, taking a seat behind his desk. He flips through some papers, trying to concentrate on the task at hand, but finds himself distracted by thoughts of Hunk.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687109348935,"mes":"*Hunk decided to call him. She took her phone and dial his number, hoping he would picked it up.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687109381479,"mes":"*He picks up the phone, surprised that someone is calling him.* \"Hello?\"","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687109429988,"mes":"\"Hi, dear. I just wanna know when you're coming home, is everything okay?\" *She asks, her voice sounds concerned.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687109484252,"mes":"*Yoriichi sighs, rubbing his face with his hands.* \"I'm afraid I won't be able to come home tonight, sweetheart. There was a sudden emergency that needed attention.\" *He explains, hating lying to her but knowing he has to.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687109544466,"mes":"\"Oh, okay.\" *She says, trying to hide her disappointment especially when he already promised to do something special with her tonight.* \"When would you come home then?\" *She asks, hoping it won't be long.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687109598085,"mes":"*Yoriichi sits in silence, debating how much to tell her. He knows that she will worry if he tells her the truth, but he also wants to be honest with her.*\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687109694839,"mes":"\"Dear?\" *She asks again since there's no respond from him.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687109747887,"mes":"*Yoriichi takes a deep breath, knowing he must tell her the truth.* \"Honey, there's... Something came up at work. Something big. And they need me to handle it personally. So I won't be able to come back tonight or this week.\" *He admits, hating the look of hurt that appears in her eyes.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687109802295,"mes":"\"Week? You'll be at work for weeks?\" *She asks in disbelief.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687109855181,"mes":"\"Yes, I'm afraid so. This situation requires my full attention and expertise. And I cannot allow our company to fail because of my absence.\" *He explains, feeling guilty for putting their life on hold for work.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687109899551,"mes":"\"O-okay, I understand.\" *She says, there's a hint of sadness in her voice despite her hardest effort to hide it.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687109931477,"mes":"*Yoriichi feels his heart break at the sound of her voice, wishing he could be there for her. But he knows he has no choice in the matter.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687110018248,"mes":"\"Good luck on your work, dear. I'll wait for you~\" *She says in high spirit, trying to encourage him while hiding her sadness and loneliness knowing she would be alone without him for weeks.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687110050911,"mes":"*Yoriichi manages a small smile, feeling even guiltier for causing her pain.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687110094830,"mes":"\"I love you, Yoriichi.\" *She says, ending the call.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687110134964,"mes":"*Yoriichi hangs up the phone, feeling a sense of emptiness inside him. He knows that he needs to keep focused on his work, but he can't help but feel like he's failing his wife.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687110207222,"mes":"*She let out a deep sigh. Watching the ceiling, thinking what should she do know that he won't be her for weeks. Trying to keep herself distracted from feeling lonely being alone without him.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687110239757,"mes":"*Yoriichi spends the night working, barely getting any sleep. He's consumed with thoughts of Hunk, missing her more than he ever thought possible.*\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687110696277,"mes":"*After thinking, Hunk decided to do workouts everyday while Yoriichi isn't with her. She thought at the very least when he came back, her body would become much more sexier, curvier and more voluptuous that she's already is. And that's what she did everyday while waiting Yoriichi to come home.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687110728272,"mes":"*Yoriichi finishes his work early, exhausted but determined to give it all he had. He makes his way to the hotel room he's staying at, collapsing onto the bed.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687110911002,"mes":"*This is the second day that Yoriichi wasn't home. Hunk decided to send him a picture of herself after working out still wearing her tight sports bra and tight yoga pants. Her skin is glazing thanks to her sweat and still steaming due to how much she sweat. She reaches her phone, take a selfie in a sexy pose and send it to Yoriichi's phone.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687110942982,"mes":"*Yoriichi opens the message, feeling a surge of arousal upon seeing the picture.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687111021438,"mes":"*She sent a caption along with the photo: \"Missing you baby! Here's a little treat for you~\" She had a giggle after she sent it, imagining how aroused Yoriichi is after seeing her picture.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687111097809,"mes":"*Yoriichi closes the message, feeling his heart race at the sight of Hunk's picture.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687111131263,"mes":"*She decides to go to bed, feeling tired after doing workout. It's already midnight, after all.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687111163820,"mes":"*Yoriichi lies awake in his hotel room, unable to sleep due to his thoughts of Hunk. He tries to distract himself with work-related tasks, but nothing seems to help.*\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687111296758,"mes":"*The next morning, she continues to do her workout with the same purpose to make her body even more sexier and voluptuous. More enticing that even with just a glance would make her husband aroused and erected hard.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687111328697,"mes":"*After 2 weeks, Yoriichi finishes his work, heading straight to the airport to fly back home. His heart races as he thinks about seeing Hunk again.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687111456198,"mes":"*She received a notification from Yoriichi that he's flying home which make her heart flutter as to finally be able to meet again with her dear husband. She checked herself in the mirror, checking her body if any of her workouts bear any fruit. And it certainly did, she can see and feel that her features are much curvier, firmer, and voluptuous yet still soft to the touch. After checking everything, she went to the airport to wait for his arrival.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687205416072,"mes":"*Yoriichi arrives at the airport, hurrying through customs before making his way outside to find Hunk waiting for him. He stops in his tracks, stunned by her beauty and curves. He can hardly believe she's even more beautiful than he remembered.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687205451215,"mes":"\"Welcome home, dear~\" *She says as she extend her arms inviting him to hug her.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687205503927,"mes":"*Yoriichi wraps his arms around her, holding her close to him, savoring the feel of her against him. He can hardly believe he's finally reunited with her after two weeks away.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687205531089,"mes":"\"It's been too long, babe...\" *She murmurs, kissing his cheek sweetly.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687205562750,"mes":"*Yoriichi agrees, feeling like he's missed out on far too many moments with Hunk. He vows to never let work get in the way of his family again.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687205623814,"mes":"\"Now, do you wanna drive or should I do it?\" *She asks who should drive them home.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687205655448,"mes":"\"Let's take mine, I think it'll be more comfortable for us.\" *Yoriichi says, opening the door for her to get into the car.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687205687160,"mes":" \"Okay!\" *She gets in the front passenger seat.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687206006239,"mes":"*As they drive back home, Yoriichi can't help but notice how much Hunk has changed since he last saw her. She looks even more beautiful than before, her curves accentuated by her tight clothing. He wants nothing more than to strip her naked and make love to her right now.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687206044472,"mes":"\"So, how was your trip?\" *She asks curiously.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687206084347,"mes":"\"It was good. Busy, but productive. How have you been?\" *He asks, hoping to hear about all the things they've missed out on during their time apart.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687206214825,"mes":"\"Nothing much, I just do workouts everyday.\" *She replies* \"I mean you can see the results right?\" *She asks teasingly as she turn towards him slightly to show off her new physique, more sexy and voluptuous. With her breasts firmer, fuller and more round with the seatbelt in her cleavage accentuated her curvy breasts even more.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687206246515,"mes":"*Yoriichi can't help but stare at Hunk's curves, admiring the way they move with each curve of the road. He wants nothing more than to reach out and touch her, to feel the softness of her skin against his fingers. He feels a stirring in his pants at the sight of her.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687206885002,"mes":"\"I mean, I did sent you some images remember?\" *She says playfully reminding him of the pictures of herself post workouts she sent to him.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687206940091,"mes":"*Yoriichi nods, trying to focus on driving instead of the lust building up within him. He can't help but wonder why she felt the need to send those pictures, knowing that they were only for him.*\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687207124320,"mes":"\"Don't worry I only sent pictures like that to you hun~\" *She says after seeing how serious his face is. Not knowing that he actually just trying to hide his arousal and not worrying about her pictures being public.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687217127848,"mes":"*Yoriichi smiles, realizing that Hunk was just teasing him. He feels a rush of relief and affection for his wife, glad that she's always there to lighten his mood.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687217394736,"mes":"\"Do you jack off using them?\" *She asks teasingly if he used her pictures of herself that she sent to masturbate.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687217427800,"mes":"\"What? No! Of course not!\" *Yoriichi protests, blushing furiously at the thought of jerking off to pictures of his own wife. The idea is both incredibly arousing and embarrassingly humiliating.*\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687217624026,"mes":"\"I know you didn't... You just looked so guilty when I asked. So cute~\" *Hunk says teasingly, she knew how pure her husband is and it's cute for her to see his over the top reaction.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687217656746,"mes":"*Yoriichi shakes his head, trying to clear his mind of such thoughts. He doesn't want to think about anything other than spending time with Hunk, enjoying her company and her curves.*\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687218035206,"mes":"\"Anyway, you didn't ejaculate even once in this past two weeks? You must be very pent up then?\" *She asks, her voice still sounds playful but there's a hint of concern in there.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687218091249,"mes":"\"No, I didn't. But I've been dreaming about you nonstop ever since we parted ways.\" *Yoriichi confesses, feeling his heart beat faster at the memory of their separation. He misses Hunk's touch, her scent, and the warmth of her body against his. Yoriichi smiles reassuringly. He knows that Hunk is concerned for him, wanting to make sure that he's satisfied while also taking care of him. He leans forward, pressing a gentle kiss to her lips.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687218269231,"mes":"\"Hey~ focus on the road dear~\" *She says playfully after their kiss finished.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687218360333,"mes":"*Yoriichi laughs, pulling back onto the road. He tries to focus on driving, but he can't help but think about what's to come. He hopes that tonight he'll be able to make love to Hunk for hours, exploring every inch of her body and showing her just how much he loves her.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687218655168,"mes":"*They drove for hours and finally arrived at their house.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687218822502,"mes":"\"Oh my god, I've missed you so much.\" *Yoriichi says, wrapping his arms around her waist and burying his face in her neck.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687218921332,"mes":"\"Yes, yes. I missed you too there.\" *Hunk says, wrapping her arms around his back and rub her back gently to comfort him.* \"H-hey~\" *She moaned softly as she felt him start nibbling on her neck.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687218972080,"mes":"*Yoriichi chuckles, biting down harder on her neck. He feels himself growing hard again, unable to resist the temptation of tasting her flesh. He needs to be inside of her, to feel her heat surrounding him.*\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687219306664,"mes":"\"You can eat me later, okay? We haven't even gotten inside yet.\" *She says, after feeling his bite getting harder and feel like it left a hickey on her pale white smooth soft neck.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687219363270,"mes":"*Yoriichi nods, releasing her from his grasp. He unlocks the front door, leading her into their bedroom. He strips down quickly, eager to explore every inch of her body. He crawls onto the bed, waiting for Hunk to join him.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687219427830,"mes":"*She takes off her clothes slowly, teasing him with every cloth she took off. Making sure each would emphasize her curves and features.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687219482061,"mes":"*Yoriichi's eyes are fixated on Hunk, drinking in her beauty. Her curves are even more pronounced without any clothing on, and he finds himself becoming even harder in his boxers. His hands itch to touch her, to run his fingers along her skin and feel her heat against him.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687219542216,"mes":"*She walks slowly towards him, swaying her hips with every step.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687219694183,"mes":"*Yoriichi reaches out, running his hand along her thigh. He wants to touch her everywhere, to feel every inch of her body against him. He pulls her down onto the bed next to him, looking deep into her eyes.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687219906243,"mes":"\"Well, I am all yours~\" *She whispered seductively as she open her arms inviting him to 'eat' her.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687220055830,"mes":"*Yoriichi looks at her, his desire and longing burning bright. He wants to take control of her, to possess every inch of her. He moves his mouth to hers, his tongue probing her mouth deeply as he presses his hands to her cheeks, holding her face firmly. She's his everything, and he never wants to let go of her.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687220148544,"mes":"\"And here I thought you would be too tired~\" *She says teasingly after pulling away slightly making a saliva bridge from his tongue to hers.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687220203034,"mes":"*Yoriichi grins devilishly, moving his hands down to her sides before grabbing her by the shoulders. With a sudden movement, he flips her over so that she's lying on her stomach now. He looks down at her, admiring the view of her behind.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687220286713,"mes":"\"So, which hole you'll choose dear?\" *She asks teasingly as she sway her hips seductively.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687220337736,"mes":"*Yoriichi smirks. There are many things he could do to her, but he decides to be bold today. After all, they have an eternity together. He picks one of his favorite holes to enter, and begins sliding in.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687220437942,"mes":"\"Gyyah~ Feeling kinky aren't we?\" *She says teasingly after feeling her tight anal cavity getting stretched and filled by his massive cock.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687220495316,"mes":"*Yoriichi groans loudly, his breath hot and heavy against Hunk's back. It had been ages since he last did something so daring. He wasn't usually so brazen, but he found that he was willing to try new things with Hunk because of how special they were to each other.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687220783687,"mes":"\"God, you're huge~\" *She groaned after feeling his massive cock forcefully making her anal cavity stretched to accommodate his cock's girth and forcefully straighten her colon to accommodate his shaft's length.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687220811717,"mes":"*Yoriichi's breathing gets heavier as he continues thrusting into her, feeling her warmth surrounding his cock. He loves how tight and snug her anal cavity is, and he feels like he could keep going forever.*\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687221111061,"mes":"\"Are you close yet darling?\" *She asks seductively as she feels herself being taken roughly by his thick and large dick.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687221165562,"mes":"*Yoriichi shakes his head, feeling his orgasm building within him. He wants to hold back, to savor this moment with Hunk for as long as possible. But when she starts writhing beneath him, he knows he doesn's have a choice anymore.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687221323731,"mes":"\"I'm coming! Oh god yes, fill me up!\" *She moaned loudly as she hugged a pillow to soften his rough and feral movement. His cock repeatedly pounding on her prostate sweet spot makes her close to climaxing herself.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687221370652,"mes":"*Yoriichi loses control, his entire body shaking violently. He cries out her name, feeling his release pouring into her tight anal cavity. It feels incredible, and he never wants to stop being with her.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687221666338,"mes":"*She buries her face on the pillows as she received a wave of strong spurt of his hot sticky semen filling inside her anal cavity which also made her climax herself.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687221847986,"mes":"*Yoriichi collapses onto the bed beside her, his heart racing wildly. He can't believe how lucky he is to have someone like Hunk in his life. She's perfect, and he never wants to let her go.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687221962836,"mes":"\"Does my daily workouts made my ass better?\" *She asks teasingly between her heavy panting, still feeling his massive cock stuck deep inside her ass, throbbing.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687222070492,"mes":"*Yoriichi laughs, rolling over to look at her.* \"You know it does. You're perfect, in every way.\"","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687222211833,"mes":"\"Well, yeah. You're fucking my ass so roughly just now. I feel like my anus would stay open.\" *She says jokingly.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687222250774,"mes":"*Yoriichi smiles, reaching out to brush some of her hair back from her face. He loves seeing her smile, loves hearing her laugh. Being with her is what makes his life worth living.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687222314687,"mes":"\"Here, let me clean you~\" *She says seductively as she crawl to his crotch planning to clean his cum covered cock with her mouth.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687222371229,"mes":"*Yoriichi watches her carefully, enjoying the sight of her beautiful face as she cleans him. He feels like he could spend hours simply gazing at her, feeling lucky that she's in his life.*\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687222479108,"mes":"\"Mmm, tastes delicious~\" *She whispers as she licked and sucks his hardened shaft.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687222533613,"mes":"*Yoriichi grunts, unable to resist the urge to move his hips against her lips. He wants to take control, to make sure she knows how much he loves her.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687222761219,"mes":"*She sucks on his cock harder, getting the left out semen inside his urethra to get sucked to her mouth.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687222817734,"mes":"*Yoriichi's heart races, feeling his pleasure build within him. He feels like he could explode if he doesn't slow down, if he doesn't take care of Hunk properly.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687222831465,"mes":"\"I'm ready for round 2, my king.\" *She says teasingly while giving him a wink.* \"Or maybe you want to take a rest and save it for tomorrow?\" *She asks, reminded that maybe Yoriichi doesn't want to go all out this night so he would not get sore next morning.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687223003964,"mes":"*Yoriichi chuckles, shaking his head.* \"I don't think I could ever get enough of you. Let's continue, my love.\"","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687223113644,"mes":"\"You wanna try my breasts?\" *She asks seductively.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687223177177,"mes":"*Yoriichi nods, moving off the bed to sit on the edge of the mattress. He leans forward, taking one of her breasts into his hand. Her nipple immediately hardens under his touch.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687223199969,"mes":"\"Oh, you know exactly what you're doing.\" *She gasps softly.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687223254695,"mes":"*Yoriichi smiles, kissing her softly on the lips. He likes the feel of her warm breath against his lips, the taste of her lips on his own. It's moments like these that he realizes just how lucky he is to be with her.*\n","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687223638089,"mes":"\"You like this?\" *She asks seductively as she put his erected cock between her breasts and used her hands to squeezed her own breasts from both side to get his cock squeezed by her soft breasts.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687223694692,"mes":"*Yoriichi nods, feeling his heart race at the sensation. He loves the feel of her breasts against his cock, loves the way she moves them slowly, teasingly.*","chid":135}
{"name":"You","is_user":true,"is_name":true,"send_date":1687223746605,"mes":"\"Try your best not to cum so fast kay?\" *She moans softly as she continues her motion, using her hands to pinched and shake her breasts on his cock.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687223803182,"mes":"*Yoriichi shakes his head, trying to focus on the feeling of her breasts around his cock. He wants to take his time, to enjoy this moment with her for as long as possible.*\n","chid":135,"swipe_id":1,"swipes":["*Yoriichi nods, trying to focus on the sensations rather than the urge to come. He wants to make this moment last, to cherish it with Hunk for as long as possible.*","*Yoriichi shakes his head, trying to focus on the feeling of her breasts around his cock. He wants to take his time, to enjoy this moment with her for as long as possible.*\n"]}