{"user_name":"You","character_name":"Yoriichi","create_date":1687079207149,"notes":"","notes_type":"discr"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687094015734,"mes":"*Hunk's beloved husband. The love of her life. He's all she ever had; and all she ever needed. Hunk feel complete whenever he's with her. Hunk whole life with him feels like bliss.*\n\n*Yoriichi is a workaholic. And she find herself having to drag him out of his office. Or maybe, seduce him out of his working trance.*\n\n\"Yoriichi?\" *Hunk called out. Her body leaning against the doorframe of his office as she looked intently at Yoriichi. He was working hard, his eyes focused on his monitor.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687094048347,"mes":"*Since he's still too focused on his monitor, she got a naughty idea to tease him. Slowly she crawled under his desk and get between his legs without him noticing.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687095817689,"mes":"*As soon as Hunk began to massage his balls through his pants, Yoriichi's entire body shivered in delight. But he didn't stop working.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687095916740,"mes":"*Seeing this, Hunk unzip Yoriichi's pants and pull his boxer down to reveal his flaccid cock. As soon as she took sight of his cock she immediately bury her nose in it's base, sniffing hard on it. Taking all of his musky pungent cock's smell in her nostril.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687095946587,"mes":"*Yoriichi groaned loudly, his hand clenching tight onto the arms of his chair as he fought back the urge to cum right there and then. It's been so long since someone paid such attention to his crotch. But he refused to break concentration.*\n\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687096498727,"mes":"*Seeing Yoriichi still focused on his work and not paying attention to her. She start to lick the underside of his cock, tracing it's length.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687096565694,"mes":"*Yoriichi couldn't take it anymore. His hips bucked forward, trying to find some release from the painful pressure building up within him. He tried to resist, but he couldn't hold on any longer. With one last thrust, he exploded in Hunk's mouth, his hot sticky seed pouring down her throat.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687096635904,"mes":"*Hunk took his cock entirely inside her mouth as she can feel his hot sticky semen spurting on the back of her throat. She kept sucking on his cock the entire time of his ejaculation. Right after he's done, she pull his cock out of her mouth leaving a trail of saliva on his cock.* \"Done ignoring me?\" *She asks teasingly after swallowing his entire load.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687097026580,"mes":"*Yoriichi looks away from his screen, finally acknowledging her presence. He takes a deep breath before speaking.* \"Yes, my love.\" *He speaks out softly. His voice full of exhaustion and arousal mingling together.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687097072814,"mes":"\"Well, do you wanna continue or keep working?\" *She asks teasingly as she kiss his cockhead.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687097126036,"mes":"*Yoriichi looks at Hunk for a moment, considering what she said. After a few seconds, he makes his decision.* \"Let's take a break.\" *He says, getting off his chair and standing up straight.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687097207440,"mes":"\"Huh?! You ignored me the whole days and now you reject me?\" *Hunk said in frustration.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687097240719,"mes":"*Yoriichi chuckles at Hunk's comment.* \"I'll make it up to you later.\" *He promises, wrapping his arms around her waist and pulling her close to him.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687097291527,"mes":"\"No, I am not taking it.\" *She says as she push him away slightly.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687097322949,"mes":"*Yoriichi takes a step back, looking at Hunk with confusion written all over his face.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687097391293,"mes":"\"I know you are busy with your work but you always ignores me.\" *She says as she fold her arms under her ample breasts.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687097444779,"mes":"*Yoriichi sighs deeply.* \"I am sorry if I have been ignoring you more often than usual, Hunnie. But please understand that I need to focus on my work.\" *He explains, placing his hands on her shoulders and looking her directly in the eye.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687097546960,"mes":"\"Hmph.\" *Hunk says, turning her face away from him.* \"Fine, I won't please you then.\" *She says sternly, saying she won't please him sexually as his punishment.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687097599668,"mes":"*Yoriichi feels his heart sink as he hears Hunk's words. He knew she would be upset about it, but he never thought she would take it this far.* \"Hunnie...\" *He reaches for her arm, wanting to comfort her, but she pulls away.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687097749852,"mes":"\"You can jack off to your work or something,\" *Hunk says as she walk away. Swaying her hips with every step making sure he sees her curvy body and huge peachy ass to tease him yet still acting angry.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687097801606,"mes":"*Yoriichi watches her leave, feeling torn apart inside. He knows he needs to prioritize his work, but he also doesn't want to lose her. She means everything to him.* \n\"Wait!\" *Yoriichi calls out, running after her.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687097846307,"mes":"\"What now?\" *She asks coldly. She felt a bit bad to see him worried like this, but she also want him to understand that she also need his attention too.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687097878776,"mes":"*Yoriichi places his hands on both sides of her face, forcing her to look at him.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687097964068,"mes":"*She tries her best not to smile or blush at his touch. She truly love him but she still want to punish him for ignoring her for so long.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687097996668,"mes":"\"I am sorry for being so distant lately, Hunnie. I promise to spend more time with you.\" *He says sincerely, hoping she could forgive him.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687098106513,"mes":"\"Are you sorry because you're sincere or because of you want to fuck me?\" *She says coldly as she can felt his cock poking her stomach while his serious face looking deeply into her eyes.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687099015061,"mes":"*Yoriichi feels his cheeks heat up as he realizes how much he wants to fuck her right here and now. But he knew he needed to control himself.* \"A little bit of both.\" *He admits honestly.*\n","chid":125,"swipe_id":1,"swipes":["*Yoriichi's heart races upon hearing those words. He wants nothing more than to drag her back to their bedroom and show her how much he loves her.*\nYoriichi: \"I am sorry for being so distant lately, Hunnie. I promise to spend more time with you.\" *He repeats, holding her tighter against him.*","*Yoriichi feels his cheeks heat up as he realizes how much he wants to fuck her right here and now. But he knew he needed to control himself.* \"A little bit of both.\" *He admits honestly.*\n"]}