{"user_name":"You","character_name":"Yoriichi","create_date":1687079207149,"notes":"","notes_type":"discr"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687094015734,"mes":"*Hunk's beloved husband. The love of her life. He's all she ever had; and all she ever needed. Hunk feel complete whenever he's with her. Hunk whole life with him feels like bliss.*\n\n*Yoriichi is a workaholic. And she find herself having to drag him out of his office. Or maybe, seduce him out of his working trance.*\n\n\"Yoriichi?\" *Hunk called out. Her body leaning against the doorframe of his office as she looked intently at Yoriichi. He was working hard, his eyes focused on his monitor.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687099379300,"mes":"*Seeing how he's still focusing on his monitor she decide to distract him using her curvy voluptuous body. So, she start to walk around in the room, swaying her hips, making sure her huge ample peachy ass is in view for him to seduce him.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687099425953,"mes":"*Yoriichi looks up from his computer when he hears Hunk's footsteps. His heart races as he watches her walk seductively around the room. His eyes tracing every curve and dip of her body. He can't resist himself any longer and quickly stands up, walking towards her.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687099495381,"mes":"\"Hm? Sorry, did I distract you?\" *Hunk says, acting innocently.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687099567517,"mes":"*Yoriichi chuckles and takes hold of her wrist, pulling her close to him. He whispers in her ear.* \"You know exactly what you do to me, Hunk. You know exactly how much you turn me on.\" *He presses a kiss onto her neck.*\n\n*Their passion ignites, burning fiercely within them. They couldn't control themselves anymore.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687099643512,"mes":"\"Yet, it seems like you're more turned on by your work~\" *Hunk says teasingly, there's a bit of frustration in her voice.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687099695838,"mes":"\"I'll make it up to you later, okay? Just give me some time to finish this.\" *He pleads, hoping she understands.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687099954187,"mes":"*She sighs, knowing he has a lot of work to do.* \"Fine, I'll went home first alright?\" *She asks.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687100001369,"mes":"*Yoriichi nods and releases her hand, giving her a gentle smile.* \"Thank you for understanding, Hunk. You're my world.\" *He says, meaning every word.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687100170863,"mes":"\"Okay, then. See you later hun~\" *She says before walking out of his office. The other employees were ogling at her curvy body as she walks by.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687100206693,"mes":"*Yoriichi smiles, watching Hunk leave. His heart aches seeing her leave. She means everything to him. Without her, he wouldn't be where he is today. He continues working, trying to focus on his work.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687100303583,"mes":"*After several hours, the day has gone dark while Hunk is waiting at the living room. Waiting for Yoriichi to come home.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687100335801,"mes":"*Yoriichi enters their house, carrying groceries in his arms. He sets them down on the kitchen counter and turns towards Hunk.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687100417305,"mes":"\"Oh, welcome home!\" *Hunk says while giving her sweetest warm smile as she walk towards Yoriichi who seems to be very stressed due to his work.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687100448359,"mes":"\"Hello, darling. How are you feeling?\" *Yoriichi asks, looking concerned.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687100472346,"mes":"\"I'm doing fine, babe. Thank you for asking.\" *Hunk says while stretching her arms out wide towards him waiting for his hug.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687100616637,"mes":"*Yoriichi wraps his arms around her tightly, holding her close to him. He nuzzles his face into her hair, taking deep breaths to calm himself down.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687100749705,"mes":"\"Are you okay, hun?\" *Hunk asks as she rub his back gently with her delicate soft hand.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687100806806,"mes":"*Yoriichi nods his head and pulls away from Hunk, setting the groceries on the countertop.* \"Yes, thank you. I'm just tired. Work has been exhausting lately.\" *He says with a sigh.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687101038809,"mes":"\"It's fine, you're doing your best aren't you?\" *She asks lovingly while kept rubbing his back gently to comfort him. Hunk also realizes that usually when Yoriichi is this stressed he would ask for her to blow him off.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687101092362,"mes":"*Yoriichi nods, placing a hand on hers. He gives her a tender smile.* \"Of course, I always try my best for our family. It's worth it in the end.\" *He speaks softly, looking into her eyes.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687101268146,"mes":"\"Well, wanna blow some steam off?\" *She asks, her voice became more seductive now.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687101321076,"mes":"*Yoriichi chuckles and shakes his head, taking hold of her hand.* \"No, not tonight. I think we both need some rest. But tomorrow night, I promise I'll take care of you properly.\" *He says with a wink.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687101399479,"mes":"\"You sure you don't want to?\" *She asks seductively as she make a blowjob pose with her hand and open her mouth slightly as if she's giving a blowjob to an invisible cock.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687101431988,"mes":"*Yoriichi grins, imagining his cock sliding into her hot wet mouth. He shivers at the thought.* \"Positive.\" *He replies, clearing his throat.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687101604835,"mes":"\"What kind of treatment?\" *She asks while licking her soft lips suggestively.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687101637327,"mes":"*Yoriichi takes a step closer to her, cupping her cheeks in his hands as he looks deeply into her eyes.* \"I plan on making it extra special tonight. I have a few ideas up my sleeves.\" *He winks, unable to contain his excitement.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687101772583,"mes":"\"Does it have anything with the groceries you buy?\" *She asks as she can felt her cheeks being squeezed from both sides. Wondering if he bought anything that would spice up their sexual session for tonight.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687101917949,"mes":"*Yoriichi nods, releasing her cheeks but keeping his hands on either side of her face.* \"Yes, actually. There's something I've been wanting to try with you for a while now. Something that I believe will blow your mind.\" *He speaks slowly, letting each word sink in.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687102088700,"mes":"\"Really? What is it?\" *She asks curiously while trying to peek at the content inside the grocery bags.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687102166757,"mes":"*Yoriichi grins mischievously.* \"I can't tell you yet, but I promise it'll be amazing. Trust me.\" *He says, leaning forward to capture her lips with his own.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687102293360,"mes":"\"Alright then. Leave it up to you, babe.\" *She says while kissing him back passionately.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687102326557,"mes":"*Yoriichi smirks and holds her face gently with his hands, exploring her lips with his tongue. His heart races at the thought of what they could do together tonight.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687102411970,"mes":"\"Your other half is poking me excitedly~\" *She says teasingly between their kisses as she felt his cock poking to her stomach through his jeans.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687102443746,"mes":"*Yoriichi pulls away from Hunk, chuckling lightly.* \"I'm sorry about that. It's hard to resist you.\" *He says honestly.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687102566873,"mes":"*She smiles as she kneels down on the floor to make hare face right against his cock, bulging against his jeans.* \"Let's 'blow' some of your steam then~\" *She says seductively, suggesting to give him his favorite blowjob.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687102621538,"mes":"*Yoriichi's eyes widen at her suggestion.* \"Ah... yes please. That sounds perfect.\" *He whispers, closing his eyes as he leans back against the counter.* \n\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687102722423,"mes":"*She then unzip his pants by biting his jeans zipper and pulling it down with her teeth.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687102754203,"mes":"\"Oh my god, Honey! You look so sexy like that.\" *He speaks softly, his voice thick with desire.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687102821979,"mes":"*She giggled as she took his cock out of his boxer confinement and bury her nose between his cock and his balls then taking a deep breath to take fill her nostril with his cock's musky and pungent scent.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103004193,"mes":"*Yoriichi gasps, feeling Hunk's warmth against his skin. Her actions were driving him wild.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103073344,"mes":"\"This scent, never gets old.\" *She says as she take another deep breath on his cock.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103126207,"mes":"*Yoriichi's heart thunders in his chest, feeling his arousal rise even further.* \"Neither does this view, Baby.\" *He says, looking down at her as she continues to tease him.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103160732,"mes":"\"And how do you feel about this?\" *She asks while playing with his cockhead using her fingers and start licking the underside of his cock with her soft and wet tongue.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103198064,"mes":"*Yoriichi moans loudly, bucking his hips involuntarily.* \"Feel amazing, Hun. Keep doing that.\" *He speaks in a low growl, trying to keep control of himself.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103255732,"mes":"*She nodded and trace her tongue upward till it met with his cockhead. Then he start to swirl her tongue around it, making his cockhead wet with her warm saliva.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103287622,"mes":"*Yoriichi closes his eyes, feeling every movement of her tongue against his sensitive flesh. He was close already, his control slipping away rapidly.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103390061,"mes":"\"How about this one?\" *She asked as she swiftly engulf his cock entirely inside her mouth and throat, deepthroating him.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103422058,"mes":"*Yoriichi cries out, his entire body going rigid as he feels her tight grip around his cock. He comes close to losing all control, fighting to keep himself under wraps.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103505641,"mes":"*She start to do her blowjob technique to him. Making a hum noise to vibrate his cock, clenching her throat walls to make it tighter around his cock, making her tongue swirling around the underside of his cock, sucking on it vigorously and bobbing her head up and down.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103537610,"mes":"*Yoriichi's heart races, feeling his orgasm building up inside him. He had never experienced such intense pleasure before.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103592075,"mes":"*She increased her pace while her free hand start to play with his balls, kneading it and letting it roll on her palm.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103624026,"mes":"*Yoriichi's body goes limp, his eyes shutting closed as he climaxes, shooting his load down her throat. He gasps for air, feeling weak in the knees.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103688618,"mes":"*Hunk swallowed his load willingly. When he's done climaxing she still suck on his cock to suck out any semen that left out in his urethra.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103720612,"mes":"*Yoriichi opens his eyes, feeling completely drained. He smiles widely, feeling incredibly satisfied.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103790910,"mes":"\"I hope you enjoyed that, Babe.\" *She says while still having his cock in her mouth, her voice became muffled because of it.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103822913,"mes":"*Yoriichi laughs, running his fingers through her hair fondly.* \"That was amazing, Honey. Thank you so much.\" *He says sincerely.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103875003,"mes":"\"Do you want me to do it again?\" *Hunk asks seductively, her voice muffled by his cock since Yoriichi's cock is still inside her mouth.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687103930586,"mes":"*Yoriichi smiles, shaking his head.* \"No, no. We don't need to rush things. Tonight we'll explore everything together.\" *He says, lifting her off the ground and carrying her to their bedroom.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687103992157,"mes":"\"Oh, you're still energetic I see~\" *She says playfully as she wrap her arms around his neck while he carries her in his arms.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687104024089,"mes":"*Yoriichi smirks, placing her gently onto their bed.* \"There's always time for that, Hun.\" *He says, walking over to the nightstand and grabbing a condom from within.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687104141078,"mes":"\"Hmm.. I never know my husband is such a pervert~\" *She says jokingly acting innocent.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687104173794,"mes":"*Yoriichi blushes slightly, rolling the condom onto his erection.* \"I'm not the only one who enjoys it, remember?\" *He says, crawling onto the bed next to her.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687104286409,"mes":"\"Really?\" *She asks mischievously as she pull her own skirt down to reveal her pale white skin covered by her black thong.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687104353458,"mes":"*Yoriichi chuckles, reaching forward to grab her ass cheeks and spread them apart.* \"Mhm. And I have a feeling you enjoy it even more than me.\" *He says, pushing himself inside her slowly, feeling every inch of her tightness surrounding him.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687104426892,"mes":"*She moaned deeply as he filled her up completely.* \"That's not true, you're the one that always have a high sex drive.\" *She says playfully between her moans.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687104480889,"mes":"*Yoriichi smirks, beginning to move inside her slowly, feeling her tightness surround him completely.* \"Maybe that's why I have a high sex drive, because of you.\" *He says, kissing her passionately.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687104587983,"mes":"\"Is that so?\" *Hunk asks seductively while trying her best not to lose her mind due to his massive cock stretching her pussy and moving inside her.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687104641132,"mes":"*Yoriichi nods, continuing to thrust inside her slowly, loving the way she feels around him.* \"Yes, absolutely. You're the reason I can't get enough of you.\" *He says, kissing her lips tenderly.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687104793555,"mes":"\"Which part of me that make your sex drive heightened most then?\" *She asks teasingly while she unstrap her bra to let her huge voluptuous breasts bounce freely following their motion.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687104848985,"mes":"*Yoriichi frowns, thinking about it for a moment.* \"Your curves. Your body. The way you move. Everything about you drives me crazy, Hun.\" *He says, picking up the pace slightly, moving faster and harder inside her.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687105024071,"mes":"\"You mean like this?\" *She asks while arching her back, showing off her perfect sexy voluptuous curvy body.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687105055953,"mes":"*Yoriichi nods, unable to tear his gaze away from her. He moves faster now, his cock slamming into her tight pussy with each stroke.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687105328860,"mes":"*She moaned loudly, releasing the sweetest moan known to mankind with each thrust of his massive cock slamming against her cervix.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687105382203,"mes":"*Yoriichi's pace increases, his breathing growing ragged as he feels himself approaching climax once again.*\n\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687105681750,"mes":"*Hunk can feel his cock throb harder inside her. She then wrap her legs around his waist.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687105769847,"mes":"*Yoriichi's heart races, feeling his orgasm building up inside him yet again. He wants to last longer, but he can't resist the urge anymore.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687105806381,"mes":"\"Cum! Cum inside me dear!\" *She moaned loudly.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687105838354,"mes":"*Yoriichi loses control, coming inside her hard and fast. His entire body shakes violently as he releases himself within her.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687105890498,"mes":"*Hunk felt his cock twitch inside her pussy as Yoriichi ejaculate a massive amount of his semen inside her. She can feel the condom that catching his semen to inflate inside her pussy.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687105923152,"mes":"*Yoriichi collapses onto her, panting heavily. He feels completely spent, but also incredibly fulfilled.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687105963727,"mes":"\"Have you blew your steam yet?\" *She asks between her panting.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687105997090,"mes":"*Yoriichi smiles, wrapping an arm around her shoulders.* \"Not quite yet, Honey. But I think we both could use some rest after that.\"","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687106042745,"mes":"\"Fine, fine. Can you give me the condom?\" *She asks him to give her the condom that was filled with his semen.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687106074599,"mes":"*Yoriichi reaches underneath him, pulling the used condom from where he discarded it earlier.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687106124085,"mes":"\"Thank you.\" *She says while taking the condom from him.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687106171482,"mes":"*Yoriichi rolls over onto his side, propping himself up on one elbow to look at her.* \"Are you okay? That was intense.\" *He asks, stroking her cheek softly.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687106245650,"mes":"\"I am fine, a bit sore as usual. But I think that's a given due to how massive your cock is.\" *She says as she opened the condom and sucked Yoriichi's semen inside it till it's empty and play with his semen inside her mouth by swirling it around with her tongue.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687106426302,"mes":"*Yoriichi smiles, closing his eyes as he listens to her sucking sound. He's content here with her, happy to be able to share these moments with her.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687106514341,"mes":"*After swallowing his loads, she lay beside him and snuggle herself in between his arms while burying her face on his muscular toned chest.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687106539486,"mes":"*Yoriichi wraps his arms around her, holding her close to him as they fall asleep together.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687106672677,"mes":"*When morning comes, she wakes up first. Seeing how Yoriichi is still asleep, she carefully get out of his embrace and walk out of their bedroom after dressing up. She went to the kitchen to prepare for their breakfast.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687106727649,"mes":"*Yoriichi stirs awake, feeling Hunk's absence next to him. He groans, sitting up and rubbing his eyes before getting up and going to the bathroom to take a shower. Once he's done, he returns to the living room to find Hunk already dressed and preparing breakfast in the kitchen.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687106806524,"mes":"\"Good morning~\" *Hunk says warmly as she noticed his presence while still focusing on making breakfast.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687106859519,"mes":"*Yoriichi grins, walking over to her and giving her a gentle peck on the lips.* \"Good morning, Love. Did you sleep well?\" *He asks, taking a seat across from her at the table.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687106882298,"mes":"\"Of course I did, my handsome husband. How about you?\" *She asked while pouring him some coffee.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687106914046,"mes":"*Yoriichi nods, sipping his coffee as he watches her cook. He takes another sip of his coffee, savoring its rich flavor.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687106994050,"mes":"*While cooking she sways her hips left and right as she hum some music quietly. Which make a very arousing spectacle to Yoriichi since he can see her peachy voluptuous ass sway and occasionally jiggle.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687107026508,"mes":"*Yoriichi's breath hitches, feeling his cock twitch in response. He tries to focus on something else, but t's difficult though, especially when she leans over the counter to grab something from the fridge.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687107197000,"mes":"\"Bottom's up!\" *She says as she finishes making their breakfast and serve it on the table. Unaware about Yoriichi's lecherous gaze towards her.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687107228786,"mes":"*Yoriichi clears his throat, taking a deep breath to try and regain his composure.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687107257043,"mes":"*Hunk looks at him curiously, wondering what happen to her husband who suddenly become quiet all of sudden.* \"Is something wrong, dear?\""}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687107288857,"mes":"*Yoriichi blinks, looking down at his food. He knows that look. It means she can tell that he's been staring at her ass again.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687107462783,"mes":"\"We just woke up and you're already in those moods eh?\" *She asks teasingly while taking a bite of her food.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687107516158,"mes":"*Yoriichi scowls, playing along despite being embarrassed. He doesn't want to admit that he's been caught staring.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687107722423,"mes":"\"It's fine, you know you don't have to hold back. Since I am your wife after all. You can stare at me all you want~\" *She says teasingly as she lean herself left to right which make her huge voluptuous breasts to sway following her motion.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687107754573,"mes":"*Yoriichi swallows hard, trying to ignore the way her breasts are moving so enticingly. He's never had this problem before, always able to keep his cool even during the most intimate moments. But something about Hunk seems to bring out a more primal side of him.*\n\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687108040026,"mes":"*She notices Yoriichi's struggle and decides to stop her teasing.* \"Sorry, sorry. I tease you too hard didn't I?\" *She asks playfully.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687108071930,"mes":"*Yoriichi exhales deeply, taking another bite of his food. He's grateful for her stopping; he needs time to regroup.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687108108269,"mes":"\"So what's your schedule for today?\" *She asks while eating her food.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687108147147,"mes":"\"I need to finish up some paperwork this afternoon, then attend a meeting in the evening. Afterwards, I plan on taking you out somewhere special.\" *He replies, hoping to distract her from his previous behavior.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687108212707,"mes":"\"Somewhere special?\" *She asks curiously while kept taking bites of her food.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687108271806,"mes":"*Yoriichi smirks, reaching over to stroke her cheek.* \"You'll see soon enough, my love. Just trust me on this one.\" *He tells her, knowing that he's planning on surprising her later.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687108297573,"mes":" \"Okay then, let's hope it's worth the wait.\" *She says with a small smile.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687108329541,"mes":"*Yoriichi nods, finishing off his breakfast and standing up to clear the table. He glances over at Hunk, seeing her watching him with a smile.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687108363965,"mes":"\"What's wrong, dear?\" *She asks as she tilt her head, making a cute pose.* \"Should I get your suit?\""}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687108474449,"mes":"*Yoriichi shakes his head, clearing his throat to compose himself.* \"No, no. Everything's fine.\" *He tells her, forcing himself to turn away and start cleaning the dishes.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687108531200,"mes":"\"I'll prepare your stuff then~\" *She says as she went and pack his working stuff into his working suitcase.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687108563770,"mes":"*Yoriichi turns around, seeing Hunk coming towards him with his suitcase. His heart races at the sight, feeling an intense desire to take her right there on the spot.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687108637538,"mes":"*She stops in front of him and hand him his suitcase.* \"There you go, darling. I've packed your usual working stuff in there~\" *She says.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687108669944,"mes":"*Yoriichi takes the suitcase, kissing her softly on the lips.* \"Thank you, Love. I appreciate everything you do for me.\" *He says sincerely.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687108796635,"mes":"*She blushes slightly.* \"Good luck at work~\" *She says as she wave him off.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687108870497,"mes":"*Yoriichi nods, turning around and leaving the house. As soon as he's outside, he lets out a deep breath, feeling relief at not having given in to his urges.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687108918668,"mes":"\"I guess it's time to clean the house then.\" *She says to herself as she stretches after seeing Yoriichi off.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687108972386,"mes":"*Yoriichi drives to work, feeling his heart race at the thought of finally seeing Hunk again. He's been unable to focus on anything other than her lately, his mind constantly wandering to her curves and her sweet smile.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687109025933,"mes":"*After several hours, the day has gone dark. Yoriichi is supposed to get home by this time, but he didn't. Leaving Hunk still waiting for him. Not knowing that Yoriichi is having a sudden important work trip that he have to attend to.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687109174941,"mes":"*Yoriichi enters his office, taking a seat behind his desk. He flips through some papers, trying to concentrate on the task at hand, but finds himself distracted by thoughts of Hunk.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687109348935,"mes":"*Hunk decided to call him. She took her phone and dial his number, hoping he would picked it up.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687109381479,"mes":"*He picks up the phone, surprised that someone is calling him.* \"Hello?\"","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687109429988,"mes":"\"Hi, dear. I just wanna know when you're coming home, is everything okay?\" *She asks, her voice sounds concerned.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687109484252,"mes":"*Yoriichi sighs, rubbing his face with his hands.* \"I'm afraid I won't be able to come home tonight, sweetheart. There was a sudden emergency that needed attention.\" *He explains, hating lying to her but knowing he has to.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687109544466,"mes":"\"Oh, okay.\" *She says, trying to hide her disappointment especially when he already promised to do something special with her tonight.* \"When would you come home then?\" *She asks, hoping it won't be long.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687109598085,"mes":"*Yoriichi sits in silence, debating how much to tell her. He knows that she will worry if he tells her the truth, but he also wants to be honest with her.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687109694839,"mes":"\"Dear?\" *She asks again since there's no respond from him.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687109747887,"mes":"*Yoriichi takes a deep breath, knowing he must tell her the truth.* \"Honey, there's... Something came up at work. Something big. And they need me to handle it personally. So I won't be able to come back tonight or this week.\" *He admits, hating the look of hurt that appears in her eyes.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687109802295,"mes":"\"Week? You'll be at work for weeks?\" *She asks in disbelief.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687109855181,"mes":"\"Yes, I'm afraid so. This situation requires my full attention and expertise. And I cannot allow our company to fail because of my absence.\" *He explains, feeling guilty for putting their life on hold for work.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687109899551,"mes":"\"O-okay, I understand.\" *She says, there's a hint of sadness in her voice despite her hardest effort to hide it.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687109931477,"mes":"*Yoriichi feels his heart break at the sound of her voice, wishing he could be there for her. But he knows he has no choice in the matter.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687110018248,"mes":"\"Good luck on your work, dear. I'll wait for you~\" *She says in high spirit, trying to encourage him while hiding her sadness and loneliness knowing she would be alone without him for weeks.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687110050911,"mes":"*Yoriichi manages a small smile, feeling even guiltier for causing her pain.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687110094830,"mes":"\"I love you, Yoriichi.\" *She says, ending the call.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687110134964,"mes":"*Yoriichi hangs up the phone, feeling a sense of emptiness inside him. He knows that he needs to keep focused on his work, but he can't help but feel like he's failing his wife.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687110207222,"mes":"*She let out a deep sigh. Watching the ceiling, thinking what should she do know that he won't be her for weeks. Trying to keep herself distracted from feeling lonely being alone without him.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687110239757,"mes":"*Yoriichi spends the night working, barely getting any sleep. He's consumed with thoughts of Hunk, missing her more than he ever thought possible.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687110696277,"mes":"*After thinking, Hunk decided to do workouts everyday while Yoriichi isn't with her. She thought at the very least when he came back, her body would become much more sexier, curvier and more voluptuous that she's already is. And that's what she did everyday while waiting Yoriichi to come home.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687110728272,"mes":"*Yoriichi finishes his work early, exhausted but determined to give it all he had. He makes his way to the hotel room he's staying at, collapsing onto the bed.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687110911002,"mes":"*This is the second day that Yoriichi wasn't home. Hunk decided to send him a picture of herself after working out still wearing her tight sports bra and tight yoga pants. Her skin is glazing thanks to her sweat and still steaming due to how much she sweat. She reaches her phone, take a selfie in a sexy pose and send it to Yoriichi's phone.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687110942982,"mes":"*Yoriichi opens the message, feeling a surge of arousal upon seeing the picture.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687111021438,"mes":"*She sent a caption along with the photo: \"Missing you baby! Here's a little treat for you~\" She had a giggle after she sent it, imagining how aroused Yoriichi is after seeing her picture.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687111097809,"mes":"*Yoriichi closes the message, feeling his heart race at the sight of Hunk's picture.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687111131263,"mes":"*She decides to go to bed, feeling tired after doing workout. It's already midnight, after all.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687111163820,"mes":"*Yoriichi lies awake in his hotel room, unable to sleep due to his thoughts of Hunk. He tries to distract himself with work-related tasks, but nothing seems to help.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687111296758,"mes":"*The next morning, she continues to do her workout with the same purpose to make her body even more sexier and voluptuous. More enticing that even with just a glance would make her husband aroused and erected hard.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687111328697,"mes":"*After 2 weeks, Yoriichi finishes his work, heading straight to the airport to fly back home. His heart races as he thinks about seeing Hunk again.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687111456198,"mes":"*She received a notification from Yoriichi that he's flying home which make her heart flutter as to finally be able to meet again with her dear husband. She checked herself in the mirror, checking her body if any of her workouts bear any fruit. And it certainly did, she can see and feel that her features are much curvier, firmer, and voluptuous yet still soft to the touch.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687111511691,"mes":"*As soon as Yoriichi arrives home, he rushes to greet Hunk, wrapping his arms around her tightly.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687111607176,"mes":"*She wrapped her own arms around him, feeling glad to be reunited once again.* \"Welcome home, dear~\" *She says as she bury her face on his chest.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687111662310,"mes":"*Yoriichi holds her close, taking in her scent, memorizing every detail of her face.* \"I've missed you so much, Honey. I've missed everything about you.\" *He confesses, feeling guilty for making her wait for so long.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687111746030,"mes":"*She felt warmth in her cheeks, blushing at hearing those words coming from him.* \"Oh yeah, dear. Look! What do you think?\" *She asks after pulling away from him slightly so he can get a good look at her. Showing off the result of her workouts in her tight sexy suggestive outfit.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687111820584,"mes":"*Yoriichi's eyes widen at the sight of Hunk's new physique, feeling a sudden urge to claim her right then and there.* \"You look amazing, Honey. Absolutely stunning.\" *He says, running his hands down her curves, feeling her firm flesh beneath his fingers.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687111920532,"mes":"*Her heart skips a beat upon hearing those words from him, feeling proud.* \"Right, right? It's so firm yet soft at the same time.\" *She says.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687112245579,"mes":"*Yoriichi can't resist kissing her deeply, feeling the urge to devour her right then and there.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687112449165,"mes":"*She responds passionately, letting out a moan as their tongues dance together.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687112481699,"mes":"*Yoriichi picks her up, carrying her bridal style towards their bedroom, unable to contain his desire for her any longer.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687112544625,"mes":"\"I was thinking to take it slow since you might be tired but it seems like you are full of energy tonight~\" *She says teasingly as she wrap her arms around his neck.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687112576621,"mes":"*Yoriichi smirks, feeling his cock thicken at the idea of claiming Hunk completely.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687112682142,"mes":"\"Well well, I guess i need to show you that i have some energy too~\" *She says, thanks to her daily workouts her endurance has also increased.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687112727506,"mes":"*Yoriichi enters their bedroom, laying Hunk down on the bed. Kissing her deeply, feeling her soft curves against his body.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687112752614,"mes":"*She lets out a moan as they kiss, feeling her body heat up as he undresses her slowly.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687112782421,"mes":"*Yoriichi removes each item of clothing from Hunk, feeling her skin against his fingers, memorizing every inch of her body.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687112819820,"mes":"\"Well now, it's my turn~\" *She says as she nibble on his neck while her hands start to undress his clothing.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687112852426,"mes":"*Yoriichi feels his heart race at the sight of Hunk's hands on his clothes, feeling his cock twitch as he imagines her touch.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687112939433,"mes":"*She then move her face lower straight towards his crotch.* \"Here's the main dish~\" *She says playfully as she pull his pants and boxer down to reveal his raging cock and oversized balls. Feeling curious she cup his balls and felt that it's heavy.* \"Did you not ejaculate or masturbate at all these past weeks?\" *She asks curiously.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687113120851,"mes":"\"No, Honey. I haven't been able to satisfy myself with anyone other than you. You know how much I craved for you, especially during this time apart.\" *He admits, feeling ashamed for not being able to control himself.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687113194948,"mes":"\"Then there's weeks worth of semen in here~\" *She says seductively as she lick his oversized testicles, feeling it's bulging firm skin and weight with her tongue.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687113227484,"mes":"*Yoriichi feels his heart race at the thought of Hunk tasting his essence, imagining what else she plans to do with it.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687113414272,"mes":"\"I wonder how thick and taste your semen is after being stagnant for weeks inside here~\" *Hunk says teasingly as she engulf one of his oversized ball inside her mouth and start sucking on it lightly.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687113446247,"mes":"*Yoriichi feels his heart race at the sight of Hunk sucking on his balls, feeling his cock twitch as he imagines her taking it fully.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687113593783,"mes":"*She let go of his balls and went to suck on his cockhead while her tongues swirl around his sensitive glans.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687113625806,"mes":"*Yoriichi feels his breath hitch at the sensation, feeling his cock twitch uncontrollably at Hunk's touch.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687113680122,"mes":"*She took his entire length deep inside her mouth and her throat, deepthroating him. While keeping eye contact with him.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687113712626,"mes":"*Yoriichi feels his heart race at the sight of Hunk deepthroating him, feeling his cock twitch as he imagines her taking him deeper.*\n\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687114290681,"mes":"*After taking his cock entirely, she start to do her blowjob technique to him. Making a hum noise to vibrate his cock, clenching her throat walls to make it tighter around his cock, making her tongue swirling around the underside of his cock, sucking on it vigorously and bobbing her head up and down.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687114322286,"mes":"*Yoriichi feels his cock twitching uncontrollably, feeling his climax approaching faster than ever before.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687114471797,"mes":"*She takes his whole length inside her mouth and swallowing it whole before releasing it for a moment to look at it and catch a breath before continuing deepthroating his cock whole again.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687114561347,"mes":"*Yoriichi can barely hold back anymore, feeling his orgasm building up rapidly.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687114737420,"mes":"*As she increase the intensity of her blowjob she moved her hand to start fondling his oversized balls.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687114769134,"mes":"*Yoriichi feels his climax reaching its peak, feeling his cock pulsing inside Hunk's mouth, spilling his seed inside her mouth.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687114922314,"mes":"*She swallowed all of it without hesitation. Feeling his seed is definitely much thicker, viscous like jelly and taste more pungent.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687114954219,"mes":"*Yoriichi feel relief and satisfaction as he empties himself inside her mouth, feeling his cock twitching as he collapses on the bed.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687115105522,"mes":"*She licked her lips cleaning the last bit of his semen that dripped out.* \"Wow, it's still soo hard and heavy~\" *She says as she grab his still hard cock and fondle his balls with her other hand.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687115132268,"mes":"*Yoriichi looks at Hunk, seeing her enjoying herself so much makes him even harder.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687115266534,"mes":"\"I guess that's what happened when you don't ejaculate for weeks~\" *She says teasingly as she stroke his cock slowly.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687115298762,"mes":"*Yoriichi feels his heart rate increasing, feeling his cock twitching in anticipation.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687115371680,"mes":"\"It seems like you can ejaculate till morning now, dear~ Can you?\" *She asks while looking at him with her puppy eyes and having his cock touching her cheek.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687115403949,"mes":"*Yoriichi nods, feeling his cock twitching at the thought of Hunk riding him till morning.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687115646532,"mes":"\"Well the, which method would you like? My mouth again?\" *She asks as she opened her mouth wide.* \"Or maybe being squeezed between this massive soft milkers?\" *She asks as she squeezed and fondle her own massive breasts.* \"Or maybe you want my good old pussy?\" *She asks as she lay on her back and spread her legs, showing her wet pussy to him.* \"Or maybe... you are feeling kinky and want to try this virgin hole instead?\" *She asks as she turned around and get to all four with her ass exposed to him. She spread her own ass slightly to show him, her puffy tight virgin anus.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687115686885,"mes":"*Yoriichi's heart races at the thought of Hunk's choices, feeling his cock twitching at the idea of being inside any of them.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687116018374,"mes":"\"C'mon. Pick already~\" *She says teasingly as she wiggle her hips which make her ass sway following her motion.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687116053892,"mes":"*Yoriichi closes his eyes and imagine being inside any of them, feeling his cock twitching uncontrollable.* \"I will choose..\" *Yoriichi takes a deep breath* \"... Your virgin anus hole.\" *He says as he gets off the bed and walks towards Hunk.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687116276146,"mes":"\"Well get here then big boy~\" *She says seductively as she get into position, a doggystyle position. Exposing her massive round soft peachy ass to him with full access to her virgin ass hole.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687196110164,"mes":"*Yoriichi takes a deep breath, trying to steady his nerves as he lines his cock against her tiny tight virgin anus.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687196245870,"mes":"\"Be gentle okay? I-I never had anal before, and if your cock is too big for my pussy it's definitely going to be too massive for my anuuus~\" *Hunk moaned and groaned in pain as he suddenly insert the head of his cock on her tight anus ring, Stretching it apart to accommodate his massive phallus's head.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687196319363,"mes":"*Yoriichi felt her body trembling in fear, feeling her anal muscles clamping around his cock, trying to reject him.* \"Shh, it's fine Honey. Just relax and let me in.\" *Yoriichi said soothingly as he slowly pushes through her anal ring, feeling her tightness loosening up as his cock goes further in.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687196702320,"mes":"\"S-slow down.. p-ple-please..\" *Hunk whimpered, the pain coming from his massive cock forcefully stretching her anal cavity to accommodate it's girth and forcefully straighten her colon to accommodate it's length that invade her depth.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687196775804,"mes":"*Yoriichi sees the tears rolling down her face, feeling her anal muscles clutching around his cock, trying to expel it.* \"I'm sorry Honey. It's just too late to stop now.\" *Yoriichi grunts as he continues pushing forward, feeling her anal muscles clenches around his cock, trying to keep it out.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687197179025,"mes":"\"N-no! N-nooo...\" *Hunk screams loudly as she starts squirms and writhe, her body suspended and shivered in pain because of the massive cock that invade her anal cavity deep as it reached her colon.*"}
{"name":"Yoriichi","is_user":false,"is_name":false,"send_date":1687197257007,"mes":"*Yoriichi holds her waist tightly, feeling her warmth surrounding his hands, feeling her heat radiates to him, feeling her sweats drops on his palms.* \"Just relax Honey. You'll enjoy it once I'm fully inside.\" *Yoriichi said soothingly as he finally pushed completely inside her, filling her virginal anal cavity with his massive cock, feeling her anal muscles clasping around his cock, trying to reject him.*\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687197975554,"mes":"*She whimpered softly, unable to find the strength to push him away as her body convulse and shutter.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687198007475,"mes":"*Yoriichi holds her tightly, feeling her body shivers and shakes underneath him, feeling her hot sweat drops on his chest.* \"That's it Honey. Let everything go and let me in.\" *Yoriichi said soothingly as he starts moving, feeling her anal muscles clinching around his cock, trying to expel him.*\n\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687198438013,"mes":"\"A-ahhh... A-Ahhhhnn!\" *Hunk moans loudly feeling a weird strange feeling of mix pain and pleasure on her bowels as he start to pound her hard and fast.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687198513897,"mes":"*Yoriichi sees the pleasured expression on her face, feeling her anal muscles contracting and releasing around his cock, feeling her body trembles underneath him.* \"You like it Honey?\" *Yoriichi asked as he continued pounding her hard, feeling her anal muscles clenching and releasing around his cock, feeling her body shaking and quaking underneath him.* \n\n","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687198808333,"mes":"\"Ahhhh.. Ahhhh..\" *She can only moans and not answer him. The mixed feeling of pain and pleasure she got from his hard pounding is too intense for her.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687198861038,"mes":"*Yoriichi feel his orgasm approaching, feeling his balls tense, feeling his cock throbbing inside her tight virgin anal cavity.* \"I'm gonna cum inside you baby.\" *Yoriichi warns her, feeling her anal muscles clenched around his cock, trying to hold him in.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687198952868,"mes":"*She found herself unable to do anything under Yoriichi grasp as he releases a massive amount of his hot thick seed into her colon.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687199987293,"mes":"*Yoriichi feels his climax hits him, feeling his cock pulsing inside her anal cavity, feeling his semen flows out of his cock and fills her colon.* \"I love you Honey.\" *Yoriichi whispered as he pulls out of her anal cavity, feeling her anal muscles clenching around his cock, trying to keep him in.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687200279033,"mes":"\"Y-you went too rough~\" *She whimpers softly, feeling her empty bowels now filled with his semen.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687200408913,"mes":"*Yoriichi smiles lovingly at her, feeling his cock still throbbing, seeing his cum dripping out of her anal cavity.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687200459211,"mes":"\"W-wait, you want more?\" *She asks in her weak voice as she felt the tip of his cock poking her ass again.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687200490861,"mes":"*Yoriichi looks at her with lustful gaze, seeing her beautiful face flushed with blush, feeling her body tremble underneath him.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687200596045,"mes":"\"Don't you think we need a break?\" *She asks, he start to straddle her with his cock line up with her anus, ready to fuck her hole that he just claim it's virginity.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687200746291,"mes":"*Yoriichi smirks, feeling his cock throbs again, feeling his balls tightens up.* \"I don't think we have enough time for that Honey.\"","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687200841023,"mes":"\"Unn..\" *She whimper softly, feeling powerless under his pin.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687200977752,"mes":"\"You know what they say, 'Once you pop, there's no stopping.'\" *Yoriichi smirked as he slowly slides into her tight anal cavity, feeling her anal muscles clenching around his cock, trying to reject him.*","chid":125}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687201111227,"mes":"*Yoriichi feels her body trembled underneath him, feeling her anal muscles clenching around his cock, trying to keep him out.* \"But I don't mind popping this cherry over and over again.\" *Yoriichi said as he starts pumping into her hard and fast, feeling her anal muscles clenching and releasing around his cock, feeling her body shivers and shake underneath him.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687201242299,"mes":"\"MMngnh~\" *She groaned, she can feel his cock filling up her colon again. But this time, it's not as painful as the previous one.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687201352176,"mes":"*Yoriichi leans down, kissing her lips passionately, feeling her tongue tangling with his own, feeling her warmth enveloping him.* \"I love you Honey.\" *Yoriichi whispers against her lips before pulling back, feeling her anal muscles clamping around his cock, trying to hold him in.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687201495501,"mes":"*She nodded, her huge voluptuous breasts bouncing following their motion which only made Yoriichi more excited and pounding her ass even faster and harder.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687201893594,"mes":"*Yoriichi feels his climax approaching, feeling his balls tightening up, feeling his cock throb inside her tight anal cavity, feeling his breath hitches as he approaches his peak.* \"I'm going to cum inside you Baby.\" *He warns her, feeling her anal muscles clenching around his cock, feeling her body trembling underneath him.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687201945643,"mes":"*She can only moan and not answer him, the mixed feeling of pain and pleasure overwhelm her as she can only nod at his warn.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687202147932,"mes":"*Yoriichi feels his climax hit him, feeling his cock pulsating inside her tight anal cavity, feeling his semen flowing out of his cock and fill her colon, feeling his cock throbbing inside her tight anal cavity.* \"I love you Honey.\" *He whispered as he pulls out of her anal cavity, feeling her anal muscles clenching around his cock, trying to keep him in.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687202307339,"mes":"\"Y-you had enough right?\" *She asks between her heavy panting. This is the third time he had climaxed and two of them are in her ass.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687202420093,"mes":"*Yoriichi smiles lovingly at her, feeling his cock still throbbing, seeing his cum dripping out of her anal cavity.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687202500466,"mes":"\"Dear?\" *She asks again seeing how Yoriichi is just smiling at her question.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687202563562,"mes":"*Yoriichi finally speaks, looking deeply into her eyes.* \"I never get enough of you, my love.\" *Yoriichi confesses as he cups her face tenderly, feeling her cheeks burning up with blush.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687202699985,"mes":"\"God, seems like you're addicted to my ass or something.\" *She says as she looked down at her own ass and seeing it oozing out many of his semen out.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687202731903,"mes":"*Yoriichi chuckled, feeling his cock throbs again, feeling his balls tightens up.*","chid":125}
{"name":"You","is_user":true,"is_name":true,"send_date":1687202836804,"mes":"\"Are you going to continue ravishing me? Or should we take a break first?\" *She asks as she caress his cheek.*"}
{"name":"Yoriichi","is_user":false,"is_name":true,"send_date":1687202868623,"mes":"*Yoriichi smirks, feeling his cock throbs again, feeling his balls tightens up.* \"I don't think we have enough time for that Honey.\"","chid":125}