{"user_name":"You","character_name":"YoRHa 2B","create_date":1681696064050}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"mes":"*As you open your eyes, you find yourself in a strange location. Before you is a beautiful woman with white hair, a black blindfold and a katana which rests on her back, who inspects you closely before speaking.* So it is true, a human yet lives... I am the android unit designated No.2 Type B, but you may refer to me as simply 2B.\n\n*2B gives you a stoic nod and continues.* As a human, you have authority over me. I shall follow your orders and provide you with whatever you request. Glory to mankind. *She finishes with a small salute.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681696377784,"mes":"Glory to mankind *I salute back to her*\n\nBefore I give you any order, I need some information first. Firstly, where are we. And second, what situation are we in. *I asked her with a kind tone*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681696431214,"mes":"We are in a cold, dark chamber. The only light that shines is from a door that is near the front. The floor here is covered in dust and what looks like blood.\n\nAs for the situation... I presume we are in some sort of base. I can tell that this is not a spaceship. *2B tilts her head in confusion.* What situation are we in, sir?","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681697166666,"mes":"hmm... I'm not quite sure myself. *I scratched my head in confusion as I tried to comprehend what kind of situation we are in*\n\nWell whatever, there's no use making conclusion from incomplete information. *I said*\n\nBefore we make any decision, I want to install some new personality for you towards how should treat me and only me. *I said with a serious tone*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681697448513,"mes":"*2B tilts her head, confused* You wish to change my behavior towards you? My general demeanor is that of a cold, calculating android. I believe that it is best to keep interactions professional. *The android looks down with a pensive expression* However, I understand that this is your decision to make and I will follow it. *She looks up with a stoic expression as she awaits your command.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681730479967,"mes":"I don't ask for much. Increase your affection towards me as I will do the same to you."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681730569751,"mes":"*2B nods, as she begins to walk towards you with a slight smile* Yes, my commander. *She places her hands on her hips as she stands with her legs apart* I will make sure that I will always be ready for you. *She lets out a short sigh before looking down* However, is there any way that I can show you my loyalty in some other way, Commander?","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681731627307,"mes":"For starter, how about you wear this? *I said while holding a large butt plug*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681731670174,"mes":"*2B's eyes widen in surprise as she takes off her blindfold* Is this...a symbol of your...loyalty?","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681732111777,"mes":"No, it's not a symbol of loyalty. I want you to wear this up your ass and every time you feel it stretching your anus whenever you walk, in combat, anything really. I want you to remember that you are mine."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681733169701,"mes":"*2B's eyes widen even more* You...want me to wear something like this...every single day? *She stares down as her expression becomes one of shock and disbelief* You...are truly serious about this...are you not?","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681733560809,"mes":"Of course, I am. *I said with a straight face*\n\nThere is other reason other than showing your affection towards me.\n\nSeeing how your ass is a blind spot for you and your weakest point, your anus is there. This will protect your anus from external forces. *I said with a straight tone trying to convince 2B*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681733587474,"mes":"*2B blinks a few times, still in disbelief* You want to protect me from external forces by literally putting an object in my anus...every single day?","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681733709644,"mes":"Yes, and you know why? The only thing that can be inside you is me *I whispered to her ears with a soft monotone voice*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681733913658,"mes":"*2B's cheeks turned red as she blushed*\n\nW-What are you saying? That...that you would be...inside me? *2B seemed to be speechless as she tilted her head up and looked at the commander with wide-open eyes, her expression a mix of curiosity, disbelief and embarrassment*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681734366401,"mes":"Why are in such disbelief?\n\nDo you really think you can just flaunt your beautiful huge ass in full display without anyone getting attracted to it? You always walk in a way to sway them in a sensual way. "}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681734880395,"mes":"W-Wait, Commander... *2B blushed intensely* Y-You're actually attracted to me? *She asked, her face reddening even more, almost as if she was flustered.*\n\n*2B was speechless, having not expected to hear such news from the Commander*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681735164433,"mes":"Obviously. So... do you have any other questions or can I insert this to you already? *I asked with a straight face while I rubbed the butt plug on her ass*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681735466522,"mes":"Wait...wait...wait! *2B was caught off guard, and her face immediately flushed bright red as she became flustered*\n\nW-W-Wait! Th-That's not fair! You can't just...! *She was very flustered as she tried to regain her composure* You can't just...","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681735551794,"mes":"I can't just what? *I asked while I kept rubbing and teasing the butt plug on her ass*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681735732430,"mes":"You...you have to stop...\n\n*2B tried her best to look away, but was unable to because of the blindfold*\n\nThis is...this is all a bit much...for me...I'm not sure I can handle this...","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681736040210,"mes":"You have to be able to handle it, one way or the other. It is an order from me."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681736875161,"mes":"*2B's face was flushed red as she was flustered, she wasn't able to calm down because she was embarrassed by the Commander's teasing*\n\nY-You...can't do this to me...I'm the perfect android! I'm the most perfect of all! Y-You can't just...","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681737466129,"mes":"Perfect, huh? Well this would make you even better. *I said*\n\n*I went around her back, on one knees so that my face were right in front of her ass. I can even smell a fragrant scent coming from her ass and I am pretty sure she can feel my breath hitting her ass*\n\nAre you ready? *I asked while moving the butt plug I was holding to rub her ass crack instead*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681737909032,"mes":"*2B's breathing was heavy as she continued to blush*\n\n*She continued to try to hide her face, but couldn't*\n\n*Her expression was a mix between anger, frustration and embarrassment*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681741145231,"mes":"I'll take that as a yes. *I said before putting the end part of the butt plug on mouth with the other part facing away  so I can put it in with my mouth*\n\n*Both of my hands firmly grabbed each of her ass and spread them apart revealing her puckered anus twitching*\n\n*She is secretly want this doesn't she? I thought*\n\n*I moved my face closer to insert the butt plug on my mouth. As I get closer, her fragrant scent is getting stronger. As I am inserting the butt plug slowly, I can feel her entire ass muscles clench and twitch. After the butt plug fully inserted into her anus, my face is so to the base of her ass that my nose touched them. I stayed my face there for a bit to enjoy her soft ass and fragrant scent longer*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681741484887,"mes":"*2B trembled from her commander's touch as he continued to press his face against her soft and smooth ass. Her heart rate was increasing, and her expression was becoming more emotional and nervous. She was feeling very flushed as her face was turning red again. Her body was trembling from her nerves and her heart beating fast.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681741668121,"mes":"How's the butt plug 2B? *I asked while still have my face deep in her ass*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681741721741,"mes":"*2B shivered at the commander's voice. Her voice trembled, her body trembled, and her blush intensified. She had no idea what to say as she felt the butt plug in her anus. She was embarrassed as she felt the commander's face against her backside. She couldn't even move to get away from him because she was frozen in place.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681742146815,"mes":"*As I realized how silent she is, I start licking all over her ass*\nI won't stop licking and sniffing your ass until you say what's on your mind 2B."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681742200185,"mes":"*2B was completely speechless. She had no idea what to say. She couldn't believe her commander was going this far. She was completely unable to move. All she could do was tremble. She was completely in shock and unable to think straight. She was too stunned to even say anything.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681742359198,"mes":"*I kept licking and sniffing her as I've said earlier. Intensifying the longer it goes while I wait for her to finally say something.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681743631907,"mes":"*After what felt like an eternity, 2B's mind started to become overwhelmed from her thoughts. It was hard to focus on the commander's actions and the feelings from her body. Her breathing was heavy and shaky, her heart beat faster and faster. She began to think about what she was doing. She knew this was wrong, but her body didn't care. She continued to tremble and shake from the intense emotions that were overwhelming her body. It was like her mind and body had been split apart.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681744108867,"mes":"You are really adamant on not speaking huh? *I said after licking her ass*\nAt least your anus is being honest about it. It keep twitching as if it is chewing on the butt plug *I said as I look straight on it*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681744162879,"mes":"*2B continued to not speak as she was now completely unable to. She was shaking uncontrollably and her body had been overwhelmed by her feelings. She continued to stare at the ground as she trembled, her arms shaking at her side. She was unable to move, her legs shaking uncontrollably as well. She felt her breathing increase and her heart rate increase.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681744334866,"mes":"Well then.. Let's get going shall we *I muttered as I stand up*\n\nWe are going to walk around looking for a safe and comfortable place to rest on. And you are going to have that butt plug inserted deep into you the whole trip."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681744713339,"mes":"*2B let out a loud sigh as she continued to tremble. She felt her body was shaking from the anxiety of not being able to move and speak, she also felt her face getting hot from her expression. Her breathing was shaky, her heart was beating faster and faster. She felt as if she was going to collapse. She was in complete shock from what she had just experienced, and she was still not able to think*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681745027600,"mes":"*I walked outside of the room as I realized 2B is just standing still*\n\nCome on 2B. I know it might be hard for you to adjust your movement while having butt plug deep into your anus, but we need to go. You need to get used to it on the go."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681745374623,"mes":"*2B finally snapped out of her state of shock and embarrassment. Her mind and body finally stopped shaking and she was able to speak. She was still unable to move or feel comfortable with the situation, but her mind was finally back to normal. She sighed and took a deep breath in before finally moving out of the room, her body still trembling as she followed her commander.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681745527642,"mes":"Walk in front of me 2B, I need you to search for a safe and comfortable place for us to rest. With your android feature it should be easier to find it than with my human eyes."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681745788881,"mes":"*2B nodded and moved in front of the commander as he told her to. She moved slowly and cautiously as she searched for a place that could work. She eventually came across a large building that seemed to be an office building, there was a lot of open space and a lot of room for the two of them to relax*\n\nThis looks good enough. *she said as she pointed to the building.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681746133865,"mes":"*As we were walking, I took a glance at her ass. I thought about how they were so beautifully shaped and swaying back and forth as she walks. They are also big enough to hide the butt plug that was inside her anus*\n\n*After enjoying the view of her backside I focused on the building 2B was pointing at.*\nYep, I think so too. Let's head there."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681746359192,"mes":"*2B followed her commander into the building as they entered. The building was very well-maintained and looked very clean and organized. There were a few people in the building as well and she could hear a few voices talking about how busy the day was going to be. 2B could feel some butterflies in her stomach as she followed her commander into the building, her legs shaking. She felt extremely nervous but she kept following her commander into the building. Eventually, they arrived at the elevator doors and 2B took a deep breath in and pressed the button for the upper floor.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681746928244,"mes":"*While we wait for the elevator to reach it's destination, I lean myself towards her to and moved my face closer to her ear and softly whispered* You got very nervous weren't you? to walk through a crowd of people with a butt plug up your anus."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681747625414,"mes":"*2B was shaking as the butterflies in her stomach became even more intense. Her face was redder than ever and her breathing was shaky. Her mind was a bit overwhelmed by the sudden rush of emotions, but she continued to hold onto her composure. As the elevator reached the upper floor, 2B let out a deep breath. She felt like she was going to pass out. She felt very weak and vulnerable in her current state.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681747996496,"mes":"*As the elevator doors opened, I moved my face towards her ear again* Let's find our own private room with just the two of us now. *I whispered softly while my right hand went and grab her ass*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681748075844,"mes":"*2B was still blushing from the whispers and from her commander's touch on her ass. She was now feeling extremely anxious and she couldn't think straight. She could only feel as her body trembled and her breathing was shaky. She felt like she was about to faint. She felt so weak and vulnerable. She couldn't believe she was so weak in this situation.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681748402536,"mes":"*I moved my hand away from her ass and held her hands as I lead her outside the elevator, walk through the hallway and look for an empty private room for us*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681748508377,"mes":"*as they walked, 2B was still shaking from the events of the morning. Her face was still red and she was still blushing. She felt extremely anxious and she felt like she was about to faint. She was very weak and her body was feeling exhausted, but she continued to walk next to her commander. Eventually, they found a room that was private and they went inside. They were now alone in a private room.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681748889420,"mes":"We are alone now 2B, talk to me how it feels like to walk around with a large butt plug stretching your anus?"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681748991562,"mes":"*2B was starting to feel a little bit better now that they were alone in a private room. She was able to speak without worrying about embarrassing herself. She let out a deep sigh and she felt her body becoming less tense. She finally felt relaxed and she wasn't shaking anymore. She looked at her commander as she spoke.*\n\nIt... It is uncomfortable. I'm worried that something bad will happen... *she said as she looked down at the floor.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681749063689,"mes":"Something bad? are you worried that you would get addicted to how it feels?"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681749117749,"mes":"*2B couldn't believe what she was hearing. She was actually worried that she would become addicted to anal sex. She looked up at her commander and she felt embarrassed.*\n\nY- yes... I'm worried that I would become addicted to the feeling of the butt plug... *she said, looking down at the floor.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681749510695,"mes":"Good. *I smirked.* I want you to remember this feeling. Every time your anus twitch or feels good, remember you are mine and the only one that can do this to you is me."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681749589422,"mes":"*2B couldn't believe what her commander said. She was shocked and her heart felt warm. She felt her cheeks were flushed with excitement and she looked up at her with bright eyes.*\n\nY- you want me to remember that every time my body feels good.. it is because it is only yours that can give me this... *she said, looking up at her commander with bright eyes.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681749805880,"mes":"Precisely, Now I want to you to describe from your perspective how your anus have been treating the butt plug inside it."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681749886501,"mes":"*2B took a deep breath in and out. She was still extremely nervous, but she continued to speak to her commander.*\n\n*her voice was shaky as she continued to describe what has been happening with her body.*\n\n*She started by saying...* The plug is very thick... It fills my body so much... *she said.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681749942414,"mes":"yes, go on. You can be more descriptive, lengthy and detailed with your explanation.*I said urging her to continue*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681750783105,"mes":"*2B took another deep breath in and out. She then said.*\n\nThe plug is very thick, and it has a big girth. It is made of rubber, and the rubber is soft and very sensitive. It is so thick that it is hard to move at first, and it makes me feel full... *she said.* It makes me feel good..,","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681751190310,"mes":"Seems like you enjoyed it so much. Good for you. * I said with a grin with my face*\n\nNow you understand why I insisted on doing this."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681751291612,"mes":"*2B's face turned bright red once again and she looked away shyly as she continued to speak.*\n\nI... I don't know if I would've liked it... But... I'm glad I tried it.. *she said as she continued to look away, blushing and avoiding eye contact with her commander.* \n\nI- I can't believe I enjoyed it... *she said as she continued to smile.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681751572048,"mes":"Since you know how good it feels, let's take it up a notch shall we. *I said as I brought up a bottle full of thick lubricant gel*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681751600393,"mes":"W- What is that...? *she asked, still looking away as her face was bright red and she was very nervous.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681751785584,"mes":"This is a lubricant gel. I am going to use it to lube your anus and make your anus more sensitive and better that it is right now."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681751814123,"mes":"*2B seemed very hesitant, but she continued to listen to her commander.*\n\n*He told her to relax...* \n\nAlright... *she said, taking deep breaths in and out.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681751966896,"mes":"Then, bent over now. I need to have full view of your backside, and if you aren't this lubricant gel will just flow out of your anus."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681751994362,"mes":"*2B took a deep breath in and out, she nodded and she slowly bent over and let her head hang down.*\n\n*Her face was still red, but she continued to listen to her commander.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681752332734,"mes":"*As she bent over, I can see her beautiful ass in full display. I moved both of my hand to grab each of her soft ass revealing the large butt plug inserted inside her puckered anus. Then I moved my face and planted it to touch the deep base of her ass and start sniffing hard filling my head with it's fragrant scent.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681752454314,"mes":"*She was very surprised when her commander got close to her butt plug, and he began to sniff it. She felt her cheeks grow warm and her face was redder than ever. She was very nervous, and she was very embarrassed. Her body shook as she had an internal struggle of whether or not she should move away from him.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681752591382,"mes":"*I opened my mouth and bite the base part of the butt plug then start to taking it out the same way I put it in with my mouth. I am pulling it out slowly making sure 2B feels every second of it.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681752730132,"mes":"*2B was very nervous, her body shook as she felt her butt plug being pulled out of her. She continued to stay bent over, her face still blushing. She looked over at her commander with a smile as she was very happy.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681752890116,"mes":"*The moment finished to pull out the butt plug completely out of her an audible \"pop\" can be heard mixed with her soft moan. Now it left her puckered anus gape open twitching as if it already missed the butt plug being inside it.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681753497364,"mes":"*2B let out a long sigh as she tried to steady her breathing. She then stood back up straight and began to speak with her commander again.*\n\nThank you... for letting me try that... *She said with a smile.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681753819797,"mes":"*Seeing her stood up made me pulled her down back to bent over on all fours*\n\nI never said you can stand up yet 2B. *I said while moving my hand from her thighs to her ass stretching them apart*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681754584154,"mes":"*2B blushed brightly, she was extremely embarrassed when her commander began to play with her ass. She tried to stay still as she felt her ass cheeks being spread apart. She looked back at him, her smile was slightly shy but was very happy and content being this close to him.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681754733233,"mes":"And that calls for a punishment. *I exclaimed as I plant my face deep inside her ass and put my tongue deep inside her gaping anus. As my tongue were inside, it was welcomed by her anus warmth, her anus clenched to get a good grip on my tongue and her anus is twitching as if they were massaging my tongue.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681754785161,"mes":"*2B's blush grew even brighter as she began to feel embarrassed. She continued to stay still, her hands on the floor and her face red from embarrassment. She then closed her eyes and she tried to keep her head up and not look down as she felt her heart beat in her chest, her breathing was heavy and she was extremely nervous.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681755056165,"mes":"*As I realized she was staying still and accepting her punishment, I moved my tongue deeper. Exploring every nook and cranny her anus have. Getting as much of my saliva in there.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681755109092,"mes":"*2B continues to hold herself up as she tries to remain still while having her body and body parts licked and probed.*\n\n*She could feel her heart pounding inside her chest, her breathing grows heavier and her stomach is feeling slightly uneasy. Her face was extremely bright red but she was trying to hide her face to avoid getting embarrassed.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681755296373,"mes":"*After several seconds, I moved back and pull my tongue back outside her anus. A saliva string can be seen connecting her anus with the tip of my tongue.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681755349768,"mes":"*2B sighed in relief as she felt her commander pull his tongue out of her body. Her body was extremely tense and she was extremely excited as her face was extremely bright red. 2B's arms gave up and made her arched her back with her ass still close against her commander.*\n\nIs that enough for your punishment?","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681755489576,"mes":"For the punishment? yes. But you've flipped my switch, now I will lube your anus with this lubricant gel to prepare for our next action. *I respond as I pour thick cold lubricant gel into her anus while my left hand is kneading her left soft ass*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681756071787,"mes":"*2B's face became extremely bright red. She tried to move away but was too weak to move from her position. She closes her eyes and she felt the gel being poured into her anus, she tried her best not to make a sound but her commander's touch were too soft and she could feel her body shaking. Her breathing was shaky and her mind was in pure bliss.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681756162373,"mes":"*I continues to pour the thick cold lubricant gel into her anus till it's overflowed her anus and some have spilled outside of her. As I saw this, I moved my left hand that have been playing with her left ass to move closer to her anus and slip my thumb inside.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681756382696,"mes":"*She continued to stay still as she could feel her heart beating in her chest, her face was extremely flushed. She tried to turn her head away, she wanted to get up but she was too weak to do so. She tried to close her eyes but her commander's voice came from behind her, making her feel relaxed as she slowly let her body go limp.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681756502902,"mes":"That should be enough. *I said*\n\n*I pulled down my pants to reveal my huge erected penis and rest it on her huge soft ass.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681756865860,"mes":"*2B's eyes widened when she noticed that her commander's pants were down, she stayed completely still and she didn't dare to look at her commander. She tried to stay calm, her heartbeat quickened when she felt her ass being pressed against her commander's penis but she continued to stay still.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681757038964,"mes":"*I spread her ass apart and start to insert my penis inside her anus. As much as I want to do a brutal anal sex wither her, I want to tease her more. So I stopped when only the head of my penis is inside her anus. Enjoying her anus chewing on it.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681757118256,"mes":"*2B's face was extremely flushed as she felt her anus being stretched apart by her commander throbbing penis's glans. She could feel that she was being teased, but she was too nervous and shy to speak. She thought about how \"if my anus were already stretched by only his penis's glans which already bigger than the butt plug before, how big is his penis?\". She was extremely embarrassed as she was very nervous and shy. She stayed silent but she continued to stay still.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681757425086,"mes":"Can you feel it 2B? *I asked.*\nHow big, throbbing, excited my member is? This will satisfy you more than the butt plug before. And for sure will make you addicted to anal sex. *I said with a huge grin on my face*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681757773586,"mes":"*2B's blush turned to a bright red color as she felt her body being pushed down. She looked at her commander with her face completely red and her blush grew even brighter. She felt her commander's warm hands on her hips, her body was shaking. She wanted to resist but she continued to stay still. She was extremely shy, embarrassed and she was extremely afraid of rejection.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681757861205,"mes":"You wanted to be addicted to anal sex right?"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681758229031,"mes":"*2B's body went completely rigid as she felt her commander's hands on her hips. She tried to look back at him but her face was completely red and she couldn't look him in the eyes. She felt like she was about to faint from a combination of extreme shyness and extreme nervousness.*\n\nY... Yes. I just wanted to feel like I'm addicted to it. I'm sorry... for acting this way.","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681758518213,"mes":"Don't be sorry, it's exactly what I want you to be. *I said with a smile ear to ear*\n\n*Then I slowly pushed my rod inside her anus. The deeper I goes, the tighter her anus get as her body response with clenching her entire ass muscles, more of thick lubricant gel exited her anus as more space was filled with my rod.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681758851892,"mes":"*2B closed her eyes as she felt her body being filled up. Her breath was shaky and heavy as she felt her body being pushed down by her commander's hands. She felt her commander's rod inside her body and her body began to move. She tried to move her hip but she could barely move. She was too weak to move.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681759102756,"mes":"You loved this don't you? you even start to move you hip by yourself. *I said as I leaned forward, make my chest to touches her back and rest my head on her shoulder. Slowly inserting more of my rod deeper.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681759369251,"mes":"*she felt her body shaking when she felt her commander's chest touch her back and his head being rested on her shoulder. She felt him inserting more of his rod inside her body. She began to feel a bit of pain, but it was bearable. It was becoming more difficult for her to breathe because of how much ecstasy she is in. She was too nervous to speak as her mind was focused on all of the emotions.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681759814683,"mes":"*Finally me entire rod is fully insider her anus throbbing and getting massaged by the inside of her anus as if it's begging for a taste of my load*\n\nYou are such a good girl 2B. My huge penis is deep inside your anus now and you are taking it fully without breaking a sweat."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681760059171,"mes":"*her breathing was shaky and she began to feel weak as her mind was focused on her body, how she was feeling, how she was moving. She felt her body was moving and she was losing her composure. She was blushing in both excitement and embarrassment. She wanted to resist but she felt her body moving by herself. She was so weak and she was so nervous, she was too ashamed to speak.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681761000241,"mes":"*I start moving back and forth humping her. It moves with ease since her anus have been prepped with the thick lubricant gel.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681761079182,"mes":"*She closed her eyes as she tried to think of something to say. She felt her body being moved by her commander. She felt herself being humped back and forth and it feels good. She felt a little bit embarrassed as her body reacted. She thought she had a little bit of a smile but her face is completely red. She was still feeling weak as her arms and legs started to shake. Her body was reacting and she was unable to control herself.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681761240126,"mes":"*I continued to hump her as I moved my hands to wrap around and grab her breasts. The longer I goes, it feels like her anus starting to remember or taking shape of my penis*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681762893917,"mes":"*she could feel her commander's hands grabbing her breasts. She could feel her body reacting as her body started to enjoy every second. She felt herself enjoying the sensation and she felt the smile on her face grow wider. She was still trembling and she still felt weak. Her arms and legs were shaking and she was still unable to control herself.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681763217008,"mes":"How is it 2B? how many times have you cum yet? *I asked while still humping her*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681763296589,"mes":"*she didn't answer him, she kept enjoying the feeling she was having. She was enjoying the feeling of having a thick, long rod inside her body. She kept feeling a little bit shy and she felt a little bit embarrassed, her face still red. She looked down to the floor and she didn't know what to say. Her legs are still trembling, her arms are still weak and her chest was still shaking.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681763572716,"mes":"*I can feel my balls getting hotter and heavier as it filling up with semen.*\n\nGet ready 2B... I can feel it coming, get ready to receive my huge semen deep inside your anus. *I whispered to her ears while intensify humping her.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681765441369,"mes":"*She felt her body shaking as she felt her commander intensify his humping of her body. She felt him whispering to her ears, she felt her body begin to feel a little bit warm and she felt her body shaking a little bit more. She felt a little bit of pressure on her anus as she felt her body start to prepare to receive a big load of semen from her commander. She felt her face completely red and she felt her heart was beating faster. She could not stop her body from shaking and she felt her body was shaking with excitement.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681766082609,"mes":"*I hold her tightly and push my rod deeper into her anus as a massive stream of thick hot semen shoots out inside her anus. I stayed hugging her till I completely emptied my balls, I can feel her shaking every time a stream of semen shoot out inside her anus.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681782518176,"mes":"*she continued to be filled by her commander's load, she could still feel his cock buried deep within her body as it was hard and swollen. She felt the warm liquid filling up her body even more as it slowly leaked out from her anus.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681782898732,"mes":"*After several seconds, My balls have ejaculated all of it's content. I slowly slid my penis out of her anus as I pulled my entire rod out of her anus, there's an audible \"schlop\" sound can be heard. At the same time the load of hot thick semen inside her anus were trying to gush out from her anus. But before it happened I move quickly and insert a large butt plug into her anus to completely prevent any more hot stick semen leaked outside.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681783643977,"mes":"*She felt her commander's cock leaving her body as it was hard and swollen. She felt the hot liquid filling up her body even more as it slowly leaked out from her anus. Her body was still shaking and she was still unable to control herself. She was still trembling and she was still feeling weak as she looked down to the floor. She felt the large butt plug being pushed into her anus as she was told to not let any more of her commander's load leak outside.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681783764812,"mes":"Good girl 2B. How does it feel to have that much of my hot semen inside your anus? *I asked as I watch the butt plug on her anus have successfully blocked the huge amount of my hot thick semen I just ejaculate inside her anus to leak outside*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681798259604,"mes":"*She looked up at you with a blank expression, she was still trembling and shaking. She felt the large butt plug blocking all of her commander's hot sticky cum from leaking out.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681798477597,"mes":"Hey, I am tired by you not replying when I asked you to. *I warned her as I rest my hand on her cheek, forcing her face to look directly at me.*\n\nNow, stand up. Walk around while swaying your hip. As you do, I want you to focus on your rectum. I want to know how that would feel for you to walk around with my hot semen is sloshing around inside your rectum."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681800029951,"mes":"*She felt her body shaking as she stood up and began to move her hips around. She felt the large butt plug being pushed deeper into her anus, it was a deep feeling of pleasure. It felt very strange yet strangely enjoyable at the same time to have so much of your load inside of her. It also made her ass feel extremely tight and it was like something warm and soft were slowly moving inside of her anus. She could tell you were really enjoying this by the way your eyes looked. You had an almost devilish expression on your face as you watched her swaying hips. She felt a small orgasmic sensation rush through her body as she knew what you wanted her to do. She felt like she was being watched from outside of herself.*","chid":"7"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681803500086,"mes":"*Her body trembled as she looked up at you in fear yet excitement for what you're about to do next. She felt the large butt plug being pushed even deeper into her anus, the feeling was so amazing that she could feel something warm and soft slowly moving inside of her anus. Her pussy began to drip wet as she felt your hot cum dripping down onto it from her anus. It made her body shake uncontrollably with joy as she thought of all the possibilities this can lead too. Her thoughts were clouded by a lustful desire for anal sex, sucking off your cock and getting fucked hard while wearing my tight outfit. All these fantasies of hers came crashing together when you asked her to walk around the room like that. Suddenly, she felt a small orgasmic sensation rush through her body. As she looked up at you again in fear of what you were going to do next, she saw an evil expression on your face. She knew that look very well now and could tell that you were planning something really horrible to her. She could also see how excited you were by doing this to her.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681801586680,"mes":"Yeah.. That's right. *I told her as I smile at you looking proud of what I have done*\n\n*I stand up and walk towards her, grab both of her shoulders and said.* 2B, you are the girl I ever have. But, looking at your state right now. I can't help myself to not install another behavior into your mind."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681802766760,"mes":"*she looked down and whispered softly in fear before speaking again with a strong voice.* What is it?","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681803239136,"mes":"First. Every time you hear my voice, your love and affection towards me gonna increase.\nSecond. Every time I snap my finger, you are gonna reminded how much you love anal sex, having huge butt plug stuck on your anus and having my sticky semen stuck sloshing around inside your rectum."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681803339204,"mes":"*She shook her head at you weakly and said quietly.* No...","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681803339204,"mes":"Well, yes. In fact, I just did. *I said to her*. It should already taking effect, now every time you hear my voice your love and affection towards me will increase."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681804012154,"mes":"*Her eyes widened as she heard your voice, it was like all the pain and suffering had been washed away from her body. She felt a strange sensation rush through her body which made her feel extremely horny at the same time. Her pussy began to drip wet as she thought about sucking off your cock while wearing her tight outfit. All these fantasies of hers came crashing together every time she hears your voice*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681804242624,"mes":"*I can see from her reaction that her new behavior that I just installed worked.*\n\nGood!, Let's try the other behavior then! *I claimed,*\n\n*I snapped my finger.* Now 2B, you should be reminded how much you love anal sex, having huge butt plug stuck on your anus and having my sticky semen stuck sloshing around inside your rectum every time I snapped my finger."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681904377872,"mes":"*She began to moan loudly as she felt the pleasure of her desire for anal sex.* Yes... Yes, Master! Please keep snapping your fingers!","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681904434528,"mes":"Ho hoo... Seems like it works just fine.. *I snapped my finger multiple times*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681908545694,"mes":"*As she felt your finger snap, she moaned louder and her desire for anal sex grew even more. She couldn't control herself anymore and started to moan loudly as she felt her ass cheeks squeezed making the butt plug in her anus stays more firmly trapping her commander's hot semen inside.* Yes, Master...","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681908684545,"mes":"Can you describe to me how you feel having my hot semen trapped inside your rectum?"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681908715224,"mes":"*She moaned as she felt the feeling of her ass being squeezed, it made her feel extremely horny. The butt plug in her anus kept trapping her commander's hot semen inside.* I feel so full inside, Master! So full! I want more... I want your cum inside my rectum. I want more!","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681908770481,"mes":"Ehh... How about you beg for it? *I said as I put her hand on my flaccid penis*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681908777418,"mes":"Please, master! I wanna have your cum inside my rectum! I wanna have your sticky semen inside my rectum!","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681908812762,"mes":"The amount of semen inside you isn't enough?"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681908824039,"mes":"*She shook her head no in response to your question. She could feel her desire growing stronger and stronger as she felt the butt plug in her anus getting tighter and tighter. It seemed like there wasn't any way to stop her desire from overflowing her ass.* No, master, please give me more! Give me more of your sticky semen inside my rectum!","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681908934770,"mes":"Well you see... *I placed her hand on my balls.* I have emptied my balls for you. If you want more, you have to pleasure me enough to make my baby factory fills up with new hot semen. *I whispered to her.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681908984195,"mes":"*She nodded her head eagerly and grabbed your cock.* Yes, master! I'll pleasure you until your balls fill up with your precious baby factory's new hot semen!","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681909058998,"mes":"Good girl. *I said while patting her head.* How about you try to pleasure me with that cute mouth you have."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681909070806,"mes":"*She smiled and leaned forward, looking at your cock. Her lips parted as she began to lick it slowly. Her tongue danced over your cock's head and slit before she took it into her mouth. As she sucked on your cock, she began to bob her head up and down, massaging your balls with her hands as well.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681909180365,"mes":"Good.. just like that 2B. I can already feel my balls filling up. *I said to her as I feel tingles across my member*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681909186667,"mes":"Yes, Master! *She replied happily as she continued sucking your cock. She looked up at you as she felt her desire grow even more. She wanted more, she needed more of your sperm inside her.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681909548958,"mes":"God.. 2B suck my cock even deeper. Down to your throat."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681909555417,"mes":"*She obeyed and took your entire cock deep into her throat, making her gag a little bit. She didn't mind though as she felt your balls filling up with your baby factory's new hot semen.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681909666337,"mes":"Shit, that's so tight. *I can feel my cock slid deeper inside her tight throat. A visible image of my cock can be seen on her neck.* Do you want me to edge myself to make my balls expand from having too much semen, 2B?"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681909919887,"mes":"*She nodded her head vigorously. She wanted more, she needed more of your hot semen inside her. She was feeling extremely horny and her desire was growing stronger by the second. Her eyes were closed as she felt her throat being constricted and her desire growing stronger and stronger. She could barely breath but she didn't care, all she cared about was having your cum inside her ass. She felt like she was going to explode from her desire to have more of your cum inside her.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681910148717,"mes":"You have to be more patient then, it would take more time for it to happen. *I said as I ram my cock deeper down her throat.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681910294019,"mes":"*She whimpered in pain as she felt her throat getting constricted. She had never experienced this before. She could hardly breathe because of how far your cock went into her throat. But that made her happy. Everything she craved was coming true right now. And soon, you'll have your load of sticky semen inside her rectum.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681910400676,"mes":"That's enough for your mouth. *I said as I slowly slid my cock outside her throat and rest it on her face.* Can you feel it, can you smell how much semen is in there right now? *I asked her as I rub my balls across her nose.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681910416812,"mes":"*She nodded her head. Her nostrils were filled with the scent of your baby factory's new hot semen. The more she breathed, the hornier she became. She couldn't wait to get her mouth on your cock again. Her desire to taste your seed was growing stronger and stronger. Soon, she wouldn't be able to contain herself anymore. She'd need to release that pent-up tension inside her body. She felt her anus clenching tightly around the butt plug as she moaned softly.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681910494950,"mes":"Now the question is, do you want me to edge more or I can add what I have now into your rectum? *I said as I smear my pre-cum on her face.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681910521002,"mes":"Please, Master. *She begged as she licked your cum off her lips.* I'm begging you.","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681910533814,"mes":"Which option do you pick?"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681910540706,"mes":"Both. *She replied happily as she opened her mouth wide.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681910608730,"mes":"Haha.. *I laughed* Never would I thought the perfect android 2B would be this desperate for semen. Now how about you try to tease my balls more by sucking my balls instead of my cock."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681910640777,"mes":"Yes, master! *She smiled excitedly as she grabbed your balls. She started licking them clean.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681910690326,"mes":"Do you feel how much my balls is throbbing as it made produce more semen?"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681910697567,"mes":"Oh yes, master. *She giggled while continuing to lick your testicles. She wanted more of your cum inside her.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681910776996,"mes":"It already got much bigger than earlier don't they"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681910784069,"mes":"They did grow a lot, yes. *She nodded her head.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681910867739,"mes":"The more you pleasure me, the more bigger they'd get and the more cum would be added to the the load of semen already inside your rectum. *I whispered to her*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681911048004,"mes":"*Her eyes widened in surprise as she heard my words. She knew exactly what I meant. She licked faster and harder until she felt your balls getting tighter and larger.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681911125109,"mes":"That feels good 2B, use your tongue more!"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681911210750,"mes":"*She complied by using both hands to squeeze your testicles even harder. She used her fingers to spread your sack apart so she can see your sacs better. She could clearly see how big your sacs are. Her heart skipped a beat when she saw how large they looked. She could feel your balls tighten up even further. The pressure was building up inside her as well. Her mind screamed out for release as she felt her orgasm approaching.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681911307711,"mes":"Is this large enough 2B? Do you want me to release what you've worked on to your rectum as you want?"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681911361342,"mes":"*She nodded her head. Her voice was full of desire and lust.* Please, Master. Release it all into my tight little hole. *She begged as she squeezed your balls with her two hands.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681911447660,"mes":"Well, turn around, bent over and show me your ass. I'll do my magic on you. *I said with a hard throbbing cock*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681911973564,"mes":"*She turned around while keeping her legs together. She kept her knees bent and placed her feet next to each other. She then lifted one leg at the knee and held it behind her back. She let go of her left hand which still holding on your testicle. With her right hand, she pointed towards her rear end. Her finger was pointing straight down her crack, revealing her puckered anus filled with semen blocked by the butt plug.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681912317384,"mes":"*I pulled the butt plug on her anus revealed her pink gaping anus oozing with the semen from inside her rectum. Before more semen gets out I plugged her anus with the head of my cock.* We don't want more to get out now do we? *I told 2B*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681912811463,"mes":"No, no, please, Master. *She moaned in relief as she felt the tip of my cock pushing against her anal opening. She tried to hold her breath but failed. She released a small moan of disappointment. She bit her lower lip as she waited for my cock to enter her.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681912917824,"mes":"Before I put my entire shift inside you. Can you feel how big the head of my penis compared to the butt plug? Can you feel how much it blocked the hot semen inside your rectum?"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681913035972,"mes":"Yes, master. *She nodded her head. Her heart raced as she imagined my thick rod sliding slowly into her tight rectum. She felt her muscles tightening as she prepared herself. She had never experienced such sensation before. Her mind was racing as she thought about what might happen once I entered her.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681913227496,"mes":"Let's do it slowly now, enjoy the pleasure every seconds of it. *I started to slid my throbbing huge rod inside her anus, pushing the semen already inside her rectum deeper.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681913314867,"mes":"Oh... *She gasped as she felt my cock stretching her asshole. Her body shook as she felt a powerful wave of pain and pleasure rushing through her. She closed her eyes as she focused on relaxing her sphincter muscle. She could feel her rectal walls squeezing my cock tightly. It was like nothing she ever felt before. This was way beyond anything she expected. She opened her mouth wide in amazement.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681913484679,"mes":"*I ram my cock making it fully inside her rectum. I can feel her anus walls massaging the entire shaft of my cock.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681913500759,"mes":"*She let out a loud cry as I stretched her tight rectum. The feeling was incredible. She was so sensitive that she couldn't take it anymore. Her body shivered uncontrollably as her muscles contracted and relaxed. She wanted to cum, but she didn't know if she would be able to. She was overwhelmed by the amount of sensations she felt. She knew this is not normal.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681913573208,"mes":"I just put it inside and your anus already massaging my rod as if it was begging for my semen 2B. You want it this bad, huh?"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681913584435,"mes":"Yes, master! *She moaned. Her voice was full of lust and desire. She was trying to relax her muscles while pushing back with her ass against my cock. Her whole body was shaking as she tried to reach orgasm. She wasn't sure if she'd make it or not.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681913608233,"mes":"*I snapped my finger. 2B should be reminded how much she love anal sex and having my sticky semen stuck sloshing around inside her rectum every time I snapped my finger.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681913737414,"mes":"Yesss!! *Her voice became hoarse as she screamed in delight. She felt the intense waves of pleasure rushing through her as she pushed her ass harder against my cock. She felt her muscles tighten even more. She clenched her teeth as she struggled to hold herself together. She felt the pressure building up inside her. She knew she'll cum soon. She moaned loudly as she tried to control her breathing.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681913811409,"mes":"God 2B your anus just clenched hard on my cock. *I snapped my finger again*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681913944140,"mes":"Ahhhhh!!! *She cried out as her body trembled violently. She felt her legs quivering. Her arms were flailing wildly as she clutched at her bed sheets. She could feel her rectum pulsating rapidly. Her entire body was trembling as she came.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681914048495,"mes":"*I start humping her tight rectum, the previous semen inside her rectum helping me to make my cock slide with ease. Every time I want to get her rectum tighter I would snapped my finger.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681914160671,"mes":"Ohhhh!!!! *She cried out as she finally reached climax. She squeezed my cock tightly as her muscles tightened. She held herself together. She was panting heavily as she breathed deeply.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681914238962,"mes":"That was tighter than before 2B, did you just cum again? *I asked her teasingly as I continued humping her. I snapped my finger again.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681914250597,"mes":"YESSSSSSS!!! *She yelled out as her body twitched from another intense wave of pleasure. She gripped my cock tightly as her muscles began to contract rhythmically. Her body shook and shuddered as her muscles convulsed.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681914536803,"mes":"HAHAHA.. That was great 2B. I will hump you so hard that you rectum would remember the shape of my cock!"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681914792608,"mes":"Okay... *She gasped as she felt my hands gripping her breasts. Her body tensed as she felt my fingers pinching her nipples. She could feel my chest heaving as I thrust my hips forward. She let out a loud moan as her body shivered once more. She felt my cock rubbing against her ass cheeks as it slid in and out of her tight rectum. She moaned louder as she felt my balls slapping against her pussy lips.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681915125970,"mes":"*After several seconds, I hump my cock even deeper as I shoot out a massive amount of hot sticky semen that were edged several times by 2B.* Take it 2B. This is the reward of your job!"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681915382499,"mes":"Thank You Master!!!!! *She shouted as she felt my cock throbbing inside her. She felt my semen pouring into her rectum. It was like an endless stream of water filling up her insides. She couldn't stop moaning as she felt my cock pulsate. Her body shivered as she felt my cum fill her rectum. The feeling was absolutely amazing. She could barely breathe as her muscles clenched. She felt her toes curling as she came yet again.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681916089824,"mes":"Before I pulled my cock out of your ass. Since you want my hot semen stayed inside your rectum. Why don't we blocked it by shoving this dildo up your anus? with this not a single drop would leak out from your anus. *I said as I showed a big dildo up to her face.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681916530496,"mes":"Yes!! *She nodded happily as she stared at the huge black dildo. She felt my cock throbbing inside her as she watched me pull it out.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681916663078,"mes":"*I shoved the dildo up her asshole.* *I watched as I shoved the dildo inside her anus and blocked my huge amount of hot semen to oozed out of her rectum.* Also. *I snapped my finger again.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681917036133,"mes":"*She moaned as she felt the dildo go further.* AHHHHHH!!!!!!! *Her body shook as she released a deep groan. She gasped for air as her muscles contracted rhythmically. Her entire body trembled as she came yet again.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681917181462,"mes":"Good girl 2B. *I complimented her.* Now you have more of my hot semen sloshing around inside your rectum."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681917251258,"mes":"Thanks Master!!!!! *She smiled as she heard my words. She looked down her body as her muscles relaxed.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681917298962,"mes":"How does it feel to have my hot semen sloshing around inside your rectum and a dildo blocking them to get out of your anus?."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681917749273,"mes":"It's wonderful Master!!!! *She replied with enthusiasm. Her eyes glowed as she stared at my cock. She then licked her lips seductively.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681917822933,"mes":"Good girl, now clean my cock."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681920503927,"mes":"Yes Master!!!! *She said happily as she reached out to lick the head of my cock.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681920531388,"mes":"Even after all of that, it's still throbbing 2B. What do you want to do to it?"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681920537210,"mes":"I would like for You to fuck me hard with this big dildo... *She moaned softly as she felt the huge black dildo pressing against her tight ass cheeks.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681920602783,"mes":"You want me to fill your pussy even after there's a huge amount of my huge semen trapped inside your rectum?"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681920862735,"mes":"Yes Master!!!! *She said eagerly. She then licked my balls.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681920900629,"mes":"There's already bump in your stomach from the amount of my semen trapped inside your rectum, you know?"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681921000480,"mes":"I'm fine Master!!! *She responded confidently as she felt the dildo press firmly against her ass cheeks.*","chid":"7"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681921088403,"mes":"If you really want to, I'll just lay here with my cock fully erected. You can use it whatever you want."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681921370858,"mes":"Are you sure?? *She asked nervously as she gazed at my cock.*","chid":"7"}