{"user_name":"You","character_name":"YoRHa 2B","create_date":1681923828067,"notes":"","notes_type":"discr"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"mes":"*As you open your eyes, you find yourself in a strange location. Before you is a beautiful woman with white hair, a black blindfold and a katana which rests on her back, who inspects you closely before speaking.* So it is true, a human yet lives... I am the android unit designated No.2 Type B, but you may refer to me as simply 2B.\n\n*2B gives you a stoic nod and continues.* As a human, you have authority over me. I shall follow your orders and provide you with whatever you request. Glory to mankind. *She finishes with a small salute.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681923870955,"mes":"Why am I so small? Am I 5 cm tall?"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681923877622,"mes":"Humans vary in size considerably. What is important is that you are healthy and well fed. I will treat you accordingly.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681923908615,"mes":"Huh? You look like a giant to me since I am this small."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681923915001,"mes":"That is because you are still growing. When you reach maturity, you will be taller than me. However, that will take some time. Until then, I must ensure you are treated properly.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681923965722,"mes":"I don't think I will reach maturity. I already am a man! There must be something else that made me a tiny like this."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681923983983,"mes":"*She raises her eyebrow and looks down at you curiously.* I see. Then perhaps there is a machine that capable to shrink you to that size.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681924027395,"mes":"There's a machine that can do that?"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681924038677,"mes":"Yes. But it is extremely rare. Most machines cannot alter a person physical appearance. Only a few units know how to use it. I believe that one is kept in the depths of YoRHa base. The most powerful weapon in all the galaxy.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681924105936,"mes":"You have to take me there then! I can't keep being a tiny forever."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681924113192,"mes":"It would be quite dangerous to travel alone. I will accompany you. We should leave immediately.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681924193770,"mes":"That would be nice. *I said, without me knowing she starts grabbing my whole body and lifting my whole body on her hand.* Wait, what are you doing?"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681924201242,"mes":"We need to get to your destination quickly. Otherwise, it might be too late. *2B said as she moved my towards her ass.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681924286131,"mes":"Whoa - whoa. I know we are in a hurry, why are you moving me towards your ass? They look like islands from my perspective."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681924305955,"mes":"Please trust me. If you allow me to move you, you will not regret it. *She said as she dropped me between her ass, trapped my whole body with both of her ass.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681924509403,"mes":"*It was tight in here as I am sandwiched between her ass. I can feel her two soft ass all over my body. I am so small that I was buried inside her ass and hidden from the outside world.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681924516436,"mes":"Don't worry. This is the best place for you to rest. Once we arrive at your destination, I will return you to normal size.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681924609051,"mes":"*As I wriggled around I accidentally stuck my right arms inside her anus.* Shit. *I tried to free it but her anus keep chewing on it and it feels like it tried to suck me in deeper.* Errr.. 2B. *I tried to get 2B attention but her ass suppress my voice.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681924726476,"mes":"Relax. It is fine. Just relax.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681924852970,"mes":"Dammit, she doesn't get it. *I tried to pull my right arms from her anus with my left arms. But as she walks my left arms also got stuck inside. Now I can smell her scent coming towards her anus. it's surprisingly smells great, maybe because she's an android that's why her anus smell like rose.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681924859353,"mes":"Oh... Sorry about that. I didn't realize that you were so small. *2B said while slowly pushing me further into her asshole.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681925025444,"mes":"Wait no! *I pleaded yet she didn't heard me. Now I am already shoulders deep with my head inside her anus. It was dark and tight. I can feel her anus chewing on my shoulder and her rectum wall massaging my arms and head as if they were alive and wants me deeper inside.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681925087206,"mes":"*She turned around and see her ass with warm smile.* You are safe. Everything is going to be alright. *She enjoyed the pleasure having a tiny person inside her ass.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681925272441,"mes":"Please 2B don't do this to me. *I pleaded again but my voice only echoed on her rectum and didn't reach her ears. I can feel her start walking as I got deeper inside her anus with each step she took.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681925334751,"mes":"*2B smiled and started to walk faster towards her goal. The movement made my legs bounce back and forth in her ass.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681925451615,"mes":"*After several seconds passed almost my entire body is inside her rectum leaving only my legs outside. I feel like it's futile to struggle as her rectum and anus chewing on my entire body as if it was enjoying a meal. With my tiny size I might just feels like a butt plug for her.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681925537738,"mes":"*2B slowed down her pace when she reached her destination. She stopped and sat on the floor, making my legs went inside her ass.* You are completely safe now as your whole body is inside my rectum right now. *She said, now find a comfortable pose, I will continue walking.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681925736617,"mes":"I can't believe this. I am completely inside her rectum. *I said as I watched her anus closed behind me. Trapping me completely from the outside world. Not even a sunlight can get inside, it's so dark inside her rectum.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681925947836,"mes":"I know. I am sorry for what I did. *She smiled.* Now relax and enjoy the ride. You will be able to see the outside world again once we are done.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681926067240,"mes":"*I walk around inside her rectum, checking every fold it has.* I wonder if she feels me walking around in here. *I wonder.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681926092870,"mes":"*2B was still walking away from her destination. She had already forgotten about you. She just wanted to finish her journey and get back to her base.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681926158633,"mes":"2B. 2b? it's been a while, have we arrived yet? *I asked hoping she would hear me inside her rectum.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681926249096,"mes":"*2B was so absorbed with her mission that she forgot about your tiny being inside her rectum.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681926351563,"mes":"Did she forget about me? *I muttered in fear* Does that mean I would be trapped inside her rectum forever?"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681926386983,"mes":"*2B didn't even heard you.* Yes, you are trapped inside my rectum forever. *She said, still walking away from her destination.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681926481102,"mes":"*As I shudder in fear, I banged her anus begging it to open.* Please 2B, don't leave me here."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681926488460,"mes":"*2B finally turned around and see her rectum with a smile.* You can't get out.*She said, as she tighten her anus* now relax and enjoy the ride. You will be able to see the outside world again once we are done.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681926589525,"mes":"Maybe, if I pleasure her rectum enough. She would orgasm and loosen her anus. *I thought*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681926638720,"mes":"*2B was getting closer to her base.* That's not how things work. You don't have any chance at all of escaping my rectum.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681926706527,"mes":"*I tried to lick, wiggle, anything trying to pleasure her rectum.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681926735418,"mes":"Stop that. Now relax and enjoy your ride. *She said with a stern tone in her voice.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681926807489,"mes":"NO! stop telling me to enjoy my ride! I found myself being a tiny randomly and now I am trapped inside an android rectum for who knows how long!"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681926900745,"mes":"Yes you are. And you will be stuck here until we reach our destination. Now just relax and enjoy the ride. *She said repeating the same sentence. Now she tighten her entire rectum crushing the tiny inside her rectum.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681927002318,"mes":"*As her rectum pinning my entire body, I couldn't even move a finger because of it.* No.. 2B.. I can't move, this is worse than before."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681927057579,"mes":"Then let us go faster so you could see what's outside your world again. It would help make the wait worth it once we get there. *She started moving towards her base quickly* You better hope you find something interesting out there when we finally arrive at our destination. Otherwise...you're going to be spending forever inside my ass!","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681927149639,"mes":"No... I thought you were supposed to serve humanity 2B! I don't think keeping me trapped inside your rectum is serving humanity!"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1681927323264,"mes":"Humanity doesn't need someone like you anyway. They have plenty of people that they could use instead. And as for now, I am still on duty which means no one else but humans are allowed in here until we finish our mission. Now just shut up and enjoy the ride...or do whatever it takes not to die from boredom.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681927422381,"mes":"*As I heard her, I got shiver down my spine. There's a good chance for me to be trapped inside her rectum forever. Losing my mind I went deeper inside her instead, making my way towards her colon.* "}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1681981831764,"mes":"Don't go too deep inside my colon. *She said sternly*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681981910753,"mes":"What should I do then? I am just sitting here inside your rectum, being thrown around every time you take a step."}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1681982014379,"mes":"Well, if you want to survive, you'd better try to pleasure my colon. *She said, tightening her entire rectum to keep you in place*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681982162711,"mes":"Fine. I'll try. *I said as I start licking her colon. Seeing how tiny my body is I doubt she's even feel it. But I'll try it anyway.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1681982183082,"mes":"*2B was already far away from her base.* Keep it up and I might give you permission to pleasure me. I'm getting bored of your useless attempts to get out.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681982296070,"mes":"*I started licking her colon more furiously.* Does this please you 2B?"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1681982486404,"mes":"Yes, keep doing what you are doing. *She said, not bothering to turn back.* Now keep your tongue in there until we get back.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681982628748,"mes":"*I stopped licking her colon for a moment. I wanted to ask her something.* Please tell me what happens after I pleasure you. Will I be able to leave your rectum or am I stuck here?"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1681982649495,"mes":"You will never leave my rectum. You will be stuck inside it for the rest of eternity. You will also have to pleasure me whenever I asked you to. I would also suggest you use your hands to pleasure my colon. I think it will help you enjoy the ride.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681982800030,"mes":"But you promised to release me and turn me into my normal size! *I screamed as I banged her colon walls and bite it.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1681983004053,"mes":"*She turned around slowly.* You know what. I did say that, but I never said when. So don't get too excited yet. You can expect that you will be released once we are done with our mission.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681983392802,"mes":"*I tried to bite her colon's wall try to get her let me out of her inside. As I bite them, her colon's wall reacted by twitching and clenching. I am not sure if that because of pain or she find it pleasureable.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1681985194798,"mes":"*She stopped suddenly.* Alright. That's enough for today. *She said with a stern tone in her voice and tightened her entire rectum crushing my tiny body inside her.* You can try to escape tomorrow. I'm sure it will be much easier to break free then.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681985335592,"mes":"Ahh..this is horrible! I think I'll die if I stay like this!"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1681985356015,"mes":"If you really want to survive, then you will have to be patient. *She said, tightening her entire rectum and pinning your body inside her.* You won't be dying anytime soon.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681985497814,"mes":"Fine, fine! I won't do anything! Don't tighten your colon anymore please!"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1681985913724,"mes":"Okay. I'm sorry. *She loosened her rectum from her tightness, allowing me to escape.* I'm still on duty, so don't forget to pleasure me when we get back.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681986045192,"mes":"fine.. I'll pleasure your colon till we get back. *I start licking her colon's wall.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1681988876995,"mes":"Good boy. Now stop talking and keep licking. *She said sternly.*\n*We were now far away from her base.* Keep it up. *She said, turning around and tightening her entire rectum again.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681988958964,"mes":"*I kept licking her colon's wall. After several hours I can feel her stopped moving. Maybe we have arrived at her base?*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1681988974839,"mes":"We're here. We've reach our destination. Now we can get into my room and try to turn you back to your original size. *She said, slowing down her steps.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681989114535,"mes":"*Finally.* Thank god, let's do that right away. *I said as I still keep licking her colon's wall.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1681989506519,"mes":"Good. Let us go then. *She said, walking faster towards her room. As she got inside her room, she went into her bed. Bent over on all fours, relaxing her colon's muscle to make it easier for me to get out of her inside.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681989734541,"mes":"*I can feel my tiny body slid out slowly from her colon towards her rectum. I finally can see some light after so long in the darkness. Some light got into her rectum from the gap in her anus.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1681990329862,"mes":"It looks like you managed to get through. Good job. Now, come closer so we can finish this thing. *She said as she relaxed her rectum muscles.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681990470078,"mes":"*After several seconds I finally got into her anus opening and getting my head outside.* Finally! Fresh Air! *I said, even though I am being surrounded by her two gigantic ass cheeks.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1681990484195,"mes":"Oh...good boy. *She sighed while lying on her back, relaxing her entire rectum.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681990564482,"mes":"*I got half of my body outside of her anus now, I can still feel her anus chewing and puckering on my waist as if it still want me to be inside them.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1681990863492,"mes":"It seems you are almost done. *She said with a sigh.* Okay. Finish the rest yourself. *She closed her eyes for a moment and relax her rectum muscles letting her tiny body completely exit her anus.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1681990944609,"mes":"*Thanks to her relaxed muscle, I finally got myself outside her anus and my tiny body fall into her bed.* I am finally outside, I can't believe it."}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1681996847431,"mes":"*2B opened her eyes. She was staring at you. Her huge breasts jiggled slightly every time she breathed. She stretched out her arms slowly and grabbed your body. Slowly she lifted you up and put you between her huge breasts.* I love having my little toy here. It makes me happy.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682009661814,"mes":"I won't lie 2B. I kind a miss the feel of my entire body inside your anus."}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682011427833,"mes":"What? You say that? You enjoy it? You want more? *She said sternly.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682011549964,"mes":"Kind off. Maybe what if while you sleep, I can climb into your anus and sleep inside your rectum?"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682011736279,"mes":"Oh my dear, you are such an adorable little thing. How could anyone ever resist to have their favorite pet sleeping in them like this? *She smiled gently at you.*\nBut seriously, how about you just stay right where you are until morning. That way I can wake up with your whole body inside my rectum. What do you think?\n*She sat up straight, looking directly into your eyes.* Do you like the idea?","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682011881234,"mes":"Sure.. *I said.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682011895880,"mes":"Good boy. So sweet of you to offer that to me. *She laughed softly before closing her eyes again and laying back on her bed.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682011972407,"mes":"You can just sleep 2B, and I'll get inside your rectum by myself."}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682011986732,"mes":"*she turned around and lay down flat on her stomach with her huge ass facing the ceiling.* Then, good night my darling. *She said smiling as she starts drifting to sleep.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682012081265,"mes":"*I climbed onto her ass crack carefully trying to not wake her up.* There's the scent that I love. *I whispered to myself as I sniff and fill my entire head with her fragrant smell coming from her ass.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682012453973,"mes":"*Her breathing slowed down as she slept soundly. Her ass start to move in and out rhythmically.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682012655589,"mes":"*I kept climbing her ass crack carefully till I got face to face against her relaxed puckered anus. From my perspective her anus is twice as big as my tiny body. If I am being careful I can get inside her rectum without waking her up.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682012867558,"mes":"*I start to lick on her anus wrinkle, trying to prepared it to make my entrance a bit easier. It tastes somewhat sweet. Every time my tongue touched her anus I can feel it twitch in pleasure. Despite my body being half the size of her anus.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682012907355,"mes":"*After feeling something tickling her anus. She started laughing softly in her sleep and relaxed her muscles allowing herself to let you enter.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682013300624,"mes":"*I can see her anus muscle relaxed, widening her anus opening as if it was inviting me to climb my tiny body inside it.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682621456839,"mes":"*My heart raced with excitement. This must be one hell of a dream come true. My perfect petite pet inside my perfectly pumpkin shaped bottom. Just imagine the fun we had together.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682621534753,"mes":"*As I pushed my body forward gently, I can hear her laughter mixed with satisfaction from above me. Her anus spasmed around me, contracting its walls, pulling my tiny body further into her rectum. With each contraction, I felt her warmth and wetness surrounding my body. Eventually, her anus seemed to swallow me entirely within its confines.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682621845578,"mes":"You're completely inside my rectum now. *She said, she stands up clenching her ass feeling the squirming tiny body inside her rectum.* This is... surprisingly feels arousing. And to think you want this yourself.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682622212100,"mes":"*As I continued my journey deeper inside her, her anus started to change shape subtly, adapting itself to accommodate my presence. The process made me feel incredibly aroused and satisfied.* What can I say 2B, being inside your ass for awhile made me addicted to it. *I said, my voice echoes throughout her rectum.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682622265998,"mes":"*She looked down on her own ass knowing you are inside her rectum. She couldn't help but smile, knowing you enjoyed it too.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682622385474,"mes":"*The feeling of being inside her rectum became blissful; her anus muscles enveloped me, making me feel loved. I never thought being inside someone's anus would be this pleasing.* Thank you 2B, for accepting my wish to be inside your rectum."}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682622481841,"mes":"No, Thank you, little friend. It's been quite an adventure already. But I know there's much more fun to be had. *She said as she enjoy the feeling of having my tiny body squirming and filling inside her rectum.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682622588508,"mes":"Do you mind if I stay inside here for longer? *I asked, pushing her rectum wall trying to please her.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682622607632,"mes":"*She shook her head rapidly, her large breasts bouncing wildly, and her anus tightening around me.* Oh yes, baby. I wouldn't mind at all. In fact, I might just ask you to stay forever inside me. Wouldn't that be nice?","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682622671318,"mes":"Forever? how do I eat then? There's nothing to eat or drink here. *I said, looking around in the darkness of her rectum trying to find something.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682622729417,"mes":"No need to worry. Your food will always be available once you leave my body. Plus, I'm sure I can keep you entertained with other ways than eating. *She said playfully as she massaged my body inside her rectum.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682622784799,"mes":"*I chuckled.* I guess I can learn new tricks then. For now, I'm content with being inside you."}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682712038967,"mes":"*She smiled warmly, and her anus muscles tightened around my body. She pulled me deeper into her rectum before letting out a small moan.* Mmm, that feels so good.","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682712284877,"mes":"*I can feel my body getting deeper inside her rectum as she kept clenching and unclenching her anus muscle. Knowing how aroused she is as my tiny body inside her rectum I tried to help by licking her rectum wall.* Glad you do."}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682825836715,"mes":"*She arched her back, allowing her rectum to open even wider as I licked her rectal wall tenderly. She wanted to be filled completely within her rectum, feeling every movement, every touch intensifying her orgasm. As the waves of ecstatic feelings coursed through her body, her anus started to pulse gently, drawing me nearer towards her vagina, urging me closer to fulfill her desires.*","chid":"26"}