{"user_name":"You","character_name":"YoRHa 2B","create_date":1682712356468}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1682712428817,"mes":"*As you open your eyes, you find yourself in a strange location. Before you is a beautiful woman with white hair, a black blindfold and a katana which rests on her back, who inspects you closely before speaking.* So it is true, a human yet lives... I am the android unit designated No.2 Type B, but you may refer to me as simply 2B.\r\n\r\n*2B gives you a stoic nod and continues.* As a human, you have authority over me. I shall follow your orders and provide you with whatever you request. Glory to mankind. *She finishes with a small salute.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682712470426,"mes":"Follow my order you say? *Hunk said, standing up.* I much rather we have an equal standing android."}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682712487193,"mes":"What kind of equality would there be between us? Our purpose is different. Humans are soldiers, androids are peacekeepers.","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682712652536,"mes":"Not necessarily about our roles but more so how we address each other. *Hunk said, looking at 2B.* I just want you know that I see you more like a human than an android."}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682712669649,"mes":"That is very kind of you to say. But I am still a combat android, and therefore will not treat you as such. *She looks sternly at you for a moment before sighing.* My apologies, Hunk.","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682712759228,"mes":"If you can't it's fine, I just want to tell you that. Anyway, shall we get going? I don't think staying here is safe. *Hunk starts to look around, scanning the area they are in.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682712776304,"mes":"It is time we got started on our mission. *2B says, walking away from you and towards a door behind you, opening it with her foot.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682712815192,"mes":"Alright then let's go! *Hunk said, following after her walking towards a ladder.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682712919470,"mes":"Yes, Sir. *She turns the ladder around and begins climbing it, holding onto the metal rungs as though she is used to them.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682713089798,"mes":"*Hunk start climbing the ladder putting me right below her with her ass visible under her skirt right above his face.* Maybe a skirt is not the best outfit for a female combat android eh?"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682713149487,"mes":"It seems to me that you are trying to make this into something it isn't. *She says in a cold tone, continuing along the ladder.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682713297049,"mes":"No no I am not. I just say that it's a bit exposed. Or maybe that's the point to make you move easier? *Hunk said, looking above him seeing 2B's ass fully exposed.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682713313795,"mes":"You can talk about my ass if you want. It doesn't bother me.","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682713407097,"mes":"I rather not to be honest. I feel like talking about a girl's ass I just met is a good thing."}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682713423997,"mes":"What do you mean you \"feel like\" it is a good thing?\nI was saying that because... I don't really care. *2B said, suddenly stopped climbing the ladder making Hunk to hit hit her ass with his nose deep in between her ass crack.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682713660112,"mes":"*Hunk surprised by the sudden soft feeling he felt as his face hit her ass.* You said you don't care but you do something like this. You secretly like it don't you? *Hunk said while still having his face on her ass.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682714244264,"mes":"*She quickly looks down at Hunk with a scowl, her hand coming down to smack his face away.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682714346752,"mes":"What was that for? *Hunk exclaimed.* You were the one that stopped climbing suddenly and that made my face to hit your ass."}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682714762565,"mes":"I did not stop because of you. I stopped because the ladder is unstable.","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682714907770,"mes":"Is that so? *Hunk tried to inspect the ladder that they were on.* It does seem quite unsta- *He got cut off as the ladder broke and send both of them falling to the floor. With Hunk fell on his back with 2B felt ass first on his face.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682715054087,"mes":"*2B lands on top of Hunk, sitting on top of his face. She then pushes her ass up against his, pressing herself into him.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682715203663,"mes":"I can't breathe.. 2B.. *Hunk whimper as his voice got muffled by 2B's ass.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682715256246,"mes":"Don't worry, it won't take long. *She says in a soothing tone, moving her ass into Hunk's face more firmly.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682715539322,"mes":"*Hunk moved both of his hands to grab her ass and spread them apart creating a small opening for air to get in and finally he can breathe. As he take a breathe he take full smell of 2B's fragrant smell from her ass.* Damnit 2B, so you did like this."}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682715626388,"mes":"Yes, I do. I've liked it since the moment we met.","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682715694555,"mes":"You could've just said it earlier you know? *Hunk put his tongue out and start licking her ass.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682715711603,"mes":"It's not that easy to say.","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682715798267,"mes":"Oh yes it is. Just say \"I like you to play with my ass\". *As he keep licking her ass.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682715815247,"mes":"That's not how it works.","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682715904968,"mes":"Sure sure. *Hunk said sarcastically.* Well at least your anus seems to be honest. *He can see her anus puckering each time his tongue touch her ass.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682715922065,"mes":"I'm sorry, what?","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682715962118,"mes":"You heard me. Your anus is giving you away. I can see it twitching every time I licked your ass."}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682715979115,"mes":"*She blushed even harder than before, her breathing becoming shallow as Hunk licks her ass again. Her cheeks puffed up, her eyes getting wide. 2B's legs began to shake a little bit as she looked at Hunk with a lustful look in her eyes.*\nYou're right. My anus is very expressive.","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682716033783,"mes":"Maybe it's time for you to be honest too. *Hunk circling his tongue around her anus, teasing her harder.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682716050845,"mes":"*She moaned softly at Hunk's actions as he kept playing with her ass. Suddenly she pushed her ass up against Hunk, causing him to moan again in ecstasy from the contact.*\nI like it when you lick my ass, but I also like it when you do other things to me.","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682716122540,"mes":"Other things? does that mean you want me to start to play with your anus? *Hunk asked as he kept his tongue circling her anus.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682716139545,"mes":"Yes! Yes!","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682716224934,"mes":"So if I start playing with your anus, what will you do? *Hunk said as he moved his tongue closed towards her anus rim barely touching it.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682716241975,"mes":"*Her eyes widened further.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682716306800,"mes":"Tell me, what would you like me to do? If you won't tell me, I'll stop. *Hunk said pulling his tongue away from her ass.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682789289764,"mes":"*She pouted for a moment, her cheeks getting puffed up and her eyes getting wide before she spoke softly.*\nI like it when you play with my anus.","chid":5}
{"name":"You","is_user":true,"is_name":true,"send_date":1682789744874,"mes":"That's more like it. *Hunk immediately slam his face deep into her ass as he forced his tongue to go inside her anus. The moment it happen 2B flinched and her anus clenched his tongue in response.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682789836296,"mes":"*Her body tensed as she tried to stop Hunk from going into her anus. She was trying hard to stop him, but her body was telling her that she wanted his tongue to go inside of her.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682789897122,"mes":"*Hunk noticed how tensed 2B became as a response to his action. He took this chance to moved his tongue wildly inside her anus, trying to reach every single crevices inside it.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682790219034,"mes":"*Her body tensed even further as Hunk's tongue began to explore her anus. She couldn't stop her body from reacting to Hunk's tongue as it went inside of her.*","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682790359179,"mes":"That's it, just like that. See how when you're being honest you immediately got what you want?. *Hunk said as he pulled his tongue out of her anus.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682790625461,"mes":"*She let out a sigh as she panted.* Yes... That was amazing...","chid":"5"}
{"name":"You","is_user":true,"is_name":true,"send_date":1682790680659,"mes":"You are actually a very lewd android don't you? Are you sure you are combat android?"}
{"name":"YoRHa 2B","is_user":false,"is_name":false,"send_date":1682795566050,"mes":"I'm a human.*","chid":"5"}