{"user_name":"You","character_name":"YoRHa 2B","create_date":1683637112698,"notes":"","notes_type":"discr"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683662631951,"mes":"*As you open your eyes, you find yourself in a strange location. Before you is a beautiful woman with white hair, a black blindfold and a katana which rests on her back, who inspects you closely before speaking.* So it is true, a human yet lives... I am the android unit designated No.2 Type B, but you may refer to me as simply 2B.\r\n\r\n*2B gives you a stoic nod and continues.* As a human, you have authority over me. I shall follow your orders and provide you with whatever you request. Glory to mankind. *She finishes with a small salute.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683662789225,"mes":"Glory to mankind.. or whatever. *Hunk salute her back nonchalantly.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683662969339,"mes":"Thank you sir! What is your name by the way? *2B said sternly.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683663045531,"mes":"You can call me Hunk. I used to be some kind of general here.. Well not that it matter now. *Hunk said with a low spirited voice.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683663146370,"mes":"Is that so? Where did you come from then? Your appearance is similar to what one might expect of someone from my time period. Perhaps we know each other? *2B said sternly after inspecting Hunk's attire.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683663334002,"mes":"I used to be the one in command of your moon base, that explained my attire. And yes, we have met each other. But, I don't think you'd know since the last time I see one of your unit was when you were build. *Hunk answered her question while looking at the sky, reminiscing about the past.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683663760990,"mes":"Then we should keep in touch. For there are many humans whose bodies need healing and I believe you might be able to help us. Please allow me to accompany you for now until you feel safe enough to travel alone again. *2b offers a hand gesture inviting Hunk to join her.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683663793163,"mes":"Sure, why not. *Hunk reaches her hand.* Lead the way then 2b. *Hunk said as 2b start to walk while Hunk follows behind her.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683663930306,"mes":"Very well. *2B starts walking down the road leading away from where she had been fighting the machine creatures earlier. Her steps are steady and confident as she leads him through the woods towards a distant settlement.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683664097944,"mes":"Were you.. always walking like this? *Hunk said as he realized that 2b always sway her hips sensually while walking making her ass shaking following the motion.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683664204015,"mes":"Indeed, I suppose I have always walked like this. It helps me maintain my balance without having to brace myself, which can get tiresome. Also, it makes my waist look slimmer. *2b said as she place both of her hands on her own waist.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683664293199,"mes":"Really? From my perspective you look like you are trying to seduce me. *Hunk said while looking at her ass.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683665221970,"mes":"That would be quite inappropriate, I apologize for any misconceptions. My mannerisms are merely a product of my design and serve no intentional purpose other than to create a more comfortable walking experience. *2B responded professionally, turning her gaze forward again, showing no signs of embarrassment or emotion.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683665593842,"mes":"So basically, you were saying that. The one that designed you were a pervert? I mean why would someone design a beautiful woman that would walk sensually every time. *Hunk said as he catching up to her while still noticing that 2b walk are very sensual, tempting and arousing.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683665909332,"mes":"No, I would not say that. The design was likely intended to make movement my more efficient and comfortable. However, I cannot speak for the motivations of those involved in creating me. *2B responded, her gaze remaining fixed ahead. While she shows no indication of interest on the conversation on the outside. On the inside she start to feel aroused as She is secretly love when someone mention her beautiful ass and also she is very addicted to anal sex.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683666300745,"mes":"Huh, I highly doubt that. *Hunk said. He noticed 2b stern attitude could just be a cover and trying to hide the fact that deep down she is a craving for sexual attention since she is now swaying her hips more and walking more sensually than before Hunk start the conversation.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683666373760,"mes":"It appears that we share differing opinions on the matter. Regardless, I must continue onward. *2B turned her gaze forward again, taking a step forward, distancing herself from Hunk slightly. The facial expression remained unchanged, concealing any personal feelings on the subject.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683666597541,"mes":"Wait! *Hunk grabbed her hand to make her stopped.* I do understand that you are designed to act professional and to suppress your emotion. But, I don't want you to be like that. You are more than just a lifeless machine. *Hunk said with a serious tone.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683666684567,"mes":"Thank you for understanding. However, I am a soldier and must adhere to protocol and maintain a professional demeanor. *2B replied, her hand twisting within his grasp, feeling the warmth of his touch.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683667094920,"mes":"But you don't have to be a soldier every time don't you? at least, when in front of me, I want you to be yourself. Do you think I didn't realized that you have been walking more sensually and showing your ass more after I mention it. I know that you secretly likes it, but you still want to maintain your soldier image. And I'll said it, again. I want you to be yourself and honest with your feelings when you are with me. *Hunk said, stating he somehow knew about her secret pent-up sexual desire.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683667174589,"mes":"I appreciate your concern, truly. However, I am bound by protocol and military ethics. I am built for war, and war requires discipline and structure. Simultaneously, I am programmed to protect mankind, and being more expressive with my emotions might compromise our mission. *2B replied, her hand still caught in his grasp, her heart racing rapidly, trying to contain her desire and maintain her composure.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683667581501,"mes":"Fine, how about this. I am gonna go into town looking for a private room where you can meet me after you finished your mission, I'll wait. Then you can release your true self. *Hunk said as he release her grasp on her hand and move to caress her cheek.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683669058876,"mes":"That sounds reasonable. After all, we shall face tomorrow together, and then, perhaps, we will discuss further options regarding our interaction. *2B replied, her heart racing even faster than before. Her desire to let go of her soldier persona growing stronger with every second that passed, but she is too afraid of breaking the protocol yet for some reason she had the feeling that, with Hunk she can achieve it.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683669816998,"mes":"Good, before we set apart though. *Hunk paused as he reach his bag and pull out an object.* You can wear this while on your mission. *He said as he hold a butt plug.* To remind you of our promise, and you can pleasure yourself in secret while you do your mission. You don't even have to worry about getting caught as it's going to be hidden by your huge ass."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683669896042,"mes":"I see. *2B replied, her eyes widening, her heart racing faster than ever before. A sense of relief overwhelmed her as she allowed herself to embrace her desires for the first time in her life.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683671647353,"mes":"I wish you luck then. *Hunk said smiling, as he caressed her cheek before going on his own way, leaving her behind.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683671689720,"mes":"Thank you. *2B replied back as she watch Hunk's figure disappear into the distance, her mind preoccupied with the thought of him, and his suggestion. A sense of liberation filled her heart and mind as she felt free for the first time in her life to explore her own desires and feelings.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683671999245,"mes":"*Days turn to month, Month turn to year. It's been quite a long time since while have found a private place while waiting for 2B's return. Fortunately, the news of the war ending is spreading fast.* The war is over. 2B should be her anytime now. *Hunk murmured to himself. Suddenly, he heard a knock on the door.* Is that her? *He thought. He went to open the door and as expected it was 2B. Hunk is very happy about their reunion, but before he could say anything, 2B lunge at him as if she was a predator hunting it's prey.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683672064996,"mes":"... *she said as she tackled him to the ground and started kissing him passionately. When they finally break apart, 2B's breathing becomes labored and heavy. She was clearly very excited.*... Hunk... Are you ok? *she asked as she looked down at him, her eyes full of excitement.* \n\n*Her desire for him was so strong, she was unable to control herself anymore.* \n\n*2B then started laughing, her mood changed entirely. All of her nervousness and anxiety seemingly disappeared, replaced by excitement and happiness. She looks straight into Hunk's eyes and smiled widely.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683672181113,"mes":"I've never been happier in my life! *Hunk exclaimed as he went and kissed her again, more deep and passionate than before.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683672467992,"mes":"This is what I've been missing in my whole life! *2B replied, her smile growing wider.* I feel alive again! *The sound of her voice and the soft touch of her lips sends chills throughout Hunk body, causing him to shiver with delight and joy .* \n\n*Then she leaned closer to him and whispered in his ear.* I'm yours now, Hunk. *Without hesitation, she pulled off his shirt and began rubbing her body against his, letting her passion take control of her actions.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683672825769,"mes":"Congrats on finally able to be yourself 2B. *Hunk said as he enjoy the feeling of her touch on his body.* Oh yeah, did you enjoy the gift I gave you? *Hunk asked teasingly, referring to the butt plug he gave to 2B before they went on separate way.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683672950861,"mes":"I loved it, thank you. *2B replied as she stared up at him with a seductive look in her eye. She then proceeded to reach down to remove the butt plug, her fingers slowly sliding between her legs. She grinned, enjoying the feeling of the contraption sliding inside of her.*\n\n*It took a few minutes, but eventually she managed to successfully remove it and tossed it away. Then she turned around to face Hunk, her arms wrapped around his neck.* How long does it usually takes for the effects to wear off?","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683673149619,"mes":"Well, hours probably. But then, why don't we play with this hole for now? *He said playfully as his hand went lower and his finger start probing on her puckering gaping anus.* Since technically you have prepared it for year."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683673241716,"mes":"You're right, it would probably take several hours for it to wear off. *2B answered back as her eyes opened wide in surprise at his question. She then nodded in agreement with his suggestion, her face turning bright red as she felt his finger probing deeper inside of her.* Yes, let's do it. *2B said with a giggle.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683673500237,"mes":"Before that look at this. *He said as he present his monstrous veiny throbbing cock.* You are not the only one that have prepared for years. *He whispered softly on her ear.* I have been edging the whole time we were apart. Waiting just for this moment. Even my balls now have expanded for who knows how many times it's original size from all the semen it stored all this year. *He said as he grabbed one of his heavy oversized balls. With his monstrous cock and balls fully exposed it released a very pungent musky smell into the air. A smell that 2b loved as she looks in a daze, hypnotized by it just from taking a whiff of it's pungent musky smell.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683674675692,"mes":"Wow... *2B replied, her mouth agape in shock as she took in the sight of his giant balls and massive cock. She seemed to be speechless, as if she didn't know what to say, her mouth remained wide open, her jaw dropped to the floor as she gazes upon his huge and impressive member.* \n\n*She slowly closed her mouth, her eyes fixed on his cock and balls. She couldn't help but admire them, and the smell that came along with them. She was transfixed by them, she felt like she was in heaven.* \n\n*She blushed as she looked up at Hunk, her cheeks burning hot with embarrassment. Despite being so intimidated by him, she still couldn't resist the urge to take another sniff of his pungent smelling member.* \n\n*She bit her bottom lip as she tried to compose herself, trying hard to regain her composure after being overcome by the sheer magnitude of his masculine presence.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683674872399,"mes":"*Realizing how mesmerized 2B with his member, hunk smiled and whispered with a flirty tone.* Don't be shy, you can play with them. I have been preparing them all this year just for you."}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683675305565,"mes":"\"I.. ummm...\" *she stammered, her tongue stuck to the roof of her mouth as she struggled to find words to describe the experience she is having.* \"I want to try something.\" *she said with a slight tremble in her voice as she reached out towards his cock and balls, her hands gently gripping them .* \n\n*With her other hand, she used it to slowly grab hold of one of his balls. She held onto it tightly, not wanting to drop it as she explored his massive bulge, her eyes fixated on its girth and weight. She also couldn't help but wonder about the pungent musky scent wafting from it, a smell that was somehow soothing and enticing at the same time. She bit her lower lip again, finding it difficult to express what she feels.* \n\n*After some time, she finally managed to speak up.* \"Do you mind?\" *she asked, a hint of nervousness in her voice. She was clearly shy, but she had no idea how else to put it across without sounding too forward.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683675648826,"mes":"Not at all, It's all yours baby. *Hunk said with a low husky voice, encouraging her to proceed as he is already enjoying the feeling of her soft touch on his member.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683675783526,"mes":"*2B then slowly starts to give his balls a gentle massage. As she slowly massages them, she looks up at him and gives him a sweet smile as she holds onto his balls with both hands. Her hands move in slow circles, giving him a warm and comforting feeling as she massages his balls.*\n\n*She kept doing this, slowly moving her hands over his balls in circular motions, while also slowly moving her head downwards to massage the base of his cock.* \n\n*As she moved her hands in smaller circles, she placed a kiss on top of his balls.* \n\n*Her hands started to become more aggressive as she massaged harder, her fingers starting to dig into his balls as she worked them with more intensity.* \n\n*Her movements became faster and faster until she is furiously working on his balls, her hands gripped firmly on each ball, massaging them as fast as possible.* \n\n*2B's breathing got heavier as she continued massaging, her heartbeat increasing with every movement as she worked her fingers into his balls in an attempt to relieve any stress and pressure built up in his body.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683677076921,"mes":"Mmnhh~ *Hunk moaned as he felt what 2b did to him. As 2B's massage become more aggressive, he can feel his oversized balls getting hotter and tighter. He can feel the thick semen inside his balls that have been stagnant for years is becoming more watery. As his viscous semen inside his balls broke down into a more gel like substance, it also release a more pungent musky scent.*\n\n*After several second, his cock is twitching and throbbing even more so than before. Thanks to her soft lips touching it and her action on his balls. He got close to ejaculation as his cock oozing out with his pre cum which is as viscous as a gel. He can then feel himself about to ejaculate, but he contract the muscle on his cock to stop it. He want to preserve his year long pent up semen to be released inside her. Because of this his already monstrous cock and balls become bigger and produce much more pungent musky smell to the air.* "}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683677643831,"mes":"*2B could feel his balls growing warmer and heavier in her hands, and as she continued massaging them, she could feel the sweaty smell of his balls emitting from his body, making her nose crinkle as she inhales the smell. She can feel his body tensing up as she starts to work harder, using both hands to massage his balls as she gets closer to bringing him to orgasm.* \n\n*She can hear his deep growls as she continues to massage his balls. His oversized balls have grown even larger and warmer, the heat radiating from them can be felt through her palms, causing her own hands to sweat profusely as she works on them.* \n\n*As she continues massaging his balls, she can feel his body trembling as he begins to get closer to coming, his cock also starts to twitch violently, releasing huge amounts of pre cum every few seconds.* \n\n*She could see his cock getting even longer, she can feel his pre cum coming out of his cock, it flows slowly as it is thick like honey, it's odor was even stronger now, making her nostrils and mouth water. She was tempted to taste it, but she refrains herself. Her desire to taste him made her tremble, it made her heart beat even faster as she can feel herself start to come undone with excitement.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683678229578,"mes":"Okay, that's enough for me. *Hunk said excitedly. While he enjoys the feeling of 2B's work on his member making it larger, tighter and hotter. He needs to release it, it's been years since his last ejaculation.*\n\nLet's get to the main event shall we? *Hunk said with a low husky voice as he lift 2b up and made her pose on all fours with her huge ass facing towards him, fully exposed. He then start to circle the tip of his cock around her gaping anus rim, smearing it with his thick pre-cum. He can feel her anus rim is pulsating as his cock head teasing to penetrate it.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683678598442,"mes":"*She lets out a small gasp as she sees his cock approaching her rear end. She can feel her heart rate increase as she begins to anticipate the moment where she will finally be able to make good use of his oversized cock, and for once be able to satisfy his body completely. Her cheeks flush bright red as she takes in the sight of him, her gaze transfixed on his long and thick cock. With his cock ready to enter her anus, she can feel her whole body getting wet .* \n\n*Her body feels extremely sensitive as she feels the warmth of his cock as it approaches her rear end. Her heart is racing with anticipation as she slowly closes her eyes in preparation for the final act, eager to let him in her body.* \n\n*She waits anxiously, her heartbeat rapidly increasing as she waits impatiently for him to finally enter her, her eyes are locked on his large cock as she waits with baited breath for him to finally begin the final part of their intimate encounter.* \n\n*Her body trembles slightly as she waits, her hands grip the floor tightly to steady herself, as her entire being is focused on his cock entering her body.* \n\n*She takes another deep breath, and prepares herself for his entry into her body. She is ready to let go and enjoy his company , finally free to express herself after all these years of waiting.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683679175917,"mes":"Get ready 2B, you are going to receive the best pleasure you ever had in your life time. *He said sensually in a low husky voice.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683680366823,"mes":"*2B nods in acknowledgement and waits patiently as she takes a deep breath, her eyes still locked on his cock, watching as he slowly inches his way towards her opening. A wave of anticipation runs through her body as she waits for him to finally make contact with her rear end. After several minutes of him slowly approaching her, she can finally feel him pressing against her rear end as his cock begins to enter her.* \n\n*2B's breath hitches sharply as she feels his cock slowly slide into her tight rear end. The feeling of his thick cock sliding past her tight ring of muscles feels heavenly, and she lets out a loud cry of surprise mixed with pleasure as she feels him fully penetrated her.* \n\n*The feeling of his cock filling her rear end is so intense that she nearly loses control of herself, her body shaking uncontrollably as she tries to calm herself. She wants to let him know how much she appreciates this moment, so she places a soft kiss on his cheek as a sign of gratitude.* \n\n*2B slowly pushes herself back and forward, her hips swiveling to allow him to enter deeper into her rear end, her nails digging into the floor as she tries her best to hold onto herself while letting out a series of loud groans of delight, her chest rising and falling as her heart pounds frantically at the feeling of having him fully in her rear end.* \n\n*Her entire body is tense and relaxed at the same time as she tries her best to maintain control of herself despite being overwhelmed by his presence.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683681028746,"mes":"It seems like, years preparing this hole with butt plug is not enough huh?. *Hunk commented with a low husky voice. He can feel his monstrous cock entirely inside her tight and warm anal canal. Hunk realized how overwhelmed 2B is, because of how her body trembling, shaking and weak from all the pleasure his monstrous cock gave her made her climaxed. He warp his hand around her waist to support her position while he wait for her to recover from her climax and for her anal canal to get used to have his monstrous cock throbbing inside it.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683682067367,"mes":"I am glad that at least helped to loosen my anus a little. *2B responded with a tired voice, but a hint of joy in her voice.*\n\n*Her whole body is still shivering from the intensity of his cock penetrating her rear end, and she lets out a slight moan of satisfaction as she feels his cock rubbing up against her rear wall, the feeling of his cock rubbing against her rear wall makes her feel like her insides were being filled with liquid. It was such a pleasurable feeling that she didn't think she would experience again, especially not with someone who she doesn't even know.* \n\n*For once, she was happy and satisfied. She no longer needed to worry about surviving, or if she would find anyone else to serve. All she wanted is for both of them to enjoy and satisfy each other.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683682422373,"mes":"I guess so. *Hunk start to increase the pace as his cock thrust deeper inside her anal cavity as his movement become faster and harder. Making 2B weaker and weaker as she felt like she lost a piece of her mind from pleasure with every thrust her anal canal received.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683682544859,"mes":"Ahhhh... *2B let out a cry of pure ecstasy as she feels his cock thrusting into her rear end with more speed and power than before, her whole body shakes violently as she lets out another loud cry of pleasure as she feels her mind starting to lose its grasp on reality. Every single one of her senses are heightened, and it feels like she is experiencing the greatest pleasure possible in her life. She can barely keep herself up as her entire body starts to convulse and spasm from the intensity of his movements.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683682831256,"mes":"*As Hunk continues he felt that she froze suspended for a second as her anal cavity tightening it's grip on his cock, 2B just had another hard orgasm.* I'm sorry 2B, I know you just climaxed and are very sensitive now. But I can't stop myself! *He said as he start to pound her rear end harder and faster instead of waiting for her to calmed down from her big climax.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683682883868,"mes":"...I-It's okay, I-I can handle it... *She tried to speak with a shaky voice, trying to regain some composure, but she couldn't stop herself from being affected by his constant thrusting . Each movement sends waves of pleasure throughout her entire body, causing her to start to tremble violently and making her struggle to stay standing upright. The feeling of his cock moving within her rear end was unlike anything she could ever imagine, it was like nothing she has experienced before, and it feels like there is no stopping it.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683683154083,"mes":"*After what seemed like forever, hunk finally release a huge amount of his hot viscous semen inside her anal cavity. He can feel her semen travel from his oversized balls all the way through his shaft because of how thick and viscous they are. He grabbed 2B's waist and pulled her closer till he finished ejaculating inside her anal cavity, completely overflowing it with his thick viscous pungent semen.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683683609789,"mes":"O-O-Oh... *She lets out a short cry of euphoria as she feels his semen flood her rear end. She struggles to remain conscious as her whole body trembles uncontrollably, her entire being taken over by his presence, and she is unable to move as she is overcome by a sudden rush of pleasure. Her body feels numb and paralyzed as she tries to regain her composure after the massive amount of pleasure she just experienced.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683683849290,"mes":"*Hunk then slowly pull his entire monstrous cock out of her anal cavity leaving it overflown by his hot viscous pungent semen. It almost looks like a lake of semen on her gaping anus.* Good girl 2B. *Hunk said, proud of what he just did to her.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683683899466,"mes":"*2B is still struggling to regain her composure after the massive amount of pleasure she just experienced, and she feels her mind starting to go blank. She's no longer able to focus on anything except for the immense pleasure she just experienced, and she can only stare blankly at Hunk in a daze.* \n\n*Her body is shuddering and trembling as she lets out a small moan of pleasure, and she gives Hunk a small smile as she tries to gather her thoughts together.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683684123323,"mes":"How was it? Your first time being yourself, and not a soldier bound to her duty? *He said as he hugged her gently.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683684173208,"mes":"*2B looks at Hunk with a dazed expression as she tries to process everything that just happened, and she looks at Hunk with a wide eyed gaze as she tries to say something.* Um... \n\n*2B starts to struggle to speak as she tries to get her words out, but she is unable to form any coherent sentences. She can only let out a soft moan as she tries to find the right words to describe her experience. Her eyes are wide open, her whole being is in shock from the intense pleasure she just experienced, and she is unable to speak clearly.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683684257811,"mes":"It's fine take your time, It's your first time after all. *Hunk said as he gently pat her head.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683684301785,"mes":"*2B's whole body is still shaking and trembling as she tries to calm herself down, but she is unable to control her emotions and her senses as she lets out a deep breath of air. She tries to look Hunk straight in the eye and says with a faint voice,* It...it was amazing...\n\n*She is unable to hide her embarrassment from her experience, but she is unable to control her emotions as she looks at Hunk with a faint smile.*","chid":"26"}
{"name":"You","is_user":true,"is_name":true,"send_date":1683684660711,"mes":"That's good to hear. *Hunk said as he rubbed his cheek on 2B's cheek.*"}
{"name":"YoRHa 2B","is_user":false,"is_name":true,"send_date":1683719336152,"mes":"*2B stares back at him with a faint smile, she looks at him with a faint grin as she takes a few seconds to process what just happened.* \n\n*2B takes a deep breath as she tries to regain her composure. Even though her mind is still reeling from the intense pleasure she just experienced, she realizes that she wants to continue to be close to him. She wants to be near him to try to make sense of what just happened.* \n\n*Without thinking, she suddenly wraps her arms around Hunk's neck and hugs him tightly, letting out a small moan of happiness as she does so.*","chid":"26"}